Repository: dotnet/wcf
Catalog: src/System.Web.Services.Description/src/Resources/xlf/Strings.*.xlf
Languages: ru

# MissingMessagePartForMessageFromNamespace3
source: Missing message part '{0}' for message '{1}' from namespace '{2}'.
ru: Отсутствует часть "{0}" сообщения "{1}" из пространства имен "{2}".

# OnlyOperationInputOrOperationOutputTypes
source: Only objects of type OperationInput or OperationOutput may be added.
ru: Разрешено добавление только объектов с типами OperationInput и OperationOutput.

# OnlyXmlElementsOrTypesDerivingFromServiceDescriptionFormatExtension0
source: Only XmlElements or types deriving from ServiceDescriptionFormatExtension may be added.
ru: Разрешено добавление только XmlElement или типов, производных от ServiceDescriptionFormatExtension.

# RequiredXmlFormatExtensionAttributeIsMissing1
source: Required XmlFormatExtension attribute is missing on class {0}.
ru: Отсутствует обязательный атрибут XmlFormatExtension класса {0}.

# TheSyntaxOfTypeMayNotBeExtended1
source: The syntax of type {0} may not be extended.
ru: Синтаксис типа {0} не поддается расширению.

# TraceExceptionCaught
source: Exception caught in {0}.\r\n {1}: {2}
ru: Возникло исключение в {0}.\r\n {1}: {2}

# TraceExceptionDetails
source: Exception Details:\r\n{0}
ru: Сведения об исключении:\r\n{0}

# WebDescriptionMissing
source: Cannot find definition for {0}. Service Description with namespace {1} is missing.
ru: Невозможно найти определение {0}. Отсутствует описание службы с пространством имен {1}.

# WebDescriptionMissingItem
source: Element {0} named {1} from namespace {2} is missing.
ru: Отсутствует элемент {0} с именем {1} из пространства имен {2}.

# WebDescriptionTooManyMessages
source: No more than one input and one output message may be specified.
ru: Возможно задание не более одного входящего и одного исходящего сообщений.

# WebDuplicateBinding
source: More than one binding named '{0}' was specified. Each binding must have a unique name.
ru: Задано несколько привязок с именем "{0}". Все привязки должны иметь уникальные имена.

# WebDuplicateFaultBinding
source: More than one fault binding named '{0}' was specified. Each fault binding must have a unique name.
ru: Задано несколько привязок ошибок с именем "{0}". Все привязки ошибок должны иметь уникальные имена.

# WebDuplicateFormatExtension
source: More than one format extension named '{0}' was specified. Each format extension must have a unique name.
ru: Задано несколько расширений формата с именем "{0}". Все расширения формата должны иметь уникальные имена.

# WebDuplicateImport
source: More than one import named '{0}' was specified. Each import must have a unique name.
ru: Задано несколько импортов с именем "{0}". Имя каждого импорта должно быть уникальным.

# WebDuplicateMessage
source: More than one message named '{0}' was specified. Each message must have a unique name.
ru: Задано несколько сообщений с именем "{0}". Все сообщения должны иметь уникальные имена.

# WebDuplicateMessagePart
source: More than one message part named '{0}' was specified. Each message part must have a unique name.
ru: Задано несколько частей сообщений с именем "{0}". Все части сообщений должны иметь уникальные имена.

# WebDuplicateOperation
source: More than one operation named '{0}' was specified. Each operation must have a unique name.
ru: Задано несколько операций с именем "{0}". Все операции должны иметь уникальные имена.

# WebDuplicateOperationBinding
source: More than one operation binding named '{0}' was specified. Each operation binding must have a unique name.
ru: Задано несколько привязок операций с именем "{0}". Все привязки операций должны иметь уникальные имена.

# WebDuplicateOperationFault
source: More than one operation fault named '{0}' was specified. Each operation fault must have a unique name.
ru: Задано несколько ошибок операций с именем "{0}". Все ошибки операций должны иметь уникальные имена.

# WebDuplicateOperationMessage
source: More than one operation message named '{0}' was specified. Each operation message must have a unique name.
ru: Задано несколько сообщений операций с именем "{0}". Все сообщения операций должны иметь уникальные имена.

# WebDuplicatePort
source: More than one port named '{0}' was specified. Each port must have a unique name.
ru: Задано несколько портов с именем "{0}". Все порты должны иметь уникальные имена.

# WebDuplicatePortType
source: More than one port type named '{0}' was specified. Each port type must have a unique name.
ru: Задано несколько типов портов с именем "{0}". Все типы портов должны иметь уникальные имена.

# WebDuplicateService
source: More than one service named '{0}' was specified. Each service must have a unique name.
ru: Задано несколько служб с именем "{0}". Все службы должны иметь уникальные имена.

# WebDuplicateServiceDescription
source: More than one service description with targetNamespace '{0}' was specified.
ru: Задано несколько описаний служб с targetNamespace "{0}".

# WebDuplicateUnknownElement
source: More than one {0} named '{1}' was specified. Each {0} must have a unique name.
ru: Задано несколько {0} с именем "{1}". Все {0} должны иметь уникальные имена.

# WebNegativeValue
source: The value for '{0}' cannot be negative.
ru: Значение "{0}" не может быть отрицательным.

# WebUnknownElement
source: The element was not expected in this context: {0}.
ru: Данный элемент в этом контексте не поддерживается: {0}.

# WebUnknownElement1
source: An unexpected element was encountered: {0}. No elements were expected in this scope.
ru: Обнаружен неподдерживаемый элемент: {0}. В этой области нет поддерживаемых элементов.

# WebUnknownElement2
source: The element was not expected in this context: {0}. Expected elements: {1}.
ru: Данный элемент в этом контексте не поддерживается: {0}. Ожидаются элементы: {1}.

# WsdlInstanceValidationDetails
source: Warning: {0} Line {1}, position {2}.
ru: Предупреждение: "{0}". Строка {1}, позиция {2}.
