Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# InValidateId
source: Expecting all chars - c - of id to be in set [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'], found '{0}'.
cs: Očekává se, že všechny znaky - c - identifikátoru budou v sadě [Char.IsLetter(c), Char.IsNumber(c), ., _, -], nalezeno {0}.
de: Es wird erwartet, dass alle Zeichen - c - der ID in der Gruppe [Char.IsLetter(c), Char.IsNumber(c), ".", "_", "-"] vorhanden sind, gefunden wurde "{0}".
es: Se espera que todos los caracteres - c - del id. estén en el conjunto [Char.IsLetter(c), Char.IsNumber(c), ".", "_", "-"]. Se encontró "{0}".
fr: Tous les caractères - c - de l'ID doivent faire partie de l'ensemble [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'] ; '{0}' a été trouvé.
it: Nel set [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'] sono previsti tutti i caratteri - c - dell'ID, ma ne sono stati trovati '{0}'.
ja: ID のすべての文字 'c' が [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'] のセットにある必要がありますが、'{0}' が見つかりました。
ko: ID의 모든 - c - 문자가 [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'] 집합에 있어야 하지만 '{0}'을(를) 찾았습니다.
pl: Oczekiwano wszystkich znaków — c — identyfikatora ze zbioru [Char.IsLetter(c), Char.IsNumber(c), „.”, „_”, „-”], znaleziono „{0}”.
pt_br: Esperando que todos os caracteres – c – da ID estejam no conjunto [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'], encontrados '{0}'.
tr: Kimlikteki tüm karakterlerin - c - kümede olması bekleniyor [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'], bulunan: '{0}'.
zh_hans: 预期 ID 的所有字符型 - c - 位于 [Char.IsLetter(c), Char.IsNumber(c), ".", "_", "-"] 集中，找到了“{0}”。
zh_hant: 識別碼的所有字元 - c - 應為 [Char.IsLetter(c)、Char.IsNumber(c)、'.'、'_'、'-'] 集合中的任一項，但找到 '{0}'。

# InValidateIdPrefix
source: Expecting first char - c - to be in set [Char.IsLetter(c) && c == '_', found '{0}'.
cs: Očekává se, že první znak - c - bude v sadě [Char.IsLetter(c) && c == '_', nalezeno {0}.
de: Es wird erwartet, dass das erste Zeichen - c - in der Gruppe [Char.IsLetter(c) & c == "_" vorhanden ist, gefunden wurde "{0}".
es: Se espera que el primer carácter - c - esté en el conjunto [Char.IsLetter(c) && c == '_'. Se encontró '{0}'.
fr: Le premier caractère - c - doit faire partie de l'ensemble [Char.IsLetter(c) && c == '_' ; '{0}' a été trouvé.
it: Previsto primo carattere - c - nel set [Char.IsLetter(c) && c == '_', trovato '{0}'.
ja: 最初の文字 'c' が [Char.IsLetter(c) && c == '_' のセットにある必要がありますが、'{0}' が見つかりました。
ko: 첫 번째 - c - 문자가 [Char.IsLetter(c) && c == '_' 집합에 있어야 하지만 '{0}'을(를) 찾았습니다.
pl: Oczekiwano pierwszego znaku — c — ze zbioru [Char.IsLetter(c) && c == „_”], znaleziono „{0}”.
pt_br: Esperando que o primeiro caractere - c - esteja no conjunto [Char.IsLetter(c) && c == '_', encontrado '{0}'.
tr: İlk karakterin - c - kümede olması bekleniyor [Char.IsLetter(c) && c == '_', bulunan: '{0}'.
zh_hans: 预期第一个字符 - c - 位于 [Char.IsLetter(c) & c ==“_”集中，找到“{0}”。
zh_hant: 第一個字元 - c - 應該是 [Char.IsLetter(c) && c == '_'] 集合中的任一項，但找到 '{0}'。

# InconsistentLastMsgNumberExceptionString
source: The remote endpoint specified two different last message numbers. The reliable session is in an inconsistent state since it cannot determine the actual last message. The reliable session was faulted.
cs: Vzdálený koncový bod určil dvě rozdílná čísla posledních zpráv. Stabilní relace se nachází v nekonzistentním stavu, protože nemůže určit skutečnou poslední zprávu. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat zwei verschiedene letzte Nachrichtennummern angegeben. Die zuverlässige Sitzung befindet sich in einem inkonsistenten Status, da die tatsächliche letzte Nachricht nicht bestimmt werden kann. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto ha especificado dos números de último mensaje diferentes. La sesión confiable está en un estado de inconsistencia, ya que no puede determinar el último mensaje real. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a spécifié deux derniers numéros de messages différents. La session fiable est dans un état incohérent car elle ne peut pas déterminer le dernier message réel. La session fiable a généré une erreur.
it: L'endpoint remoto ha specificato due numeri diversi dell'ultimo messaggio. La sessione affidabile è in uno stato incoerente perché non può determinare l'ultimo messaggio corrente. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、2 つの異なる最後のメッセージ番号を指定しました。信頼できるセッションは、実際の最後のメッセージを決定できないため、整合性がない状態になっています。信頼できるセッションは途中終了されました。
ko: 원격 끝점에서 서로 다른 두 개의 마지막 메시지 번호를 지정했습니다. 실제 마지막 메시지를 확인할 수 없으므로 신뢰할 수 있는 세션의 상태가 일관되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy określił dwa różne numery ostatniego komunikatu. Niezawodna sesja jest w stanie niespójnym, ponieważ nie można określić rzeczywistego ostatniego komunikatu. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto especificou dois números de última mensagem diferentes. A sessão confiável está em estado inconsistente já que não tem como determinar a última mensagem real. Falha na sessão confiável.
tr: Uzak bitiş noktası iki farklı son ileti numarası belirtti. Gerçek son iletiyi belirleyemediğinden güvenilir oturum tutarsız bir durumda. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点指定了两个不同的上条消息编号。可靠会话所处状态不一致，因为它无法确定实际的上条消息。可靠会话已出错。
zh_hant: 遠端端點已指定兩個不同的最後訊息編號。可靠工作階段處於不一致的狀態，因為它無法判斷實際的最後訊息。可靠工作階段發生錯誤。

# IncorrectBinaryNegotiationValueType
source: Incoming binary negotiation has invalid ValueType {0}.
cs: Příchozí binární vyjednávání má neplatnou třídu ValueType {0}.
de: Die eingehende Binäraushandlung hat den ungültigen ValueType {0}.
es: La negociación binaria entrante tiene ValueType no válido {0}.
fr: La négociation binaire entrante a un ValueType {0} non valide.
it: Il valore ValueType {0} nella negoziazione binaria in ingresso non è valido.
ja: 受信バイナリ ネゴシエーションの ValueType {0} は無効です。
ko: 들어오는 이진 협상에 잘못된 ValueType {0}이(가) 있습니다.
pl: Nieprawidłowy element ValueType {0} w przychodzącej negocjacji binarnej.
pt_br: A negociação binária de entrada tem a propriedade ValueType {0} inválida.
tr: Gelen ikili anlaşma geçersiz ValueType {0} öğesine sahip.
zh_hans: 传入的二进制协商具有无效的 ValueType {0}。
zh_hant: 傳入二進位交涉具有無效的 ValueType {0}。

# InnerChannelFactoryWasNotSet
source: Cannot open ChannelFactory as the inner channel factory was not set during the initialization process.
cs: Nelze otevřít třídu ChannelFactory, protože objekt pro vytváření vnitřního kanálu nebyl během procesu inicializace nastaven.
de: Die ChannelFactory kann nicht geöffnet werden, da die innere Kanalfactory beim Initialisierungsprozess nicht festgelegt wurde.
es: No se puede abrir ChannelFactory, ya que no se estableció el generador de canales interno durante el proceso de inicialización.
fr: Impossible d'ouvrir ChannelFactory dans la mesure où la fabrique de canaux n'a pas été définie durant le processus d'initialisation.
it: Non è possibile aprire l'elemento ChannelFactory perché la factory canale interna non è stata impostata durante il processo di inizializzazione.
ja: 初期化プロセス中に内部チャネル ファクトリが設定されなかったため、ChannelFactory を開けません。
ko: 내부 채널 팩터리가 초기화 프로세스 도중에 설정되지 않았으므로 ChannelFactory를 열 수 없습니다.
pl: Nie można otworzyć elementu ChannelFactory, ponieważ wewnętrzna fabryka kanałów nie została ustawiona podczas procesu inicjowania.
pt_br: Não é possível abrir ChannelFactory porque a fábrica de canais interna não foi definida durante o processo de inicialização.
tr: İç kanal fabrikası başlatma işleminde ayarlanmadığından, ChannelFactory açılamıyor.
zh_hans: 无法打开 ChannelFactory，因为初始化过程中未设置内部通道工厂。
zh_hant: 因為在初始化處理程序期間未設定內部通道處理站，所以無法開啟 ChannelFactory。

# InputTypeListEmptyError
source: The input handler list cannot be empty.
cs: Seznam obslužných rutin vstupu nemůže být prázdný.
de: Die Eingabehandlerliste darf nicht leer sein.
es: La lista de controladores de entrada no puede estar vacía.
fr: La liste de gestionnaires d'entrée ne peut pas être vide.
it: L'elenco dei gestori di input non può essere vuoto.
ja: 入力ハンドラーの一覧は空にできません。
ko: 입력 처리기 목록을 비워 둘 수 없습니다.
pl: Lista funkcji obsługi danych wejściowych nie może być pusta.
pt_br: A lista do manipulador de entrada não pode estar vazia.
tr: Giriş işleyicisi boş olamaz.
zh_hans: 输入处理程序列表不能为空。
zh_hant: 輸入處理常式清單不可為空白。

# InsufficentMemory
source: Insufficient memory avaliable to complete the operation.
cs: K dokončení operace není dostatek paměti.
de: Es ist nicht ausreichend Arbeitsspeicher verfügbar, um den Vorgang abzuschließen.
es: No hay suficiente memoria disponible para completar la operación.
fr: Mémoire disponible insuffisante pour effectuer l'opération.
it: La memoria disponibile non è sufficiente per completare l'operazione.
ja: 利用可能なメモリが不足しているため、この操作を完了できません。
ko: 작업을 완료하는 데 사용할 수 있는 메모리가 부족합니다.
pl: Brak wystarczającej ilości pamięci, aby ukończyć operację.
pt_br: Memória insuficiente disponível para concluir a operação.
tr: İşlemi tamamlamak için yetersiz kullanılabilir bellek.
zh_hans: 可用内存不足，无法完成操作。
zh_hant: 記憶體不足，無法完成作業。

# InvalidAcknowledgementFaultReason
source: The SequenceAcknowledgement violates the cumulative acknowledgement invariant.
cs: Třída SequenceAcknowledgement narušuje kumulativní invariantu potvrzení.
de: Das SequenceAcknowledgement verletzt den kumulativen Bestätigungsinvariant.
es: SequenceAcknowledgement infringe la clase invariable de confirmación acumulativa.
fr: L'élément SequenceAcknowledgement ne respecte pas l'invariant d'accusé de réception cumulatif.
it: SequenceAcknowledgement viola l'invariante acknowledgement cumulativa.
ja: SequenceAcknowledgement の値は、累積確認応答の検証結果として正しくありません。
ko: SequenceAcknowledgement가 누적된 고정 승인을 위반합니다.
pl: Element SequenceAcknowledgement narusza skumulowaną stałą potwierdzeń.
pt_br: SequenceAcknowledgement viola a invariante de confirmação cumulativa.
tr: SequenceAcknowledgement, birikimli bildirim alternatifini ihlal ediyor.
zh_hans: SequenceAcknowledgement 与累计确认恒定发生冲突。
zh_hant: SequenceAcknowledgement 違反累計認可不變量。

# InvalidAcknowledgementReceived
source: A violation of acknowledgement protocol has been detected. An InvalidAcknowledgement fault was sent to the remote endpoint and the reliable session was faulted.
cs: Bylo zjištěno porušení protokolu potvrzování. Chyba třídy InvalidAcknowledgement byla odeslána do vzdáleného koncového bodu a stabilní relace selhala.
de: Eine Verletzung des Bestätigungsprotokolls wurde entdeckt. Ein InvalidAcknowledgement-Fehler wurde an den Remoteendpunkt gesendet, und die zuverlässige Sitzung war nicht erfolgreich.
es: Se detectó una infracción del protocolo de confirmación. Se envió un error InvalidAcknowledgement al extremo remoto y se generó un error en la sesión confiable.
fr: Une violation du protocole d'accusé de réception a été détectée. Une erreur InvalidAcknowledgement a été envoyée au point de terminaison distant et la session fiable a généré une erreur.
it: Rilevata una violazione del protocollo di acknowledgement. È stato inviato un errore InvalidAcknowledgement all'endpoint remoto e la sessione affidabile non è riuscita.
ja: 受信確認プロトコル違反が検出されました。InvalidAcknowledgement フォールトがリモート エンドポイントに送信されたため、信頼できるセッションは途中終了されました。
ko: 승인 프로토콜 위반이 감지되었습니다. InvalidAcknowledgement 오류가 원격 끝점에 보내졌고 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Wykryto naruszenie protokołu potwierdzeń. Do zdalnego punktu końcowego został wysłany komunikat o błędzie InvalidAcknowledgement i wystąpił błąd sesji uwierzytelnionej.
pt_br: Foi detectada uma violação do protocolo de confirmação. Uma falha InvalidAcknowledgement foi enviada ao ponto de extremidade remoto e a sessão confiável foi interrompida.
tr: Bildirim protokolü ihlali algılandı. Uzak bitiş noktasına bir InvalidAcknowledgement hatası gönderildi ve güvenilir oturum hatayla sonlandırıldı.
zh_hans: 已检测到确认协议冲突。已将 InvalidAcknowledgement 错误发送到远程终结点，并且该可靠的会话出错。
zh_hant: 偵測到認可通訊協定違規。InvalidAcknowledgement 錯誤已傳送至遠端端點，可靠工作階段發生錯誤。

# InvalidActionForNegotiationMessage
source: Security negotiation message has incorrect action '{0}'.
cs: Zpráva o vyjednávání zabezpečení má nesprávnou akci {0}.
de: Eine Sicherheitsaushandlungsnachricht weist die falsche Aktion "{0}" auf.
es: El mensaje de negociación de seguridad tiene la acción incorrecta '{0}'.
fr: Un message de négociation de sécurité a une action '{0}' incorrecte.
it: Il messaggio di negoziazione della sicurezza ha un'azione non corretta '{0}'.
ja: セキュリティ ネゴシエーション メッセージに、無効なアクション '{0}' があります。
ko: 보안 협상 메시지에 잘못된 동작 '{0}'이(가) 있습니다.
pl: Komunikat negocjacji zabezpieczeń zawiera błędną akcję „{0}”.
pt_br: A mensagem de negociação de segurança possui uma ação incorreta '{0}'.
tr: Güvenlik sözleşmesi iletisi, geçersiz '{0}' eylemine sahip.
zh_hans: 安全协商消息具有错误的操作“{0}”。
zh_hant: 安全性交涉訊息包含不正確的動作 '{0}'。

# InvalidAsyncBeginMethodSignatureForMethod2
source: Invalid async Begin method signature for method {0} in ServiceContract type {1}. Your begin method must take an AsyncCallback and an object as the last two arguments and return an IAsyncResult.
cs: Neplatný podpis asynchronní metody počátku pro metodu {0} v typu třídy ServiceContract {1}. Metoda Begin musí jako poslední dva argumenty přijímat ukazatel AsyncCallback a objekt a vracet hodnotu IAsyncResult.
de: Ungültige Signatur der asynchronen Begin-Methode für die Methode {0} im ServiceContract-Typ {1}. Die Begin-Methode muss einen AsyncCallback und ein Objekt als die beiden letzten Argumente akzeptieren und ein IAsyncResult zurückgeben.
es: Signatura no válida del método Begin asincrónico para el método {0} en el tipo de ServiceContract {1}. El método Begin debe tomar AsyncCallback y un objeto como los dos últimos argumentos y devolver IAsyncResult.
fr: La signature de méthode Begin asynchrone est non valide pour la méthode {0} dans le ServiceContract de type {1}. La méthode Begin doit accepter AsyncCallback et un objet pour ses deux derniers arguments et retourner IAsyncResult.
it: La firma del metodo Begin asincrono per il metodo {0} nell'elemento ServiceContract di tipo {1} non è valida. Il metodo Begin deve accettare come ultimi due argomenti un elemento AsyncCallback e un oggetto e restituire un elemento IAsyncResult.
ja: ServiceContract 型 {1} のメソッド {0} の非同期 Begin メソッドのシグネチャは無効です。begin メソッドは、AsyncCallback およびオブジェクトを最後の 2 つの引数として受け取って、IAsyncResult を返す必要があります。
ko: ServiceContract 형식 {1}의 {0} 메서드에 대한 잘못된 비동기 Begin 메서드 시그니처가 있습니다. Begin 메서드는 AsyncCallback 및 개체를 마지막 두 개의 인수로 가지고 IAsyncResult를 반환해야 합니다.
pl: Nieprawidłowy podpis asynchronicznej metody Begin dla metody {0} w typie ServiceContract {1}. Stosowana metoda Begin musi przyjmować element AsyncCallback oraz dowolny obiekt jako dwa ostatnie argumenty i zwracać obiekt IAsyncResult.
pt_br: Assinatura inválida de método Begin assíncrono para o método {0} no tipo {1} de ServiceContract. Seu método Begin deve usar AsyncCallback e um objeto como os dois últimos argumentos e retornar IAsyncResult.
tr: {1} ServiceContract türündeki {0} metodu için geçersiz asenkron Begin metodu imzası. Başlangıç metodunuz, en son iki bağımsız değişken olarak bir AsyncCallback ve bir nesne almalı ve bir IAsyncResult döndürmelidir.
zh_hans: ServiceContract 类型 {1} 中方法 {0} 的异步 Begin 方法签名无效。Begin 方法必须取 AsyncCallback 和对象作为最后两个参数并返回 IAsyncResult。
zh_hant: ServiceContract 類型 {1} 中方法 {0} 的非同步 Begin 方法簽章無效。開始方法必須以 AsyncCallback 及一個物件作為最後兩個引數，並傳回 IAsyncResult。

# InvalidAsyncEndMethodSignatureForMethod2
source: Invalid async End method signature for method {0} in ServiceContract type {1}. Your end method must take an IAsyncResult as the last argument.
cs: Neplatný podpis asynchronní metody ukončení pro metodu {0} v typu třídy ServiceContract {1}. Metoda ukončení musí přijmout třídu IAsyncResult jako poslední argument.
de: Ungültige Signatur der asynchronen End-Methode für die Methode {0} im ServiceContract-Typ {1}. Die End-Methode muss ein IAsyncResult als letztes Argument akzeptieren.
es: Signatura no válida del método End asincrónico para el método {0} en el tipo de ServiceContract {1}. El método End debe tomar IAsyncResult como último argumento.
fr: La signature de méthode End asynchrone est non valide pour la méthode {0} dans le ServiceContract de type {1}. La méthode End doit accepter IAsyncResult comme dernier argument.
it: La firma del metodo End asincrono per il metodo {0} nell'elemento ServiceContract di tipo {1} non è valida. Il metodo End deve accettare come ultimo argomento un elemento IAsyncResult.
ja: ServiceContract 型 {1} のメソッド {0} の非同期 End メソッドのシグネチャは無効です。end メソッドは、IAsyncResult を最後の引数として受け取る必要があります。
ko: ServiceContract 형식 {1}의 {0} 메서드에 대한 잘못된 비동기 End 메서드 시그니처가 있습니다. End 메서드는 IAsyncResult를 마지막 인수로 가져야 합니다.
pl: Nieprawidłowy podpis asynchronicznej metody End dla metody {0} w typie ServiceContract {1}. Stosowana metoda End musi przyjmować obiekt IAsyncResult jako ostatni argument.
pt_br: Assinatura inválida de método End assíncrono para o método {0} no tipo {1} de ServiceContract. Seu método End deve usar IAsyncResult como último argumento.
tr: {1} ServiceContract türündeki {0} metodu için geçersiz asenkron End metodu imzası. Bitiş metodunuz, en son bağımsız değişken olarak bir IAsyncResult almalıdır.
zh_hans: ServiceContract 类型 {1} 中方法 {0} 的异步 End 方法签名无效。End 方法必须取 IAsyncResult 作为最后一个参数。
zh_hant: ServiceContract 類型的 {1} 的方法 {0} 之非同步 End 方法簽章無效。結束方法必須以 IAsyncResult 作為最後的引數。

# InvalidBindingScheme
source: The TransportBindingElement of type '{0}' in this CustomBinding returned a null or empty string for the Scheme. TransportBindingElement's Scheme must be a non-empty string.
cs: Třída TransportBindingElement typu {0} v této třídě CustomBinding vrátila jako schéma řetězec s hodnotou NULL nebo prázdný řetězec. Schéma třídy TransportBindingElement musí být neprázdným řetězcem.
de: Das TransportBindingElement vom Typ "{0}" in dieser CustomBinding hat für das Schema eine NULL-Zeichenfolge oder leere Zeichenfolge zurückgegeben. Das Schema von TransportBindingElement darf keine leere Zeichenfolge sein.
es: El elemento TransportBindingElement de tipo "{0}" en el enlace CustomBinding devolvió una cadena nula o vacía para Scheme. El atributo Scheme de TransportBindingElement no debe ser una cadena vacía.
fr: L'élément TransportBindingElement de type '{0}' dans cette liaison CustomBinding a retourné une chaîne de valeur null ou vide pour le modèle. Le modèle de l'élément TransportBindingElement doit être une chaîne non vide.
it: L'elemento TransportBindingElement di tipo '{0}' in questo elemento CustomBinding ha restituito una stringa vuota o Null per lo schema. Lo schema di TransportBindingElement deve essere una stringa non vuota.
ja: この CustomBinding に含まれている型 '{0}' の TransportBindingElement は、Scheme に対して null または空の文字列を戻しました。TransportBindingElement の Scheme は、空ではない文字列である必要があります。
ko: 이 CustomBinding에서 형식 '{0}'의 TransportBindingElement가 구성표에 대해 null 또는 빈 문자열을 반환했습니다. TransportBindingElement의 구성표는 비어 있지 않은 문자열이어야 합니다.
pl: ElementTransportBindingElement typu „{0}” w elemencie CustomBinding zwrócił wartość null lub pusty ciąg dla schematu. Schemat elementu TransportBindingElement musi być ciągiem niepustym.
pt_br: TransportBindingElement do tipo '{0}' em CustomBinding retornou uma cadeia de caracteres nula ou vazia para o Esquema. O Esquema de TransportBindingElement deve ser uma cadeia de caracteres não vazia.
tr: Bu CustomBinding içinde '{0}' türündeki TransportBindingElement, Scheme için null ya da boş dize döndürdü. TransportBindingElement için Scheme, boş olmayan bir dize olmalıdır.
zh_hans: 该 CustomBinding 中类型为“{0}”的 TransportBindingElement 为方案返回了 null 或空字符串。TransportBindingElement 的方案必须是非空字符串。
zh_hant: 此 CustomBinding 中類型 '{0}' 的 TransportBindingElement 傳回的 Scheme 為 null 或空字串。TransportBindingElement 的 Scheme 必須是非空白字串。

# InvalidBufferRemaining
source: An acknowledgement was received indicating the remaining buffer space on the remote endpoint is {0}. This number cannot be less than zero. The reliable session was faulted.
cs: Bylo přijato potvrzení určující, že zbývající prostor vyrovnávací paměti v koncovém bodě je {0}. Toto číslo nesmí být menší než nula. Ve stabilní relaci došlo k chybě.
de: Es wurde eine Bestätigung empfangen, die anzeigt, dass auf dem Remoteendpunkt ein Pufferspeicher von {0} verbleibt. Diese Zahl kann nicht kleiner als Null sein. Die zuverlässige Sitzung war nicht erfolgreich.
es: Se recibió una confirmación para indicar que el espacio de búfer restante en el extremo remoto es {0}. Este número no puede ser inferior a cero. Se generó un error en la sesión confiable.
fr: Un accusé de réception a été reçu, indiquant que l'espace de mémoire tampon restant sur le point de terminaison distant est {0}. Ce nombre ne peut pas être inférieur à zéro. La session fiable a généré une erreur.
it: L'acknowledgement ricevuto indica che lo spazio restante sul buffer nell'endpoint remoto è {0}. Tale numero non può essere minore di zero. Sessione affidabile non riuscita.
ja: リモート エンドポイント上の残りのバッファー容量が {0} であることを示す受信確認を受信しました。この数値は 0 以上である必要があります。信頼できるセッションは途中終了されました。
ko: 원격 끝점의 나머지 버퍼 공간이 {0}(이)라는 것을 나타내는 승인을 수신했습니다. 이 숫자는 0보다 작을 수 없습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Odebrano potwierdzenie, że pozostała ilość miejsca w buforze zdalnego punktu końcowego wynosi {0}. Liczba ta nie może być ujemna. Wystąpił błąd sesji uwierzytelnionej.
pt_br: Uma confirmação foi recebida, indicando que o espaço de buffer restante no ponto de extremidade remoto é {0}. Esse número não pode ser menor que zero. Falha na sessão confiável.
tr: Uzak bitiş noktasında kalan arabellek alanının {0} olduğunu belirten bir bildirim alındı. Bu sayı, sıfırdan küçük olamaz. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 收到指示远程终结点上的缓冲区空间为 {0} 的确认。此数值不能小于零。该可靠的会话出错。
zh_hant: 收到指出遠端端點的剩餘緩衝區空間為 {0} 的通知。此數字不可小於零。可靠工作階段發生錯誤。

# InvalidCloseResponseAction
source: A security session close response was received with an invalid action '{0}'.
cs: Odpověď na ukončení relace zabezpečení byla přijata s neplatnou akcí {0}.
de: Eine Antwort zum Schließen einer Sicherheitssitzung wurde mit einer ungültigen Aktion "{0}" empfangen.
es: Se recibió una respuesta de cierre de sesión de seguridad con una acción no válida "{0}".
fr: Une réponse de fermeture de session de sécurité a été reçue avec une action «{0}» non valide,
it: È stata ricevuta una risposta di chiusura nella sessione di sicurezza con un'azione non valida "{0}".
ja: 無効なアクション '{0}' が含まれたセキュリティ セッションの終了応答を受信しました。
ko: 보안 세션 닫기 응답이 잘못된 '{0}' 동작과 함께 수신되었습니다.
pl: Odebrano odpowiedź zamykającą sesję zabezpieczeń z nieprawidłową akcją "{0}".
pt_br: Uma resposta de fechamento da sessão de segurança foi recebida com uma ação inválida '{0}'.
tr: Geçersiz '{0}' eylemi içeren bir güvenlik oturumu kapatma yanıtı alındı.
zh_hans: 已收到带有无效操作“{0}”的安全会话关闭响应
zh_hant: 收到含有無效動作 '{0}' 的安全性工作階段關閉回應。

source: Invalid decoder state machine.
cs: Stavový počítač pro dekódování je neplatný.
de: Ungültiger Decoderzustandsautomat.
es: Equipo de estado de descodificador no válido.
fr: Machine à états de décodeur non valide.
it: La macchina a stati del decoder non è valida.
ja: デコーダーのステート マシンが無効です。
ko: 잘못된 디코더 상태 컴퓨터입니다.
pl: Nieprawidłowa maszyna stanu dekodera.
pt_br: Computador de estado de decodificador inválido.
tr: Geçersiz kod çözücü durum makinesi.
zh_hans: 解码器状态机无效。
zh_hant: 解碼器狀態機器無效。
