Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# DerivedKeyTokenOffsetTooHigh
source: The derived key's Offset ('{0}' bytes) exceeds the maximum offset ('{1}' bytes) allowed.
cs: Posun odvozeného klíče (počet bajtů: {0}) přesahuje maximální povolený posun (počet bajtů: {1}).
de: Der Offset ("{0}" Bytes) des abgeleiteten Schlüssels überschreitet den maximal zulässigen Offset ("{1}" Bytes).
es: El valor Offset ("{0}" bytes) de la clave derivada supera el desplazamiento máximo ("{1}" bytes) permitido.
fr: Le décalage de la clé dérivée ('{0}' octets) dépasse le décalage maximal autorisé ('{1}' octets).
it: Il valore di Offset ('{0}' byte) della chiave derivata supera quello massimo consentito ('{1}' byte).
ja: 派生キーのオフセット ('{0}' バイト) は、許可されている最大オフセット ('{1}' バイト) を超えています。
ko: 파생 키의 오프셋('{0}'바이트)이 허용되는 최대 오프셋('{1}'바이트)을 초과합니다.
pl: Przesunięcie („{0}” B) klucza pochodnego przekracza maksymalne dozwolone przesunięcie („{1}” B).
pt_br: O Deslocamento ('{0}' bytes) da chave derivada excede o deslocamento máximo permitido ('{1}' bytes).
tr: Türetilen anahtarın Offset özelliği değeri ('{0}' bayt), izin verilen en büyük uzaklık değerini ('{1}' bayt) aşıyor.
zh_hans: 派生密钥的偏移(“{0}”个字节)超过了所允许的最大偏移(“{1}”个字节)。
zh_hant: 衍生金鑰的 Offset ('{0}' 個位元組) 超出允許的偏差上限 ('{1}' 個位元組)。

# DerivedKeyTokenRequiresTokenReference
source: DerivedKeyToken requires a reference to a token.
cs: Třída DerivedKeyToken vyžaduje odkaz na token.
de: DerivedKeyToken erfordert einen Verweis auf ein Token.
es: El elemento DerivedKeyToken requiere una referencia a un token.
fr: DerivedKeyToken nécessite une référence à un jeton.
it: Con DerivedKeyToken è richiesto un riferimento a un token.
ja: DerivedKeyToken には、トークンへの参照が必要です。
ko: DerivedKeyToken은 토큰에 대한 참조가 필요합니다.
pl: Obiekt DerivedKeyToken wymaga odwołania do tokenu.
pt_br: DerivedKeyToken requer uma referência a um token.
tr: DerivedKeyToken, bir belirteç başvurusu gerektirir.
zh_hans: DerivedKeyToken 需要对令牌的引用。
zh_hant: DerivedKeyToken 需要權杖參考。

# DispatchRuntimeRequiresFormatter0
source: The DispatchOperation '{0}' requires Formatter, since DeserializeRequest and SerializeReply are not both false.
cs: Třída DispatchOperation {0} vyžaduje formátovací modul, protože třídy DeserializeRequest a SerializeReply nejsou obě neplatné.
de: Der DispatchOperation "{0}" erfordert eine Formatierung, da DeserializeRequest und SerializeReply beide nicht "false" sind.
es: DispatchOperation "{0}" requiere Formatter, porque DeserializeRequest y SerializeReply no tienen ambos el valor false.
fr: DispatchOperation '{0}' nécessite Formatter, car DeserializeRequest et SerializeReply n'ont pas tous les deux la valeur false.
it: Con l'elemento DispatchOperation '{0}' è richiesto Formatter perché DeserializeRequest e SerializeReply non sono entrambi false.
ja: DeserializeRequest と SerializeReply の両方が False ではないため、DispatchOperation '{0}' にはフォーマッタが必要です。
ko: DeserializeRequest 및 SerializeReply가 둘 다 false가 아니므로 DispatchOperation '{0}'에 포맷터가 필요합니다.
pl: Element DispatchOperation „{0}” wymaga elementu Formatter, ponieważ co najmniej jedna z właściwości DeserializeRequest i SerializeReply nie ma wartości false.
pt_br: DispatchOperation '{0}' requer Formatter, pois DeserializeRequest e SerializeReply não são ambos false.
tr: DeserializeRequest ve SerializeReply değerlerinin her ikisi de false olmadığından, DispatchOperation '{0}' Formatter gerektirir.
zh_hans: DispatchOperation“{0}”需要格式化程序，因为 DeserializeRequest 和 SerializeReply 并非均为 False。
zh_hant: 因為 DeserializeRequest 與 SerializeReply 並非都為 false，所以 DispatchOperation '{0}' 需要 Formatter。

# DnsIdentityCheckFailedForIncomingMessage
source: Identity check failed for incoming message. The expected DNS identity of the remote endpoint was '{0}' but the remote endpoint provided DNS claim '{1}'. If this is a legitimate remote endpoint, you can fix the problem by explicitly specifying DNS identity '{1}' as the Identity property of EndpointAddress when creating channel proxy.
cs: Pro příchozí zprávu nebylo možné zkontrolovat identitu. Očekávaná identita DNS vzdáleného koncového bodu byla {0}, ale vzdálený koncový bod poskytl deklaraci DNS {1}. Pokud se jedná o legitimní vzdálený koncový bod, lze tento problém vyřešit explicitním určením identity DNS {1} jako vlastnosti Identity třídy EndpointAddress při vytváření kanálu proxy.
de: Fehler bei der Identitätsprüfung für eine eingehende Nachricht. Die erwartete DNS-Identität des Remoteendpunkts war "{0}", aber der Remoteendpunkt hat den DNS-Anspruch "{1}" bereitgestellt. Wenn es sich hierbei um einen zulässigen Remoteendpunkt handelt, können Sie das Problem beheben, indem Sie ausdrücklich die DNS-Identität "{1}" als Identity-Eigenschaft von EndpointAddress angeben, wenn Sie einen Kanalproxy erstellen.
es: Error de comprobación de identidad para el mensaje entrante. La identidad DNS esperada del punto de conexión remoto era "{0}" pero el punto de conexión remoto proporcionó la notificación DNS "{1}". Si se trata de un punto de conexión remoto legítimo, puede solucionar el problema especificando de forma explícita la identidad DNS "{1}" como la propiedad Identity de EndpointAddress al crear el proxy del canal.
fr: Échec de la vérification d'identité pour le message entrant. L'identité DNS attendue sur le point de terminaison distant était '{0}', mais le DNS fourni pour le point de terminaison distant revendique '{1}'. S'il s'agit d'un point de terminaison distant valable, vous pouvez résoudre le problème en spécifiant explicitement l'identité DNS '{1}' pour la propriété Identity de EndpointAddress durant la création du proxy du canal.
it: Non è stato possibile completare il controllo di identità per il messaggio in arrivo. L'identità DNS prevista dell'endpoint remoto era '{0}', ma l'endpoint remoto ha fornito l'attestazione DNS '{1}'. Se si tratta di un endpoint remoto legittimo, è possibile risolvere il problema specificando esplicitamente l'identità DNS '{1}' come proprietà Identity di EndpointAddress durante la creazione del proxy del canale.
ja: 受信メッセージの ID の確認に失敗しました。リモート エンドポイントの予期された DNS ID は '{0}' ですが、リモート エンドポイントから提供されたのは DNS 要求 '{1}' でした。これが適正なリモート エンドポイントである場合、チャネルのプロキシを作成する際に、DNS ID '{1}' を EndpointAddress の ID プロパティとして明示的に指定することで問題を修正することができます。
ko: 들어오는 메시지의 ID를 검사하지 못했습니다. 원격 엔드포인트의 필요한 DNS ID가 '{0}'이지만 원격 엔드포인트가 DNS 클레임 '{1}'을(를) 제공했습니다. 이 엔드포인트가 올바른 원격 엔드포인트인 경우 채널 프록시를 만들 때 DNS ID '{1}'을(를) EndpointAddress의 Identity 속성으로 명시적으로 지정하여 이 문제를 해결할 수 있습니다.
pl: Nie można sprawdzić tożsamości komunikatu przychodzącego. Oczekiwana tożsamość DNS zdalnego punktu końcowego to „{0}”, ale zdalny punkt końcowy udostępnił oświadczenie DNS „{1}”. Jeśli jest to uprawniony zdalny punkt końcowy, można naprawić problem, jawnie ustawiając tożsamość DNS „{1}” jako właściwość Identity elementu EndpointAddress podczas tworzenia serwera proxy kanału.
pt_br: Falha na verificação de Identidade da mensagem de entrada. A identidade DNS esperada do ponto de extremidade remoto era '{0}', mas o ponto de extremidade remoto forneceu uma declaração DNS '{1}'. Se for um ponto de extremidade remoto legítimo, corrija o problema especificando explicitamente a identidade DNS '{1}' como a propriedade Identity de EndpointAddress ao criar um proxy de canal.
tr: Kimlik denetimi gelen iletide başarısız oldu. Uzak uç noktanın beklenen DNS kimliği '{0}' iken, uzak uç nokta '{1}' DNS talebini sağladı. Bu yasal bir uzak uç noktaysa, kanal proxy'si oluştururken '{1}' DNS kimliğini EndpointAddress Identity özelliği olarak açıkça belirterek sorunu düzeltebilirsiniz.
zh_hans: 传入消息标识检查失败。远程终结点需要的 DNS 标识为“{0}”，但是远程终结点提供的 DNS 声明为“{1}”。如果此远程终结点合法，可以通过在创建通道代理时将 DNS 标识“{1}”显式指定为 EndpointAddress 的“标识”属性来解决此问题。
zh_hant: 內送郵件的身分識別檢查失敗。應有的遠端端點 DNS 身分識別為 '{0}'，但遠端端點提供的 DNS 宣告為 '{1}'。若這是合法的遠端端點，只要在建立通道 Proxy 時，請明確指定 DNS 身分識別 '{1}' 作為 EndpointAddress 的 Identity 屬性，即可解決此問題。

# DnsIdentityCheckFailedForIncomingMessageLackOfDnsClaim
source: The Identity check failed for the incoming message. The remote endpoint did not provide a domain name system (DNS) claim and therefore did not satisfied DNS identity '{0}'. This may be caused by lack of DNS or CN name in the remote endpoint X.509 certificate's distinguished name.
cs: Kontrola identity příchozí zprávy selhala. Vzdálený koncový bod neposkytl deklaraci identity služby DNS (Domain Name System), a proto nesplnil {0} identitu DNS. To může být způsobeno nepřítomností názvu DNS nebo CN v rozlišujícím názvu certifikátu vzdáleného koncového bodu X.509.
de: Fehler bei der Identitätsprüfung für eine eingehende Nachricht. Der Remoteendpunkt hat keinen DNS-Anspruch (Domain Name System) bereitgestellt und daher nicht die DNS-Identität "{0}" erfüllt. Die Ursache hierfür kann ein fehlender DNS- oder CN-Name im Distinguished Name des X.509-Zertifikats des Remoteendpunkts sein.
es: Error de comprobación de identidad para el mensaje entrante. El punto de conexión remoto no proporcionó ninguna notificación de Sistema de nombres de dominio (DNS) y, por lo tanto, no satisfizo la identidad DNS "{0}". Esto puede deberse a la falta del nombre DNS o CN en el nombre distintivo del certificado X.509 del punto de conexión remoto.
fr: Échec du contrôle d'identité pour le message entrant. Le point de terminaison distant n'a pas fourni de revendication DNS (Domain Name System) et n'a donc pas satisfait l'identité DNS '{0}'. Cet incident pourrait être causé par l'absence d'un nom DNS ou CN dans le nom unique du certificat X.509 du point de terminaison distant.
it: Non è stato possibile completare il controllo di identità per il messaggio in arrivo. L'endpoint remoto non ha fornito un'attestazione Domain Name System (DNS) e non ha quindi soddisfatto l'identità DNS '{0}'. Questo problema potrebbe essere causato dalla mancanza del nome DNS o CN nel nome distinto del certificato X.509 dell'endpoint remoto.
ja: 受信メッセージの ID の確認に失敗しました。リモート エンドポイントからドメイン ネーム システム (DNS) 要求が提供されなかったため、DNS ID '{0}' を満たしませんでした。これは、リモート エンドポイントの X.509 証明書の識別名に DNS 名または CN 名が含まれていないことが原因である可能性があります。
ko: 들어오는 메시지의 ID를 검사하지 못했습니다. 원격 엔드포인트가 DNS(Domain Name System) 클레임을 제공하지 않았으므로 DNS ID '{0}'을(를) 충족하지 못했습니다. 이것은 원격 엔드포인트 X.509 인증서의 고유 이름에 DNS 또는 CN 이름이 없을 경우 발생할 수 있습니다.
pl: Nie można sprawdzić tożsamości komunikatu przychodzącego. Zdalny punkt końcowy nie udostępnił oświadczenia systemu DNS i przez to nie spełnił wymagań dotyczących tożsamości DNS „{0}”. Może to być spowodowane brakiem nazwy DNS lub nazwy pospolitej w nazwie wyróżniającej certyfikatu X.509 zdalnego punktu końcowego.
pt_br: Falha na verificação de Identidade da mensagem de entrada. O ponto de extremidade remoto não forneceu uma declaração de DNS (Sistema de Nomes de Domínio) e, portanto, não atendeu à identidade DNS '{0}'. Isso pode ter ocorrido pela falta de um nome DNS ou CN no nome diferenciado do certificado X.509 referente ao ponto de extremidade remoto.
tr: Kimlik denetimi gelen iletide başarısız oldu. Uzak uç nokta, bir etki alanı adı sistemi (DNS) talebi sağlamadı ve bu nedenle DNS kimliği '{0}' karşılanamadı. Bunun nedeni, uzak uç nokta X.509 sertifikasının farklı adında DNS veya CN adının bulunmaması olabilir.
zh_hans: 传入消息标识检查失败。远程终结点未提供域名系统(DNS)声明，因此不符合 DNS 标识“{0}”。这可能是由于远程终结点 X.509 证书的可分辨名称中缺少 DNS 或 CN 名称所致。
zh_hant: 內送郵件的身分識別檢查失敗。遠端端點未提供網域名稱系統 (DNS) 宣告，因此未符合 DNS 身分識別 '{0}'。這可能是因為遠端端點 X.509 憑證的辨別名稱遺漏了 DNS 或 CN 名稱所造成。

# DnsIdentityCheckFailedForOutgoingMessage
source: Identity check failed for outgoing message. The expected DNS identity of the remote endpoint was '{0}' but the remote endpoint provided DNS claim '{1}'. If this is a legitimate remote endpoint, you can fix the problem by explicitly specifying DNS identity '{1}' as the Identity property of EndpointAddress when creating channel proxy.
cs: Pro odchozí zprávu nebylo možné zkontrolovat identitu. Očekávaná identita DNS vzdáleného koncového bodu byla {0} ale vzdálený koncový bod poskytl deklaraci DNS {1}. Pokud se jedná o legitimní vzdálený koncový bod, lze tento problém vyřešit explicitním určením identity DNS {1} jako vlastnosti Identity třídy EndpointAddress při vytváření kanálu proxy.
de: Fehler bei der Identitätsprüfung für eine ausgehende Nachricht. Die erwartete DNS-Identität des Remoteendpunkts war "{0}", aber der Remoteendpunkt hat den DNS-Anspruch "{1}" bereitgestellt. Wenn es sich hierbei um einen zulässigen Remoteendpunkt handelt, können Sie das Problem beheben, indem Sie ausdrücklich die DNS-Identität "{1}" als Identity-Eigenschaft von EndpointAddress angeben, wenn Sie einen Kanalproxy erstellen.
es: Error de comprobación de identidad para el mensaje saliente. La identidad DNS esperada del punto de conexión remoto era "{0}" pero el punto de conexión remoto proporcionó la notificación DNS "{1}". Si se trata de un punto de conexión remoto legítimo, puede solucionar el problema especificando de forma explícita la identidad DNS "{1}" como la propiedad Identity de EndpointAddress al crear el proxy del canal.
fr: Échec de la vérification d'identité pour le message sortant. L'identité DNS attendue sur le point de terminaison distant était '{0}', mais le DNS fourni pour le point de terminaison distant revendique '{1}'. S'il s'agit d'un point de terminaison distant valable, vous pouvez résoudre le problème en spécifiant explicitement l'identité DNS '{1}' pour la propriété Identity de EndpointAddress durant la création du proxy du canal.
it: Non è stato possibile completare il controllo di identità per il messaggio in uscita. L'identità DNS prevista dell'endpoint remoto era '{0}', ma l'endpoint remoto ha fornito l'attestazione DNS '{1}'. Se si tratta di un endpoint remoto legittimo, è possibile risolvere il problema specificando esplicitamente l'identità DNS '{1}' come proprietà Identity di EndpointAddress durante la creazione del proxy del canale.
ja: 送信メッセージの ID の確認に失敗しました。リモート エンドポイントの予期された DNS ID は '{0}' ですが、リモート エンドポイントから提供されたのは DNS 要求 '{1}' でした。これが適正なリモート エンドポイントである場合、チャネルのプロキシを作成する際に、DNS ID '{1}' を EndpointAddress の ID プロパティとして明示的に指定することで問題を修正することができます。
ko: 보내는 메시지의 ID를 검사하지 못했습니다. 원격 엔드포인트의 필요한 DNS ID가 '{0}'이지만 원격 엔드포인트가 DNS 클레임 '{1}'을(를) 제공했습니다. 이 엔드포인트가 올바른 원격 엔드포인트인 경우 채널 프록시를 만들 때 DNS ID '{1}'을(를) EndpointAddress의 Identity 속성으로 명시적으로 지정하여 이 문제를 해결할 수 있습니다.
pl: Nie można sprawdzić tożsamości komunikatu wychodzącego. Oczekiwana tożsamość DNS zdalnego punktu końcowego to „{0}”, ale zdalny punkt końcowy udostępnił oświadczenie DNS „{1}”. Jeśli jest to uprawniony zdalny punkt końcowy, można naprawić problem, jawnie ustawiając tożsamość DNS „{1}” jako właściwość Identity obiektu EndpointAddress podczas tworzenia serwera proxy kanału.
pt_br: Falha na verificação de Identidade da mensagem de saída. A identidade DNS esperada do ponto de extremidade remoto era '{0}', mas o ponto de extremidade remoto forneceu uma declaração DNS '{1}'. Se for um ponto de extremidade remoto legítimo, corrija o problema especificando explicitamente a identidade DNS '{1}' como a propriedade Identity de EndpointAddress ao criar um proxy de canal.
tr: Kimlik denetimi giden iletide başarısız oldu. Uzak uç noktanın beklenen DNS kimliği '{0}' iken, uzak uç nokta '{1}' DNS talebini sağladı. Bu yasal bir uzak uç noktaysa, kanal proxy'si oluştururken '{1}' DNS kimliğini EndpointAddress Identity özelliği olarak açıkça belirterek sorunu düzeltebilirsiniz.
zh_hans: 传出消息标识检查失败。远程终结点需要的 DNS 标识为“{0}”，但是远程终结点提供的 DNS 声明为“{1}”。如果此远程终结点合法，可以通过在创建通道代理时将 DNS 标识“{1}”显式指定为 EndpointAddress 的 Identity 属性来解决此问题。
zh_hant: 外寄郵件的身分識別檢查失敗。預期的遠端端點 DNS 身分識別為 '{0}'，但遠端端點提供的 DNS 宣告為 '{1}'。如果這是合法的遠端端點，只要在建立通道 Proxy 時，明確指定 DNS 身分識別 '{1}' 作為 EndpointAddress 的 Identity 屬性，即可解決此問題。

# DnsIdentityCheckFailedForOutgoingMessageLackOfDnsClaim
source: The Identity check failed for the outgoing message. The remote endpoint did not provide a domain name system (DNS) claim and therefore did not satisfied DNS identity '{0}'. This may be caused by lack of DNS or CN name in the remote endpoint X.509 certificate's distinguished name.
cs: Kontrola identity odchozí zprávy selhala. Vzdálený koncový bod neposkytl deklaraci identity služby DNS (Domain Name System), a proto nesplnil {0} identitu DNS. To může být způsobeno nepřítomností názvu DNS nebo CN v rozlišujícím názvu certifikátu vzdáleného koncového bodu X.509.
de: Fehler bei der Identitätsprüfung für eine ausgehende Nachricht. Der Remoteendpunkt hat keinen DNS-Anspruch (Domain Name System) bereitgestellt und daher nicht die DNS-Identität "{0}" erfüllt. Die Ursache hierfür kann ein fehlender DNS- oder CN-Name im Distinguished Name des X.509-Zertifikats des Remoteendpunkts sein.
es: Error de comprobación de identidad para el mensaje saliente. El punto de conexión remoto no proporcionó ninguna notificación de Sistema de nombres de dominio (DNS) y, por lo tanto, no satisfizo la identidad DNS "{0}". Esto puede deberse a la falta del nombre DNS o CN en el nombre distintivo del certificado X.509 del punto de conexión remoto.
fr: Échec du contrôle d'identité pour le message sortant. Le point de terminaison distant n'a pas fourni de revendication DNS (Domain Name System) et n'a donc pas satisfait l'identité DNS '{0}'. Cet incident pourrait être causé par l'absence d'un nom DNS ou CN dans le nom unique du certificat X.509 du point de terminaison distant.
it: Non è stato possibile completare il controllo di identità per il messaggio in uscita. L'endpoint remoto non ha fornito un'attestazione Domain Name System (DNS) e non ha quindi soddisfatto l'identità DNS '{0}'. Questo problema potrebbe essere causato dalla mancanza del nome DNS o CN nel nome distinto del certificato X.509 dell'endpoint remoto.
ja: 送信メッセージの ID の確認に失敗しました。リモート エンドポイントからドメイン ネーム システム (DNS) 要求が提供されなかったため、DNS ID '{0}' を満たしませんでした。これは、リモート エンドポイントの X.509 証明書の識別名に DNS 名または CN 名が含まれていないことが原因である可能性があります。
ko: 보내는 메시지의 ID를 검사하지 못했습니다. 원격 엔드포인트가 DNS(Domain Name System) 클레임을 제공하지 않았으므로 DNS ID '{0}'을(를) 충족하지 못했습니다. 이것은 원격 엔드포인트 X.509 인증서의 고유 이름에 DNS 또는 CN 이름이 없을 경우 발생할 수 있습니다.
pl: Nie można sprawdzić tożsamości komunikatu wychodzącego. Zdalny punkt końcowy nie udostępnił oświadczenia systemu DNS i przez to nie spełnił wymagań dotyczących tożsamości DNS „{0}”. Może to być spowodowane brakiem nazwy DNS lub nazwy pospolitej w nazwie wyróżniającej certyfikatu X.509 zdalnego punktu końcowego.
pt_br: Falha na verificação de Identidade da mensagem de saída. O ponto de extremidade remoto não forneceu uma declaração de DNS (Sistema de Nomes de Domínio) e, portanto, não atendeu à identidade DNS '{0}'. Isso pode ter ocorrido pela falta de um nome DNS ou CN no nome diferenciado do certificado X.509 referente ao ponto de extremidade remoto.
tr: Kimlik denetimi giden iletide başarısız oldu. Uzak uç nokta, bir etki alanı adı sistemi (DNS) talebi sağlamadı ve bu nedenle DNS kimliği '{0}' karşılanamadı. Bunun nedeni, uzak uç nokta X.509 sertifikasının farklı adında DNS veya CN adının bulunmaması olabilir.
zh_hans: 传出消息标识检查失败。远程终结点未提供域名系统(DNS)声明，因此不符合 DNS 标识“{0}”。这可能是由于远程终结点 X.509 证书的可分辨名称中缺少 DNS 或 CN 名称所致。
zh_hant: 外寄郵件的身分識別檢查失敗。遠端端點未提供網域名稱系統 (DNS) 宣告，因此不符合 DNS 身分識別 '{0}'。這可能是因為遠端端點 X.509 憑證的辨別名稱遺漏 DNS 或 CN 名稱所造成。

# DuplexChannelAbortedDuringOpen
source: Duplex channel to {0} was aborted during the open process.
cs: Duplexní kanál do {0} byl přerušen během otevřeného procesu.
de: Der Duplexkanal zu {0} wurde beim Öffnen abgebrochen.
es: El canal dúplex a {0} se anuló durante el proceso de apertura.
fr: Le canal duplex vers {0} a été abandonné durant le processus d'ouverture.
it: Il canale duplex per {0} è stato interrotto durante il processo di apertura.
ja: {0} への二重チャネルは、開始処理中に中止されました。
ko: 열기 프로세스 도중에 {0}에 대한 이중 채널이 중단되었습니다.
pl: Kanał dupleksowy do elementu {0} został przerwany w trakcie procesu otwierania.
pt_br: O canal dúplex para {0} foi anulado durante o processo de abertura.
tr: {0} çift yönlü kanalı açma işlemi sırasında iptal edildi.
zh_hans: 打开进程的过程中，到 {0} 的双工通道被中止。
zh_hant: {0} 的雙工通道在開啟過程中已中止。

# DuplicateBehavior1
source: The value could not be added to the collection, as the collection already contains an item of the same type: '{0}'. This collection only supports one instance of each type.
cs: Hodnotu nebylo možné přidat do kolekce, protože ta již zahrnuje položku stejného typu: {0}. Tato kolekce podporuje od každého typu pouze jednu instanci.
de: Der Wert konnte der Sammlung nicht hinzugefügt werden, da die Sammlung bereits ein Element desselben Typs enthält: "{0}". Diese Sammlung unterstützt nur jeweils eine Instanz von jedem Typ.
es: No se pudo agregar el valor a la colección, ya que esta contiene un elemento del mismo tipo: "{0}". Esta colección solo admite una instancia de cada tipo.
fr: La valeur n'a pas pu être ajoutée à la collection, car cette collection contient déjà un élément du même type : '{0}'. Cette collection ne prend en charge qu'une seule instance de chaque type.
it: Non è stato possibile aggiungere il valore alla raccolta perché la raccolta contiene già un elemento dello stesso tipo: '{0}'. Questa raccolta supporta una sola istanza di ogni tipo.
ja: このコレクションには、同じ型 '{0}' の項目が既に含まれているため、値を追加できませんでした。このコレクションは、各型の 1 つのインスタンスのみをサポートしています。
ko: 동일한 형식의 항목이 이미 컬렉션이 있으므로 값을 컬렉션에 추가할 수 없습니다. '{0}'. 이 컬렉션은 각 형식의 인스턴스를 하나만 지원합니다.
pl: Nie można dodać wartości do kolekcji, ponieważ kolekcja zawiera już element tego samego typu: „{0}”. Ta kolekcja obsługuje tylko jedno wystąpienie każdego typu.
pt_br: Não foi possível adicionar o valor à coleção porque essa coleção já contém um item do mesmo tipo: '{0}'. Essa coleção apenas dá suporte a uma instância de cada tipo.
tr: Koleksiyon zaten aynı türden bir öğe bulundurduğundan, değer koleksiyona eklenemedi: '{0}'. Bu koleksiyon her türün yalnızca bir örneğini destekler.
zh_hans: 该值无法添加到集合中，因为该集合已经包含一个相同类型的项目:“{0}”。此集合仅支持每种类型一个实例。
zh_hant: 無法將值新增至集合，因為集合已包含相同類型的項目: '{0}'。此集合每一類型僅支援一個執行個體。

# DuplicateIdInMessageToBeVerified
source: The '{0}' id occurred twice in the message that is supplied for verification.
cs: Identifikátor {0} se vyskytl dvakrát ve zprávě dodané k ověření.
de: Die ID "{0}" erschien zweimal in der für die Überprüfung bereitgestellten Nachricht.
es: El id. '{0}' aparece dos veces en el mensaje que se proporciona para la comprobación.
fr: L'identificateur '{0}' figure deux fois dans le message qui est fourni pour vérification.
it: L'ID '{0}' è stato rilevato due volte nel messaggio fornito per la verifica.
ja: 検証対象のメッセージに ID '{0}' が 2 つあります。
ko: 확인을 위해 제공된 메시지에서 '{0}' ID가 두 번 발견되었습니다.
pl: Identyfikator „{0}” pojawił się dwukrotnie w komunikacie dostarczonym do weryfikacji.
pt_br: A identificação '{0}' ocorreu duas vezes na mensagem fornecida para verificação.
tr: '{0}' kimliği, doğrulama için sağlanan iletide iki kez oluştu.
zh_hans: “{0}”ID 在提供以进行验证的消息中出现了两次。
zh_hant: 提供用於驗證的訊息中出現兩次 '{0}' 識別碼。

# DuplicateMessageProperty
source: A property with the name '{0}' already exists.
cs: Vlastnost s názvem {0} již existuje.
de: Eine Eigenschaft mit dem Namen "{0}" ist bereits vorhanden.
es: Ya existe una propiedad con el nombre "{0}".
fr: Une propriété portant le nom '{0}' existe déjà.
it: Esiste già una proprietà denominata '{0}'.
ja: 名前が '{0}' のプロパティは既に存在しています。
ko: 이름이 '{0}'인 속성이 이미 있습니다.
pl: Właściwość o nazwie „{0}” już istnieje.
pt_br: Já existe uma propriedade com o nome '{0}'.
tr: '{0}' adlı bir özellik zaten var.
zh_hans: 已存在名称为“{0}”的属性。
zh_hant: 名為 '{0}' 的屬性已經存在。
