Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# MtomRootContentTypeNotFound
source: Content-Type header for root MIME part not found.
cs: Nenašla se hlavička Content-Type pro kořenovou část MIME.
de: Der Content-Type-Header für den MIME-Stammabschnitt konnte nicht gefunden werden.
es: No se encontró el encabezado Content-Type para el elemento MIME raíz.
fr: En-tête Content-Type pour la partie MIME racine introuvable.
it: Intestazione Content-Type per la parte MIME radice non trovata.
ja: ルート MIME パートに対する Content-Type ヘッダーが見つかりません。
ko: 루트 MIME 부분에 대한 Content-Type 헤더를 찾을 수 없습니다.
pl: Nie znaleziono nagłówka Content-Type dla głównej części MIME.
pt_br: Cabeçalho Content-Type da parte MIME raiz não encontrada.
tr: Kök MIME için Content-Type üst bilgisi bulunamadı.
zh_hans: 未找到根 MIME 部分的 Content-Type 标头。
zh_hant: 找不到根 MIME 部份的 Content-Type 標頭。

# MtomRootNotApplicationXopXml
source: Root MIME part must have media type '{0}' and media subtype '{1}'.
cs: Kořenová část MIME musí mít typ média {0} a podtyp média {1}.
de: Der MIME-Stammabschnitt muss den Medientyp "{0}" und den Medienuntertyp "{1}" aufweisen.
es: El elemento MIME raíz debe tener el tipo de medios '{0}' y el subtipo de medios '{1}'.
fr: La partie MIME racine doit contenir le type multimédia '{0}' et le sous-type multimédia '{1}'.
it: La parte MIME radice deve avere tipo di supporto '{0}' e sottotipo di supporto '{1}'.
ja: ルート MIME パートには、メディア型 '{0}' およびメディア サブタイプ '{1}' が含まれている必要があります。
ko: 루트 MIME 부분은 '{0}' 미디어 유형과 '{1}' 미디어 하위 유형을 가져야 합니다.
pl: Główna część MIME musi zawierać typ nośnika „{0}” i podtyp nośnika „{1}”.
pt_br: A parte MIME raiz deve ter um tipo de mídia '{0}' e um subtipo de mídia '{1}'.
tr: Kök MIME bölümü, '{0}' medya türüne ve '{1}' medya alt türüne sahip olmalıdır.
zh_hans: 根 MIME 部分必须有媒体类型“{0}”和媒体子类型“{1}”。
zh_hant: 根 MIME 部份必須要有媒體類型 '{0}' 及媒體子類型 '{1}'。

# MtomRootPartNotFound
source: Root MIME part containing infoset not found.
cs: Nenašla se kořenová část MIME obsahující informační sadu.
de: Ein MIME-Stammabschnitt mit dem Infoset konnte nicht gefunden werden.
es: No se encuentra el elemento MIME raíz que contiene el conjunto de información.
fr: Partie MIME racine contenant infoset introuvable.
it: Parte MIME radice contenente InfoSet non trovata.
ja: infoset を含むルート MIME パートが見つかりません。
ko: infoset이 포함된 루트 MIME 부분을 찾을 수 없습니다.
pl: Nie znaleziono głównej części MIME zawierającej obiekt typu infoset.
pt_br: Parte MIME raiz contendo infoset não encontrado.
tr: Bilgi kümesini içeren kök MIME bölümü bulunamadı.
zh_hans: 未找到包含 Infoset 的根 MIME 部分。
zh_hant: 找不到內含 InfoSet 的根 MIME 部份。

# MtomRootRequiredParamNotSpecified
source: Root MIME part must contain non-zero length value for '{0}' parameter in Content-Type header.
cs: Kořenová část MIME musí v hlavičce Content-Type obsahovat hodnotu s nenulovou délkou pro parametr {0}.
de: Der Content-Type-Header eines MIME-Stammabschnitts enthält keinen Wert mit einer Länge ungleich NULL für den {0}-Parameter.
es: El elemento MIME raíz debe contener un valor de longitud que no sea cero para el parámetro '{0}' para el encabezado Content-Type.
fr: La partie MIME racine doit contenir une valeur de longueur différente de zéro pour le paramètre '{0}' dans l'en-tête Content-Type.
it: La parte MIME radice deve contenere un valore di lunghezza maggiore di zero per il parametro '{0}' nell'intestazione Content-Type.
ja: ルート MIME パートには、Content-Type ヘッダー内に、'{0}' パラメーターに対する長さが 0 以外の値が含まれている必要があります。
ko: 루트 MIME 부분은 Content-Type 헤더의 '{0}' 매개 변수에 대해 길이가 0이 아닌 값을 포함해야 합니다.
pl: Główna część MIME musi zawierać wartość o niezerowej długości dla parametru „{0}” w nagłówku Content-Type.
pt_br: Parte MIME raiz deve conter um valor de comprimento diferente de zero para o parâmetro '{0}' no cabeçalho Content-Type.
tr: Kök MIME bölümü, Content-Type üst bilgisinde '{0}' parametresi için sıfır olmayan uzunluğa sahip olmalıdır.
zh_hans: 根 MIME 部分必须在 Content-Type 标头中包含“{0}”参数的非零长度值。
zh_hant: 根 MIME 部份在 Content-Type 標頭中必須要有 '{0}' 參數非零長度的值。

# MtomRootUnexpectedCharset
source: Unexpected charset '{0}' found in root MIME part. Expecting '{1}'.
cs: V kořenové části MIME se vyskytla neočekávaná znaková sada {0}. Očekává se {1}.
de: In einem MIME-Stammabschnitt wurde der unerwartete Zeichensatz "{0}" gefunden. Erwartet wurde der Zeichensatz "{1}".
es: Se encontró un conjunto de caracteres inesperado, '{0}', en el elemento MIME raíz. Se esperaba '{1}'.
fr: Charset '{0}' inattendu trouvé dans la partie MIME racine. '{1}' attendu.
it: Trovato set di caratteri '{0}' non previsto nella parte MIME radice. Previsto '{1}'.
ja: ルート MIME パート内で、予期しない charset '{0}' が見つかりました。'{1}' である必要があります。
ko: 루트 MIME 부분에서 예기치 않은 charset '{0}'을(를) 찾았습니다. '{1}'이(가) 있어야 합니다.
pl: Nieoczekiwany zestaw znaków „{0}” znaleziony w głównej części MIME. Oczekiwany zestaw: „{1}”.
pt_br: Conjunto de caracteres inesperado '{0}' encontrado na parte MIME raiz. Espera-se '{1}'.
tr: Kök MIME bölümünde beklenmeyen '{0}' karakter kümesi bulundu. Beklenen: '{1}'.
zh_hans: 在根 MIME 部分中找到异常字符集“{0}”。应为“{1}”。
zh_hant: 在根 MIME 部份找到不正確的字元集 '{0}'。必須為 '{1}'。

# MtomRootUnexpectedType
source: Unexpected type '{0}' found in root MIME part. Message header specifies '{1}'.
cs: V kořenové části MIME se vyskytl neočekávaný typ {0}. Hlavička zprávy uvádí typ {1}.
de: In einem MIME-Stammabschnitt wurde der unerwartete Typ "{0}" gefunden. Erwartet wurde der Typ "{1}", wie im Nachrichten-Header angegeben.
es: Se encontró un tipo inesperado, '{0}', en el elemento MIME raíz. El encabezado del mensaje especifica '{1}'.
fr: Type '{0}' inattendu trouvé dans la partie MIME racine. L'en-tête du message précise '{1}'.
it: Trovato tipo '{0}' non previsto nella parte MIME radice. Nell'intestazione del messaggio viene specificato '{1}'.
ja: ルート MIME パート内で、予期しない型 '{0}' が見つかりました。メッセージ ヘッダーには '{1}' を指定してください。
ko: 루트 MIME 부분에서 예기치 않은 '{0}' 형식을 찾았습니다. 메시지 헤더는 '{1}'을(를) 지정합니다.
pl: Nieoczekiwany typ „{0}” znaleziony w głównej części MIME. Nagłówek wiadomości określa „{1}”.
pt_br: Tipo '{0}' inesperado encontrado na parte MIME raiz. O cabeçalho da mensagem especifica '{1}'.
tr: Kök MIME bölümünde '{0}' beklenmeyen tür bulundu. İleti üst bilgisinin tanımladığı: '{1}'.
zh_hans: 根 MIME 部分中找到异常类型“{0}”。消息标头指定的类型为“{1}”。
zh_hant: 在根 MIME 部份找到不正確的類型 '{0}'。訊息標頭指定 '{1}'。

# MtomXopIncludeHrefNotSpecified
source: Mandatory attribute '{0}' not found on XOP Include element.
cs: U elementu XOP Include chybí povinný atribut {0}.
de: Das verbindliche Attribut "{0}" konnte für das XOP Include-Element nicht gefunden werden.
es: No se encontró el atributo obligatorio '{0}' en el método de inclusión XOP.
fr: Attribut obligatoire '{0}' introuvable sur l'élément XOP Include.
it: Attributo obbligatorio '{0}' non trovato nell'elemento XOP Include.
ja: XOP Include 要素で、必須の属性 '{0}' が見つかりません。
ko: 필수 특성 '{0}'을(를) XOP 포함 요소에서 찾을 수 없습니다.
pl: Nie znaleziono obowiązkowego atrybutu „{0}” w elemencie XOP Include.
pt_br: Atributo obrigatório '{0}' não encontrado no elemento XOP Include.
tr: '{0}' zorunlu özniteliği, XOP Include öğesinde bulunamadı.
zh_hans: XOP 包含元素中未找到强制特性“{0}”。
zh_hant: 在 XOP Include 元素上找不到強制屬性 '{0}'。

# MtomXopIncludeInvalidXopAttributes
source: XOP Include element has invalid attribute '{0}' from XOP namespace '{1}'.
cs: Element XOP Include má neplatný atribut {0} z oboru názvů XOP {1}.
de: Das XOP Include-Element weist ein ungültiges Attribut "{0}" aus dem XOP-Namespace "{1}" auf.
es: El elemento de inclusión XOP tiene un atributo '{0}' no válido del espacio de nombres XOP '{1}'.
fr: L'élément XOP Include est doté de l'attribut '{0}' non valide provenant de l'espace de noms XOP '{1}'.
it: L'elemento XOP Include ha un attributo '{0}' non valido dallo spazio dei nomi XOP '{1}'.
ja: XOP Include 要素には、XOP 名前空間 '{1}' からの無効な属性 '{0}' が含まれています。
ko: XOP 포함 요소에 XOP 네임스페이스 '{1}'의 잘못된 '{0}' 특성이 있습니다.
pl: Element XOP Include ma nieprawidłowy atrybut „{0}” z przestrzeni nazw XOP „{1}”.
pt_br: O elemento XOP Include tem atributo inválido '{0}' no namespace XOP '{1}'.
tr: XOP Include öğesi, '{1}' XOP ad alanında geçersiz '{0}' özniteliğine sahip.
zh_hans: XOP 包含元素具有来自 XOP 命名空间“{1}”中的无效特性“{0}”。
zh_hant: XOP Include 元素有來自 XOP 命名空間 '{1}' 的無效屬性 '{0}'。

# MtomXopIncludeInvalidXopElement
source: XOP Include element has invalid child element '{0}' from XOP namespace '{1}'.
cs: Element XOP Include má neplatný podřízený element {0} z oboru názvů XOP {1}.
de: Das XOP Include-Element weist ein ungültiges untergeordnetes Element "{0}" aus dem XOP-Namespace "{1}" auf.
es: El elemento de inclusión XOP tiene un elemento secundario '{0}' no válido del espacio de nombres XOP '{1}'.
fr: L'élément XOP Include est doté de l'élément enfant non valide '{0}' provenant de l'espace de noms XOP '{1}'.
it: L'elemento XOP Include ha un elemento figlio '{0}' non valido dallo spazio dei nomi XOP '{1}'.
ja: XOP Include 要素には、XOP 名前空間 '{1}' からの無効な子要素 '{0}' を持つ要素が含まれています。
ko: XOP 포함 요소에 XOP 네임스페이스 '{0}'의 잘못된 '{1}' 자식 요소가 있습니다.
pl: Element XOP Include ma nieprawidłowy element podrzędny „{0}” z przestrzeni nazw XOP „{1}”.
pt_br: O elemento XOP Include tem elemento filho inválido '{0}' no namespace XOP '{1}'.
tr: XOP Include öğesi, '{1}' XOP ad alanında geçersiz '{0}' alt öğesine sahip.
zh_hans: XOP 包含元素具有来自 XOP 命名空间“{1}”中的无效子元素“{0}”。
zh_hant: XOP Include 元素有來自 XOP 命名空間 '{1}' 的無效子元素 '{0}'。

# MultipleIdentities
source: The extensions cannot contain an Identity if one is supplied as a constructor argument.
cs: Rozšíření nesmějí obsahovat identitu, pokud je některá zadána jako argument konstruktoru.
de: Die Erweiterungen dürfen keine Identität enthalten, wenn eine Identität als Konstruktorargument angegeben wird.
es: Las extensiones no pueden contener una identidad si se proporciona una como argumento de constructor.
fr: Les extensions ne peuvent pas contenir Identity, s'il en existe un fourni en tant qu'argument de constructeur.
it: L'estensione non può contenere un elemento Identity se ne è già stato specificato uno come argomento del costruttore.
ja: コンストラクターの引数として提供されている場合、拡張に ID を含めることはできません。
ko: 생성자 인수로 제공되는 경우에는 확장에 ID가 포함될 수 없습니다.
pl: Rozszerzenia nie mogą zawierać tożsamości, jeśli jest ona podawana jako argument konstruktora.
pt_br: As extensões não poderão conter uma Identidade se uma for fornecida como argumento de construtor.
tr: Oluşturucu bağımsız değişkeni olarak bir tane sağlandığı takdirde, uzantılar Identity bulunduramaz.
zh_hans: 如果标识已作为构造函数参数提供，则扩展不能再包含它。
zh_hant: 延伸模組不可包含提供作為建構函式引數的身分識別。

# MultipleMatchingCryptosFound
source: The token's crypto collection has multiple objects of type '{0}'.
cs: Kryptografická kolekce tokenu obsahuje více objektů typu {0}.
de: Die Kryptografiesammlung des Tokens weist mehrere Objekte vom Typ "{0}" auf.
es: La colección criptográfica del token tiene varios objetos de tipo '{0}'.
fr: La collection de chiffrements du jeton a plusieurs objets de type '{0}'.
it: La raccolta di crittografia del token contiene più oggetti di tipo '{0}'.
ja: トークンの暗号化コレクションに '{0}' オブジェクトが複数あります。
ko: 토큰의 암호화 컬렉션에 형식 '{0}'의 여러 개체가 있습니다.
pl: Kolekcja kryptograficzna tokenu zawiera wiele obiektów typu „{0}”.
pt_br: A coleção criptográfica do token possui vários objetos do tipo '{0}'.
tr: Belirtecin şifre koleksiyonunda '{0}' türünde birden çok nesne var.
zh_hans: 标记的加密集合具有多个类型为“{0}”的对象。
zh_hant: 權杖的加密集合包含多個類型 '{0}' 的物件。

# MultipleMebesInParameters
source: More than one MessageEncodingBindingElement was found in the BindingParameters of the BindingContext. This usually is caused by having multiple MessageEncodingBindingElements in a CustomBinding. Remove all but one of these elements.
cs: Bylo nalezeno více tříd MessageEncodingBindingElement ve třídě BindingParameters třídy BindingContext. To je obvykle způsobeno tím, že se v třídě CustomBinding vyskytuje více tříd MessageEncodingBindingElements. Až na jeden odeberte všechny tyto elementy.
de: In den BindingParameters von BindingContext wurde mehr als ein MessageEncodingBindingElement gefunden. Dies ist im Allgemeinen darauf zurückzuführen, dass eine CustomBinding mehrere MessageEncodingBindingElements enthält. Entfernen Sie alle Elemente bis auf eins.
es: Se encontró más de un elemento MessageEncodingBindingElement en los parámetros BindingParameter de BindingContext. La causa suele ser que hay varios elementos MessageEncodingBindingElement en un enlace CustomBinding. Quite todos estos elementos menos uno.
fr: Plusieurs éléments MessageEncodingBindingElement ont été trouvés dans les paramètres BindingParameters du contexte BindingContext. Cette situation est généralement due à l'existence de plusieurs éléments MessageEncodingBindingElements dans un élément CustomBinding. Supprimez tous ces éléments sauf un.
it: Nell'elemento BindingParameters di BindingContext sono stati trovati più elementi MessageEncodingBindingElement. Questa situazione si verifica in genere perché in un elemento CustomBinding sono presenti più elementi MessageEncodingBindingElement. Rimuovere tutti gli elementi tranne uno.
ja: BindingContext の BindingParameter に複数の MessageEncodingBindingElement が見つかりました。これは一般的には CustomBinding に複数の MessageEncodingBindingElement があることにより起こります。これらの要素のうち 1 つを除くすべて削除してください。
ko: 둘 이상의 MessageEncodingBindingElement를 BindingContext의 BindingParameters에서 찾았습니다. 이것은 일반적으로 CustomBinding에 여러 MessageEncodingBindingElements가 있기 때문에 발생합니다. 이러한 요소를 하나만 제외하고 모두 제거하세요.
pl: Znaleziono więcej niż jeden element MessageEncodingBindingElement we właściwości BindingParameters elementu BindingContext. Zazwyczaj jest to spowodowane występowaniem wielu elementów MessageEncodingBindingElements w elemencie CustomBinding. Usuń wszystkie elementy oprócz jednego.
pt_br: Mais de um MessageEncodingBindingElement foi encontrado nos BindingParameters do BindingContext. Isso geralmente ocorre porque existem vários MessageEncodingBindingElements em uma CustomBinding. Remova esses elementos, deixando apenas um.
tr: BindingContext BindingParameters içinde birden çok MessageEncodingBindingElement bulundu. Bu genellikle, bir CustomBinding içinde birkaç MessageEncodingBindingElements bulunması nedeniyle oluşur. Öğeleri yalnızca bir tane kalacak biçimde kaldırın.
zh_hans: 在 BindingContext 的 BindingParameters 中找到多个 MessageEncodingBindingElement。这通常是因为在 CustomBinding 中具有多个 MessageEncodingBindingElements 所导致的。请保留一个元素，删除所有剩余元素。
zh_hant: 在 BindingContext 的 BindingParameters 中找到多個 MessageEncodingBindingElement。這通常是因為 CustomBinding 中有多個 MessageEncodingBindingElements 所造成。請保留其中一項元素，其他全部移除。

# MultipleMessageHeaders
source: Multiple headers with name '{0}' and namespace '{1}' found.
cs: Bylo nalezeno více záhlaví s názvem {0} a oborem názvů {1}.
de: Es wurden mehrere Header mit dem Namen "{0}" und dem Namespace "{1}" gefunden.
es: Se encontraron varios encabezados con el nombre "{0}" y el espacio de nombres "{1}".
fr: Plusieurs en-têtes comportant le nom '{0}' et l'espace de noms '{1}' ont été trouvés.
it: Sono state trovate più intestazioni denominate '{0}' con spazio dei nomi '{1}'.
ja: 名前が '{0}'、名前空間が '{1}' であるヘッダーが複数見つかりました。
ko: 이름 '{0}' 및 네임스페이스 '{1}'을(를) 가진 여러 헤더를 찾았습니다.
pl: Znaleziono wiele nagłówków o nazwie „{0}” i z przestrzenią nazw „{1}”.
pt_br: Foram encontrados vários cabeçalhos com o nome '{0}' e o namespace '{1}'.
tr: '{0}' adı ve '{1}' ad alanına sahip birden çok üst bilgi bulundu.
zh_hans: 找到多个名为“{0}”、命名空间为“{1}”的标头。
zh_hant: 找到名稱為 '{0}' 且命名空間為 '{1}' 的多個標頭。

# MultipleMessageHeadersWithActor
source: Multiple headers with name '{0}' and namespace '{1}' and role '{2}' found.
cs: Bylo nalezeno více záhlaví s názvem {0}, s oborem názvů {1} a s rolí {2}.
de: Es wurden mehrere Header mit dem Namen "{0}", dem Namespace "{1}" und der Rolle "{2}" gefunden.
es: Se encontraron varios encabezados con el nombre "{0}", el espacio de nombres "{1}" y el rol "{2}".
fr: Plusieurs en-têtes comportant le nom '{0}', l'espace de noms '{1}' et le rôle '{2}' ont été trouvés.
it: Sono state trovate più intestazioni denominate '{0}' con spazio dei nomi '{1}' e ruolo '{2}'.
ja: 名前が '{0}'、名前空間が '{1}'、役割が '{2}' であるヘッダーが複数見つかりました。
ko: 이름 '{0}' 및 네임스페이스 '{1}'과(와) 역할'{2}'을(를) 가진 여러 헤더를 찾았습니다.
pl: Znaleziono wiele nagłówków o nazwie „{0}”, roli „{2}” i z przestrzenią nazw „{1}”.
pt_br: Foram encontrados vários cabeçalhos com o nome '{0}', o namespace '{1}' e a função '{2}'.
tr: '{0}' adı, '{1}' ad alanı ve '{2}' rolüne sahip birden çok üst bilgi bulundu.
zh_hans: 找到多个名为“{0}”、命名空间为“{1}”和角色为“{2}”的标头。
zh_hant: 找到多個名為 '{0}'、命名空間為 '{1}' 且角色為 '{2}' 的標頭。

# MultipleRelatesToHeaders
source: Multiple RelatesTo headers with relationship '{0}' found. Only one is allowed per relationship.
cs: Bylo nalezeno více záhlaví třídy RelatesTo se vztahem {0}. Pro jednu třídu je povolen pouze jeden vztah.
de: Es wurden mehrere RelatesTo-Header mit der Beziehung "{0}" gefunden. Pro Beziehung ist nur ein Wert zulässig.
es: Se han encontrado varios encabezados RelatesTo con la relación "{0}". solo se permite uno por relación.
fr: Plusieurs en-têtes RelatesTo avec une relation '{0}' ont été trouvés. Un seul en-tête est autorisé par relation.
it: Sono state trovate più intestazioni RelatesTo con relazione '{0}'. Ne è consentita solo una per relazione.
ja: リレーションシップ名が '{0}' である RelatesTo ヘッダーが複数見つかりました。このヘッダーは、1 つのリレーションシップにつき 1 つしか許可されていません。
ko: 관계 '{0}'을(를) 가진 여러 RelatesTo 헤더를 찾았습니다. 관계당 하나만 허용됩니다.
pl: Znaleziono wiele nagłówków RelatesTo z relacją „{0}”. Dla każdej relacji jest dozwolony tylko jeden nagłówek.
pt_br: Foram encontrados múltiplos cabeçalhos RelatesTo com a relação '{0}'. Apenas um é permitido por relação.
tr: '{0}' ilişkisine sahip birden fazla RelatesTo üst bilgisi bulundu. Her ilişki için yalnızca birine izin verilir.
zh_hans: 已找到多个关系为“{0}”的 RelatesTo 标头。每个关系只允许有一个上述标头。
zh_hant: 找到多個具有關聯性 '{0}' 的 RelatesTo 標頭。每個關聯性只允許一個標頭。

# MultipleSecurityCredentialsManagersInChannelBindingParameters
source: The ClientCredentials cannot be added to the binding parameters because the binding parameters already contains a SecurityCredentialsManager '{0}'. If you are configuring custom credentials for the channel, please first remove any existing ClientCredentials from the behaviors collection before adding the custom credential.
cs: Třídu ClientCredentials nelze přidat k parametrům vazby, protože parametry vazby již obsahují třídu SecurityCredentialsManager {0}. Pokud konfigurujete vlastní přihlašovací údaje kanálu, odstraňte nejprve existující třídu ClientCredentials z kolekce chování a teprve pak přidejte vlastní přihlašovací údaje.
de: Die ClientCredentials können den Bindungsparametern nicht hinzugefügt werden, da die Bindungsparameter bereits einen SecurityCredentialsManager "{0}" enthalten. Wenn Sie benutzerdefinierte Anmeldeinformationen für den Kanal konfigurieren, entfernen Sie zunächst alle vorhandenen ClientCredentials aus der Verhaltenssammlung, bevor Sie die benutzerdefinierten Anmeldeinformationen hinzufügen.
es: El objeto ClientCredentials no se puede agregar a los parámetros del enlace porque estos ya contienen un objeto SecurityCredentialsManager "{0}". Si está configurando credenciales personalizadas para el canal, quite primero el elemento ClientCredentials existente de la colección de comportamientos y, después, agregue la credencial personalizada.
fr: ClientCredentials ne peut pas être ajouté aux paramètres de liaison, car ces paramètres contiennent déjà un SecurityCredentialsManager '{0}'. Si vous configurez des informations d'identification personnalisées pour le canal, supprimez d'abord tous les ClientCredentials existants de la collection de comportements avant d'ajouter les informations d'identification personnalisées.
it: Non è possibile aggiungere l'elemento ClientCredentials ai parametri di binding perché questi contengono già un elemento SecurityCredentialsManager '{0}'. Se si configurano credenziali personalizzate per il canale, rimuovere prima gli eventuali elementi ClientCredentials esistenti dalla raccolta di comportamenti prima di aggiungere la credenziale personalizzata.
ja: バインド パラメーターに既に SecurityCredentialsManager '{0}' があるため、ClientCredentials をバインド パラメーターに追加できません。チャネルのためのカスタムの資格情報を構成している場合は、カスタムの資格情報を追加する前に、まずすべての既存の ClientCredentials を動作コレクションから削除してください。
ko: 바인딩 매개 변수에 이미 SecurityCredentialsManager '{0}'이(가) 포함되어 있으므로 ClientCredentials를 바인딩 매개 변수에 추가할 수 없습니다. 채널에 대한 사용자 지정 자격 증명을 구성하는 경우 사용자 지정 자격 증명을 추가하기 전에 먼저 동작 컬렉션에서 모든 기존 ClientCredentials를 제거하세요.
pl: Nie można dodać elementu ClientCredentials do parametrów powiązania, ponieważ parametry powiązania zawierają już element SecurityCredentialsManager „{0}”. W przypadku konfigurowania niestandardowych poświadczeń dla tego kanału przed dodaniem niestandardowego poświadczenia usuń z kolekcji zachowań wszystkie istniejące elementy ClientCredentials.
pt_br: Não é possível adicionar ClientCredentials aos parâmetros de associação porque esses parâmetros já contêm SecurityCredentialsManager '{0}'. Se você estiver configurando credenciais personalizadas para o canal, remova primeiro quaisquer ClientCredentials existentes da coleção de comportamentos antes de adicionar a credencial personalizada.
tr: Bağlama parametrelerinde zaten bir SecurityCredentialsManager '{0}' olduğundan ClientCredentials bağlama parametrelerine eklenemiyor. Kanal için özel kimlik bilgileri yapılandırıyorsanız, lütfen önce mevcut ClientCredentials öğelerini davranış koleksiyonundan kaldırdıktan sonra özel kimlik bilgilerini ekleyin.
zh_hans: 无法将 ClientCredentials 添加到绑定参数中，因为绑定参数已包含 SecurityCredentialsManager“{0}”。如果要为通道配置自定义凭据，请先从行为集合删除任何现有 ClientCredentials，然后再添加自定义凭据。
zh_hant: 無法將 ClientCredentials 新增至繫結參數，因為繫結參數已包含 SecurityCredentialsManager '{0}'。若要為通道設定自訂認證，請先從行為集合移除所有現有 ClientCredentials，再新增自訂認證。
