Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# HttpToMustEqualVia
source: The binding specified requires that the to and via URIs must match because the Addressing Version is set to None. The to URI specified was '{0}'. The via URI specified was '{1}'.
cs: Určená vazba vyžaduje, aby si cílové a průchozí identifikátory URI odpovídaly, protože funkce Addressing Version (verze adresování) je nastavena na hodnotu None. Určený cílový identifikátor URI byl {0}. Určený průchozí identifikátor URI byl {1}.
de: Die angegebene Bindung erfordert, dass die An- und Umleitungs-URIs übereinstimmen, da die Adressierungsversion auf "None" festgelegt ist. Der angegebene An-URI war "{0}". Der angegebene Umleitungs-URI war "{1}".
es: El enlace especificado requiere que los URI de destino y vía coincidan porque la versión de direccionamiento está establecida en None. El URI de destino especificado era "{0}". El URI de vía especificado era "{1}".
fr: Pour la liaison spécifiée, les URI cible et intermédiaire doivent correspondre, car la version d'adressage a la valeur 'None'. L'URI cible spécifié était '{0}'. L'URI intermédiaire spécifié était '{1}'.
it: Con il binding specificato gli URI di destinazione e di via devono corrispondere perché l'elemento AddressingVersion è impostato su None. URI di destinazione specificato: '{0}'. URI di via specificato: '{1}'.
ja: Addressing Version が None に設定されているため、指定したバインドでは、to URI と via URI が一致している必要があります。指定された to URI は '{0}' です。指定された via URI は '{1}' です。
ko: 주소 지정 버전이 None으로 설정되었기 때문에 지정한 바인딩에서는 to 및 via URI가 일치해야 합니다. 지정한 to URI는 '{0}'이고 지정한 via URI는 '{1}'입니다.
pl: Określone powiązanie wymaga zgodności docelowego i pośredniego identyfikatora URI, ponieważ ustawienie wersji adresowania ma wartość None. Określony docelowy identyfikator URI to „{0}”. Określony pośredni identyfikator URI to „{1}”.
pt_br: A associação especificada requer que os URIs de destino e de rota sejam correspondentes, pois a Versão de Endereçamento está definida como None. O URI de destino especificado era '{0}'. O URI de rota especificado era '{1}'.
tr: Addressing Version None olarak ayarlandığından, belirtilen bağlama, kime ve ile URI değerlerinin eşleşmesini gerektirir. Belirtilen URI: '{0}'. Belirtilen ile URI değeri: '{1}'.
zh_hans: 指定的绑定要求目标 URI 和中转 URI 必须匹配，因为寻址版本被设置为“无”。指定的目标 URI 为“{0}”。指定的中转 URI 为“{1}”。
zh_hant: 指定的繫結要求 to URI 與 via URI 必須相符，因為 Addressing Version 設定為 None。指定的 to URI 為 '{0}'。指定的 via URI 為 '{1}'。

# HttpsExplicitIdentity
source: The HTTPS channel factory does not support explicit specification of an identity in the EndpointAddress unless the authentication scheme is NTLM or Negotiate.
cs: Výroba kanálu protokolu HTTPS nepodporuje explicitní specifikaci identity ve třídě EndpointAddress, pokud schéma ověřování není NTLM nebo Negotiate (Vyjednaný).
de: Die HTTPS-Kanalfactory unterstützt die explizite Angabe einer Identität in der EndpointAddress nur dann, wenn "NTML" oder "Negotiate" als Authentifizierungsschema angegeben ist.
es: El generador de canales HTTPS no admite la especificación explícita de una identidad en EndpointAddress a menos que el esquema de autenticación sea NTLM o Negotiate.
fr: La fabrique de canaux HTTPS ne prend pas en charge la spécification explicite d'une identité dans l'élément EndpointAddress, sauf si le schéma d'authentification est NTLM ou Negotiate.
it: La channel factory HTTPS non supporta la specifica esplicita di un'identità in EndpointAddress a meno che lo schema di autenticazione non sia NTLM o Negotiate.
ja: 認証スキームが NTLM またはネゴシエートでない場合、HTTPS チャネル ファクトリは、EndpointAddress での ID の明示的な指定をサポートしません。
ko: 인증 구성표가 NTLM 또는 협상이 아닌 경우 HTTPS 채널 팩터리가 EndpointAddress에서 ID의 명시적 지정을 지원하지 않습니다.
pl: Fabryka kanałów HTTPS nie obsługuje jawnej specyfikacji tożsamości w elemencie EndpointAddress, o ile schematem uwierzytelniania nie jest standard NTLM lub Negotiate.
pt_br: A fábrica de canais HTTPS não oferece suporte à especificação explícita de uma identidade em EndpointAddress, a não ser que o esquema de autenticação seja NTLM ou Negociação.
tr: HTTPS kanal fabrikası, kimlik doğrulama düzeni NTLM ya da Negotiate olmadıkça, EndpointAddress içinde açık bir kimlik belirtimini desteklemez.
zh_hans: HTTPS 通道工厂不支持在 EndpointAddress 中显式指定标识，除非身份验证方案是 NTLM 或协商。
zh_hant: HTTPS 通道處理站不支援在 EndpointAddress 中明確指定身分識別，除非驗證配置為 NTLM 或 Negotiate。

# HttpsIdentityMultipleCerts
source: The endpoint identity specified when creating the HTTPS channel to '{0}' contains multiple server certificates. However, the HTTPS transport only supports the specification of a single server certificate. In order to create an HTTPS channel, please specify no more than one server certificate in the endpoint identity.
cs: Identita koncového bodu určená při vytváření kanálu protokolu HTTPS do {0} zahrnuje několik certifikátů serverů. Přenos protokolu HTTPS však podporuje pouze specifikaci jednoho certifikátu serveru. Chcete-li vytvořit kanál protokolu HTTPS, určete v identitě koncového bodu pouze jeden certifikát serveru.
de: Die Endpunktidentität, die beim Erstellen des HTTPS-Kanals zu "{0}" angegeben wurde, enthält mehrere Serverzertifikate. Der HTTPS-Transport unterstützt jedoch nur die Angabe eines einzigen Serverzertifikats. Geben Sie in der Endpunktidentität maximal ein Serverzertifikat an, um einen HTTPS-Kanal zu erstellen.
es: La identidad del extremo especificada al crear el canal HTTPS a '{0}' contiene varios certificados de servidor. Sin embargo, el transporte HTTPS sólo admite la especificación de un certificado de servidor. Para crear un canal HTTPS, especifique un único certificado de servidor en la identidad del extremo.
fr: L'identité du point de terminaison spécifiée lors de la création du canal HTTPS vers '{0}' contient plusieurs certificats de serveur. Le transport HTTPS ne prend cependant en charge que la spécification d'un seul certificat de serveur. Pour pouvoir créer un canal HTTPS, ne spécifiez qu'un seul certificat de serveur dans l'identité du point de terminaison.
it: L'identità endpoint specificata durante la creazione del canale HTTPS in '{0}' contiene più certificati server. Tuttavia, il trasporto HTTPS supporta solo la specifica di un unico certificato server. Per creare un canale HTPPS, specificare un massimo di un certificato server nell'identità endpoint.
ja: '{0}' への HTTPS チャネルを作成するときに指定したエンドポイント ID に複数のサーバー証明書が含まれていますが、HTTPS トランスポートは単一のサーバー証明書の指定しかサポートしていません。HTTPS チャネルを作成するためには、エンドポイント ID に複数のサーバー証明書を指定しないでください。
ko: '{0}'에 대한 HTTPS 채널을 만들 때 지정한 끝점 ID에 여러 서버 인증서가 있습니다. 그러나 HTTPS 전송에서는 서버 인증서를 하나만 지정할 수 있습니다. HTTPS 채널을 만들려면 끝점 ID에서 서버 인증서를 하나만 지정하십시오.
pl: Tożsamość punktu końcowego określona podczas tworzenia kanału HTTPS do punktu „{0}” zawiera wiele certyfikatów serwera. Jednak przesyłanie za pośrednictwem protokołu HTTPS obsługuje specyfikację tylko jednego certyfikatu serwera. Aby utworzyć kanał HTTPS, określ nie więcej niż jeden certyfikat serwera w tożsamości punktu końcowego.
pt_br: A identidade de ponto de extremidade especificada ao criar o canal HTTPS para '{0}' contém vários certificados de servidor. Entretanto, o transporte HTTPS apenas oferece suporte à especificação de um único certificado de servidor. Para criar um canal HTTPS, especifique no máximo um certificado de servidor na identidade do ponto de extremidade.
tr: '{0}' HTTPS kanalı oluşturulurken belirtilen bitiş noktası varlığı, birden çok sunucu sertifikası içeriyor. Bununla birlikte HTTPS taşıması yalnızca bir tek sunucu sertifikası belirtimini destekliyor. Bir HTTPS kanalı oluşturmak için bitiş noktası varlığında bir sunucu sertifikasından fazlasını belirtmeyin.
zh_hans: 创建到达“{0}”的 HTTPS 通道时指定的终结点标识包含多个服务器证书。但是，HTTPS 传输仅支持指定一个服务器证书。为了创建 HTTPS 通道，请不要在终结点标识中指定一个以上的服务器证书。
zh_hant: 建立 '{0}' 的 HTTPS 通道時所指定的端點身分識別包含多個伺服器憑證。不過，HTTPS 傳輸僅支援指定單一伺服器憑證。為了建立 HTTPS 通道，在端點身分識別中只能指定單一伺服器憑證。

# HttpsServerCertThumbprintMismatch
source: The server certificate with name '{0}' failed identity verification because its thumbprint ('{1}') does not match the one specified in the endpoint identity ('{2}'). As a result, the current HTTPS request has failed. Please update the endpoint identity used on the client or the certificate used by the server.
cs: Certifikát serveru s názvem {0} selhal při ověřování identity, protože jeho miniatura ({1}) neodpovídá miniatuře určené v identitě koncového bodu ({2}). V důsledku toho se aktuální požadavek protokolu HTTPS nezdařil. Aktualizujte identitu koncového bodu použitou v klientovi nebo certifikát používaný serverem.
de: Bei der Identitätsüberprüfung des Serverzertifikats mit dem Namen "{0}" ist ein Fehler aufgetreten, da der Fingerabdruck ("{1}") nicht dem Fingerabdruck entspricht, der in der Endpunktidentität ("{2}") angegeben ist. Daher war die aktuelle HTTPS-Anforderung nicht erfolgreich. Aktualisieren Sie die auf dem Client verwendete Endpunktidentität oder das vom Server verwendete Zertifikat.
es: No se pudo comprobar la identidad del certificado de servidor con el nombre "{0}" porque su huella ("{1}") no coincide con la especificada en la identidad del punto de conexión ("{2}"). Como resultado, la solicitud HTTPS actual generó un error. Actualice la identidad del punto de conexión que se usa en el cliente o el certificado que usa el servidor.
fr: Échec de la vérification d'identité du certificat de serveur portant le nom '{0}', car son empreinte numérique ('{1}') ne correspond pas à celle qui est spécifiée dans l'identité du point de terminaison ('{2}'). La requête HTTPS actuelle n'a donc pas réussi. Effectuez une mise à jour de l'identité du point de terminaison utilisée sur le client ou du certificat utilisé par le serveur.
it: La verifica dell'identità del certificato server denominato '{0}' non è riuscita perché la relativa identificazione digitale ('{1}') non corrisponde a quella specificata nell'identità endpoint ('{2}'). Di conseguenza, la richiesta HTTPS non è riuscita. Aggiornare l'identità endpoint usata nel client o il certificato usato dal server.
ja: '{0}' という名前のサーバー証明書の拇印 ('{1}') は、エンドポイント ID で指定された拇印 ('{2}') と一致しないため、このサーバー証明書は ID 確認で不適格と判断されました。この結果、現在の HTTPS 要求は失敗しました。クライアントで使用されるエンドポイント ID、またはサーバーによって使用される証明書を更新してください。
ko: 해당 지문('{1}')이 엔드포인트 ID에 지정한 지문('{2}')과 일치하지 않기 때문에 이름이 '{0}'인 서버 인증서에서 ID를 확인하지 못했습니다. 결과적으로 현재 HTTPS 요청에 실패했습니다. 클라이언트에서 사용되는 엔드포인트 ID나 서버가 사용하는 인증서를 업데이트하세요.
pl: Certyfikat serwera o nazwie „{0}” nie potwierdził tożsamości, ponieważ jego odcisk palca („{1}”) jest niezgodny z odciskiem zdefiniowanym w tożsamości punktu końcowego („{2}”). Dlatego bieżące żądanie protokołu HTTPS nie powiodło się. Zaktualizuj tożsamość punktu końcowego używaną przez klienta lub certyfikat używany przez serwer.
pt_br: Falha na verificação de identidade do certificado do servidor com o nome '{0}' porque sua impressão digital ('{1}') não corresponde à especificada na identidade do ponto de extremidade ('{2}'). Consequentemente, a solicitação HTTPS atual apresentou uma falha. Atualize a identidade do ponto de extremidade usada no cliente ou o certificado usado pelo servidor.
tr: Parmak izi ('{1}') uç nokta kimliğinde ('{2}') belirtilenle eşleşmediğinden, '{0}' adlı sunucu sertifikasının kimliği doğrulanamadı. Sonuç olarak geçerli HTTPS isteği başarısız oldu. Lütfen istemcide kullanılan uç nokta kimliğini ya da sunucu tarafından kullanılan sertifikayı güncelleştirin.
zh_hans: 名为“{0}”的服务器证书未通过标识验证，因为其指纹(“{1}”)与在终结点标识(“{2}”)中指定的指纹不匹配。因此，当前的 HTTPS 请求失败。请更新客户端上使用的终结点标识或服务器使用的证书。
zh_hant: 名稱為 '{0}' 的伺服器憑證之身分識別驗證失敗，因為其指紋 ('{1}') 與端點身分識別 ('{2}') 中指定的指紋不符。因此，目前的 HTTPS 要求失敗。請更新用戶端上使用的端點身分識別，或更新伺服器使用的憑證。

# ID6002
source: ID6002: The given key size in bits is '{0}' which is not a multiple of 8.
cs: ID6002: Zadaná velikost klíče v bitech je {0}, což není násobek čísla 8.
de: ID6002: Die in Bits angegebene Schlüsselgröße "{0}" ist kein Vielfaches von 8.
es: ID6002: El tamaño de clave dada en bits es '{0}', que no es un múltiplo de 8.
fr: ID6002 : la taille de clé spécifiée en bits est de '{0}', une valeur qui n'est pas un multiple de 8.
it: ID6002: le dimensioni di chiave specificate in bit sono pari a '{0}', che non è un multiplo di 8.
ja: ID6002: ビット単位で指定されたキーのサイズ '{0}' は 8 の倍数ではありません。
ko: ID6002: 지정한 키 크기가 8의 배수가 아닌 '{0}'비트입니다.
pl: ID6002: Rozmiar danego klucza w bitach wynosi „{0}”, ale nie jest wielokrotnością liczby 8.
pt_br: ID6002: o tamanho da chave fornecida em bits é '{0}', o que não é um múltiplo de 8.
tr: ID6002: Bit olarak verilen anahtar boyutu '{0}' ve bu değer 8'in katı değil.
zh_hans: ID6002: 给定的密钥大小(比特)为“{0}”，不是 8 的倍数。
zh_hant: ID6002: 指定金鑰的位元大小為 '{0}'，並非 8 的倍數。

# ID6033
source: ID6033: The specified key size '{0}' is not supported.
cs: ID6033: Zadaná velikost klíče {0} není podporována.
de: ID6033: Die angegebene Schlüsselgröße "{0}" wird nicht unterstützt.
es: ID6033: No se admite el tamaño de la clave especificada '{0}'.
fr: ID6033 : la taille de clé spécifiée '{0}' n'est pas prise en charge.
it: ID6033: le dimensione di chiave specificate '{0}' non sono supportate.
ja: ID6033: 指定されたキー サイズ '{0}' はサポートされていません。
ko: ID6033: 지정된 키 크기 '{0}'은(는) 지원되지 않습니다.
pl: ID6033: Określony rozmiar klucza „{0}” nie jest obsługiwany.
pt_br: ID6033: não há suporte para o tamanho especificado da chave '{0}'.
tr: ID6033: Belirtilen '{0}' anahtar boyutu desteklenmiyor.
zh_hans: ID6033: 不支持指定的密钥大小“{0}”。
zh_hant: ID6033: 不支援指定的金鑰大小 '{0}'。

# IdentityCheckFailedForIncomingMessage
source: The identity check failed for the incoming message. The expected identity is '{0}' for the '{1}' target endpoint.
cs: Kontrola identity příchozí zprávy se nezdařila. Očekávaná identita je {0} pro cílový koncový bod {1}.
de: Fehler bei der Identitätsprüfung für die eingehende Nachricht. Die erwartete Identität ist "{0}" für den Zielendpunkt "{1}".
es: Error de comprobación de identidad para el mensaje entrante. Se espera la identidad "{0}" para el punto de conexión de destino "{1}".
fr: Échec de la vérification d'identité pour le message entrant. L'identité attendue est '{0}' pour le point de terminaison cible '{1}'.
it: Il controllo di identità del messaggio in arrivo non è riuscito. L'identità prevista è '{0}' per l'endpoint di destinazione '{1}'.
ja: 受信メッセージの ID の確認が失敗しました。ターゲットのエンドポイント '{1}' で要求されている ID は '{0}' です。
ko: 들어오는 메시지에 대한 ID를 검사하지 못했습니다. '{1}' 대상 끝점에 대해 필요한 ID는 '{0}'입니다.
pl: Nie można sprawdzić tożsamości komunikatu przychodzącego. Oczekiwana tożsamość to „{0}” dla docelowego punktu końcowego „{1}”.
pt_br: Falha na identificação de identidade para mensagem de entrada. A identidade esperada é '{0}' para o ponto de extremidade de destino '{1}'.
tr: Gelen ileti kimlik denetimi başarısız oldu. '{1}' hedef uç nokta için beklenen kimlik: '{0}'.
zh_hans: 传入消息的标识检查失败。“{1}”目标终结点的所需标识为“{0}”。
zh_hant: 內送郵件的身分識別檢查失敗。'{1}' 目標端點應有的身分識別為 '{0}'。

# IdentityCheckFailedForOutgoingMessage
source: The identity check failed for the outgoing message. The expected identity is '{0}' for the '{1}' target endpoint.
cs: Kontrola identity odchozí zprávy se nezdařila. Očekávaná identita je {0} pro cílový koncový bod {1}.
de: Fehler bei der Identitätsprüfung für die ausgehende Nachricht. Die erwartete Identität ist "{0}" für den Zielendpunkt "{1}".
es: Error de comprobación de identidad para el mensaje saliente. Se espera la identidad "{0}" para el punto de conexión de destino "{1}".
fr: Échec de la vérification d'identité pour le message sortant. L'identité attendue est '{0}' pour le point de terminaison cible '{1}'.
it: Il controllo di identità del messaggio in uscita non è riuscito. L'identità prevista è '{0}' per l'endpoint di destinazione '{1}'.
ja: 送信メッセージの ID の確認が失敗しました。ターゲットのエンドポイント '{1}' で要求されている ID は '{0}' です。
ko: 보내는 메시지에 대한 ID를 검사하지 못했습니다. '{1}' 대상 끝점에 대해 필요한 ID는 '{0}'입니다.
pl: Nie można sprawdzić tożsamości komunikatu wychodzącego. Oczekiwana tożsamość to „{0}” dla docelowego punktu końcowego „{1}”.
pt_br: Falha na identificação de identidade para mensagem de saída. A identidade esperada é '{0}' para o ponto de extremidade de destino '{1}'.
tr: Giden ileti kimlik denetimi başarısız oldu. '{1}' hedef uç nokta için beklenen kimlik: '{0}'.
zh_hans: 传出消息的标识检查失败。“{1}”目标终结点的所需标识为“{0}”。
zh_hant: 外寄郵件的身分識別檢查失敗。'{1}' 目標端點應有的身分識別為 '{0}'。

# ImpersonationLevelNotSupported
source: The authentication modes using Kerberos do not support the impersonation level '{0}'. Specify identification or impersonation.
cs: Režimy ověřování pomocí protokolu Kerberos nepodporují úroveň zosobnění {0}. Zadejte identifikaci nebo zosobnění.
de: Die Authentifizierungsmodi mit Kerberos unterstützen die Identitätswechselebene "{0}" nicht. Geben Sie Identifikation oder Identitätswechsel an.
es: Los modos de autenticación que utilizan Kerberos no admiten el nivel de suplantación "{0}". Especifique identificación o suplantación.
fr: Les modes d'authentification basés sur Kerberos ne prennent pas en charge le niveau d'emprunt d'identité '{0}'. Spécifiez une identification ou un emprunt d'identité.
it: Le modalità di autenticazione che usano Kerberos non supportano il livello di rappresentazione '{0}'. Specificare Identification o Impersonation.
ja: Kerberos を使用した認証モードは、偽装レベル '{0}' をサポートしていません。ID または偽装を指定してください。
ko: Kerberos를 사용하는 인증 모드는 가장 수준 '{0}'을(를) 지원하지 않습니다. ID 또는 가장을 지정하세요.
pl: Tryby uwierzytelniania przy użyciu protokołu Kerberos nie obsługują poziomu personifikacji „{0}”. Określ identyfikację lub personifikację.
pt_br: Os modos de autenticação usando Kerberos não dão suporte ao nível de representação '{0}'. Especifique a identificação ou a representação.
tr: Kerberos'u kullanan kimlik doğrulama yöntemleri, '{0}' kimliğe bürünme düzeyini desteklemiyor. Tanımlama veya kimliğe bürünme belirtin.
zh_hans: 使用 Kerberos 的身份验证模式不支持模拟级别“{0}”。请指定标识或模拟。
zh_hant: 使用 Kerberos 的驗證模式不支援模擬等級 '{0}'。請指定識別或模擬。

# InAContractInheritanceHierarchyIfParentHasCallbackChildMustToo
source: Because base ServiceContract '{0}' has a CallbackContract '{1}', derived ServiceContract '{2}' must also specify either '{1}' or a derived type as its CallbackContract.
cs: Protože základní třída ServiceContract {0} obsahuje třídu CallbackContract {1}, odvozená třída ServiceContract {2} musí rovněž určovat buď {1} nebo odvozený typ jako její třídu CallbackContract.
de: Da der Basis-ServiceContract "{0}" einen CallbackContract "{1}" aufweist, muss der abgeleitete ServiceContract "{2}" auch entweder "{1}" oder einen abgeleiteten Typ als CallbackContract angeben.
es: Puesto que ServiceContract base "{0}" tiene un valor CallbackContract "{1}", el valor ServiceContract derivado "{2}" debe especificar también "{1}" o un tipo derivado como CallbackContract.
fr: Le ServiceContract de base '{0}' ayant un CallbackContract '{1}', le ServiceContract '{2}' dérivé doit également spécifier '{1}' ou un type dérivé en tant que CallbackContract.
it: La versione di base di ServiceContract '{0}' contiene un elemento CallbackContract '{1}', di conseguenza anche l'elemento ServiceContract derivato '{2}' deve specificare '{1}' o un tipo derivato come CallbackContract.
ja: 基本の ServiceContract '{0}' には、CallbackContract '{1}' が含まれているため、派生した ServiceContract '{2}' は、'{1}' または自身の派生型としての CallbackContract も指定する必要があります。
ko: 기본 ServiceContract '{0}'에 CallbackContract '{1}'이(가) 있기 때문에 파생된 ServiceContract '{2}'도 '{1}' 또는 파생된 형식을 해당 CallbackContract로 지정해야 합니다.
pl: Ponieważ podstawowy element ServiceContract „{0}” zawiera element CallbackContract „{1}”, pochodny element ServiceContract „{2}” musi także określać element {1} albo pochodny typ jako element CallbackContract.
pt_br: Como ServiceContract '{0}' base tem CallbackContract '{1}', o objeto ServiceContract '{2}' derivado também deve especificar '{1}' ou um tipo derivado como sua propriedade CallbackContract.
tr: Temel ServiceContract '{0}', bir CallbackContract '{1}' öğesine sahip olduğundan, türetilen ServiceContract '{2}' öğesi de CallbackContract öğesi olarak '{1}' ya da türetilen bir tür belirtmelidir.
zh_hans: 因为基本 ServiceContract“{0}”具有 CallbackContract“{1}”，派生的 ServiceContract“{2}”也必须指定“{1}”或指定作为其 CallbackContract 的派生类型。
zh_hant: 因為基底 ServiceContract '{0}' 具有 CallbackContract '{1}'，所以衍生的 ServiceContract '{2}' 也必須指定 '{1}' 或衍生的類型作為其 CallbackContract。

# InAContractInheritanceHierarchyTheServiceContract3_2
source: In a contract inheritance hierarchy, the ServiceContract's CallbackContract must be a subtype of the CallbackContracts of all of the CallbackContracts of the ServiceContracts inherited by the original ServiceContract, Types {0} and {1} violate this rule.
cs: V hierarchii dědičnosti kontraktu musí být třída CallbackContract třídy ServiceContract podtypem tříd CallbackContracts všech tříd CallbackContract tříd ServiceContracts zděděných původní třídou ServiceContract. Typy {0} a {1} toto pravidlo porušují.
de: In einer Vertragsvererbungshierarchie muss der CallbackContract des ServiceContract ein Untertyp des CallbackContracts aller CallbackContracts der vom ursprünglichen ServiceContract geerbten ServiceContracts sein. Die Typen {0} und {1} verstoßen gegen diese Regel.
es: En una jerarquía de herencia de contrato, CallbackContract de ServiceContract debe ser un subtipo de todos los CallbackContract de los ServiceContract heredados por el ServiceContract original. Los tipos {0} y {1} infringen esta regla.
fr: Dans une hiérarchie d'héritage de contrat, le CallbackContract de ServiceContract doit être un sous-type des CallbackContracts de tous les CallbackContracts des ServiceContracts hérités du ServiceContract d'origine. Les types {0} et {1} ne respectent pas cette règle.
it: In una gerarchia di ereditarietà dei contratti, l'elemento CallbackContract di ServiceContract deve essere un sottotipo di CallbackContract di tutti gli elementi CallbackContract di elementi ServiceContract ereditati dalla versione originale di ServiceContract. I tipi {0} e {1} violano tale regola.
ja: コントラクトの継承階層においては、ServiceContract の CallbackContract は、元の ServiceContract によって継承される ServiceContract のすべての CallbackContract の CallbackContract のサブタイプである必要がありますが、型 {0} と {1} はこのルールに違反しています。
ko: 계약 상속 계층 구조에서 ServiceContract의 CallbackContract는 원래 ServiceContract가 상속하는 ServiceContracts의 모든 CallbackContracts에 대한 하위 형식의 CallbackContracts여야 합니다. {0} 및 {1} 형식이 이 규칙을 위반합니다.
pl: W hierarchii dziedziczenia kontraktów element CallbackContract obiektu ServiceContract musi być podtypem elementów CallbackContract wszystkich elementów CallbackContract w obiektach ServiceContract dziedziczonych przez pierwotny obiekt ServiceContract. Typy {0} i {1} nie spełniają tej reguły.
pt_br: Em uma hierarquia de herança de contrato, CallbackContract de ServiceContract deve ser um subtipo de CallbackContract de todas as propriedades CallbackContracts de ServiceContracts herdadas pelo objeto ServiceContract original; os Tipos {0} e {1} violam essa regra.
tr: Bir anlaşma devralma hiyerarşisinde ServiceContract CallbackContract, özgün ServiceContract tarafından devralınan ServiceContracts öğesinin tüm CallbackContracts değerlerinin bir CallbackContracts alt türü olmalıdır, {0} ve {1} Türleri bu kuralı ihlal ediyor.
zh_hans: 在协定继承层次结构中，ServiceContract 的 CallbackContract 必须是原始 ServiceContract 继承的 ServiceContract 的所有 CallbackContract 的 CallbackContract 的子类型，类型 {0} 和 {1} 与此规则冲突。
zh_hant: 在合約繼承階層中，ServiceContract 的 CallbackContract 必須是原始 ServiceContract 所繼承之 ServiceContracts 的所有 CallbackContracts 的 CallbackContracts 子類型，類型 {0} 與 {1} 違反此規則。
