Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# TaskAsyncMatchConsistency_ReturnType5
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{3}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
cs: Úlohově orientovaná asynchronní metoda OperationContract {0} typu {1} se shoduje s asynchronními metodami OperationContract {2} a {3}, protože mají shodný název operace {4}. Pokud se synchronní metoda OperationContract shoduje s párem asynchronních metod OperationContract, musejí obě tyto metody OperationContract definovat stejný návratový typ. V tomto případě jsou tyto návratové typy rozdílné. Tento problém je možné odstranit tak, že zajistíte, aby metoda {0} i metoda {3} měly stejný návratový typ. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die aufgabenbasierte asynchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine synchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts den gleichen Rückgabetyp definieren. In diesem Fall unterscheiden sich die Rückgabetypen. Stellen Sie sicher, dass die Methoden "{0}" und "{3}" über den gleichen Rückgabetyp verfügen, um dieses Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract asincrónico basado en tareas en el tipo "{1}" coincide con los métodos "{2}" y "{3}" OperationContract asincrónicos porque tienen el mismo nombre de operación "{4}". Cuando un método OperationContract sincrónico coincide con un par de métodos OperationContract asincrónicos, los dos métodos OperationContracts deben definir el mismo tipo de devolución. En este caso, los tipos de devolución son diferentes. Para solucionarlo, asegúrese de que el método "{0}" y el método "{3}" tiene el mismo tipo de devolución. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract asynchrone basée sur les tâches '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent définir le même type de retour. Dans ce cas, les types de retour sont différents. Pour corriger le problème, vérifiez que les méthodes '{0}' et '{3}' utilisent le même type de retour. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' asincrono basato su attività nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract sincrono viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono definire lo stesso tipo restituito. In questo caso, i tipi restituiti sono diversi. Per risolvere il problema, verificare che il metodo '{0}' e il metodo '{3}' abbiano lo stesso tipo restituito. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' のタスクベースの非同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。非同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract では同じ戻り値の型を定義する必要があります。このケースでは、戻り値の型が異なります。この問題を修正するには、メソッド '{0}' とメソッド '{3}' の戻り値の型を同じにしてください。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: 두 메서드가 동일한 작업 이름 '{4}'을(를) 포함하기 때문에 '{1}' 형식의 작업 기반 비동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 일치했습니다. 동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하는 경우 두 OperationContract 모두 동일한 반환 형식을 정의해야 합니다. 이 경우 반환 형식이 달라집니다. 이를 해결하려면 메서드 '{0}'과(와) 메서드 '{3}'의 반환 형식이 동일한지 확인해야 합니다. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Oparta na zadaniach asynchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do asynchronicznych metod klasy OperationContract „{2}” i „{3}”, ponieważ zawierają one operację o takiej samej nazwie „{4}”. Gdy synchroniczna metoda klasy OperationContract jest dopasowywana do pary asynchronicznych metod klasy OperationContract, obie klasy OperationContract muszą definiować taki sam zwracany typ. W tym przypadku zwracane typy są różne. Aby rozwiązać ten problem, upewnij się, że metoda „{0}” i metoda „{3}” mają taki sam zwracany typ. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método assíncrono OperationContract baseado em tarefa '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método síncrono OperationContract coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem definir o mesmo tipo de retorno. Nesse caso, os tipos de retorno são diferentes. Para corrigir isso, verifique se os métodos '{0}' e '{3}' têm o mesmo tipo de retorno. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{4}' işlem adına sahip olduklarından '{1}' türü içindeki görev tabanlı asenkron OperationContract metodu '{0}' ile asenkron OperationContract metotları '{2}' ve '{3}' eşleştirildi. Zaman uyumlu bir OperationContract metodu asenkron iki OperationContract metoduyla eşleştirildiğinde, iki OperationContract tarafından aynı dönüş türü tanımlanmalıdır. Bu durumda, dönüş türleri farklıdır. Bunu düzeltmek için, '{0}' metodu ile '{3}' metodunun aynı dönüş türüne sahip olduğundan emin olun. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中基于任务的异步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当同步 OperationContract 方法与一对异步 OperationContract 方法匹配时，两个 OperationContract 必须定义相同的返回类型。在本例中，返回类型不同。若要修复此问题，请确保方法“{0}”和方法“{3}”具有相同的返回类型。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 以工作為基礎的非同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當同步 OperationContract 方法符合一對非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同的傳回型別。在此例中，傳回型別不同。若要修正此問題，請確認方法 '{0}' 與方法 '{3}' 具有相同的傳回型別。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# TheBindingForDoesnTSupportOrderedDelivery1
source: The DeliveryRequirementsAttribute on contract '{0}' specifies a QueuedDeliveryRequirements value of NotAllowed. However, the configured binding for this contract specifies that it does support queued delivery. A queued binding may not be used with this contract.
cs: Atribut DeliveryRequirementsAttribute u kontraktu {0} udává pro atribut QueuedDeliveryRequirements hodnotu NotAllowed. Nakonfigurovaná vazba pro tento kontrakt ale udává, že podporuje doručení s frontou. S tímto kontraktem nelze použít vazbu s frontou.
de: Der DeliveryRequirementsAttribute für Vertrag "{0}" gibt einen QueuedDeliveryRequirements-Wert von "NotAllowed" an. Die konfigurierte Bindung für diesen Vertrag gibt jedoch an, dass er die Zustellung über eine Warteschlange unterstützt. Für diesen Vertrag darf keine Bindung verwendet werden, die in eine Warteschlange gestellt wurde.
es: El atributo DeliveryRequirementsAttribute del contrato '{0}' especifica un valor de QueuedDeliveryRequirements de NotAllowed. Sin embargo, el enlace configurado para este contrato especifica que no admite la entrega en cola. No se puede usar un enlace en cola con este contrato.
fr: DeliveryRequirementsAttribute sur le contrat '{0}' spécifie une valeur QueuedDeliveryRequirements de NotAllowed. Toutefois, la liaison configurée pour ce contrat spécifie qu'elle ne prend pas en charge la livraison mise en file d'attente. Une liaison mise en file d'attente ne peut pas être utilisée avec ce contrat.
it: DeliveryRequirementsAttribute nel contratto '{0}' specifica un valore NotAllowed per QueuedDeliveryRequirements. Tuttavia, il binding configurato per il contratto specifica che il recapito in coda è supportato. Impossibile utilizzare un binding in coda con questo contratto.
ja: コントラクト '{0}' の DeliveryRequirementsAttribute では、QueuedDeliveryRequirements の値として NotAllowed が指定されていますが、このコントラクトに対して構成されたバインドでは、待機配送をサポートすることが指定されています。待機バインドをこのコントラクトで使用することはできません。
ko: '{0}' 계약의 DeliveryRequirementsAttribute가 NotAllowed의 QueuedDeliveryRequirements 값을 지정합니다. 그러나 이 계약에 대해 구성된 바인딩은 대기 중인 배달을 지원한다고 지정합니다. 대기 중인 바인딩은 이 계약에서 사용할 수 없습니다.
pl: Atrybut DeliveryRequirementsAttribute w kontrakcie „{0}” ma określoną wartość pola QueuedDeliveryRequirements równą NotAllowed. Jednak w powiązaniu skonfigurowanym dla tego kontraktu określono, że nie obsługuje on dostarczania kolejkowanego. Z tym kontraktem nie można używać powiązania kolejkowanego.
pt_br: O DeliveryRequirementsAttribute no contrato '{0}' especifica um valor QueuedDeliveryRequirements de NotAllowed. Entretanto, a associação configurada para esse contrato especifica que ele oferece suporte à entrega enfileirada. Uma associação enfileirada pode não ser usada com esse contrato.
tr: '{0}' sözleşmesindeki DeliveryRequirementsAttribute, NotAllowed değerine sahip bir QueuedDeliveryRequirements belirtiyor. Bununla birlikte bu sözleşme için yapılandırılan bağlama sıralı teslimi desteklemediğini belirtiyor. Bir sıralı bağlama bu sözleşmeyle kullanılamaz.
zh_hans: 协定“{0}”上的 DeliveryRequirementsAttribute 指定了 NotAllowed 的 QueuedDeliveryRequirements 值。但是，为此协定配置的绑定指定其不支持排队传送。排队绑定可能不能用于此协定。
zh_hant: 合約 '{0}' 上的 DeliveryRequirementsAttribute 可將 QueuedDeliveryRequirements 值指定為 NotAllowed。但是此合約的設定繫結可指定支援佇列傳遞。佇列繫結無法與此合約搭配使用。

source: TimeSpan must be greater than TimeSpan.Zero.
cs: Hodnota TimeSpan musí být větší než TimeSpan.Zero.
de: TimeSpan muss größer als TimeSpan.Zero sein.
es: TimeSpan debe ser mayor que TimeSpan.Zero.
fr: TimeSpan doit être supérieur à TimeSpan.Zero.
it: Il valore di TimeSpan deve essere maggiore di TimeSpan.Zero.
ja: TimeSpan は TimeSpan.Zero を超える値である必要があります。
ko: TimeSpan은 TimeSpan.Zero보다 커야 합니다.
pl: Wartość TimeSpan musi być większa niż TimeSpan.Zero.
pt_br: TimeSpan deve ser maior que TimeSpan.Zero.
tr: TimeSpan değeri, TimeSpan.Zero değerinden daha büyük olmalıdır.
zh_hans: TimeSpan 必须大于 TimeSpan.Zero。
zh_hant: TimeSpan 必須大於 TimeSpan.Zero。

# TimeStampHasCreationAheadOfExpiry
source: The security timestamp is invalid because its creation time ('{0}') is greater than or equal to its expiration time ('{1}').
cs: Časové razítko zabezpečení není platné, protože jeho čas vytvoření ({0}) je větší než nebo roven jeho času vypršení platnosti ({1}).
de: Der Sicherheitszeitstempel ist ungültig, weil sein Wert für den Erstellungszeitpunkt ("{0}") größer oder gleich dem Wert für den Ablaufzeitpunkt ("{1}") ist.
es: La marca de tiempo de seguridad no es válida porque la hora de creación ("{0}") es posterior o igual a la hora de expiración ("{1}").
fr: L'horodatage de sécurité est non valide, car son heure de création ('{0}') est supérieure ou égale à son heure d'expiration ('{1}').
it: Il timestamp di sicurezza non è valido perché l'ora di creazione ('{0}') è maggiore o uguale a quella di scadenza ('{1}').
ja: このセキュリティ タイムスタンプは、作成時間 ('{0}') が有効期限 ('{1}') 以降なので無効です。
ko: 보안 타임스탬프는 만든 시간('{0}')이 만료 시간('{1}')보다 크거나 같으므로 잘못되었습니다.
pl: Sygnatura czasowa zabezpieczeń jest niepoprawna, ponieważ jej godzina utworzenia („{0}”) jest większa lub równa godzinie wygaśnięcia („{1}”).
pt_br: O carimbo de data/hora de segurança é inválido porque sua hora de criação ('{0}') é maior ou igual à sua hora de expiração ('{1}').
tr: Oluşturulma zamanı ('{0}'), geçerlilik sonu zamanına ('{1}') eşit ya da ondan daha büyük olduğundan, güvenlik zaman damgası geçersiz.
zh_hans: 安全时间戳无效，因为其创建时间({0})大于或等于其过期时间({1})。
zh_hant: 因為安全性時間戳記的建立時間 ('{0}') 大於或等於到期時間 ('{1}')，所以安全性時間戳記無效。

# TimeStampHasCreationTimeInFuture
source: The security timestamp is invalid because its creation time ('{0}') is in the future. Current time is '{1}' and allowed clock skew is '{2}'.
cs: Časové razítko zabezpečení není platné, protože jeho čas vytvoření ({0}) je v budoucnosti. Aktuální čas je {1} a povolený časový posun je {2}.
de: Der Sicherheitszeitstempel ist ungültig, weil sein Erstellungszeitpunkt ("{0}") in der Zukunft liegt. Die aktuelle Uhrzeit ist "{1}", und die erlaubte Uhrabweichung ist "{2}".
es: La marca de tiempo de seguridad no es válida porque la hora de creación ("{0}") es una hora futura. La hora actual es "{1}" y el sesgo de reloj permitido es "{2}".
fr: L'horodatage de sécurité est non valide, car son heure de création ('{0}') est dans le futur. Le temps actuel est '{1}' et l'inclinaison autorisée de l'horloge est '{2}'.
it: Il timestamp di sicurezza non è aggiornato perché l'ora di creazione ('{0}') ricorre nel futuro. L'ora corrente è '{1}' e lo sfasamento consentito di orario è '{2}'.
ja: このセキュリティ タイムスタンプは、作成時間 ('{0}') が将来なので無効です。現在の時間は '{1}' で、許容される時計の誤差は '{2}' です。
ko: 보안 타임스탬프는 만든 시간('{0}')이 미래의 시간이므로 잘못되었습니다. 현재 시간은 '{1}'이며 허용된 클록 스큐(clock skew)는 '{2}'입니다.
pl: Sygnatura czasowa zabezpieczeń jest niepoprawna, ponieważ jej godzina utworzenia („{0}”) jest w przyszłości. Obecna godzina to „{1}”, a dopuszczalna niedokładność zegara wynosi „{2}”.
pt_br: O carimbo de data/hora de segurança é inválido porque sua hora de criação ('{0}') está no futuro. A hora atual é '{1}' e a distorção horária permitida é '{2}'.
tr: Oluşturulma zamanı ('{0}') ileri bir tarihte olduğundan, güvenlik zaman damgası geçersiz. Geçerli zaman '{1}' ve izin verilen saat sapması: '{2}'.
zh_hans: 安全时间戳无效，因为其创建时间({0})是将来的时间。当前时间为“{1}”，允许的时钟偏差是“{2}”。
zh_hant: 因為安全性時間戳記的建立時間 ('{0}') 在未來，所以安全性時間戳記無效。目前時間是 '{1}'，允許的時鐘誤差是 '{2}'。

# TimeStampHasExpiryTimeInPast
source: The security timestamp is stale because its expiration time ('{0}') is in the past. Current time is '{1}' and allowed clock skew is '{2}'.
cs: Časové razítko zabezpečení je zastaralé, protože jeho čas vypršení platnosti ({0}) je v minulosti. Aktuální čas je {1} a povolený časový posun je {2}.
de: Der Sicherheitszeitstempel ist veraltet, weil sein Ablaufzeitpunkt ("{0}") in der Vergangenheit liegt. Die aktuelle Uhrzeit ist "{1}", und die erlaubte Uhrabweichung ist "{2}".
es: La marca de tiempo de seguridad es obsoleta porque la hora de expiración ("{0}") es una hora pasada. La hora actual es "{1}" y el sesgo de reloj permitido es "{2}".
fr: L'horodatage de sécurité est périmé, car son heure d'expiration ('{0}') est dans le passé. Le temps actuel est '{1}' et l'inclinaison autorisée de l'horloge est '{2}'.
it: Il timestamp di sicurezza non è aggiornato perché l'ora di scadenza ('{0}') è già passata. L'ora corrente è '{1}' e lo sfasamento consentito di orario è '{2}'.
ja: このセキュリティ タイムスタンプは、有効期限 ('{0}') が過去なので古くなっています。現在の時間は '{1}' で、許容される時計の誤差は '{2}' です。
ko: 보안 타임스탬프는 만료 시간('{0}')이 과거의 시간이므로 잘못되었습니다. 현재 시간은 '{1}'이며 허용된 클록 스큐(clock skew)는 '{2}'입니다.
pl: Sygnatura czasowa zabezpieczeń jest nieodświeżona, ponieważ jej godzina utworzenia („{0}”) jest w przeszłości. Obecna godzina to „{1}”, a dopuszczalna niedokładność zegara wynosi „{2}”.
pt_br: O carimbo de data/hora de segurança é obsoleto porque a hora de expiração ('{0}') está no passado. A hora atual é '{1}' e a distorção horária permitida é '{2}'.
tr: Geçerlilik süresi ('{0}') geçtiğinden, güvenlik zaman damgası eskimiş. Geçerli zaman '{1}' ve izin verilen saat sapması: '{2}'.
zh_hans: 安全时间戳已过时，因为其过期时间({0})是过去的时间。当前时间为“{1}”，允许的时钟偏差是“{2}”。
zh_hant: 因為安全性時間戳記的過期時間 ('{0}') 在過去，所以安全性時間戳記已過時。目前時間是 '{1}'，允許的時鐘誤差是 '{2}'。

# TimeStampWasCreatedTooLongAgo
source: The security timestamp is stale because its creation time ('{0}') is too far back in the past. Current time is '{1}', maximum timestamp lifetime is '{2}' and allowed clock skew is '{3}'.
cs: Časové razítko zabezpečení je zastaralé, protože jeho čas vytvoření ({0}) je příliš daleko v minulosti. Aktuální čas je {1}, maximální životnost časového razítka je {2} a povolený časový posun je {3}.
de: Der Sicherheitszeitstempel ist veraltet, weil sein Erstellungszeitpunkt ("{0}") zu weit in der Vergangenheit liegt. Die aktuelle Uhrzeit ist "{1}", die maximale Lebensdauer des Zeitstempels ist "{2}", und die erlaubte Uhrabweichung ist "{3}".
es: La marca de tiempo de seguridad es obsoleta porque la fecha de creación ("{0}") es demasiado anterior. La hora actual es "{1}", la vigencia máxima de la marca de tiempo es "{2}" y el sesgo de reloj permitido es "{3}".
fr: L'horodatage de sécurité est périmé, car son heure de création ('{0}') est trop lointaine dans le passé. Le temps actuel est '{1}', la durée de vie maximale de l'horodatage est '{2}' et l'inclinaison autorisée de l'horloge est '{3}'.
it: Il timestamp di sicurezza non è aggiornato perché l'ora di creazione ('{0}') è già passata da molto tempo. L'ora corrente è '{1}', la durata massima del timestamp è '{2}' e lo sfasamento consentito di orario è '{3}'.
ja: このセキュリティ タイムスタンプは、作成時間 ('{0}') が極端に遠い過去なので古くなっています。現在の時間は '{1}'、タイムスタンプの最大有効期限は '{2}'、許容される時計の誤差は '{3}' です。
ko: 보안 타임스탬프는 만든 시간('{0}')이 너무 오래전이므로 잘못되었습니다. 현재 시간은 '{1}'이고, 최대 타임스탬프 수명은 '{2}'이며, 허용된 클록 스큐(clock skew)는 '{3}'입니다.
pl: Sygnatura czasowa zabezpieczeń jest nieodświeżona, ponieważ jej godzina utworzenia („{0}”) jest zbyt daleko w przeszłości. Obecna godzina to „{1}”, maksymalny okres istnienia sygnatury czasowej wynosi „{2}”, a dopuszczalna niedokładność zegara wynosi „{3}”.
pt_br: O carimbo de data/hora de segurança é obsoleto porque sua hora de criação ('{0}') é muito distante no passado. A hora atual é '{1}', o tempo de vida máximo do carimbo de data/hora é '{2}' e a distorção horária permitida é '{3}'.
tr: Oluşturulma zamanı ('{0}') çok geride kaldığından, güvenlik zaman damgası eskimiş. Geçerli zaman '{1}', en uzun zaman damgası ömrü: '{2}' ve izin verilen saat sapması: '{3}'.
zh_hans: 安全时间戳已过时，因为其创建时间({0})是很久之前的时间。当前时间为“{1}”，最大时间戳生存期为“{2}”，允许的时钟偏差是“{3}”。
zh_hant: 因為安全性時間戳記的建立時間 ('{0}') 過時甚久，所以安全性時間戳記已過時。目前時間是 '{1}'，時間戳記生命週期上限是 '{2}'，允許的時鐘誤差是 '{3}'。

# TimeoutOnAddToWindow
source: The message could not be transferred within the allotted timeout of {0}. There was no space available in the reliable channel's transfer window. The time allotted to this operation may have been a portion of a longer timeout.
cs: Zpráva nebyla přenesena v rámci přiděleného časového limitu {0}. Nebyl k dispozici prostor v přenosovém okně stabilního kanálu. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die Nachricht konnte nicht innerhalb des zugewiesenen Zeitlimits von {0} nicht übertragen werden. Im Übertragungsfenster des zuverlässigen Kanals war kein Platz mehr verfügbar. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: No se pudo transferir el mensaje en el tiempo de espera asignado de {0}. No había espacio disponible en la ventana de transferencia del canal confiable. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Impossible de transférer le message dans le délai imparti de {0}. Aucun espace n'est disponible dans la fenêtre de transfert du canal fiable. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Impossibile trasferire il messaggio entro il timeout assegnato di {0}. Spazio non disponibile nella finestra di trasferimento del canale affidabile. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内にメッセージを転送できませんでした。信頼性の高いチャネルの転送ウィンドウに使用可能な領域がありません。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한({0}) 내에 메시지를 전송할 수 없습니다. 신뢰 가능한 채널의 전송 창에서 사용할 수 있는 공간이 없습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Nie powiodło się przesłanie komunikatu w ciągu przydzielonego limitu czasu {0}. Nie było wystarczająco dużo miejsca w oknie transmisji niezawodnego kanału. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A mensagem não pôde ser transferida dentro do tempo limite alocado de {0}. Não havia espaço disponível na janela de transferência do canal confiável. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: İleti ayrılan zaman aşımı süresi ({0}) içinde aktarılamadı. Güvenilir kanalın aktarma penceresinde kullanılabilir alan yoktu. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 消息无法在分配的超时 {0} 内传输。可靠通道的传输窗口中没有可用空间。分配给此操作的时间可能已经是更长超时的一部分。
zh_hant: 訊息無法在分配的逾時 {0} 內傳輸。可靠的通道傳輸窗口沒有可用空間。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutOnClose
source: The close operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Operace zavřít nebyla dokončena v rámci přiděleného časového limitu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Das Schließen wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La operación de cierre no se completó dentro del tiempo de espera asignado de {0}. Es posible que el tiempo asignado a esta operación fuera una parte de un tiempo de espera mayor.
fr: L'opération de fermeture ne s'est pas effectuée dans le délai d'expiration alloué de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: L'operazione di chiusura non è stata completata entro il timeout allocato pari a {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内に、終了操作は完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한({0}) 내에 닫기 작업이 완료되지 않았습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja zamykania nie została ukończona przed upływem przydzielonego limitu czasu równego {0}. Czas przydzielony na wykonanie tej operacji mógł stanowić część większego limitu czasu.
pt_br: A operação de fechamento não foi concluída no tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Kapatma işlemi ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 关闭操作没有在分配的超时 {0} 内完成。分配给此操作的时间可能比超时长。
zh_hant: 關閉作業未在分配的逾時 {0} 之內完成。分配給此作業的時間可能是較長逾時的一部分。
