Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# BinaryEncoderSessionTooLarge
source: The binary encoder session information exceeded the maximum size quota ({0}). To increase this quota, use the MaxSessionSize property on the BinaryMessageEncodingBindingElement.
cs: Informace o relaci binárního kodéru přesahují maximální kvótu velikosti ({0}). Chcete-li tuto kvótu zvýšit, použijte vlastnost MaxSessionSize ve třídě BinaryMessageEncodingBindingElement.
de: Die Sitzungsinformationen für den binären Encoder haben das Kontingent für die maximale Größe ({0}) überschritten. Verwenden Sie die MaxSessionSize-Eigenschaft für das BinaryMessageEncodingBindingElement, um dieses Kontingent zu erhöhen.
es: La información de la sesión del codificador binario superó la cuota de tamaño máximo ({0}). Para aumentar la cuota, use la propiedad MaxSessionSize en BinaryMessageEncodingBindingElement.
fr: Les informations de session de l'encodeur binaire ont dépassé le quota de taille maximale autorisée ({0}). Pour augmenter ce quota, utilisez la propriété MaxSessionSize sur l'élément BinaryMessageEncodingBindingElement.
it: Le informazioni sulla sessione del codificatore binario hanno superato la quota massima delle dimensioni ({0}). Per aumentare questa quota, usare la proprietà MaxSessionSize su BinaryMessageEncodingBindingElement.
ja: バイナリ エンコーダーのセッション情報が、最大サイズ クォータ ({0}) を超えました。このクォータを増やすには、BinaryMessageEncodingBindingElement で MaxSessionSize プロパティを使用してください。
ko: 이진 인코더 세션 정보가 최대 크기 할당량({0})을 초과했습니다. 이 할당량을 늘리려면 BinaryMessageEncodingBindingElement에서 MaxSessionSize 속성을 사용하세요.
pl: Informacje sesji kodera binarnego przekroczyły maksymalną wielkość limitu przydziału ({0}). Ten limit przydziału można zwiększyć za pomocą właściwości MaxSessionSize elementu BinaryMessageEncodingBindingElement.
pt_br: As informações da sessão do codificador binário excederam a cota de tamanho máximo ({0}). Para aumentar essa cota, use a propriedade MaxSessionSize em BinaryMessageEncodingBindingElement.
tr: İkili kodlama oturumu bilgileri kota boyutu üst sınırını aştı ({0}). Kotayı artırmak için BinaryMessageEncodingBindingElement üstündeki MaxSessionSize özelliğini kullanın.
zh_hans: 二进制编码器会话信息超过大小配额({0})的最大值。若要增大此配额，请使用 BinaryMessageEncodingBindingElement 上的 MaxSessionSize 属性。
zh_hant: 二進位編碼器工作階段資訊超出配額 ({0}) 上限。若要加大此配額，請使用 BinaryMessageEncodingBindingElement 上的 MaxSessionSize 屬性。

# BindingDoesnTSupportAnyChannelTypes1
source: Binding '{0}' doesn't support creating any channel types. This often indicates that the BindingElements in a CustomBinding have been stacked incorrectly or in the wrong order. A Transport is required at the bottom of the stack. The recommended order for BindingElements is: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
cs: Vazba {0} nepodporuje vytváření žádných typů kanálů. To často znamená, že třídy BindingElements ve třídě CustomBinding byly skládány nesprávně nebo v chybném pořadí. Ve spodní části zásobníku je vyžadován Transport. Doporučené pořadí tříd BindingElements je: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport
de: Die Bindung "{0}" unterstützt das Erstellen von Kanaltypen nicht. Dies weist häufig darauf hin, dass die BindingElements in einer CustomBinding fehlerhaft oder in der falschen Reihenfolge im Stapel abgelegt wurden. Unten im Stapel ist ein Transport erforderlich. Die empfohlene Reihenfolge für BindingElements ist: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
es: El enlace "{0}" no admite la creación de tipos de canales. Esto suele indicar que se apilaron elementos BindingElements en CustomBinding de forma incorrecta o en el orden erróneo. Es necesario el elemento Transport en la parte inferior de la pila. El orden recomendado para BindingElements es: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
fr: La liaison '{0}' ne prend pas en charge la création de types de canal. Ceci indique souvent que les éléments BindingElements ont été empilés de façon incorrecte, ou dans le mauvais ordre, dans un élément CustomBinding. Un élément Transport est obligatoire au bas de la pile. L'ordre recommandé pour BindingElements est : TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
it: Il binding '{0}' non supporta la creazione di alcun tipo di canale. Questa condizione indica spesso che lo stack o l'ordine degli elementi BindingElement in CustomBinding non è corretto. È richiesto un elemento Transport alla fine dello stack. L'ordine consigliato per gli elementi BindingElement è: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
ja: バインド '{0}' はどの種類のチャネルの作成もサポートしていません。これは多くの場合、CustomBinding 内の BindingElements が適切にスタックされていないか、スタックの順序が間違っていることを示します。スタックの一番下には Transport が必要です。BindingElements の推奨順序は、TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport です。
ko: '{0}' 바인딩이 채널 형식 만들기를 지원하지 않습니다. 이것은 대개 CustomBinding의 BindingElements가 올바르지 않게 스택되었거나 순서가 잘못되었다는 것을 나타냅니다. 스택의 맨 아래에 Transport가 필요합니다. BindingElements에 권장되는 순서는 다음과 같습니다. TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
pl: Powiązanie „{0}” nie obsługuje tworzenia żadnych typów kanałów. To często oznacza, że elementy BindingElements w CustomBinding zostały niepoprawnie ułożone w stos lub są w niewłaściwej kolejności. Transport musi być na spodzie stosu. Zalecana jest następująca kolejność elementów BindingElements: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
pt_br: A associação '{0}' não dá suporte à criação de tipos de canal. Em geral, isso indica que ingElements em uma CustomBinding foram empilhados incorretamente ou na ordem errada. Transport é necessário na parte inferior da pilha. A ordem recomendada para BindingElements é: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
tr: '{0}' bağlaması herhangi bir kanal türü oluşturmayı desteklemiyor. Bu, genellikle bir CustomBinding içindeki BindingElements öğelerinin hatalı ya da yanlış sırada yığınlandığını gösterir. Yığının en altında bir Transport öğesi gerekir. BindingElements için önerilen sıra: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
zh_hans: 绑定“{0}”不支持创建任何通道类型。这通常表示 CustomBinding 中的 BindingElement 堆栈不正确或者顺序错误。Transport 必须位于堆栈的底部。建议 BindingElement 的顺序是: TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport。
zh_hant: 繫結 '{0}' 不支援建立任何通道類型。這通常代表 CustomBinding 中的 BindingElements 堆疊不正確，或是順序錯誤。堆疊底層必須是 Transport。BindingElements 的建議順序為: TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport。

# BindingDoesnTSupportDuplexButContractRequires1
source: Contract requires Duplex, but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Kontrakt vyžaduje vlastnost Duplex, ale vazba {0} ji nepodporuje, nebo není pro její podporu správně nakonfigurována.
de: Der Vertrag erfordert "Duplex", die Bindung "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato requiere Duplex, pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le contrat nécessite le mode Duplex mais la liaison '{0}' ne le prend pas en charge, ou elle n'est pas configurée correctement pour cela.
it: Il contratto richiede l'impostazione Duplex, ma il binding '{0}' non la supporta o non è configurato correttamente per supportarla.
ja: コントラクトには Duplex が必要ですが、バインド '{0}' はこれをサポートしていないか、サポートするように正しく構成されていません。
ko: 계약에 Duplex가 필요하지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt wymaga elementu Duplex, ale element Binding „{0}” go nie obsługuje lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato requer Duplex, mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma için Duplex gerekiyor, ancak Binding '{0}' bunu desteklemiyor ya da bunu destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定需要双工，但是绑定“{0}”不支持它或者因配置不正确而无法支持它。
zh_hant: 合約需要 Duplex，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# BindingDoesnTSupportOneWayButContractRequires1
source: Contract requires OneWay, but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Kontrakt vyžaduje vlastnost OneWay, ale vazba {0} ji nepodporuje nebo není pro její podporu správně nakonfigurována.
de: Der Vertrag erfordert "OneWay", die Bindung "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato requiere OneWay, pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le contrat nécessite le mode OneWay, mais la liaison '{0}' ne le prend pas en charge, ou elle n'est pas configurée correctement pour cela.
it: Il contratto richiede l'impostazione OneWay, ma il binding '{0}' non la supporta o non è configurato correttamente per supportarla.
ja: コントラクトには OneWay が必要ですが、バインド '{0}' はこれをサポートしていないか、サポートするように正しく構成されていません。
ko: 계약에 OneWay가 필요하지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt wymaga elementu OneWay, ale element Binding „{0}” go nie obsługuje lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato requer OneWay, mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma için OneWay gerekiyor, ancak Binding '{0}' bunu desteklemiyor ya da bunu destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定需要单向，但是绑定“{0}”不支持它或者因配置不正确而无法支持它。
zh_hant: 合約需要 OneWay，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# BindingDoesnTSupportRequestReplyButContract1
source: Contract requires Request/Reply, but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Kontrakt vyžaduje vlastnost Request nebo Reply, ale vazba {0} je nepodporuje, nebo není pro jejich podporu správně nakonfigurována.
de: Der Vertrag erfordert "Request/Reply", die Bindung "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato requiere Request/Reply, pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le contrat nécessite le mode Request/Reply, mais la liaison '{0}' ne le prend pas en charge, ou elle n'est pas configurée correctement pour cela.
it: Il contratto richiede l'impostazione Request/Reply, ma il binding '{0}' non la supporta o non è configurato correttamente per supportarla.
ja: コントラクトには Request/Reply が必要ですが、バインド '{0}' はこれをサポートしていないか、サポートするように正しく構成されていません。
ko: 계약에 Request/Reply가 필요하지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt wymaga elementu Request/Reply, ale element Binding „{0}” go nie obsługuje lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato requer Solicitação/Resposta, mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma için Request/Reply gerekiyor, ancak Binding '{0}' bunu desteklemiyor ya da bunu destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定需要请求/回复，但是绑定“{0}”不支持它或者因配置不正确而无法支持它。
zh_hant: 合約需要 Request/Reply，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# BindingDoesnTSupportSessionButContractRequires1
source: Contract requires Session, but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Kontrakt vyžaduje vlastnost Session, ale vazba {0} ji nepodporuje, nebo není pro její podporu správně nakonfigurována.
de: Der Vertrag erfordert "Session", die Bindung "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato requiere Session, pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le contrat nécessite le mode Session, mais la liaison '{0}' ne le prend pas en charge, ou elle n'est pas configurée correctement pour cela.
it: Il contratto richiede l'impostazione Session, ma il binding '{0}' non la supporta o non è configurato correttamente per supportarla.
ja: コントラクトには Session が必要ですが、バインド '{0}' はこれをサポートしていないか、サポートするように正しく構成されていません。
ko: 계약에 Session이 필요하지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt wymaga elementu Session, ale element Binding „{0}” go nie obsługuje lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato requer Sessão, mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma için Session gerekiyor, ancak '{0}' Binding bunu desteklemiyor ya da destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定需要会话，但是绑定“{0}”不支持它或者因配置不正确而无法支持它。
zh_hant: 合約需要 Session，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# BindingDoesnTSupportTwoWayButContractRequires1
source: Contract requires TwoWay (either request-reply or duplex), but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Kontrakt vyžaduje vlastnost TwoWay (požadavek-odpověď, nebo duplexní), ale vazba {0} ji nepodporuje, nebo není pro její podporu správně nakonfigurována.
de: Der Vertrag erfordert "TwoWay" (entweder Anforderung-Antwort oder Duplex), die Bindung "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato requiere TwoWay (solicitud-respuesta o dúplex), pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le contrat nécessite le mode TwoWay (soit requête-réponse, soit duplex) mais la liaison '{0}' ne le prend pas en charge, ou elle n'est pas configurée correctement pour cela.
it: Il contratto richiede l'impostazione TwoWay (request/reply o duplex), ma il binding '{0}' non la supporta o non è configurato correttamente per supportarlo.
ja: コントラクトは、TwoWay (要求-応答、または二重) を必要としますが、バインディング '{0}' はそれをサポートしていないか、それをサポートするように適切に構成されていません。
ko: 계약에 TwoWay(request-reply 또는 duplex)가 필요하지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt wymaga elementu TwoWay (żądanie-odpowiedź lub dupleks), ale element Binding „{0}” go nie obsługuje lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato requer TwoWay (solicitação/resposta ou duplex), mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma için TwoWay (istek-yanıt ya da çift yönlü) gerekiyor, ancak '{0}' Binding bunu desteklemiyor ya da destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定需要双向(请求-回复或双工)，但是绑定“{0}”不支持它或者因配置不正确而无法支持它。
zh_hant: 合約需要 TwoWay (要求-回覆或雙工)，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# BindingDoesntSupportDatagramButContractRequires
source: Contract does not allow Session, but Binding '{0}' does not support Datagram or is not configured properly to support it.
cs: Kontrakt nepovoluje vlastnost Session, ale vazba {0} nepodporuje Datagram nebo není pro jeho podporu správně nakonfigurována.
de: Der Vertrag lässt "Session" nicht zu, aber die Bindung "{0}" unterstützt kein Datagramm, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: El contrato no permite Session, pero el enlace "{0}" no admite Datagram o no está configurado correctamente para admitirlo.
fr: Le contrat n'autorise pas la session, mais la liaison '{0}' ne prend pas en charge le datagramme ou n'est pas correctement configurée pour le prendre en charge.
it: Il contratto non consente Session, ma il binding '{0}' non supporta Datagram o non è configurato correttamente per supportarlo.
ja: コントラクトは Session を許可していませんが、バインド '{0}' は Datagram をサポートしていないか、サポートするように正しく構成されていません。
ko: 계약이 Session을 허용하지 않지만 '{0}' 바인딩이 데이터그램을 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Kontrakt nie umożliwia stosowania elementu Session, ale element Binding „{0}” nie obsługuje elementu Datagram lub jest niepoprawnie skonfigurowany do jego obsługi.
pt_br: O contrato não permite Sessão, mas a Associação '{0}' não dá suporte à Datagrama ou não está configurada adequadamente para dar suporte a isso.
tr: Anlaşma Oturuma izin vermiyor, ancak '{0}' Bağlaması Veri Birimini desteklemiyor ya da bunu destekleyecek biçimde yapılandırılmamış.
zh_hans: 协定不允许会话，但是绑定“{0}”不支持数据报，或者因配置不正确而无法支持数据报。
zh_hant: 合約不允許 Session，但繫結 '{0}' 不支援 Datagram，或因未正確設定而無法支援。

# BindingRequirementsAttributeDisallowsQueuedDelivery1
source: DeliveryRequirementsAttribute disallows QueuedDelivery, but binding for the endpoint with contract '{0}' supports it.
cs: Třída DeliveryRequirementsAttribute zakazuje třídu QueuedDelivery, ale vazba koncového bodu se smlouvou {0} ji podporuje.
de: DeliveryRequirementsAttribute lässt QueuedDelivery nicht zu, die Bindung für den Endpunkt mit Vertrag "{0}" unterstützt dies jedoch.
es: DeliveryRequirementsAttribute no permite QueuedDelivery, pero el enlace del extremo con el contrato '{0}' lo admite.
fr: DeliveryRequirementsAttribute interdit QueuedDelivery, mais la liaison pour le point de terminaison avec le contrat '{0}' prend cet élément en charge.
it: DeliveryRequirementsAttribute non consente QueuedDelivery, ma il binding per l'endpoint con il contratto '{0}' lo supporta.
ja: DeliveryRequirementsAttribute は QueuedDelivery を許可していませんが、コントラクト '{0}' を持つエンドポイントのバインドはこれをサポートしています。
ko: DeliveryRequirementsAttribute에서 QueuedDelivery가 허용되지 않지만 '{0}' 계약을 가진 끝점에 대한 바인딩이 이를 지원합니다.
pl: Element DeliveryRequirementsAttribute nie umożliwia stosowania elementu QueuedDelivery, ale obsługuje go powiązanie dla punktu końcowego z kontraktem „{0}”.
pt_br: DeliveryRequirementsAttribute não permite QueuedDelivery, mas o suporte necessário é fornecido pela associação referente ao ponto de extremidade com o contrato '{0}'.
tr: DeliveryRequirementsAttribute, QueuedDelivery öğesine izin vermiyor, ancak '{0}' sözleşmesi olan bitiş noktası bağlaması öğeyi destekliyor.
zh_hans: DeliveryRequirementsAttribute 不允许 QueuedDelivery，但是终结点与协定“{0}”的绑定支持它。
zh_hant: DeliveryRequirementsAttribute 不允許 QueuedDelivery，但具有合約 '{0}' 的端點繫結有支援。

# BindingRequirementsAttributeRequiresQueuedDelivery1
source: DeliveryRequirementsAttribute requires QueuedDelivery, but binding for the endpoint with contract '{0}' doesn't support it or isn't configured properly to support it.
cs: Třída DeliveryRequirementsAttribute vyžaduje třídu QueuedDelivery, ale vazba koncového bodu se smlouvou {0} ji nepodporuje, nebo není pro její podporu správně nakonfigurována.
de: DeliveryRequirementsAttribute erfordert QueuedDelivery, die Bindung für den Endpunkt mit Vertrag "{0}" unterstützt dies jedoch nicht, oder die Unterstützung wurde nicht ordnungsgemäß konfiguriert.
es: DeliveryRequirementsAttribute requiere QueuedDelivery, pero el enlace del extremo con el contrato '{0}' no lo admite o no está configurado correctamente para admitirlo.
fr: DeliveryRequirementsAttribute exige QueuedDelivery, mais la liaison pour le point de terminaison avec le contrat '{0}' ne prend pas cet élément en charge ou elle n'est pas correctement configurée pour cela.
it: DeliveryRequirementsAttribute richiede QueuedDelivery, ma il binding per l'endpoint con il contratto '{0}' non lo supporta o non è configurato correttamente per supportarlo.
ja: DeliveryRequirementsAttribute には QueuedDelivery が必要ですが、コントラクトが '{0}' のエンドポイントへのバインドはこれをサポートしていないか、サポートするように正しく構成されていません。
ko: DeliveryRequirementsAttribute에 QueuedDelivery가 필요하지만 '{0}' 계약을 가진 끝점에 대한 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Element DeliveryRequirementsAttribute wymaga elementu QueuedDelivery, ale powiązanie dla punktu końcowego z kontraktem „{0}” go nie obsługuje lub nie jest poprawnie skonfigurowane do jego obsługi.
pt_br: DeliveryRequirementsAttribute requer QueuedDelivery, mas o suporte necessário não é fornecido pela associação referente ao ponto de extremidade com o contrato '{0}' ou sua configuração para suporte não está correta.
tr: DeliveryRequirementsAttribute için QueuedDelivery öğesi gerekli, ancak '{0}' sözleşmesi olan bitiş noktası bağlaması öğeyi desteklemiyor ya da destekleyecek biçimde yapılandırılmamış.
zh_hans: DeliveryRequirementsAttribute 需要 QueuedDelivery，但是终结点与协定“{0}”的绑定不支持它或者因为配置不正确而不支持它。
zh_hant: DeliveryRequirementsAttribute 需要 QueuedDelivery，但具有合約 '{0}' 的端點繫結不支援，或因未正確設定而無法支援。

# BodyWriterCanOnlyBeWrittenOnce
source: The body writer does not support writing more than once because it is not buffered.
cs: Modul pro zápis zpráv nepodporuje více než jeden zápis, protože nemá vyrovnávací paměť.
de: Das Body Writer-Objekt unterstützt nur einmaliges Schreiben, weil es nicht gepuffert ist.
es: El escritor del cuerpo no admite la posibilidad de escribir más de una vez, ya que no se almacena en búfer.
fr: L'enregistreur de corps ne prend l'écriture en charge qu'une seule fois, car il n'est pas mis en mémoire tampon.
it: Il body writer non supporta la scrittura multipla perché non è memorizzato nel buffer.
ja: 本文のライターは、バッファーされていないため、1 度しか書き込めません。
ko: 본문 기록기가 버퍼링되지 않았기 때문에 두 번 이상 기록하는 것을 지원하지 않습니다.
pl: Procedura zapisu treści nie obsługuje zapisu wielokrotnego, ponieważ nie jest buforowana.
pt_br: O gravador de corpo não dá suporte para mais de uma gravação porque não está armazenado em buffer.
tr: Gövde yazıcısı, ara belleğe alınmadığından birkaç kez yazmayı desteklemiyor.
zh_hans: 正文编写器不支持多次写入，因为它未进行缓冲处理。
zh_hant: 內文寫入器未經緩衝處理，因此不支援多次寫入。

# BodyWriterReturnedIsNotBuffered
source: The body writer returned from OnCreateBufferedCopy was not buffered.
cs: Modul pro zápis zpráv vrácený z třídy OnCreateBufferedCopy neměl vyrovnávací paměť.
de: Das von OnCreateBufferedCopy zurückgegebene Body Writer-Objekt war nicht gepuffert.
es: El escritor del cuerpo devuelto por OnCreateBufferedCopy no se almacenó en búfer.
fr: L'enregistreur de corps retourné à partir de OnCreateBufferedCopy n'a pas été mis en mémoire tampon.
it: Il body writer restituito da OnCreateBufferedCopy non era memorizzato nel buffer.
ja: OnCreateBufferedCopy から返された本文のライターはバッファーされていません。
ko: OnCreateBufferedCopy에서 반환된 본문 기록기가 버퍼링되지 않았습니다.
pl: Procedura zapisu zwrócona z elementu OnCreateBufferedCopy nie była buforowana.
pt_br: O gravador de corpo retornado de OnCreateBufferedCopy não estava armazenado em buffer.
tr: OnCreateBufferedCopy öğesinden döndürülen gövde yazıcısı ara belleğe alınmadı.
zh_hans: OnCreateBufferedCopy 返回的正文编写器未进行缓冲处理。
zh_hant: 從 OnCreateBufferedCopy 傳回的內文寫入器未經緩衝處理。

# BootstrapSecurityBindingElementNotSet
source: The security binding element for bootstrap security was not specified on '{0}'.
cs: Element vazby zabezpečení pro zabezpečení samozavádění nebyl v {0} určen.
de: Das Sicherheitsbindungselement für die Bootstrapsicherheit wurde auf "{0}" nicht angegeben.
es: No se especificó el elemento de enlace de seguridad para la seguridad de arranque en '{0}'.
fr: L'élément de liaison de sécurité pour la sécurité du démarrage n'a pas été spécifié sur '{0}'.
it: L'elemento associazione di sicurezza per la sicurezza bootstrap non è stato specificato su '{0}'.
ja: ブートストラップ セキュリティのセキュリティ バインド要素が '{0}' で指定されませんでした。
ko: 부트스트랩 보안을 위한 보안 바인딩 요소가 '{0}'에 지정되지 않았습니다.
pl: Element powiązania zabezpieczeń dla zabezpieczeń ładowania początkowego nie został określony w „{0}”.
pt_br: O elemento de associação de segurança para segurança de inicialização não foi especificado em '{0}'.
tr: Önyükleme güvenliği için güvenlik bağlama öğesi '{0}' üstünde belirtilmedi.
zh_hans: “{0}”中未指定引导安全性的安全性绑定元素。
zh_hant: '{0}' 上未指定啟動安裝安全性之安全性繫結元素。
