Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# ClaimTypeCannotBeEmpty
source: The claimType cannot be an empty string.
cs: Třídou claimType nesmí být prázdný řetězec.
de: Der ClaimType darf keine leere Zeichenfolge sein.
es: ClaimType no puede ser una cadena vacía.
fr: La valeur de claimType ne peut pas être une chaîne de caractères vide.
it: L'elemento ClaimType non può essere una stringa vuota.
ja: claimType を空の文字列にすることはできません。
ko: claimType은 빈 문자열일 수 없습니다.
pl: Element claimType nie może być ciągiem pustym.
pt_br: O claimType não pode ser uma cadeia de caracteres vazia.
tr: claimType boş bir dize olamaz.
zh_hans: claimType 不能为空字符串。
zh_hant: claimType 不可為空字串。

# ClientCertificateNotProvidedOnClientCredentials
source: The client certificate is not provided. Specify a client certificate in ClientCredentials.
cs: Certifikát klienta není zadán. Určete certifikát klienta ve třídě ClientCredentials.
de: Das Clientzertifikat wurde nicht bereitgestellt. Geben Sie in ClientCredentials ein Clientzertifikat an.
es: No se proporciona el certificado de cliente. Especifique un certificado de cliente en ClientCredentials.
fr: Le certificat client n'est pas fourni. Spécifiez un certificat client dans ClientCredentials.
it: Il certificato client non è stato fornito. Specificare un certificato client in ClientCredentials.
ja: クライアントの証明書が提供されていません。クライアントの証明書を ClientCredentials で指定してください。
ko: 클라이언트 인증서가 제공되지 않았습니다. ClientCredentials에서 클라이언트 인증서를 지정하세요.
pl: Nie zapewniono certyfikatu klienta. Określ certyfikat klienta w obiekcie ClientCredentials.
pt_br: O certificado do cliente não foi fornecido. Especifique o certificado do cliente em ClientCredentials.
tr: İstemci sertifikası sağlanmadı. ClientCredentials içinde bir istemci sertifikası belirtin.
zh_hans: 未提供客户端证书。请在 ClientCredential 中指定一个客户端证书。
zh_hant: 未提供用戶端的憑證。請在 ClientCredentials 中指定用戶端憑證。

# ClientCredentialTypeMustBeSpecifiedForMixedMode
source: ClientCredentialType.None is not valid for the TransportWithMessageCredential security mode. Specify a message credential type or use a different security mode.
cs: Třída ClientCredentialType.None není pro režim zabezpečení TransportWithMessageCredential platný. Určete typ přihlašovacích údajů zprávy nebo použijte jiný režim zabezpečení.
de: ClientCredentialType.None ist für den TransportWithMessageCredential-Sicherheitsmodus ungültig. Geben Sie einen Anmeldeinformationstyp für Nachrichten an, oder verwenden Sie einen anderen Sicherheitsmodus.
es: ClientCredentialType.None no es válido para el modo de seguridad TransportWithMessageCredential. Especifique un tipo de credencial de mensaje o use otro modo de seguridad.
fr: ClientCredentialType.None est non valide pour le mode de sécurité TransportWithMessageCredential. Indiquez un type pour les informations d'identification de message ou utilisez un autre mode de sécurité.
it: L'elemento ClientCredentialType.None non è valido per la modalità di sicurezza TransportWithMessageCredential. Specificare un tipo di credenziali messaggio o usare una modalità di sicurezza diversa.
ja: ClientCredentialType.None は、TransportWithMessageCredential セキュリティ モードでは無効です。メッセージ資格情報の種類を指定するか、別のセキュリティ モードを使用してください。
ko: ClientCredentialType.None은 TransportWithMessageCredential 보안 모드에 사용할 수 없습니다. 메시지 자격 증명 형식을 지정하거나 다른 보안 모드를 사용하세요.
pl: Wartość ClientCredentialType.None jest niepoprawna dla trybu zabezpieczeń TransportWithMessageCredential. Określ typ poświadczeń komunikatu lub użyj innego trybu zabezpieczeń.
pt_br: ClientCredentialType.None inválido para o modo de segurança TransportWithMessageCredential. Especifique um tipo de credencial de mensagem ou use um modo de segurança diferente.
tr: ClientCredentialType.None, TransportWithMessageCredential güvenlik modu için geçerli değil. Bir ileti kimlik bilgisi türü belirtin ya da farklı bir güvenlik modu kullanın.
zh_hans: ClientCredentialType.None 对于 TransportWithMessageCredential 安全模式无效。请指定消息凭据类型或使用其他安全模式。
zh_hant: ClientCredentialType.None 對於 TransportWithMessageCredential 安全性模式無效。請指定訊息認證類型，或使用不同的安全性模式。

# ClientCredentialsUnableToCreateLocalTokenProvider
source: ClientCredentials cannot create a local token provider for token requirement {0}.
cs: Třída ClientCredentials nemůže vytvořit místního zprostředkovatele tokenu pro požadavek tokenu {0}.
de: ClientCredentials kann keinen lokalen Tokenanbieter für die Tokenanforderung {0} erstellen.
es: ClientCredentials no puede crear un proveedor de tokens local para el requisito de token {0}.
fr: ClientCredentials ne peut pas créer de fournisseur de jetons local pour les exigences de jeton {0}.
it: L'elemento ClientCredentials non può creare un provider di token locale per il requisito di token {0}.
ja: ClientCredentials が、トークンの要件 {0} のローカルのトークン プロバイダーを作成できません。
ko: ClientCredentials가 토큰 요구 사항 {0}에 대한 로컬 토큰 공급자를 만들 수 없습니다.
pl: Obiekt ClientCredentials nie może utworzyć lokalnego dostawcy tokenów dla wymagania tokenu {0}.
pt_br: ClientCredentials não pode criar um provedor de token local para o requisito de token {0}.
tr: ClientCredentials, {0} belirteç gereksinimi için yerel bir belirteç sağlayıcısı oluşturamıyor.
zh_hans: ClientCredential 无法为令牌要求 {0} 创建本地令牌提供程序。
zh_hant: ClientCredentials 無法為權杖需求 {0} 建立本機權杖提供者。

# ClientRuntimeRequiresFormatter0
source: The ClientOperation '{0}' requires Formatter, since SerializeRequest and DeserializeReply are not both false.
cs: Třída ClientOperation {0} vyžaduje formátovací modul, protože třída SerializeRequest a DeserializeReply nemají obě hodnotu false.
de: Der ClientOperation "{0}" erfordert einen Formatierer, da SerializeRequest und DeserializeReply nicht beide "false" sind.
es: ClientOperation "{0}" requiere Formatter, ya que SerializeRequest y DeserializeReply no son false.
fr: L'entité ClientOperation '{0}' nécessite Formatter, car SerializeRequest et DeserializeReply n'ont pas tous les deux la valeur false.
it: Con l'elemento ClientOperation '{0}' è richiesto Formatter perché SerializeRequest e DeserializeReply non sono entrambi false.
ja: SerializeRequest と DeserializeReply の両方が False ではないため、ClientOperation '{0}' にはフォーマッタが必要です。
ko: SerializeRequest 및 DeserializeReply가 둘 다 false가 아니므로 ClientOperation '{0}'에 포맷터가 필요합니다.
pl: Element ClientOperation „{0}” wymaga wartości Formatter, ponieważ SerializeRequest i DeserializeReply mają wartość false.
pt_br: ClientOperation '{0}' requer o Formatter, pois SerializeRequest e DeserializeReply não são ambos false.
tr: SerializeRequest ve DeserializeReply değerlerinin her ikisi de false olmadığından, ClientOperation '{0}' Formatter gerektirir.
zh_hans: ClientOperation“{0}”需要格式化程序，因为 SerializeRequest 和 DeserializeReply 并不都是 False。
zh_hant: 因為 SerializeRequest 與 DeserializeReply 並非兩者皆為 false，所以 ClientOperation '{0}' 需要 Formatter。

# ClientSecurityCloseTimeout
source: The client's security session did not receive a 'close response' message from the service within the configured timeout ({0}).
cs: Relace zabezpečení klienta nepřijala od služby zprávu zavřít odpověď v nakonfigurovaném časového limitu ({0}).
de: Die Sicherheitssitzung des Clients hat innerhalb des konfigurierten Zeitlimits ({0}) keine Nachricht "Antwort schließen" vom Dienst empfangen.
es: La sesión de seguridad del cliente no recibió un mensaje 'close response' del servicio en el tiempo de espera configurado ({0}).
fr: La session de sécurité client n'a reçu aucun message de fermeture de réponse du service dans le délai d'attente imparti ({0}).
it: La sessione di sicurezza del client non ha ricevuto un messaggio di risposta di chiusura dal servizio entro il timeout configurato ({0}).
ja: クライアントのセキュリティ セッションで、構成されたタイムアウト時間 ({0}) 内にサービスから '終了応答' メッセージが受信されませんでした。
ko: 클라이언트의 보안 세션이 구성된 시간 제한({0}) 내에 서비스로부터 'close response' 메시지를 수신하지 않았습니다.
pl: Sesja zabezpieczeń klienta nie odebrała komunikatu zamknięcia odpowiedzi („close response”) z usługi w ciągu skonfigurowanego limitu czasu ({0}).
pt_br: A sessão de segurança do cliente não recebeu uma mensagem de 'resposta de fechamento' a partir do serviço dentro do tempo limite configurado ({0}).
tr: İstemcinin güvenlik oturumu, yapılandırılan zaman aşımı süresi ({0}) içinde hizmetten bir 'yanıt kapatma' iletisi almadı.
zh_hans: 客户端的安全会话在配置的超时({0})之内未从服务接收到“关闭响应”消息。
zh_hant: 用戶端安全性工作階段未在設定的逾時 ({0}) 內收到來自服務的「關閉回應」訊息。

# ClientSecurityNegotiationTimeout
source: Client is unable to finish the security negotiation within the configured timeout ({0}). The current negotiation leg is {1} ({2}).
cs: Klient nemůže dokončit vyjednávání zabezpečení v nakonfigurovaném časovém limitu ({0}). Aktuální fáze vyjednávání je {1} ({2}).
de: Der Client kann die Sicherheitsaushandlung nicht innerhalb des konfigurierten Timeouts ({0}) abschließen. Der aktuelle Aushandlungsabschnitt ist {1} ({2}).
es: El cliente no puede terminar la negociación de seguridad dentro del tiempo de espera configurado ({0}). El tramo de negociación actual es{1} ({2}).
fr: Le client n'est pas en mesure de faire aboutir la négociation de sécurité dans le délai d'attente imparti ({0}). La section de négociation actuelle est {1} ({2}).
it: Il client non è in grado di completare la negoziazione di sicurezza entro il timeout configurato ({0}). La sezione corrente di negoziazione è {1} ({2}).
ja: クライアントは構成されているタイムアウト時間内 ({0}) にセキュリティ ネゴシエーションを完了できません。現在のネゴシエーション段階は {1} ({2}) です。
ko: 클라이언트가 구성된 시간 제한({0}) 내에 보안 협상을 끝낼 수 없습니다. 현재 협상 레그는 {1}({2})입니다.
pl: Klient nie może zakończyć negocjacji zabezpieczeń w ciągu konfigurowanego limitu czasu ({0}). Bieżący etap negocjacji to {1} ({2}).
pt_br: O cliente não pode concluir a negociação de segurança dentro do tempo limite configurado ({0}). O segmento de negociação atual é {1} ({2}).
tr: İstemci, yapılandırılan zaman aşımı süresi ({0}) içinde güvenlik anlaşmasını tamamlayamadı. Geçerli anlaşma bacağı: {1} ({2}).
zh_hans: 客户端无法在配置的超时({0})内完成安全协商。当前的协商段为 {1} ({2})。
zh_hant: 用戶端無法在設定的逾時 ({0}) 內完成安全性交涉。目前的交涉階段為 {1} ({2})。

# ClientSecurityOutputSessionCloseTimeout
source: The client's security session was not able to close its output session within the configured timeout ({0}).
cs: Relace zabezpečení klienta nemohla ukončit svou výstupní relaci v nakonfigurovaném časovém limitu ({0}).
de: Die Sicherheitssitzung des Clients konnte die Ausgabesitzung nicht innerhalb des konfigurierten Timeouts ({0}) schließen.
es: La sesión de seguridad del cliente no pudo cerrar su sesión de salida en el tiempo de espera configurado ({0}).
fr: La session de sécurité du client n'a pas pu fermer sa session de sortie avant la fin du délai d'attente ({0}).
it: La sessione di sicurezza del client non è stata in grado di chiudere la sessione di output entro il timeout configurato ({0}).
ja: クライアントのセキュリティ セッションは、構成されているタイムアウト時間内 ({0}) に出力セッションを閉じることができませんでした。
ko: 클라이언트의 보안 세션이 구성된 시간 제한({0}) 내에 출력 세션을 닫을 수 없습니다.
pl: Sesja zabezpieczeń klienta nie może zamknąć swojej sesji wyjściowej w ciągu skonfigurowanego limitu czasu ({0}).
pt_br: A sessão de segurança do cliente não pôde fechar sua sessão de saída dentro do tempo limite configurado ({0}).
tr: İstemcinin güvenlik oturumu, yapılandırılan zaman aşımı süresi ({0}) içinde çıktı oturumunu kapatamadı.
zh_hans: 客户端的安全会话无法在配置的超时({0})之内关闭其输出会话。
zh_hant: 用戶端的安全性工作階段無法在設定的逾時 ({0}) 內關閉輸出工作階段。

# ClientSecuritySessionRequestTimeout
source: Client is unable to request the security session within the configured timeout ({0}).
cs: Klient nemůže vyžádat relaci zabezpečení v nakonfigurovaném časovém limitu ({0}).
de: Der Client kann die Sicherheitssitzung nicht innerhalb des konfigurierten Zeitlimits ({0}) anfordern.
es: El cliente no puede solicitar la sesión de seguridad en el tiempo de espera configurado ({0}).
fr: Le client ne peut pas demander la session de sécurité avant la fin du délai d'attente ({0}).
it: Il client non è in grado di richiedere la sessione di sicurezza entro il timeout configurato ({0}).
ja: クライアントは構成されているタイムアウト時間内 ({0}) にセキュリティ セッションを要求できません。
ko: 클라이언트가 구성된 시간 제한({0}) 내에 보안 세션을 요청할 수 없습니다.
pl: Klient nie może żądać sesji zabezpieczeń w ciągu skonfigurowanego limitu czasu ({0}).
pt_br: O cliente não pode solicitar a sessão de segurança dentro do tempo limite configurado ({0}).
tr: İstemci, yapılandırılan zaman aşımı süresi ({0}) içinde güvenlik oturumu isteği gönderemedi.
zh_hans: 客户端无法在配置的超时({0})之内请求安全会话。
zh_hant: 用戶端無法在設定的逾時 ({0}) 內要求安全性工作階段。

# ClientWebSocketFactory_CreateWebSocketFailed
source: An error occurred when creating the WebSocket with the factory of type '{0}'. See the inner exception for details.
cs: Při vytváření objektu WebSocket s použitím objektu pro vytváření typu {0} došlo k chybě. Další informace naleznete v popisu vnitřní výjimky.
de: Fehler beim Erstellen des WebSockets mit der Factory vom Typ "{0}". Details finden Sie in der inneren Ausnahme.
es: Error al crear el WebSocket con el generador de tipo "{0}". Consulte la excepción interna para obtener información detallada.
fr: Erreur durant la création du WebSocket avec la fabrique de type '{0}'. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la creazione dell'elemento WebSocket con la factory di tipo '{0}'. Per dettagli, vedere l'eccezione interna.
ja: 型 '{0}' のファクトリで WebSocket を作成しているときにエラーが発生しました。詳細については、内部例外を参照してください。
ko: 팩터리 형식이 '{0}'인 WebSocket을 만드는 동안 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas tworzenia obiektu WebSocket za pomocą fabryki typu „{0}”. Aby uzyskać szczegółowe informacje, zobacz wyjątek wewnętrzny.
pt_br: Erro ao criar o WebSocket com a fábrica do tipo '{0}'. Consulte a exceção interna para obter detalhes.
tr: '{0}' fabrika türünde WebSocket oluşturulurken hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 创建包含类型为“{0}”的工厂的 WebSocket 时发生错误。请参见内部异常了解详细信息。
zh_hant: 建立 Factory 類型為 '{0}' 的 WebSocket 時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ClientWebSocketFactory_InvalidSubProtocol
source: The WebSocket returned by the factory of type '{0}' has the SubProtocol '{1}' that doesn't match the requested SubProtocol value '{2}'.
cs: Objekt WebSocket vrácený objektem pro vytváření typu {0} má SubProtocol {1}, který neodpovídá požadované hodnotě SubProtocol {2}.
de: Der von der Factory vom Typ "{0}" zurückgegebene WebSocket weist das SubProtocol "{1}" auf, das nicht mit dem angeforderten SubProtocol-Wert "{2}" übereinstimmt.
es: El WebSocket devuelto por el generador de tipo "{0}" tiene el SubProtocol "{1}" que no coincide con el valor de SubProtocol solicitado "{2}".
fr: Le WebSocket retourné par la fabrique de type '{0}' comporte le SubProtocol '{1}' qui ne correspond pas à la valeur SubProtocol demandée '{2}'.
it: L'elemento SubProtocol '{1}' dell'elemento WebSocket restituito dalla factory di tipo '{0}' non corrisponde al valore dell'elemento SubProtocol richiesto '{2}'.
ja: 型 '{0}' のファクトリから返された WebSocket に、要求された SubProtocol 値 '{2}' と一致しない SubProtocol '{1}' があります。
ko: 팩터리 형식 '{0}'에서 반환된 WebSocket의 하위 프로토콜 '{1}'이(가) 요청한 하위 프로토콜 값 '{2}'과(와) 일치하지 않습니다.
pl: Obiekt WebSocket zwrócony przez fabrykę typu „{0}” ma element SubProtocol o wartości „{1}”, która jest niezgodna z żądaną wartością elementu SubProtocol równą „{2}”.
pt_br: O WebSocket retornado pela fábrica do tipo '{0}' tem o SubProtocolo '{1}', que não corresponde ao valor '{2}' do SubProtocolo solicitado.
tr: '{0}' fabrika türü tarafından döndürülen WebSocket istenen '{2}' SubProtocol değeriyle eşleşmeyen '{1}' SubProtocol'üne sahip.
zh_hans: 由类型为“{0}”工厂返回的 WebSocket 包含 SubProtocol“{1}”，该子协议与请求的 SubProtocol 值“{2}”不符。
zh_hant: 類型為 '{0}' 的 Factory 所傳回的 WebSocket 具有的 SubProtocol '{1}' 與要求的 SubProtocol 值 '{2}' 不符。

# ClientWebSocketFactory_InvalidWebSocket
source: WebSocket creation failed. The '{0}' returned a WebSocket that is either null or not opened.
cs: Vytvoření objektu WebSocket se nezdařilo. {0} vrátil objekt WebSocket, která má buď hodnotu null, nebo není otevřený.
de: Fehler bei der Erstellung des WebSockets. Von "{0}" wurde ein WebSocket zurückgegeben, der NULL oder nicht geöffnet ist.
es: Error al crear el WebSocket. El "{0}" devolvió un WebSocket que es nulo o no está abierto.
fr: Échec de la création du WebSocket. '{0}' a retourné un WebSocket qui est soit une valeur null, soit non ouvert.
it: La creazione dell'elemento WebSocket non è riuscita. '{0}' ha restituito un elemento WebSocket Null o non aperto.
ja: WebSocket の作成に失敗しました。'{0}' から、null であるか開くことのできない WebSocket が返されました。
ko: WebSocket을 만들지 못했습니다. '{0}'에서 Null이거나 열리지 않은 WebSocket을 반환했습니다.
pl: Tworzenie obiektu WebSocket nie powiodło się. Fabryka „{0}” zwróciła obiekt WebSocket, który ma wartość null lub nie został otwarty.
pt_br: Falha na criação do WebSocket. O '{0}' retornou um WebSocket que é nulo ou não está aberto.
tr: WebSocket oluşturulamadı. '{0}' null veya açılmamış bir WebSocket döndürdü.
zh_hans: WebSocket 创建失败。“{0}”返回的 WebSocket 为 null 或未打开。
zh_hant: WebSocket 建立失敗。'{0}' 傳回的 WebSocket 為 Null 或未開啟。

# CloneNotImplementedCorrectly
source: Clone() was not implemented properly by '{0}'. The cloned object was '{1}'.
cs: Metoda Clone() nebyla třídou {0} správně implementována. Klonovaný objekt byl {1}.
de: Clone() wurde von "{0}" nicht korrekt implementiert. Geklontes Objekt: "{1}".
es: "{0}" no implementó Clone() correctamente. El objeto clonado fue "{1}".
fr: Clone() n'a pas été implémenté correctement par '{0}'. L'objet cloné était '{1}'.
it: Clone() non è stato implementato correttamente da '{0}'. L'oggetto clonato era '{1}'.
ja: Clone() は '{0}' によって適切に実装されませんでした。複製されたオブジェクトは '{1}' です。
ko: Clone()이 '{0}'에 의해 올바르게 구현되지 않았습니다. 복제된 개체는 '{1}'입니다.
pl: Metoda Clone() nie została zaimplementowana poprawnie przez „{0}”. Sklonowany obiekt to „{1}”.
pt_br: Clone() não foi corretamente implementado por '{0}'. O objeto clonado era '{1}'.
tr: Clone(), '{0}' tarafından düzgün biçimde uygulanmadı. Kopyalanan nesne: '{1}'.
zh_hans: “{0}”未正确实现 Clone()。克隆的对象为“{1}”。
zh_hant: '{0}' 未正確實作 Clone()。複製的物件為 '{1}'。

# CloseOutputSessionErrorReason
source: An unexpected error occurred while attempting to close the output half of the duplex reliable session.
cs: Došlo k neočekávané chybě během pokusu o ukončení výstupní poloviny duplexní stabilní relace.
de: Beim Versuch, die Ausgabehälfte der zuverlässigen Duplexsitzung zu schließen, ist ein unerwarteter Fehler aufgetreten.
es: Error inesperado al intentar cerrar la mitad de salida de la sesión confiable dúplex.
fr: Une erreur inattendue s'est produite lors de la tentative de fermeture de la partie émission de la session fiable duplex.
it: Errore imprevisto durante il tentativo di chiudere la parte output della sessione affidabile duplex.
ja: 信頼性の高い二重セッションの出力半分を閉じようとしいるときに、予期しないエラーが発生しました。
ko: 신뢰할 수 있는 이중 세션의 절반 출력을 닫는 동안 오류가 발생했습니다.
pl: Podczas próby zamknięcia wyjściowej połowy niezawodnej sesji dupleksowej wystąpił niespodziewany błąd.
pt_br: Erro inesperado ao tentar fechar a metade de saída da sessão segura duplex.
tr: Çift yönlü oturumun çıktı yarısı kapatılmaya çalışılırken beklenmeyen bir hata oluştu.
zh_hans: 尝试在双工可靠会话的一半时关闭输出，发生意外错误。
zh_hant: 嘗試關閉雙工可靠工作階段的輸出部份時，發生意外的錯誤。

# CloseTimedOut
source: Close timed out after {0}. Increase the timeout value passed to the call to Close or increase the CloseTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
cs: Ukončení bylo načasováno po {0}. Zvyšte hodnotu časového intervalu předaného do volání k ukončení nebo zvyšte hodnotu CloseTimeout na vazbě. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Schließen ist nach {0} ein Timeout aufgetreten. Erhöhen Sie den an den Close-Aufruf übergebenen Zeitlimitwert, oder erhöhen Sie den CloseTimeout-Wert für die Bindung. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de Close después de {0}. Aumente el valor de tiempo de espera pasado a la llamada a Close o aumente el valor CloseTimeout en el enlace. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Close a dépassé le délai d'expiration après {0}. Augmentez la valeur du délai d'expiration passée à l'appel à Close ou augmentez la valeur de CloseTimeout sur la liaison. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di Close dopo {0}. Aumentare il valore di timeout passato alla chiamata a Close o aumentare il valore di CloseTimeout nell'elemento Binding. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: Close 処理は {0} 後にタイムアウトしました。Close の呼び出しに渡されるタイムアウト値を増やすか、Binding の CloseTimeout 値を増やしてください。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {0} 이후에 Close의 시간이 초과되었습니다. Close의 호출에 전달되는 시간 제한 값을 늘리거나 바인딩에서 CloseTimeout 값을 늘리세요. 이 작업에 할당된 시간이 더 긴 시간 제한의 일부분일 수 있습니다.
pl: Po {0} upłynął limit czasu oczekiwania na akcję Close. Zwiększ wartość limitu czasu przekazywaną w wywołaniu Close lub wartość CloseTimeout w obiekcie Binding. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: Tempo limite de fechamento atingido após {0}. Aumente o valor de tempo limite passado à chamada para Fechar ou aumente o valor de CloseTimeout na Associação. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} sonra Close işlemi zaman aşımına uğradı. Close çağrısına geçirilen zaman aşımı değerini artırın ya da Binding üstündeki CloseTimeout değerini artırın. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 关闭操作在 {0} 之后超时。请增大传递给 Close 调用的超时值，或增大绑定上的 CloseTimeout 值。分配给此操作的时间可能比超时长。
zh_hant: Close 於 {0} 之後逾時。請加大傳遞至 Close 呼叫的逾時值，或加大繫結上的 CloseTimeout 值。分配給此作業的時間可能是較長逾時的一部分。

# CommunicationObjectAborted1
source: The communication object, {0}, cannot be used for communication because it has been Aborted.
cs: Objekt komunikace, {0}, nelze použít pro komunikaci, protože ta byla ukončena.
de: Das Kommunikationsobjekt {0} kann nicht zur Kommunikation verwendet werden, da es abgebrochen wurde.
es: El objeto de comunicación, {0}, no se puede usar para la comunicación porque se anuló.
fr: L'objet de communication {0} ne peut pas être utilisé pour la communication, car il a été annulé.
it: Non è possibile usare l'oggetto comunicazione {0} per la comunicazione perché è stato impostato su Aborted.
ja: 通信オブジェクト {0} は状態が Aborted であるため、通信に使用できません。
ko: 통신 개체 {0}은(는) 중단되었기 때문에 통신에 사용할 수 없습니다.
pl: Obiektu komunikacyjnego {0} nie można użyć do komunikacji, ponieważ została na nim wykonana operacja przerwania.
pt_br: O objeto de comunicação, {0}, não pode ser usado para comunicação porque foi Anulado.
tr: Aborted olduğundan, {0} iletişim nesnesi iletişim için kullanılamıyor.
zh_hans: 无法将通信对象 {0} 用于通信，因为它已经被中止。
zh_hant: 因為通訊物件 {0} 已中止，所以無法用於通訊。
