Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# WebSocketVersionMismatchFromServer
source: The server didn't accept the connection request. It is possible that the WebSocket protocol version on your client doesn't match the one on the server('{0}').
cs: Server nepřijal žádost o připojení. Verze protokolu WebSocket na straně klienta se pravděpodobně neshoduje s nastavením na straně serveru ({0}).
de: Der Server hat die Verbindungsanforderung nicht akzeptiert. Möglicherweise stimmt die Version des WebSocket-Protokolls auf dem Client nicht mit der auf dem Server ("{0}") überein.
es: El servidor no aceptó la solicitud de conexión. Es posible que la versión del subprotocolo WebSocket de su cliente no coincida con el del servidor ("{0}").
fr: Le serveur a refusé la demande de connexion. Il est possible que la version du protocole WebSocket sur votre client ne corresponde pas à la version située sur le serveur ('{0}').
it: Il server non ha accettato la richiesta di connessione. È possibile che la versione del protocollo WebSocket nel client non corrisponda a quella nel server ('{0}').
ja: サーバーが接続要求を受け入れませんでした。クライアントの WebSocket プロトコルのバージョンが、サーバー ('{0}') のものと一致していない可能性があります。
ko: 서버에서 연결 요청을 수락하지 않았습니다. 클라이언트의 WebSocket 프로토콜 버전이 서버의 프로토콜 버전('{0}')과 일치하지 않을 수 있습니다.
pl: Serwer nie zaakceptował żądania połączenia. Być może wersja protokołu WebSocket używana przez klienta jest niezgodna z wersją używaną przez serwer („{0}”).
pt_br: O servidor não aceitou a solicitação de conexão. É possível que a versão do protocolo WebSocket no cliente não corresponda à versão no servidor ('{0}').
tr: Sunucu, bağlantı isteğini kabul etmedi. İstemciniz üzerindeki WebSocket protokol sürümü, sunucudaki ('{0}') ile eşleşmiyor olabilir.
zh_hans: 服务器不接受连接请求。有可能是因为客户端上 WebSocket 协议的版本与服务器上该协议的版本({0})不匹配。
zh_hant: 伺服器未接受連線要求。可能是用戶端的 WebSocket 通訊協定版本與伺服器的版本 ('{0}') 不符。

# WriteBufferOverflow
source: An internal error has occurred. Overflow on MIME writer buffer.
cs: Došlo k vnitřní chybě. Přetečení vyrovnávací paměti zapisovací funkce MIME.
de: Interner Fehler. Ein Überlauf des MIME-Writer-Puffers hat stattgefunden.
es: Error interno. Desbordamiento del búfer del escritor MIME.
fr: Une erreur interne s'est produite. Dépassement de la capacité de la mémoire tampon de l'enregistreur MIME.
it: Errore interno. Overflow del buffer del writer MIME.
ja: 内部エラーが発生しました。MIME ライター バッファーのオーバーフローです。
ko: 내부 오류가 발생했습니다. MIME 작성기 버퍼가 오버플로되었습니다.
pl: Wystąpił błąd wewnętrzny. Przepełnienie buforu zapisu MIME.
pt_br: Erro interno. Houve estouro no buffer de gravação do MIME.
tr: Bir iç hata oluştu. MIME yazıcı arabelleğinde taşma var.
zh_hans: 出现内部错误。MIME 编写器缓冲区溢出。
zh_hant: 發生內部錯誤。MIME 寫入器緩衝區上發生溢位。

# WriteNotSupportedOnStream
source: Write not supported on stream '{0}'.
cs: Zápis není u streamu {0} podporovaný.
de: Für den Datenstrom "{0}" wird der Schreibzugriff nicht unterstützt.
es: No se admite la escritura en la secuencia '{0}'.
fr: L'écriture n'est pas prise en charge sur le flux '{0}'.
it: Scrittura non supportata sul flusso '{0}'.
ja: ストリーム '{0}' での書き込みはサポートされていません。
ko: 스트림 '{0}'에서 쓰기가 지원되지 않습니다.
pl: Nieobsługiwany zapis w strumieniu „{0}”.
pt_br: Não há suporte para gravação no fluxo '{0}'.
tr: '{0}' akışında Write desteklenmez.
zh_hans: 流“{0}”不支持写入。
zh_hant: 資料流 '{0}' 上不支援寫入。

# WrongIdentifierFault
source: The remote endpoint has sent an fault message with an unexpected sequence identifier over a session. The fault may be intended for a different session. The fault reason is: {0} The reliable session was faulted.
cs: Vzdálený koncový bod odeslal přes relaci chybovou zprávu s neočekávaným identifikátorem sekvence. Je možné, že je chyba určena pro jinou relaci. Důvod chyby je: {0} Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat eine Fehlernachricht mit einem unerwarteten Sequenzbezeichner über eine Sitzung gesendet. Der Fehler bezog sich möglicherweise auf eine andere Sitzung. Fehlerursache: {0} Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto envió un mensaje de error con un identificador de secuencia inesperado en una sesión. Es posible que el error corresponda a una sesión diferente. La razón del error es: {0}. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a envoyé un message de faute avec un identificateur de séquence inattendu sur une session. La faute pourrait concerner une autre session. La raison de la faute est : {0} La session fiable a généré une erreur.
it: L'endpoint remoto ha inviato un messaggio di errore con un identificatore di sequenza imprevisto in una sessione. È possibile che l'errore fosse destinato a una sessione diversa. Il motivo dell'errore è: {0} Sessione affidabile non riuscita.
ja: リモート エンドポイントは、予期しないシーケンス ID を持つフォールト メッセージをセッション経由で送信しました。このフォールトは異なるセッションを対象にしている可能性があります。フォールトの原因は {0} です。信頼できるセッションは途中終了されました。
ko: 원격 끝점이 세션을 통해 필요하지 않은 시퀀스 식별자가 있는 오류 메시지를 보냈습니다. 오류는 다른 세션을 위한 것일 수 있습니다. 오류 원인은 {0}입니다. 신뢰 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy wysłał komunikat o błędzie o nieoczekiwanym identyfikatorze sekwencji za pośrednictwem sesji. Błąd może dotyczyć innej sesji. Powód błędu: {0} Wystąpił błąd sesji uwierzytelnionej.
pt_br: O ponto de extremidade remoto enviou uma mensagem de falha com um identificador de sequência inesperado em uma sessão. A falha pode ser destinada a uma sessão diferente. O motivo da falha é: {0} Falha na sessão confiável.
tr: Uzak bitiş noktası bir oturumda beklenmeyen bir sıra tanımlayıcısıyla bir hata iletisi gönderdi. Hata başka bir oturum için gönderilmiş olabilir. Hata nedeni: {0} Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点息通过会话发送了一条带有意外序列标识符的错误消。该错误可能是用于其他会话的。错误原因是: {0} 可靠会话出错。
zh_hant: 遠端端點已在工作階段上傳送具有不正確順序識別項的錯誤訊息。可能是其他工作階段的錯誤。錯誤原因: {0} 可靠工作階段發生錯誤。

# WsrmFaultReceived
source: The sequence has been terminated by the remote endpoint. {0} The reliable session was faulted.
cs: Sekvence byla ukončena vzdáleným koncovým bodem. {0} Ve stabilní relaci došlo k chybě.
de: Die Sequenz wurde vom Remoteendpunkt beendet. {0} Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto finalizó la secuencia. {0} Se generó un error en la sesión confiable.
fr: La séquence a été arrêtée par le point de terminaison distant. {0} La session fiable a généré une erreur.
it: La sequenza è stata terminata dall'endpoint remoto. {0} Sessione affidabile non riuscita.
ja: このシーケンスはリモート エンドポイントによって終了されました。{0} 信頼できるセッションは途中終了されました。
ko: 원격 끝점에 의해 시퀀스가 종료되었습니다. {0} 신뢰 세션에 오류가 발생했습니다.
pl: Sekwencja została przerwana przez zdalny punkt końcowy. {0} Wystąpił błąd sesji uwierzytelnionej.
pt_br: A sequência foi encerrada pelo ponto de extremidade remoto. {0} Falha na sessão confiável.
tr: Sıra, uzak bitiş noktası tarafından sonlandırıldı. {0} Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点已终止该序列。{0} 可靠会话出错。
zh_hant: 遠端端點已經終止順序。{0} 可靠工作階段發生錯誤。

# WsrmMessageProcessingError
source: An error occurred while processing a message. {0}
cs: Při zpracování zprávy došlo k chybě. {0}
de: Beim Verarbeiten einer Nachricht ist ein Fehler aufgetreten. {0}
es: Error al procesar un mensaje. {0}
fr: Une erreur s'est produite lors du traitement d'un message. {0}
it: Errore durante l'elaborazione di un messaggio. {0}
ja: メッセージの処理中にエラーが発生しました。{0}
ko: 메시지를 처리하는 동안 오류가 발생했습니다. {0}
pl: Wystąpił błąd podczas przetwarzania wiadomości. {0}
pt_br: Erro ao processar uma mensagem. {0}
tr: Bir ileti işlenirken hata oluştu. {0}
zh_hans: 处理消息时出错。{0}
zh_hant: 處理訊息時發生錯誤。 {0}

# WsrmMessageWithWrongRelatesToExceptionString
source: The returned {0}Response was carrying the a wsa:RelatesTo header that does not correlate with the wsa:MessageId header on the {0} request. This is a violation of the WS-Addressing request reply protocol. The reliable session cannot continue.
cs: Vrácená odpověď {0}Response nesla záhlaví wsa:RelatesTo, které nekoreluje se záhlavím wsa:MessageId v požadavku {0}. To je narušení protokolu odpovědi na požadavek WS-Adressing. Stabilní relace nemůže pokračovat.
de: Die zurückgegebene {0}Response hatte einen wsa:RelatesTo-Header, der nicht dem wsa:MessageId-Header der {0}-Anforderung entspricht. Dies ist eine Verletzung des Protokolls für Antworten auf WS-Addressing-Anforderungen. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: La respuesta{0} devuelta llevaba el encabezado wsa:RelatesTo que no se correlaciona con el encabezado wsa:MessageId de la solicitud {0}. Ésta es una infracción del protocolo de respuesta a solicitudes WS-Addressing. La sesión confiable no puede continuar.
fr: La {0}Response renvoyée comportait un en-tête wsa:RelatesTo qui ne correspondait pas à l'en-tête wsa:MessageId figurant dans la demande {0}. Il s'agit d'une violation du protocole de réponse à la demande WS-Addressing. La session fiable ne peut pas continuer.
it: {0}Response restituita conteneva l'intestazione wsa:RelatesTo non correlata all'intestazione wsa:MessageId nella richiesta {0}. Ciò costituisce una violazione del protocollo di risposta alla richiesta WS-Addressing. Impossibile continuare la sessione affidabile.
ja: 返された {0}Response の wsa:RelatesTo ヘッダーは、{0} 要求の wsa:MessageId ヘッダーと相関付けられていません。これは WS-Addressing 要求応答のプロトコル違反です。信頼できるセッションは続行できません。
ko: 반환된 {0}Response에 {0} 요청의 wsa:MessageId 헤더와 상호 연결되어 있지 않은 wsa:RelatesTo 헤더가 있습니다. 이것은 WS-Addressing 요청 회신 프로토콜 위반입니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Zwrócona odpowiedź {0}Response zawierała nagłówek wsa:RelatesTo, który nie jest skorelowany z nagłówkiem wsa:MessageId w żądaniu {0}. Stanowi to naruszenie protokołu żądań i odpowiedzi WS-Addressing. Nie można kontynuować działania niezawodnej sesji.
pt_br: O {0}Response retornado tinha um cabeçalho wsa:RelatesTo não correlacionado ao cabeçalho wsa:MessageId na solicitação {0}. Trata-se de uma violação do protocolo de resposta da solicitação do WS-Addressing. A sessão confiável não pode continuar.
tr: Döndürülen {0}Response, {0} isteğindeki wsa:MessageId üst bilgisiyle ilişkilendirilemeyen bir wsa:RelatesTo üst bilgisine sahipti. Bu, WS-Addressing istek yanıtı protokolünün ihlalidir. Güvenilir oturum devam edemiyor.
zh_hans: 已返回 {0}Response 带有的 wsa:RelatesTo 头与 {0} 请求的 wsa:MessageId 头无关。这违犯了 WS-Addressing 请求答复协议。可靠会话无法继续。
zh_hant: 傳回的 {0}Response 具有 wsa:RelatesTo 標頭，該標頭與 {0} 要求上的 wsa:MessageId 標頭沒有關聯。這違反 WS-Addressing 要求回覆通訊協定。可靠工作階段無法繼續。

# WsrmMessageWithWrongRelatesToFaultString
source: The remote endpoint has responded to a {0} request message with an invalid reply. The reply has a wsa:RelatesTo header with an unexpected identifier. The reliable session cannot continue.
cs: Vzdálený koncový bod odpověděl na zprávu požadavku {0} neplatnou odpovědí. Odpověď obsahuje záhlaví wsa:RelatesTo s neočekávaným identifikátorem. Stabilní relace nemůže pokračovat.
de: Der Remoteendpunkt hat auf eine {0}-Anforderungsnachricht mit einer ungültigen Antwort reagiert. Die Antwort hat einen wsa:RelatesTo-Header mit einem unerwarteten Bezeichner. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: El extremo remoto ha respondido a un mensaje de solicitud {0} con una respuesta que no es válida. La respuesta tiene un encabezado wsa:RelatesTo con un identificador inesperado. La sesión confiable no puede continuar.
fr: Le point de terminaison distant a répondu à un message de demande {0} avec une réponse non valide. La réponse comporte un en-tête wsa:RelatesTo avec un identifiant inattendu. La session fiable ne peut pas continuer.
it: L'endpoint ha risposto a un messaggio di richiesta {0} con una risposta non valida. La risposta contiene un'intestazione wsa:RelatesTo con un identificatore imprevisto. Impossibile continuare la sessione affidabile.
ja: リモート エンドポイントは、{0} 要求メッセージに対して無効な応答を返しました。この応答には、予期しない識別子の付いた wsa:RelatesTo ヘッダーが付いています。信頼できるセッションは続行できません。
ko: 원격 끝점이 잘못된 회신으로 {0} 요청 메시지에 응답했습니다. 예기치 않은 식별자가 있는 wsa:RelatesTo 헤더가 회신에 있습니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Zdalny punkt końcowy odpowiedział na komunikat żądania {0} za pomocą nieprawidłowej odpowiedzi. Odpowiedź zawierała nagłówek wsa:RelatesTo z nieoczekiwanym identyfikatorem. Nie można kontynuować działania niezawodnej sesji.
pt_br: O ponto de extremidade remoto respondeu a uma mensagem de solicitação {0} com uma resposta inválida. A resposta tem um cabeçalho wsa:RelatesTo com identificador inesperado. A sessão confiável não pode continuar.
tr: Uzak bitiş noktası bir {0} isteğine geçersiz bir yanıt gönderdi. Yanıt, beklenmeyen bir tanımlayıcı içeren bir wsa:RelatesTo üst bilgisine sahip. Güvenilir oturum devam edemiyor.
zh_hans: 远程终结点对 {0} 请求消息响应的答复无效。该答复的 wsa:RelatesTo 头具有意外标识符。可靠会话无法继续。
zh_hant: 遠端端點針對 {0} 要求訊息回應了無效的回覆。回覆具有 wsa:RelatesTo 標頭，且該標頭具有未預期的識別碼。可靠工作階段無法繼續。

# WsrmRequestIncorrectReplyToExceptionString
source: The remote endpoint sent a wsrm:{0} request message with a wsa:ReplyTo address containing a URI which is not equivalent to the remote address. This is not supported. The reliable session was faulted.
cs: Vzdálený koncový bod odeslal zprávu požadavku wsrm:{0} s adresou wsa:ReplyTo obsahující identifikátor URI, který není ekvivalentní se vzdálenou adresou. To není podporováno. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat eine wsrm:{0}-Anforderungsnachricht mit einer wsa:ReplyTo-Adresse gesendet, die einen URI enthält, der nicht der Remoteadresse entspricht. Dies wird nicht unterstützt. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto envió un mensaje de solicitud wsrm:{0} con una dirección wsa:ReplyTo que contenía un URI que no equivale a la dirección remota. No se admite esta operación. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a envoyé un message de demande wsrm:{0} avec une adresse wsa:ReplyTo contenant un URI ne correspondant pas à l'adresse distante. Cela n'est pas pris en charge. La session fiable a généré une erreur.
it: L'endpoint remoto ha inviato un messaggio di richiesta wsrm:{0} con un indirizzo wsa:ReplyTo contenente un URI che non corrisponde all'indirizzo remoto. L'operazione non è supportata. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、リモート アドレスと等しくない URI を含む wsa:ReplyTo アドレスの付いた wsrm:{0} 要求メッセージを送信しました。これはサポートされていません。信頼できるセッションは途中終了されました。
ko: 원격 끝점이 원격 주소에 해당하지 않는 URI를 포함하는 wsa:ReplyTo 주소로 wsrm:{0} 요청 메시지를 보냈습니다. 이것은 지원되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy wysłał komunikat żądania wsrm:{0} z adresem wsa:ReplyTo zawierającym identyfikator URI, który nie jest odpowiednikiem adresu zdalnego. To zachowanie nie jest obsługiwane. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto enviou uma mensagem de solicitação wsrm:{0} com um endereço wsa:ReplyTo contendo um URI não equivalente ao endereço remoto. Não há suporte para essa situação. Falha na sessão confiável.
tr: Uzak bitiş noktası, uzak adrese eşdeğer olmayan bir URI içeren bir wsa:ReplyTo adresi olan bir wsrm:{0} istek iletisi gönderdi. Bu desteklenmez. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点发送了具有 wsa:ReplyTo 地址的 wsrm:{0} 请求消息，但该地址中包含的 URI 并不等效于远程地址。这不受支持。可靠会话出错。
zh_hant: 遠端端點已傳送具有 wsa:ReplyTo 位址的 wsrm:{0} 要求訊息，該位址包含不等同於遠端位址的 URI。不支援此一狀況。可靠工作階段發生錯誤。

# WsrmRequestIncorrectReplyToFaultString
source: The wsrm:{0} request message's wsa:ReplyTo address containing a URI which is not equivalent to the remote address. This is not supported. The reliable session was faulted.
cs: Adresa wsa:ReplyTo zprávy požadavku wsrm:{0} obsahuje identifikátor URI, který není ekvivalentní se vzdálenou adresou. To není podporováno. Ve stabilní relaci došlo k chybě.
de: Die wsa:ReplyTo-Adresse der wsrm:{0}-Anforderungsnachricht enthält einen URI, der nicht der Remoteadresse entspricht. Dies wird nicht unterstützt. Die zuverlässige Sitzung war nicht erfolgreich.
es: La dirección wsa:ReplyTo del mensaje de solicitud wsrm:{0} que contiene un URI que no equivale a la dirección remota. No se admite esta operación. Se generó un error en la sesión confiable.
fr: L'adresse wsa:ReplyTo du message de demande wsrm:{0} contient un URI ne correspondant pas à l'adresse distante. Cela n'est pas pris en charge. La session fiable a généré une erreur.
it: Il messaggio di richiesta wsrm:{0} è un indirizzo wsa:ReplyTo contenente un URI che non corrisponde all'indirizzo remoto. L'operazione non è supportata. Sessione affidabile non riuscita.
ja: リモート アドレスと等しくない URI を含む wsa:ReplyTo アドレスの付いた wsrm:{0} 要求メッセージです。これはサポートされていません。信頼できるセッションは途中終了されました。
ko: 원격 주소에 해당하지 않는 URI를 포함하는 wsrm:{0} 요청 메시지의 wsa:ReplyTo 주소입니다. 이것은 지원되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Adres wsa:ReplyTo w komunikacie żądania wsrm:{0} zawiera identyfikator URI, który nie jest odpowiednikiem adresu zdalnego. To zachowanie nie jest obsługiwane. Wystąpił błąd niezawodnej sesji.
pt_br: O endereço wsa:ReplyTo da mensagem de solicitação wsrm:{0} contendo um URI não equivalente ao endereço remoto. Não há suporte para essa situação. Falha na sessão confiável.
tr: wsrm:{0} istek iletisi, uzak adrese eşdeğer olmayan bir URI içeren wsa:ReplyTo adresine sahip. Bu desteklenmez. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: wsrm:{0} 请求消息的 wsa:ReplyTo 地址中包含的 URI 并不等效于远程地址。这不受支持。可靠会话出错。
zh_hant: wsrm:{0} 要求訊息的 wsa:ReplyTo 位址包含不等同於遠端位址的 URI。不支援此一狀況。可靠工作階段發生錯誤。

# WsrmRequiredExceptionString
source: The incoming message is not a WS-ReliableMessaging 1.1 message and could not be processed.
cs: Příchozí zpráva není zprávou protokolu WS-ReliableMessaging 1.1 a nemůže být zpracována.
de: Die eingehende Nachricht ist keine WS-ReliableMessaging 1.1-Nachricht und konnte nicht verarbeitet werden.
es: El mensaje entrante no es un mensaje WS-ReliableMessaging 1.1 y no se pudo procesar.
fr: Le message entrant n'est pas un message WS-ReliableMessaging 1.1 et n'a pas pu être traité.
it: Il messaggio in ingresso non è un messaggio WS-ReliableMessaging 1.1 e non può essere elaborato.
ja: 受信メッセージは WS-ReliableMessaging 1.1 メッセージではないので、処理できませんでした。
ko: 들어오는 메시지는 WS-ReliableMessaging 1.1 메시지가 아니라서 처리할 수 없습니다.
pl: Komunikat przychodzący nie jest komunikatem protokołu WS-ReliableMessaging 1.1 i nie można go przetworzyć.
pt_br: A mensagem de entrada não é uma mensagem WS-ReliableMessaging 1.1 e não pode ser processada.
tr: Gelen ileti bir WS-ReliableMessaging 1.1 iletisi değil ve işlenemedi.
zh_hans: 传入消息不是 WS-ReliableMessaging 1.1 消息，无法处理。
zh_hant: 傳入訊息不是 WS-ReliableMessaging 1.1 訊息，因而無法處理。

# WsrmRequiredFaultString
source: The RM server requires the use of WS-ReliableMessaging 1.1 protocol. This is likely caused by a binding mismatch.
cs: Server služby RM vyžaduje používání protokolu WS-ReliableMessaging 1.1. To je pravděpodobně způsobeno neshodou vazeb.
de: Für den RM-Server ist die Verwendung des WS-ReliableMessaging 1.1-Protokolls erforderlich. Dies wird vermutlich durch eine fehlende Bindungsübereinstimmung verursacht.
es: El servidor RM requiere el uso del protocolo WS-ReliableMessaging 1.1. Es probable que esto se deba a que un enlace no coincide.
fr: Le serveur de messagerie fiable requiert l'utilisation du protocole WS-ReliableMessaging 1.1. Cela est probablement provoqué par une non-correspondance de liaison.
it: Il server RM richiede l'utilizzo del protocollo WS-ReliableMessaging 1.1. È possibile che i binding non corrispondano.
ja: RM サーバーには WS-ReliableMessaging 1.1 プロトコルの使用が必要です。これはバインドの不整合により発生する可能性があります。
ko: RM 서버에서는 WS-ReliableMessaging 1.1 프로토콜을 사용해야 합니다. 이것은 흔히 바인딩 불일치로 인해 발생합니다.
pl: Serwer protokołu RM wymaga użycia protokołu WS-ReliableMessaging 1.1. Jest to prawdopodobnie spowodowane niezgodnością powiązań.
pt_br: O servidor RM exige o uso do protocolo WS-ReliableMessaging 1.1. A causa mais provável é uma incompatibilidade entre associações.
tr: RM sunucusu WS-ReliableMessaging 1.1 protokolünün kullanılmasını gerektiriyor. Bunun nedeni olasılıkla bir bağlama uyuşmazlığıdır.
zh_hans: RM 服务器要求使用 WS-ReliableMessaging 1.1 协议。这可能是由绑定不匹配引起的。
zh_hant: RM 伺服器要求使用 WS-ReliableMessaging 1.1 通訊協定。這可能是因繫結不相符所造成。

# X509ChainBuildFail
source: The X.509 certificate {0} chain building failed. The certificate that was used has a trust chain that cannot be verified. Replace the certificate or change the certificateValidationMode. {1}
cs: Vytvoření řetězce certifikátu X.509 {0} se nezdařilo. Použitý certifikát má řetězec certifikátů, který nemůže být ověřen. Nahraďte certifikát, nebo změňte certificateValidationMode. {1}
de: Fehler beim Erstellen der X.509-Zertifikatkette {0}. Die Vertrauenskette des verwendeten Zertifikats kann nicht überprüft werden. Ersetzen Sie das Zertifikat, oder ändern Sie den certificateValidationMode. {1}
es: No se pudo compilar la cadena {0} de certificado X.509. El certificado empleado dispone de una cadena de confianza que no se puede comprobar. Reemplace el certificado o cambie el valor de certificateValidationMode. {1}
fr: Échec de génération de la chaîne du certificat X.509 {0}. Le certificat utilisé comporte une chaîne d'approbation impossible à vérifier. Remplacez le certificat ou changez certificateValidationMode. {1}
it: Non è stato possibile creare la catena {0} di certificati X.509. Il certificato usato include una catena di certificati non verificabile. Sostituire il certificato o modificare l'elemento certificateValidationMode. {1}
ja: X.509 証明書 {0} のチェーンを構築できませんでした。使用された証明書には、検証できない信頼チェーンがあります。証明書を交換するか certificateValidationMode を変更してください。{1}
ko: X.509 인증서 {0} 체인을 만들지 못했습니다. 사용한 인증서에 확인할 수 없는 신뢰 체인이 포함되어 있습니다. 인증서를 바꾸거나 certificateValidationMode를 변경하세요. {1}
pl: Nie można utworzyć łańcucha certyfikatu X.509 {0}. Używany certyfikat ma łańcuch zaufania, którego nie można zweryfikować. Zastąp certyfikat lub zmień tryb certificateValidationMode. {1}
pt_br: Falha na compilação da cadeia de certificado X.509 {0}. O certificado usado tem uma cadeia confiável que não pode ser verificada. Substitua o certificado ou altere o certificateValidationMode. {1}
tr: X.509 sertifikası {0} zincir oluşturma işlemi başarısız oldu. Kullanılan sertifika doğrulanamayan bir güven zincirine sahip. Sertifikayı yenisiyle değiştirin veya certificateValidationMode'u değiştirin. {1}
zh_hans: X.509 证书 {0} 链生成失败。所使用的证书具有无法验证的信任链。请替换证书或更改 certificateValidationMode。{1}
zh_hant: 建置 X.509 憑證 {0} 鏈結失敗。所用憑證使用了無法驗證的信任鏈結。 請更換憑證或變更 certificateValidationMode。{1}

# X509InvalidUsageTime
source: The X.509 certificate ({0}) usage time is invalid. The usage time '{1}' does not fall between NotBefore time '{2}' and NotAfter time '{3}'.
cs: Čas použití certifikátu X.509 ({0}) je neplatný. Čas využití {1} nepatří mezi čas NotBefore {2} a čas NotAfter {3}.
de: Die Verwendungszeit des X509-Zertifikats {0} ist ungültig. Die Verwendungszeit "{1}" liegt nicht zwischen der NotBefore-Zeit "{2}" und der NotAfter-Zeit "{3}".
es: El tiempo de uso del certificado X.509 ({0}) no es válido. El tiempo de uso '{1}' no se encuentra dentro del intervalo que va de la hora NotBefore '{2}' a la hora NotAfter '{3}'.
fr: Le temps d'utilisation ({0}) du certificat X.509 est non valide. Le temps d'utilisation '{1}' n'est pas compris dans la plage NotBefore '{2}' - NotAfter '{3}'.
it: Il tempo di uso del certificato X.509 ({0}) non è valido. Il tempo di uso '{1}' non è compreso tra l'ora indicata da NotBefore '{2}' e quella indicata da NotAfter '{3}'.
ja: X.509 証明書 ({0}) の使用時刻が無効です。使用時刻 '{1}' は、NotBefore 時刻 '{2}' から NotAfter 時刻 '{3}' までの範囲に入っていません。
ko: X.509 인증서({0}) 사용 시간이 잘못되었습니다. 사용 시간 '{1}'이(가) NotBefore 시간 '{2}'과(와) NotAfter 시간 '{3}' 사이에 속하지 않습니다.
pl: Czas użycia certyfikatu X.509 ({0}) jest nieprawidłowy. Czas użycia „{1}” nie mieści się w zakresie między czasem NotBefore „{2}” i czasem NotAfter „{3}”.
pt_br: O tempo de uso do certificado X.509 ({0}) é inválido. O tempo de uso '{1}' não está entre a hora NotBefore '{2}' e a hora NotAfter '{3}'.
tr: X.509 sertifikasının ({0}) kullanım süresi geçersiz. '{1}' kullanım süresi, NotBefore zamanı '{2}' ile NotAfter zamanı '{3}' arasında değil.
zh_hans: X.509 证书({0})使用时间无效。使用时间“{1}”不在 NotBefore 时间“{2}”和 NotAfter 时间“{3}”之间。
zh_hant: X.509 憑證 ({0}) 使用時間無效。使用時間 '{1}' 並非介於 NotBefore 時間 '{2}' 與 NotAfter 時間 '{3}' 之間。
