Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxInvalidMessageBodyErrorDeserializingParameter
source: There was an error while trying to deserialize parameter {0}:{1}. Please see InnerException for more details.
cs: Došlo k chybě při pokusu o deserializaci parametru {0}:{1}. Další informace zjistíte podle hodnoty vlastnosti InnerException.
de: Beim Deserialisieren des Parameters {0}:{1} ist ein Fehler aufgetreten. Weitere Details finden Sie unter InnerException.
es: Error al intentar deserializar el parámetro {0}:{1}. Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant la tentative de désérialisation du paramètre {0} : {1}. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il tentativo di deserializzare il parametro {0}:{1}. Per maggiori dettagli, vedere InnerException.
ja: パラメーター {0}:{1} を逆シリアル化しようとしているときにエラーが発生しました。詳細については、InnerException を参照してください。
ko: {0}:{1} 매개 변수를 deserialize하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas próby zdeserializowania parametru {0}:{1}. Aby uzyskać więcej szczegółów, zobacz element InnerException.
pt_br: Erro ao tentar desserializar o parâmetro {0}:{1}. Consulte a InnerException para obter mais detalhes.
tr: {0}:{1} parametresi seri durumdan çıkarılmaya çalışılırken bir hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 尝试反序列化参数 {0} 时出错: {1}。有关详细信息，请参阅 InnerException。
zh_hant: 嘗試將參數 {0}:{1} 還原序列化時發生錯誤。如需詳細資料，請查看 InnerException。

# SFxInvalidMessageBodyErrorDeserializingParameterMore
source: There was an error while trying to deserialize parameter {0}:{1}. The InnerException message was '{2}'. Please see InnerException for more details.
cs: Došlo k chybě při pokusu o deserializaci parametru {0}:{1}. Zpráva InnerException byla {2}. Další informace zjistíte podle hodnoty vlastnosti InnerException.
de: Beim Deserialisieren des Parameters {0}:{1} ist ein Fehler aufgetreten. Die InnerException-Nachricht war "{2}". Weitere Details finden Sie unter InnerException.
es: Error al intentar deserializar el parámetro {0}:{1}. El mensaje de InnerException era "{2}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant la tentative de désérialisation du paramètre {0} : {1}. Le message InnerException était le suivant : '{2}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il tentativo di deserializzare il parametro {0}:{1}. Messaggio di InnerException: '{2}'. Per maggiori dettagli, vedere InnerException.
ja: パラメーター {0}:{1} を逆シリアル化しようとしているときにエラーが発生しました。InnerException メッセージは '{2}' でした。詳細については InnerException を参照してください。
ko: {0}:{1} 매개 변수를 deserialize하는 동안 오류가 발생했습니다. InnerException 메시지는 '{2}'입니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas próby zdeserializowania parametru {0}:{1}. Komunikat InnerException: „{2}”. Aby uzyskać więcej szczegółów, zobacz element InnerException.
pt_br: Erro ao tentar desserializar o parâmetro {0}:{1}. A mensagem da InnerException foi '{2}'. Consulte a InnerException para obter mais detalhes.
tr: {0}:{1} parametresi seri durumdan çıkarılmaya çalışılırken bir hata oluştu. InnerException iletisi: '{2}'. Daha fazla ayrıntı için InnerException öğesine bakın.
zh_hans: 尝试反序列化参数 {0} 时出错: {1}。InnerException 消息是“{2}”。有关详细信息，请参阅 InnerException。
zh_hant: 嘗試將參數 {0}:{1} 還原序列化時發生錯誤。InnerException 訊息為 '{2}'。如需詳細資料，請查看 InnerException。

# SFxInvalidMessageBodyErrorSerializingParameter
source: There was an error while trying to serialize parameter {0}:{1}. The InnerException message was '{2}'. Please see InnerException for more details.
cs: Došlo k chybě při pokusu o deserializaci parametru {0}:{1}. Zpráva InnerException byla {2}. Další informace naleznete u třídy InnerException.
de: Beim Deserialisieren des Parameter {0}:{1} ist ein Fehler aufgetreten. Die InnerException-Nachricht war "{2}". Weitere Details finden Sie unter InnerException.
es: Error al intentar serializar el parámetro {0}:{1}. El mensaje de InnerException fue "{2}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite en tentant de sérialiser le paramètre {0}:{1}. Le message InnerException était '{2}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il tentativo di serializzare il parametro {0}:{1}. Messaggio di InnerException: '{2}'. Per maggiori dettagli, vedere InnerException.
ja: パラメーター {0} をシリアル化しようとしているときにエラーが発生しました: {1}。InnerException メッセージは '{2}' でした。詳細については、InnerException を参照してください。
ko: {0}:{1} 매개 변수를 직렬화하는 동안 오류가 발생했습니다. InnerException 메시지는 '{2}'입니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas próby serializowania parametru {0}:{1}. Komunikat InnerException: „{2}”. Aby uzyskać więcej szczegółów, zobacz element InnerException.
pt_br: Erro ao tentar serializar o parâmetro {0}:{1}. A mensagem da InnerException foi '{2}'. Consulte a InnerException para obter mais detalhes.
tr: {0}:{1} parametresi serileştirilmeye çalışılırken bir hata oluştu. InnerException iletisi: '{2}'. Daha fazla ayrıntı için InnerException öğesine bakın.
zh_hans: 尝试对参数 {0} 进行序列化时出错: {1}。InnerException 消息是“{2}”。有关详细信息，请参见 InnerException。
zh_hant: 嘗試將參數 {0}:{1} 序列化時發生錯誤。InnerException 訊息為 '{2}'。如需詳細資訊，請參閱 InnerException。

# SFxInvalidMessageContractSignature
source: The operation {0} either has a parameter or a return type that is attributed with MessageContractAttribute. In order to represent the request message using a Message Contract, the operation must have a single parameter attributed with MessageContractAttribute. In order to represent the response message using a Message Contract, the operation's return value must be a type that is attributed with MessageContractAttribute and the operation may not have any out or ref parameters.
cs: Operace {0} má parametr nebo vrácený typ s atributem MessageContractAttribute. Aby operace mohla představovat zprávu požadavku pomocí kontraktu zprávy, musí mít jeden parametr s atributem MessageContractAttribute. Aby operace mohla představovat zprávu odpovědi pomocí kontraktu zprávy, musí být její vrácená hodnota typem s atributem MessageContractAttribute a nesmí mít žádný parametr typu out nebo ref.
de: Der Vorgang {0} weist einen Parameter oder Rückgabetyp auf, der mit MessageContractAttribute attributiert ist. Um die Anforderungsnachricht mit einem Nachrichtenvertrag darzustellen, muss der Vorgang über einen einzelnen Parameter verfügen, der mit MessageContractAttribute attributiert ist. Um die Antwortnachricht mit einem Nachrichtenvertrag darzustellen, muss es sich beim Rückgabewert des Vorgangs um einen Typ handeln, der mit MessageContractAttribute attributiert ist, und der Vorgang darf nicht über out- oder ref-Parameter verfügen.
es: La operación {0} tiene un parámetro o un tipo de valor devuelto con el atributo MessageContractAttribute. Para representar el mensaje de solicitud con un contrato de mensaje, la operación debe tener un solo parámetro con el atributo MessageContractAttribute. Para representar el mensaje de respuesta con un contrato de mensaje, el valor devuelto de la operación debe ser un tipo con el atributo MessageContractAttribute y la operación no puede tener ningún parámetro out o ref.
fr: L'opération {0} contient un paramètre ou un type de retour qui est attribué avec MessageContractAttribute. Pour représenter le message de requête à l'aide d'un contrat de message, l'opération doit contenir un seul paramètre attribué à MessageContractAttribute. Pour représenter le message de réponse à l'aide d'un contrat de message, la valeur retournée à partir de l'opération doit être un type attribué à MessageContractAttribute et l'opération ne doit pas contenir de paramètre out ou ref.
it: L'operazione {0} contiene un parametro o un tipo restituito con attributo MessageContractAttribute. Per rappresentare il messaggio di richiesta tramite un contratto di messaggio, l'operazione deve contenere un singolo parametro con attributo MessageContractAttribute. Per rappresentare il messaggio di risposta tramite un contratto di messaggio, il valore restituito dall'operazione deve essere di un tipo con attributo MessageContractAttribute e l'operazione non può includere parametri out o ref.
ja: 操作 {0} には、MessageContractAttribute 属性を持つパラメーターまたは戻り値の型が含まれています。Message Contract を使用して要求メッセージを表現するには、この操作には MessageContractAttribute 属性を持つ単一のパラメーターが含まれている必要があります。Message Contract を使用して応答メッセージを表現するには、この操作の戻り値は MessageContractAttribute 属性を持つ型である必要があり、この操作には out パラメーターや ref パラメーターが含まれていてはいけません。
ko: 특성이 MessageContractAttribute인 매개 변수 또는 반환 형식이 {0} 작업에 있습니다. 메시지 계약을 사용하는 요청 메시지를 표시하려면 특성이 MessageContractAttribute인 단일 매개 변수가 작업에 있어야 합니다. 메시지 계약을 사용하는 응답 메시지를 표시하려면 작업의 반환 값이 특성이 MessageContractAttribute인 형식이어야 하며, 작업에 out 또는 ref 매개 변수가 포함되지 않을 수 있습니다.
pl: Operacja {0} ma parametr lub zwracany typ mający atrybut MessageContractAttribute. Aby móc przedstawić komunikat żądania z użyciem kontraktu komunikatu, operacja musi mieć pojedynczy parametr z atrybutem MessageContractAttribute. Aby móc przedstawić komunikat odpowiedzi z użyciem kontraktu komunikatu, wartość zwrotna operacji musi być typem z atrybutem MessageContractAttribute, a operacja nie może mieć żadnych parametrów „out” lub „ref”.
pt_br: A operação {0} tem um parâmetro ou um tipo de retorno que é atribuído com MessageContractAttribute. Para representar a mensagem de solicitação usando um Contrato de Mensagem, a operação deve ter um parâmetro único atribuído com MessageContractAttribute. Para representar a mensagem de resposta usando um Contrato de Mensagem, o valor retornado da operação deverá ser um tipo atribuído com MessageContractAttribute e a operação poderá não ter nenhum parâmetro out ou ref.
tr: {0} işlemi, MessageContractAttribute ile ilişkilendirilen bir parametreye ya da dönüş türüne sahip. Bir İleti Anlaşması kullanarak istek iletisini göstermek için işlemin MessageContractAttribute ile ilişkilendirilen bir tek parametreye sahip olması gerekir. Bir İleti Anlaşması kullanarak yanıt iletisini göstermek için işlemin döndürdüğü değerin MessageContractAttribute ile ilişkilendirilen bir tür olması ve işlemin dış ya da başvuru parametresinin olmaması gerekir.
zh_hans: 操作 {0} 具有特性为 MessageContractAttribute 的参数或返回类型。要使用消息协定表示请求消息，操作必须有一个特性为 MessageContractAttribute 的参数。若要使用消息协定表示响应消息，操作的返回值必须是特性为 MessageContractAttribute 的类型，且不能有 out 或 ref 参数。
zh_hant: 作業 {0} 具有一個以 MessageContractAttribute 賦予屬性的參數或傳回型別。為了代表使用 Message Contract 的要求訊息，作業必須具有一個以 MessageContractAttribute 賦予屬性的參數。為了代表使用 Message Contract 的回應訊息，作業的傳回值類型必須以 MessageContractAttribute 賦予屬性，且作業不可具有任何 out 或 ref 參數。

# SFxInvalidMessageHeaderArrayType
source: MessageHeaderArrayAttribute found on member {0} is not a single dimensional array.
cs: Třída MessageHeaderArrayAttribute nalezená v členu {0} není jednorozměrné pole.
de: Das für den Member "{0}" gefundene MessageHeaderArrayAttribute ist kein eindimensionales Array.
es: El atributo MessageHeaderArrayAttribute que se encontró en el miembro {0} no es una matriz unidimensional.
fr: MessageHeaderArrayAttribute trouvé sur le membre {0} n'est pas un tableau unidimensionnel.
it: MessageHeaderArrayAttribute trovato nel membro {0} non è una matrice unidimensionale.
ja: メンバー {0} で見つかった MessageHeaderArrayAttribute は、1 次元配列ではありません。
ko: {0} 멤버에 있는 MessageHeaderArrayAttribute가 1차원 배열이 아닙니다.
pl: Atrybut MessageHeaderArrayAttribute znaleziony w składowej {0} nie jest tablicą jednowymiarową.
pt_br: MessageHeaderArrayAttribute encontrado no membro {0} não é uma matriz dimensional única.
tr: {0} üyesinde bulunan MessageHeaderArrayAttribute tek boyutlu bir dizi değil.
zh_hans: 在成员 {0} 上找到的 MessageHeaderArrayAttribute 不是一维数组。
zh_hant: 成員 {0} 上找到的 MessageHeaderArrayAttribute 並非單一維度陣列。

# SFxInvalidReplyAction
source: Outgoing reply message for operation '{0}' specified Action='{1}', but contract for that operation specifies ReplyAction='{2}'. The Action specified in the Message must match the ReplyAction in the contract, or the operation contract must specify ReplyAction='*'.
cs: Odchozí zpráva odpovědi pro operaci {0} uváděla třídu Action={1}, ale kontrakt pro tuto operaci určuje třídu ReplyAction={2}. Akce určená ve zprávě musí odpovídat třídě ReplyAction v kontraktu nebo musí kontrakt operace určovat třídu ReplyAction=*.
de: Die ausgehende Antwortnachricht für den Vorgang "{0}" hat Action="{1}" angegeben, aber der Vertrag für diesen Vorgang gibt ReplyAction="{2}" an. Die in der Nachricht angegebene Aktion muss der ReplyAction im Vertrag entsprechen, oder der Vorgangsvertrag muss ReplyAction="*" angeben.
es: El mensaje de respuesta saliente para la operación "{0}" especificaba Action="{1}", pero el contrato para dicha operación especifica ReplyAction="{2}". El valor de Action especificado en el mensaje debe coincidir con el de ReplyAction en el contrato, o bien el contrato de la operación debe especificar ReplyAction="*".
fr: Le message de réponse sortant de l'opération '{0}' spécifiait Action='{1}', mais le contrat de cette opération spécifie ReplyAction='{2}'. L'Action spécifiée dans le Message doit correspondre à ReplyAction dans le contrat, ou le contrat d'opération doit spécifier ReplyAction='*'.
it: Il messaggio di risposta in uscita per l'operazione '{0}' ha specificato Action='{1}', ma il contratto per tale operazione specifica ReplyAction='{2}'. L'elemento Action specificato in Message deve corrispondere all'elemento ReplyAction nel contratto o il contratto di operazione deve specificare ReplyAction='*'.
ja: 操作 '{0}' の送信応答メッセージは Action='{1}' を指定しましたが、この操作のコントラクトは ReplyAction='{2}' を指定しています。Message で指定された Action がコントラクト内の ReplyAction と一致しているか、この操作のコントラクトが ReplyAction='*' を指定している必要があります。
ko: '{0}' 작업에 대한 보내는 회신 메시지는 Action='{1}'(을)를 지정했지만 이 작업에 대한 계약이 ReplyAction='{2}'을(를) 지정합니다. 메시지에 지정된 Action이 계약의 ReplyAction과 일치하거나, 작업 계약이 ReplyAction='*'를 지정해야 합니다.
pl: Wychodzący komunikat odpowiedzi dla operacji „{0}” zawiera określenie Action=„{1}”, podczas gdy kontrakt dla danej operacji określa ReplyAction=„{2}”. Parametr Action określony w komunikacie musi odpowiadać parametrowi ReplyAction w kontrakcie lub kontrakt operacji musi określać parametr ReplyAction=„*”.
pt_br: A mensagem de resposta de saída para a operação '{0}' especificou Ação='{1}', mas o contrato para essa operação especifica ReplyAction='{2}'. A Ação especificada na Mensagem deve corresponder à ReplyAction no contrato ou o contrato de operação deve especificar ReplyAction='*'.
tr: '{0}' işlemi giden yanıt iletisi Action='{1}' değeri belirtti, ancak bu işlemin anlaşması ReplyAction='{2}' değerini belirtiyor. Message içinde belirtilen değerin, anlaşmadaki ReplyAction değeriyle eşleşmesi gerekir ya da işlem anlaşması ReplyAction='*' değeri belirtmelidir.
zh_hans: 操作“{0}”的传出回复消息指定了 Action=“{1}”，但该操作的协定指定了 ReplyAction=出错“{2}”。在“消息”中指定的 Action 必须与协定中的 ReplyAction 匹配，否则操作协定必须指定 ReplyAction="*"。
zh_hant: 作業 '{0}' 的傳出回覆訊息指定了 Action='{1}'，但是作業的合約指定了 ReplyAction='{2}'。在 Message 中指定的 Action 必須符合合約中的 ReplyAction，或是作業合約必須指定 ReplyAction='*'。

# SFxInvalidRequestAction
source: Outgoing request message for operation '{0}' specified Action='{1}', but contract for that operation specifies Action='{2}'. The Action specified in the Message must match the Action in the contract, or the operation contract must specify Action='*'.
cs: Odchozí zpráva požadavku pro operaci {0} uváděla třídu Action={1}, ale kontrakt pro tuto operaci určuje třídu Action={2}. Akce určená ve zprávě musí odpovídat akci v kontraktu nebo musí kontrakt operace určovat třídu Action=*.
de: Die ausgehende Anforderungsnachricht für den Vorgang "{0}" hat Action="{1}" angegeben, aber der Vertrag für diesen Vorgang gibt Action="{2}" an. Die in der Nachricht angegebene Aktion muss der Aktion im Vertrag entsprechen, oder der Vorgangsvertrag muss Action="*" angeben.
es: El mensaje de solicitud saliente para la operación "{0}" especificaba Action="{1}", pero el contrato para dicha operación especifica Action="{2}". El valor de Action especificado en el mensaje debe coincidir con el del contrato, o bien el contrato de la operación debe especificar Action="*".
fr: Le message de requête sortant de l'opération '{0}' spécifiait Action='{1}', mais le contrat de cette opération spécifie Action='{2}'. L'Action spécifiée dans le Message doit correspondre à Action dans le contrat, ou le contrat d'opération doit spécifier Action= '*'.
it: Il messaggio di risposta in uscita per l'operazione '{0}' ha specificato Action='{1}', ma il contratto per tale operazione specifica Action='{2}'. L'elemento Action specificato in Message deve corrispondere all'elemento Action nel contratto o il contratto di operazione deve specificare Action='*'.
ja: 操作 '{0}' の送信要求メッセージは Action='{1}' を指定しましたが、この操作のコントラクトは Action='{2}' を指定しています。Message で指定された Action がコントラクト内の ReplyAction と一致しているか、この操作のコントラクトが Action='*' を指定している必要があります。
ko: '{0}' 작업에 대한 보내는 요청 메시지는 Action='{1}'(을)를 지정했지만 이 작업에 대한 계약은 Action='{2}'을(를) 지정합니다. 메시지에 지정된 Action이 계약의 Action과 일치하거나, 작업 계약이 Action='*'를 지정해야 합니다.
pl: Wychodzący komunikat żądania operacji „{0}” zawiera określenie Action=„{1}”, podczas gdy kontrakt operacji określa Action=„{2}”. Parametr Action określony w komunikacie musi odpowiadać parametrowi Action w kontrakcie lub kontrakt operacji musi określać parametr Action=„*”.
pt_br: A mensagem de solicitação de saída para a operação '{0}' especificou Ação='{1}', mas o contrato para essa operação especifica Ação='{2}'. A Ação especificada na Mensagem deve corresponder à Ação do contrato ou o contrato de operação deve especificar Ação='*'.
tr: '{0}' işlemi giden istek iletisi Action='{1}' değeri belirtti, ancak bu işlemin anlaşması Action='{2}' değerini belirtiyor. Message içinde belirtilen Action değerinin, anlaşmadaki Action değeriyle eşleşmesi gerekir ya da işlem anlaşması Action='*' değeri belirtmelidir.
zh_hans: 操作“{0}”的传出请求消息指定了 Action=“{1}”，但该操作的协定指定了 Action=“{2}”。在“消息”中指定的 Action 必须与协定中的 Action 匹配，否则操作协定必须指定 Action="*"。
zh_hant: 作業 '{0}' 的傳出要求訊息指定了 Action='{1}'，但該作業的合約指定了 Action='{2}'。訊息中指定的 Action 必須與合約中的 Action 相符，或是作業合約必須指定 Action='*'。

# SFxInvalidSoapAttribute
source: XmlSerializer attribute {0} is not valid in {1}. Only SoapElement attribute is supported.
cs: Atribut XmlSerializer {0} není v {1} platný. Podporuje se pouze atribut SoapElement.
de: Das XmlSerializer-Attribut "{0}" ist in {1} nicht gültig. Nur das SoapElement-Attribut wird unterstützt.
es: El atributo XmlSerializer {0} no es válido en {1}. Solo se admite el atributo SoapElement.
fr: L'attribut XmlSerializer {0} n'est pas valide dans {1}. Seul l'attribut SoapElement est pris en charge.
it: Attributo XmlSerializer {0} non valido in {1}. È supportato solo l'attributo SoapElement.
ja: XmlSerializer 属性 {0} は {1} 内では有効ではありません。サポートされているのは SoapElement 属性だけです。
ko: XmlSerializer 특성 {0}이(가) {1}에 사용할 수 없습니다. SoapElement 특성만 지원됩니다.
pl: Atrybut XmlSerializer {0} jest nieprawidłowy w {1}. Obsługiwany jest jedynie atrybut SoapElement.
pt_br: O atributo XmlSerializer {0} não é válido em {1}. Só há suporte para o atributo SoapElement.
tr: XmlSerializer özniteliği {0}, {1} içinde geçerli değil. Yalnızca SoapElement özniteliği destekleniyor.
zh_hans: XmlSerializer 特性 {0} 在 {1} 中无效。仅支持 SoapElement 特性。
zh_hant: XmlSerializer 屬性 {0} 在 {1} 中無效。僅支援 SoapElement 屬性。

# SFxInvalidStaticOverloadCalledForDuplexChannelFactory1
source: The static CreateChannel method cannot be used with the contract {0} because that contract defines a callback contract. Please try using one of the static CreateChannel overloads on DuplexChannelFactory<TChannel>.
cs: Statickou metodu CreateChannel nelze použít s kontraktem {0}, protože tento kontrakt definuje kontrakt zpětného volání. Pokuste se použít některé ze statických přetížení CreateChannel pro třídu DuplexChannelFactory<TChannel>.
de: Die statische CreateChannel-Methode kann nicht mit dem Vertrag {0} verwendet werden, da der Vertrag einen Rückrufvertrag definiert. Verwenden Sie eine der statischen CreateChannel-Überladungen für die DuplexChannelFactory<TChannel>.
es: El método CreateChannel estático no se puede usar con el contrato {0} porque dicho contrato define un contrato de devolución de llamada. Intente usar una de las sobrecargas de CreateChannel estáticas en DuplexChannelFactory<TChannel>.
fr: La méthode statique CreateChannel ne peut pas être utilisée avec le contrat {0}, car ce dernier définit un contrat de rappel. Essayez en utilisant l'une des surcharges statiques CreateChannel sur DuplexChannelFactory<TChannel>.
it: Non è possibile usare il metodo CreateChannel statico con il contratto {0} perché il contratto definisce un contratto di callback. Provare a usare uno degli overload statici di CreateChannel su DuplexChannelFactory<TChannel>.
ja: コントラクト {0} はコールバック コントラクトを定義しているため、静的な CreateChannel メソッドをこのコントラクトで使用できません。DuplexChannelFactory<TChannel> で静的な CreateChannel オーバーロードのいずれかを使用してみてください。
ko: {0} 계약이 콜백 계약을 정의하므로 정적 CreateChannel 메서드를 해당 계약에서사용할 수 없습니다. DuplexChannelFactory<TChannel>에서 정적 CreateChannel 오버로드 중 하나를 사용해 보세요.
pl: Statyczna metoda CreateChannel nie może być używana z kontraktem {0}, ponieważ kontrakt ten definiuje kontrakt wywołania zwrotnego. Należy użyć jednego ze statycznych przeciążeń klasy CreateChannel w kanale DuplexChannelFactory<TChannel>.
pt_br: O método CreateChannel estático não pode ser usado com o contrato {0} porque esse contrato define um contrato do retorno de chamada. Tente usar uma das sobrecargas CreateChannel estáticas em DuplexChannelFactory<TChannel>.
tr: {0} anlaşması bir geri çağırma anlaşması tanımlamakta olduğundan Statik CreateChannel metodu bu anlaşması ile kullanılamaz. DuplexChannelFactory<TChannel> üstündeki statik CreateChannel aşırı yüklemelerinden birini kullanmayı deneyin.
zh_hans: 静态 CreateChannel 方法不能与协定 {0} 共同使用，因为该协定定义了回拨协定。请在 DuplexChannelFactory<TChannel> 上尝试使用其中一个静态 CreateChannel 重载。
zh_hant: 靜態 CreateChannel 方法無法與合約 {0} 搭配使用，因為該合約定義了回呼合約。請嘗試使用 DuplexChannelFactory<TChannel> 的其中一項靜態 CreateChannel 多載。

# SFxInvalidStreamInRequest
source: For request in operation {0} to be a stream the operation must have a single parameter whose type is Stream.
cs: Má-li být požadavek v operaci {0} datovým proudem, musí mít operace jeden parametr typu datový proud.
de: Damit die Anforderung im Vorgang {0} ein Datenstrom sein kann, muss der Vorgang über einen einzelnen Parameter mit dem Typ "Stream" verfügen.
es: Para que la solicitud de la operación {0} sea una secuencia, la operación debe tener un único parámetro cuyo tipo sea Stream.
fr: Pour que la requête de l'opération {0} soit un flux, l'opération doit contenir un seul paramètre dont le type est Stream.
it: La richiesta nell'operazione {0} può essere un flusso solo se l'operazione contiene un unico parametro di tipo Stream.
ja: 操作 {0} における要求をストリームにするには、この操作は Stream 型の単一のパラメーターを持つ必要があります。
ko: {0} 작업의 요청이 스트림이 되려면 형식이 스트림인 단일 매개 변수가 작업에 있어야 합니다.
pl: Aby żądanie w operacji {0} było strumieniem, operacja musi mieć pojedynczy parametr typu Stream.
pt_br: Para a solicitação na operação {0} ser um fluxo, a operação deve ter um parâmetro único cujo tipo seja Stream.
tr: {0} işlemindeki isteğin bir akış olabilmesi için işlemin, türü Stream olan bir tek parametresi olması gerekir.
zh_hans: 要使操作 {0} 中的请求成为流，操作必须具有其类型为 Stream 的单个参数。
zh_hant: 若作業 {0} 中的要求為資料流，作業必須具有類型為 Stream 的單一參數。
