Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# HttpMessageHandlerTypeNotSupported
source: Invalid type: '{0}'. It must inherit from base type '{1}', cannot be abstract, and must expose a public default constructor.
cs: Neplatný typ: {0}. Musí dědit ze základního typu {1}, nemůže být abstraktní a musí zveřejnit výchozí veřejný konstruktor.
de: Ungültiger Typ: "{0}". Dieser Typ muss vom Basistyp "{1}" erben, darf nicht abstrakt sein und muss einen öffentlichen Standardkonstruktor verfügbar machen.
es: Tipo no válido: "{0}". Debe heredarse de un tipo base "{1}", no puede ser abstracto y debe exponer un constructor predeterminado público.
fr: Type non valide : '{0}'. Il doit hériter du type de base '{1}', ne peut pas être abstrait et doit exposer un constructeur par défaut public.
it: Il tipo '{0}' non è valido. Deve ereditare dal tipo di base '{1}', non può essere astratto e deve esporre un costruttore predefinito pubblico.
ja: 無効な型: '{0}'。基本データ型 '{1}' を継承する必要があり、抽象型にすることはできません。さらに、パブリックの既定コンストラクターを公開する必要があります。
ko: 잘못된 '{0}' 형식입니다. 기본 '{1}' 형식에서 상속해야 하며, abstract일 수 없고, public 기본 생성자를 노출해야 합니다.
pl: Nieprawidłowy typ: „{0}”. Ten typ musi dziedziczyć z typu podstawowego „{1}”, nie może być abstrakcyjny i musi uwidaczniać domyślnego konstruktora publicznego.
pt_br: Tipo inválido: '{0}'. Ele deve herdar do tipo base '{1}', não pode ser abstrato e deve expor um construtor padrão público.
tr: Geçersiz tür: '{0}'. '{1}' temel türünden devralmalıdır, soyut olamaz ve genel bir varsayılan oluşturucu kullanıma açmalıdır.
zh_hans: 类型“{0}”无效。它必须从基类型“{1}”继承，不能是抽象的，并且必须公开一个公共的默认构造函数。
zh_hant: 類型無效: '{0}'。它必須繼承自基底類型 '{1}'、不可為抽象，且必須公開公用預設建構函式。

# HttpPipelineNotSupportedOnClientSide
source: The property '{0}' is not supported when building a ChannelFactory. The property value must be null when calling BuildChannelFactory.
cs: Při vytváření objektu ChannelFactory není vlastnost {0} podporována. Tato vlastnost musí mít při volání metody BuildChannelFactory hodnotu null.
de: Die Eigenschaft "{0}" wird beim Erstellen einer ChannelFactory nicht unterstützt. Beim Aufrufen von BuildChannelFactory muss der Eigenschaftswert NULL sein.
es: La propiedad "{0}" no se admite al compilar ChannelFactory. El valor de propiedad debe ser nulo al llamar a BuildChannelFactory.
fr: La propriété '{0}' n'est pas prise en charge durant la génération de ChannelFactory. La valeur de propriété doit être une valeur null durant l'appel de BuildChannelFactory.
it: La proprietà '{0}' non è supportata durante la creazione di un elemento ChannelFactory. Quando si chiama BuildChannelFactory, il valore della proprietà deve essere Null.
ja: プロパティ '{0}' は、ChannelFactory を作成するときにはサポートされません。BuildChannelFactory を呼び出すときにはこのプロパティの値を null にする必要があります。
ko: ChannelFactory를 작성할 때는 '{0}' 속성이 지원되지 않습니다. BuildChannelFactory를 호출할 때는 이 속성 값이 null이어야 합니다.
pl: Właściwość „{0}” nie jest obsługiwana podczas tworzenia obiektu ChannelFactory. Ta właściwość musi mieć wartość null podczas wywoływania metody BuildChannelFactory.
pt_br: Não há suporte para a propriedade '{0}' durante a criação de uma ChannelFactory. O valor da propriedade deve ser nulo na chamada a BuildChannelFactory.
tr: ChannelFactory oluştururken '{0}' özelliği desteklenmez. BuildChannelFactory çağrılırken özellik değeri null olmalıdır.
zh_hans: 生成 ChannelFactory 时不支持属性“{0}”。调用 BuildChannelFactory 时，该属性值必须为 null。
zh_hant: 建置 ChannelFactory 時，不支援屬性 '{0}'。呼叫 BuildChannelFactory 時，此屬性值必須為 null。

# HttpProxyRequiresSingleAuthScheme
source: The '{0}' authentication scheme has been specified for the proxy on the HTTP factory. However, the factory only supports specification of exactly one authentication scheme. Valid authentication schemes are Digest, Negotiate, NTLM, Basic, or Anonymous.
cs: Schéma ověřování {0} bylo určeno pro proxy server objektu factory protokolu HTTP. Objekt factory však podporuje pouze specifikaci právě jednoho schématu ověřování. Platná schémata ověřování jsou Digest (Stručný), Negotiate (Vyjednaný), NTLM, Basic (Základní) a Anonymous (Anonymní).
de: Für den Proxy auf der HTTP-Factory wurde das Authentifizierungsschema "{0}" angegeben. Die Factory unterstützt jedoch nur die Angabe genau eines Authentifizierungsschemas. Gültige Authentifizierungsschemas sind "Digest", "Negotiate", "NTLM", "Basic" oder "Anonymous".
es: Se especificó el esquema de autenticación '{0}' para el proxy en el generador HTTP. Sin embargo, el generador sólo admite la especificación de un único esquema de autenticación. Los esquemas de autenticación válidos son Digest, Negotiate, NTLM, Basic o Anonymous.
fr: Le modèle d'authentification '{0}' a été spécifié pour le proxy sur la fabrique HTTP. Cependant, la fabrique ne prend en charge qu'un seul schéma d'authentification. Les schémas d'authentification valides sont Digest, Negotiate, NTLM, Basic ou Anonymous.
it: Lo schema di autenticazione '{0}' è stato specificato per il proxy nella factory HTTP. Tuttavia, la factory supporta solo la specifica di un unico schema di autenticazione. Gli schemi di autenticazione validi sono Digest, Negotiate, NTLM, Basic o Anonymous.
ja: '{0}' 認証方式が HTTP ファクトリのプロキシに対して指定されていますが、このファクトリは ExactlyOne 認証方式の指定しかサポートしていません。有効な認証方式は、ダイジェスト、ネゴシエート、NTLM、基本、または匿名です。
ko: '{0}' 인증 구성표가 HTTP 팩터리의 프록시에 지정되었습니다. 그러나 이 팩터리에서는 오직 하나의 인증 구성표 지정만 지원할 수 있습니다. 올바른 인증 구성표는 다이제스트, 협상, NTLM, 기본 또는 익명입니다.
pl: Określono schemat uwierzytelniania „{0}” dla serwera proxy w fabryce HTTP. Jednak fabryka obsługuje specyfikację dokładnie jednego schematu uwierzytelniania. Prawidłowe schematy uwierzytelniania to Digest, Negotiate, NTLM, Basic lub Anonymous.
pt_br: O esquema de autenticação '{0}' foi especificado para o proxy na fábrica HTTP. Entretanto, a fábrica apenas oferece suporte para a especificação de exatamente um esquema de autenticação. Os esquemas válidos de autenticação são Resumo, Negociação, NTLM, Básico ou Anônimo.
tr: '{0}' kimlik doğrulama düzeni HTTP fabrikası üstündeki proxy için belirtilmiş. Bununla birlikte, fabrika yalnızca tam olarak bir kimlik doğrulama düzeninin belirtilmesini destekler. Geçerli kimlik doğrulama düzenleri: Digest, Negotiate, NTLM, Basic veya Anonymous.
zh_hans: 已为 HTTP 工厂上的代理指定了“{0}”身份验证方案。但是，该工厂仅支持只指定一个身份验证方案。有效的身份验证方案为摘要、协商、NTLM、基本或匿名。
zh_hant: HTTP 處理站上的 Proxy 已指定 '{0}' 驗證配置。不過，處理站僅支援指定一個驗證配置。有效的驗證配置為 Digest、Negotiate、NTLM、Basic 或 Anonymous。

# HttpReceiveFailure
source: An error occurred while receiving the HTTP response to {0}. This could be due to the service endpoint binding not using the HTTP protocol. This could also be due to an HTTP request context being aborted by the server (possibly due to the service shutting down). See server logs for more details.
cs: Během příjmu odpovědi protokolu HTTP na {0} došlo k chybě. Může to být proto, že vazba koncového bodu služby nepoužívá protokol HTTP. Může to být i tím, že byl kontext požadavku protokolu HTTP přerušen serverem (pravděpodobně z důvodu vypnutí služby). Další informace naleznete v protokolech serveru.
de: Beim Empfangen der HTTP-Antwort für {0} ist ein Fehler aufgetreten. Dies kann darauf zurückzuführen sein, dass die Dienstendpunktbindung das HTTP-Protokoll nicht verwendet. Eine andere mögliche Ursache ist, dass der HTTP-Anforderungskontext vom Server abgebrochen wird (vermutlich aufgrund des Herunterfahrens des Diensts). Weitere Informationen finden Sie in den Serverprotokollen.
es: Error al recibir la respuesta HTTP a {0}. Puede deberse a que el enlace del punto de conexión de servicio no usa el protocolo HTTP. También puede deberse a que el servidor anula un contexto de solicitud HTTP (posiblemente por el cierre del servicio). Consulte los registros del servidor para obtener más información.
fr: Une erreur s'est produite durant la réception de la réponse HTTP à {0}. Il est possible que la liaison de point de terminaison de service n'utilise pas le protocole HTTP. Il est possible également qu'un contexte de requête HTTP ait été ignoré par le serveur (peut-être en raison de l'arrêt du service). Pour plus d'informations, consultez les journaux du serveur.
it: Si è verificato un errore durante la ricezione della risposta HTTP a {0}. È possibile che il binding dell'endpoint servizio non usi il protocollo HTTP o che un contesto di richiesta HTTP sia stato interrotto dal server, probabilmente a causa dell'arresto del servizio. Per maggiori dettagli, vedere i log del server.
ja: {0} に対する HTTP 応答の受信中にエラーが発生しました。この原因としては、サービス エンドポイント バインドが HTTP プロトコルを使用していないことが考えられます。また別の原因として、HTTP 要求コンテキストがサーバーによって中止された可能性もあります (サーバーがシャットダウンした場合など)。詳細についてはサーバー ログを参照してください。
ko: {0}에 대한 HTTP 응답을 수신하는 동안 오류가 발생했습니다. 이것은 서비스 엔드포인트 바인딩에서 HTTP 프로토콜을 사용하지 않기 때문일 수 있습니다. 또한 서비스 종료로 인해 서버가 HTTP 요청 컨텍스트를 중단하는 중이기 때문일 수 있습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Wystąpił błąd podczas odbierania odpowiedzi HTTP przez obiekt {0}. Być może powiązanie punktu końcowego usługi nie używa protokołu HTTP. Przyczyną może być również przerwanie kontekstu żądania HTTP przez serwer (prawdopodobnie przez zamknięcie usługi). Sprawdź dzienniki serwera, aby uzyskać więcej informacji.
pt_br: Erro ao receber a resposta HTTP para {0}. Isso pode estar relacionado ao fato de que a associação de ponto de extremidade de serviço não usa o protocolo HTTP. Também pode estar relacionado à anulação de um contexto de solicitação HTTP pelo servidor (possivelmente devido ao desligamento do serviço). Consulte os logs do servidor para obter mais detalhes.
tr: {0} öğesine HTTP yanıtı alınırken bir hata oluştu. Bunun nedeni HTTP protokolü kullanmayan hizmet uç noktası bağlaması olabilir. Ayrıca bu, sunucu tarafından iptal edilen bir HTTP isteği bağlamına da bağlı olabilir (büyük olasılıkla hizmetin kapatılmasına bağlı olarak). Diğer ayrıntılar için sunucu günlüklerine bakın.
zh_hans: 接收对 {0} 的 HTTP 响应时发生错误。这可能是由于服务终结点绑定未使用 HTTP 协议造成的。这还可能是由于服务器中止了 HTTP 请求上下文(可能由于服务关闭)所致。有关详细信息，请参见服务器日志。
zh_hant: 接收 {0} 的 HTTP 回應時發生錯誤。這可能是因為服務端點繫結未使用 HTTP 通訊協定所造成。也可能是伺服器中止 HTTP 要求內容 (可能因服務關閉) 所造成。請參閱伺服器記錄檔，以取得詳細資料。

# HttpRequestTimedOut
source: The HTTP request to '{0}' has exceeded the allotted timeout of {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Požadavek protokolu HTTP na {0} přesáhl přidělený časový limit {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die HTTP-Anforderung an "{0}" hat das dafür vorgesehene Zeitlimit von {1} überschritten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La solicitud HTTP a "{0}" superó el tiempo de espera asignado de {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La requête HTTP à '{0}' a dépassé le délai d'expiration alloué de {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: La richiesta HTTP a '{0}' ha superato il timeout allocato pari a {1}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: '{0}' に対する HTTP 要求が、割り当てられたタイムアウト時間 {1} を超えました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: '{0}'에 대한 HTTP 요청이 할당된 시간 제한 {1}을(를) 초과했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Żądanie HTTP skierowane do obiektu „{0}” przekroczyło przydzielony limit czasu {1}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A solicitação HTTP para '{0}' excedeu o tempo limite determinado de {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: '{0}' öğesine HTTP tarafından yapılan istek, ayrılan zaman aşımı süresini ({1}) aştı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 对“{0}”的 HTTP 请求已超过分配的超时 {1}。分配给此操作的时间可能比超时长。
zh_hant: 對 '{0}' 的 HTTP 要求已超出分配的逾時 {1}。分配給此作業的時間可能是較長逾時的一部分。

# HttpRequiresSingleAuthScheme
source: The '{0}' authentication scheme has been specified on the HTTP factory. However, the factory only supports specification of exactly one authentication scheme. Valid authentication schemes are Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication, or Anonymous.
cs: Schéma ověřování {0} bylo určeno v objektu pro vytváření protokolu HTTP. Objekt pro vytváření však podporuje pouze specifikaci právě jednoho schématu ověřování. Platná schémata ověřování jsou Digest (Stručný), Negotiate (Vyjednaný), NTLM, Basic (Základní), IntegratedWindowsAuthentication a Anonymous (Anonymní).
de: Das Authentifizierungsschema "{0}" wurde für die HTTP-Factory angegeben. Die Factory unterstützt jedoch nur die Angabe genau eines Authentifizierungsschemas. Gültige Authentifizierungsschemas sind Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication oder Anonymous.
es: El esquema de autenticación "{0}" ha sido especificado en la fábrica HTTP. Sin embargo, la fábrica sólo admite la especificación de exactamente un esquema de autenticación. Los esquemas de autenticación válidos son Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication o Anonymous.
fr: Le modèle d'authentification «{0}» a été spécifié sur la fabrique HTTP. Cependant, la fabrique ne prend en charge qu'un seul schéma d'authentification. Les schémas d'authentification valides sont Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication ou Anonymous.
it: Nella factory HTTP è stato specificato lo schema di autenticazione "{0}", ma la factory supporta solo la specifica di un unico schema di autenticazione. Gli schemi di autenticazione validi sono Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication o Anonymous.
ja: '{0}' 認証方式が HTTP ファクトリに指定されていますが、ファクトリは ExactlyOne 認証しかサポートしていません。有効な認証方式は、Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication、または Anonymous です。
ko: '{0}' 인증 구성표가 HTTP 팩터리에 지정되었습니다. 그러나 이 팩터리에서는 오직 하나의 인증 구성표 지정만 지원할 수 있습니다. 유효한 인증 구성표는 다이제스트, 협상, NTLM, 기본, IntegratedWindowsAuthentication 또는 익명입니다.
pl: Określono schemat uwierzytelniania "{0}" w fabryce HTTP. Jednak fabryka obsługuje tylko specyfikację dokładnie jednego schematu uwierzytelniania. Prawidłowe schematy uwierzytelniania to Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication lub Anonymous.
pt_br: O esquema de autenticação '{0}' foi especificado na fábrica HTTP. No entanto, a fábrica suporta apenas a especificação de, exatamente, um esquema de autenticação. Os esquemas de autenticação válidos são Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication ou Anonymous.
tr: '{0}' kimlik doğrulama düzeni HTTP fabrikasında belirtildi. Ancak, fabrika yalnızca tam olarak bir kimlik doğrulama düzeni belirtilmesini destekler. Geçerli kimlik doğrulama düzenleri: Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication veya Anonymous.
zh_hans: 已在 HTTP 工厂上指定了“{0}”身份验证方案。但是，该工厂仅支持只指定一种身份验证方案。有效的身份验证方案为 Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication 或 Anonymous。
zh_hant: HTTP 處理站上已指定 '{0}' 驗證配置。但處理站僅支援指定一個驗證配置。有效的驗證配置為 Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication 或 Anonymous。

# HttpResponseTimedOut
source: The HTTP request to '{0}' has exceeded the allotted timeout of {1} while reading the response. The time allotted to this operation may have been a portion of a longer timeout.
cs: Požadavek protokolu HTTP na {0} přesáhl přidělený časový limit{1} při čtení odpovědi. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die HTTP-Anforderung für "{0}" hat das vorgesehene Zeitlimit von {1} beim Lesen der Antwort überschritten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La solicitud HTTP a "{0}" ha superado el tiempo de espera asignado de {1} mientras leía la respuesta. Es posible que el tiempo asignado a esta operación haya sido una parte de un tiempo de espera mayor.
fr: La requête HTTP vers '{0}' a dépassé le délai d'expiration alloué de {1} durant la lecture de la réponse. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: La richiesta HTTP a '{0}' ha superato il timeout allocato pari a {1} durante la lettura della risposta. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 応答を読み取っている間に、'{0}' に対する HTTP 要求が、割り当てられたタイムアウト時間 {1} を超えました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 응답을 읽는 동안 '{0}'에 대한 HTTP 요청이 할당된 시간 제한 {1}을(를) 초과했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Żądanie HTTP skierowane do „{0}” przekroczyło przydzielony limit czasu ({1}) podczas odczytu odpowiedzi. Czas przydzielony na wykonanie tej operacji mógł stanowić część większego limitu czasu.
pt_br: A solicitação HTTP para '{0}' excedeu o tempo limite determinado de {1} ao ler a resposta. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: '{0}' tarafına gönderilen HTTP isteği, yanıt okurken ayrılan {1} zaman aşımı süresini aştı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 读取响应时，对“{0}”的 HTTP 请求已超过分配的超时 {1}。分配给此操作的时间可能比超时长。
zh_hant: 讀取回應時，'{0}' 的 HTTP 要求超過分配的逾時 ({1})。分配給此作業的時間可能是較長逾時的一部分。

# HttpServerTooBusy
source: The HTTP service located at {0} is unavailable. This could be because the service is too busy or because no endpoint was found listening at the specified address. Please ensure that the address is correct and try accessing the service again later.
cs: Služba HTTP umístěná na adrese {0} není k dispozici. Příčinou může být to, že služba je zaneprázdněna nebo že nebyl nalezen žádný koncový bod naslouchající na této adrese. Ověřte, zda je tato adresa správná, a pokuste se opět později o přístup k této službě.
de: Der HTTP-Dienst unter {0} ist nicht verfügbar. Möglicherweise ist der Dienst ausgelastet, oder es wurde kein Endpunkt gefunden, der an der angegebenen Adresse lauscht. Stellen Sie sicher, dass die richtige Adresse angegeben ist, und versuchen Sie später noch mal, auf den Dienst zuzugreifen.
es: El servicio HTTP ubicado en {0} no está disponible. Esto puede deberse a que el servicio está demasiado ocupado o porque el punto de conexión estaba a la escucha en la dirección especificada. Asegúrese de que la dirección es correcta e intente obtener acceso al servicio de nuevo más tarde.
fr: Le service HTTP situé sur {0} n'est pas disponible. Cela peut être dû au fait que le service est trop occupé ou qu'aucun point de terminaison n'était à l'écoute à l'adresse spécifiée. Vérifiez que l'adresse est correcte, puis réessayez d'accéder au service plus tard.
it: Il servizio HTTP alla posizione {0} non è disponibile. È possibile che il servizio sia troppo occupato o che non sia stato trovato alcun endpoint in ascolto all'indirizzo specificato. Assicurarsi che l'indirizzo sia corretto e ripetere l'accesso al servizio più tardi.
ja: {0} の HTTP サービスを使用できません。原因としては、サービスがビジー状態であることや、指定されたアドレスでリッスンするエンドポイントが見つからなかったことが考えられます。アドレスが正しいことを確認し、後でもう一度サービスにアクセスしてください。
ko: {0}에 있는 HTTP 서비스를 사용할 수 없습니다. 서비스를 사용 중이거나 지정된 주소로 수신 중인 엔드포인트를 찾을 수 없기 때문일 수 있습니다. 주소가 올바른지 확인하고 나중에 다시 서비스에 액세스해보세요.
pl: Usługa HTTP zlokalizowana na serwerze {0} jest niedostępna. Może to być spowodowane tym, że usługa jest zbyt zajęta, lub tym, że pod określonym adresem nie nasłuchuje żaden punkt końcowy. Upewnij się, że ten adres jest poprawny, i spróbuj ponownie uzyskać dostęp do tej usługi później.
pt_br: O serviço HTTP localizado em {0} não está disponível. Talvez isso ocorreu porque o serviço está muito ocupado ou porque nenhum ponto de extremidade foi encontrado escutando no endereço especificado. Verifique se o endereço está correto e tente acessar o serviço novamente mais tarde.
tr: {0} konumundaki HTTP hizmeti kullanılamıyor. Bunun nedeni hizmetin çok meşgul olması veya belirtilen adreste dinleme yapan bir uç nokta bulunamaması olabilir. Lütfen adresin doğru olduğundan emin olun ve hizmete erişmeyi daha sonra yeniden deneyin.
zh_hans: 位于 {0} 的 HTTP 服务不可用。这可能是因为该服务太忙，或是因为未找到侦听指定地址的终结点。请确保地址正确，并在稍后再次尝试访问该服务。
zh_hant: 位於 {0} 的 HTTP 服務無法使用。可能是因為服務過於忙碌，或是接聽指定的位址時未找到端點。請確認該位址正確，並稍後再嘗試存取服務。

# HttpSoapActionMismatch
source: The SOAP action specified on the message, '{0}', does not match the action specified on the HttpRequestMessageProperty, '{1}'.
cs: Akce SOAP určená ve zprávě, {0}, neodpovídá akci určené ve třídě HttpRequestMessageProperty, {1}.
de: Die für die Nachricht angegebene SOAP-Aktion "{0}" entspricht nicht der für HttpRequestMessageProperty angegebenen Aktion "{1}".
es: La acción SOAP especificada en el mensaje, "{0}", no coincide con la acción especificada en HttpRequestMessageProperty, "{1}".
fr: L'action SOAP spécifiée sur le message, '{0}', ne correspond pas à l'action spécifiée sur HttpRequestMessageProperty, '{1}'.
it: L'azione SOAP '{0}' specificata nel messaggio non corrisponde a quella '{1}' specificata nell'elemento HttpRequestMessageProperty.
ja: メッセージで指定した SOAP アクション '{0}' が、HttpRequestMessageProperty で指定したアクション '{1}' と一致しません。
ko: 메시지에 지정한 SOAP 동작 '{0}'이(가) HttpRequestMessageProperty에 지정한 '{1}' 동작과 일치하지 않습니다.
pl: Akcja SOAP określona dla wiadomości („{0}”) jest niezgodna z akcją określoną we właściwości HttpRequestMessageProperty („{1}”).
pt_br: A ação de SOAP especificada na mensagem, '{0}', não corresponde à ação especificada em HttpRequestMessageProperty, '{1}'.
tr: '{0}' iletisinde belirtilen SOAP eylemi, HttpRequestMessageProperty, '{1}' içinde belirtilen eylemle eşleşmiyor.
zh_hans: 消息上指定的 SOAP 操作“{0}”与在 HttpRequestMessageProperty 上指定的操作“{1}”不匹配。
zh_hant: 在訊息 '{0}' 指定的 SOAP 動作與在 HttpRequestMessageProperty '{1}' 指定的動作不相符。

# HttpSoapActionMismatchContentType
source: The SOAP action specified on the message, '{0}', does not match the action specified in the content-type of the HttpRequestMessageProperty, '{1}'.
cs: Akce SOAP určená ve zprávě, {0}, neodpovídá akci určené v typu obsahu třídy HttpRequestMessageProperty, {1}.
de: Die für die Nachricht angegebene SOAP-Aktion "{0}" entspricht nicht der im Inhaltstyp von HttpRequestMessageProperty angegebenen Aktion "{1}".
es: La acción SOAP especificada en el mensaje, "{0}", no coincide con la acción especificada en el tipo de contenido de HttpRequestMessageProperty, "{1}".
fr: L'action SOAP spécifiée sur le message, '{0}', ne correspond pas à l'action spécifiée dans le type de contenu de HttpRequestMessageProperty, '{1}'.
it: L'azione SOAP '{0}' specificata nel messaggio non corrisponde a quella '{1}' specificata nell'elemento content-type di HttpRequestMessageProperty.
ja: メッセージで指定した SOAP アクション '{0}' が、HttpRequestMessageProperty の content-type で指定したアクション '{1}' と一致しません。
ko: 메시지에 지정한 SOAP 동작 '{0}'이(가) HttpRequestMessageProperty의 content-type에 지정한 '{1}' 동작과 일치하지 않습니다.
pl: Akcja SOAP określona dla wiadomości („{0}”) jest niezgodna z akcją określoną w elemencie Content-Type właściwości HttpRequestMessageProperty („{1}”).
pt_br: A ação de SOAP especificada na mensagem, '{0}', não corresponde à ação especificada no tipo de conteúdo de HttpRequestMessageProperty, '{1}'.
tr: '{0}' iletisinde belirtilen SOAP eylemi, HttpRequestMessageProperty, '{1}' içerik türünde belirtilen eylemle eşleşmiyor.
zh_hans: 消息上指定的 SOAP 操作“{0}”与在 HttpRequestMessageProperty 的内容类型上指定的操作“{1}”不匹配。
zh_hant: 在訊息 '{0}' 指定的 SOAP 動作與在 HttpRequestMessageProperty '{1}' 的 content-type 指定的動作不相符。
