Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SyncAsyncMatchConsistency_Attributes6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, any additional attributes must be declared on the synchronous OperationContract method. In this case, the asynchronous OperationContract method '{2}' has one or more attributes of type '{5}'. To fix it, remove the '{5}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} v typu {1} byla spojena s asynchronními metodami OperationContract {2} a {3}, protože mají stejný název operace {4}. Když je synchronní metoda OperationContract spojena s párem asynchronních metod OperationContract, musejí být všechny dodatečné atributy deklarovány v synchronní metodě OperationContract. V tomto případě má asynchronní metoda OperationContract {2} jeden nebo více atributů typu {5}. Pokud chcete situaci napravit, odeberte atribut nebo atributy {5} z metody {2}. Je také možné zabránit spojení změnou názvu jedné z metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine synchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen alle zusätzlichen Attribute für die synchrone OperationContract-Methode deklariert werden. In diesem Fall weist die asynchrone OperationContract-Methode "{2}" mindestens ein Attribut vom Typ "{5}" auf. Entfernen Sie das bzw. die {5}-Attribute aus der Methode "{2}", um das Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: Se estableció la correspondencia del método OperationContract sincrónico "{0}" en el tipo "{1}" con los métodos OperationContract asincrónicos "{2}" y "{3}" porque tienen el mismo nombre de operación "{4}". Cuando se establece la correspondencia de un método OperationContract sincrónico con un par de métodos OperationContract asincrónicos, los atributos adicionales deben declararse en el método OperationContract sincrónico. En este caso, el método OperationContract asincrónico "{2}" tiene uno o varios atributos de tipo "{5}". Para corregirlo, quite el atributo o atributos "{5}" del método "{2}". Como alternativa, puede cambiar el nombre de uno de los métodos para evitar la correspondencia.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les éventuels attributs supplémentaires doivent être déclarés sur la méthode OperationContract synchrone. Dans ce cas, la méthode OperationContract asynchrone '{2}' a un ou plusieurs attributs de type '{5}'. Pour corriger le problème, supprimez l'attribut '{5}' ou les attributs de la méthode '{2}'. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract sincrono viene abbinato a una coppia di metodi OperationContract asincroni, gli eventuali attributi aggiuntivi devono essere dichiarati nel metodo OperationContract asincrono. In questo caso, il metodo OperationContract '{2}' asincrono contiene uno o più attributi di tipo '{5}'. Per risolvere il problema, rimuovere l'attributo o gli attributi '{5}' dal metodo '{2}'. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、追加の属性はすべて同期 OperationContract メソッドで宣言する必要があります。このケースでは、非同期 OperationContract メソッド '{2}' に型 '{5}' の 1 つ以上の属性があります。この問題を修正するには、'{5}' 属性をすべてメソッド '{2}' から削除します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 같은 작업 이름 '{4}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하면 동기 OperationContract 메서드에서 추가 특성을 선언해야 합니다. 이 경우 비동기 OperationContract 메서드 '{2}'에는 '{5}' 형식의 특성이 하나 이상 있어야 합니다. 이 문제를 해결하려면 '{5}' 특성이나 '{2}' 메서드의 특성을 제거하세요. 또는 메서드 중 하나의 이름을 바꾸면 서로 일치하지 않게 됩니다.
pl: Metoda synchroniczna klasy OperationContract „{0}” w typie „{1}” została dopasowana do asynchronicznych metod klasy OperationContract „{2}” i „{3}”, ponieważ mają tę samą nazwę operacji „{4}”. Gdy metoda synchroniczna klasy OperationContract zostanie dopasowana do pary metod asynchronicznych klasy OperationContract, wszelkie atrybuty dodatkowe muszą być zadeklarowane w metodzie synchronicznej klasy OperationContract. W tym przypadku metoda asynchroniczna klasy OperationContract „{2}” ma co najmniej jeden atrybut typu „{5}”. Aby to naprawić, usuń atrybut lub atrybuty „{5}” z metody „{2}”. Ewentualnie można uniemożliwić dopasowanie, zmieniając nazwę jednej z metod.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método síncrono OperationContract coincide com um par de métodos assíncronos OperationContract, qualquer atributo adicional deve ser declarado no método síncrono OperationContract. Nesse caso, o método assíncrono OperationContract '{2}' tem um ou mais atributos do tipo '{5}'. Para corrigir isso, remova o atributo ou os atributos '{5}' do método '{2}'. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: '{1}' türündeki '{0}' zaman uyumlu OperationContract metodu, aynı '{4}' işlem adına sahip olduklarından, asenkron OperationContract metotları '{2}' ve '{3}' ile eşleştirilmişti. Zaman uyumlu bir OperationContract metodu, asenkron bir çift OperationContract metoduyla eşleştirildiğinde, ek özniteliklerin zaman uyumlu OperationContract metodunda tanımlanması gerekir. Bu durumda, asenkron OperationContract metodu '{2}' bir veya birkaç '{5}' türünde özniteliğe sahiptir. Bunu düzeltmek için '{5}' özniteliğini ya da özniteliklerini '{2}' metodundan kaldırın. Alternatif olarak metotlardan birinin adını değiştirmek de eşleşmeyi önler.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当同步 OperationContract 方法与一对异步 OperationContract 方法匹配时，必须在同步 OperationContract 方法上声明任何其他特性。在本例中，异步 OperationContract 方法“{2}”有一个或多个类型为“{5}”的特性。要修复此问题，请从方法“{2}”中删除“{5}”特性(一个或多个)。或者，更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當同步 OperationContract 方法符合一對非同步 OperationContract 方法時，其他任何屬性皆必須在非同步 OperationContract 方法上宣告。在此例中，非同步 OperationContract 方法 '{2}' 具有一或多個類型 '{5}' 的屬性。若要修正此問題，請移除 '{5}' 屬性，或移除方法 '{2}' 的屬性。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# SyncAsyncMatchConsistency_Parameters5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} v typu {1} byla spojena s asynchronními metodami OperationContract {2} a {3}, protože mají stejný název operace {4}. Když je synchronní metoda OperationContract spojena s párem asynchronních metod OperationContract, dvě metody OperationContracts musejí definovat stejný počet a typ parametrů. V tomto případě se některé argumenty liší. Pokud chcete situaci napravit, zajistěte, aby měly metody OperationContracts stejný počet a typ argumentů, ve stejném pořadí. Je také možné zabránit spojení změnou názvu jedné z metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine synchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts die gleiche Anzahl und den gleichen Typ von Parametern definieren. In diesem Fall sind einige Argumente unterschiedlich. Stellen Sie sicher, dass die OperationContracts die gleiche Anzahl und den gleichen Typ von Argumenten in der gleichen Reihenfolge definieren, um das Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: Se estableció la correspondencia del método OperationContract sincrónico "{0}" en el tipo "{1}" con los métodos OperationContract asincrónicos "{2}" y "{3}" porque tienen el mismo nombre de operación "{4}". Cuando se establece la correspondencia de un método OperationContract sincrónico con un par de métodos OperationContract asincrónicos, los dos métodos OperationContract deben definir el mismo número y tipos de parámetros. En este caso, algunos argumentos son diferentes. Para corregirlo, asegúrese de que se definen el mismo número y tipos de argumentos en el mismo orden en los métodos OperationContract. Como alternativa, puede cambiar el nombre de uno de los métodos para evitar la correspondencia.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent définir le même nombre et les mêmes types de paramètre. Dans ce cas, certains des arguments sont différents. Pour corriger ce problème, vérifiez que les méthodes OperationContracts définissent le même nombre et les mêmes types d'argument, dans le même ordre. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract sincrono viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono definire lo stesso numero e gli stessi tipi di parametri. In questo caso, alcuni degli argomenti sono diversi. Per risolvere il problema, verificare che i metodi OperationContract definiscano lo stesso numero e gli stessi tipi di parametri nello stesso ordine. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract では同じ数と型のパラメーターを定義する必要があります。このケースでは、一部の引数が異なります。この問題を修正するには、これらの OperationContract で同じ数と型の引数を同じ順序で定義します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'은(는) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 같은 작업 이름 '{4}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하면 두 OperationContract가 같은 수와 형식의 매개 변수를 정의해야 합니다. 이 경우에는 일부 인수가 다릅니다. 이 문제를 해결하려면 OperationContract가 같은 수와 형식의 인수를 같은 순서로 정의하는지 확인하세요. 또는 메서드 중 하나의 이름을 바꾸면 서로 일치하지 않게 됩니다.
pl: Metoda synchroniczna klasy OperationContract „{0}” w typie „{1}” została dopasowana do metod asynchronicznych klasy OperationContract „{2}” i „{3}”, ponieważ mają tę samą nazwę operacji „{4}”. Gdy metoda synchroniczna klasy OperationContract zostanie dopasowana do pary metod asynchronicznych klasy OperationContract, w obu klasach OperationContract musi być zdefiniowana ta sama liczba parametrów tych samych typów. W tym przypadku niektóre argumenty są różne. Aby to naprawić, dopilnuj, aby w klasach OperationContract była zdefiniowana ta sama liczba argumentów tego samego typu, w tej samej kolejności. Ewentualnie można uniemożliwić dopasowanie, zmieniając nazwę jednej z metod.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método síncrono OperationContract coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem definir o mesmo número e tipos de parâmetros. Nesse caso, alguns dos argumentos são diferentes. Para corrigir isso, verifique se os OperationContracts definem o mesmo número e tipos de argumentos, na mesma ordem. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: '{1}' türündeki '{0}' zaman uyumlu OperationContract metodu, aynı '{4}' işlem adına sahip olduklarından, asenkron OperationContract metotları '{2}' ve '{3}' ile eşleştirilmişti. Zaman uyumlu bir OperationContract metodu, asenkron bir çift OperationContract metoduyla eşleştirildiğinde, iki OperationContract aynı sayıda ve türde parametre tanımlamalıdır. Bu durumda, bazı bağımsız değişkenler farklıdır. Bunu düzeltmek için OperationContract metotlarının aynı sayıda ve türde bağımsız değişkeni, aynı düzende tanımlamasını sağlayın. Alternatif olarak metotlardan birinin adını değiştirmek de eşleşmeyi önler.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当同步 OperationContract 方法与一对异步 OperationContract 方法匹配时，这两个 OperationContracts 必须定义相同的参数数目和类型。在本例中，某些参数是不同的。要修复此问题，请确保 OperationContracts 以相同的顺序定义相同的参数数目和类型。或者，更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當同步 OperationContract 方法符合一對非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同數量與類型的參數。在此例中，部分引數不同。若要修正此問題，請確認 OperationContract 定義相同數量與類型的引數，且順序也相同。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# SyncAsyncMatchConsistency_Property6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must have the same value for the '{5}' property. In this case, the values are different. To fix it, change the '{5} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} v typu {1} byla spojena s asynchronními metodami OperationContract {2} a {3}, protože mají stejný název operace {4}. Když je synchronní metoda OperationContract spojena s párem asynchronních metod OperationContract, dvě metody OperationContracts musejí mít stejnou hodnotu pro vlastnost {5}. V tomto případě se hodnoty liší. Pokud chcete situaci napravit, změňte vlastnost {5} jedné z metod OperationContracts, aby byly stejné. Je také možné zabránit spojení změnou názvu jedné z metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine synchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts den gleichen Wert für die {5}-Eigenschaft haben. In diesem Fall sind die Werte unterschiedlich. Ändern Sie die {5}-Eigenschaft eines der beiden OperationContracts, sodass sie einander entsprechen. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: Se estableció la correspondencia del método OperationContract sincrónico "{0}" en el tipo "{1}" con los métodos OperationContract asincrónicos "{2}" y "{3}" porque tienen el mismo nombre de operación "{4}". Cuando se establece la correspondencia de un método OperationContract sincrónico con un par de métodos OperationContract asincrónicos, los dos métodos OperationContract deben tener el mismo valor para la propiedad "{5}". En este caso, los valores son diferentes. Para corregirlo, cambie la propiedad "{5} de uno de los métodos OperationContract para que coincida con el otro. Como alternativa, puede cambiar el nombre de uno de los métodos para evitar la correspondencia.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent contenir la même valeur pour la propriété '{5}'. Dans ce cas, les valeurs sont différentes. Pour corriger le problème, modifiez la propriété '{5}' de l'une des méthodes OperationContracts pour qu'elle corresponde à l'autre. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract sincrono viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono avere lo stesso valore per la proprietà '{5}'. In questo caso, i valori sono diversi. Per risolvere il problema, modificare la proprietà '{5} di uno dei metodi OperationContract in modo tale che i valori corrispondano. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract は同じ値の '{5}' プロパティを持つ必要があります。このケースでは、これらの値が異なります。この問題を修正するには、いずれかの OperationContract の '{5}' プロパティを変更して、他の '{5}' プロパティと一致させます。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'은(는) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 같은 작업 이름 '{4}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하면 두 OperationContract가 '{5}' 속성에 대해 같은 값을 가져야 합니다. 이 경우에는 값이 다릅니다. 이 문제를 해결하려면 다른 속성과 일치하도록 OperationContract 중 하나의 '{5}' 속성을 바꾸세요. 또는 메서드 중 하나의 이름을 바꾸면 일치하지 않게 됩니다.
pl: Metoda synchroniczna klasy OperationContract „{0}” w typie „{1}” została dopasowana do metod asynchronicznych klasy OperationContract „{2}” i „{3}”, ponieważ mają tę samą nazwę operacji „{4}”. Gdy metoda synchroniczna klasy OperationContract zostanie dopasowana do pary metod asynchronicznych klasy OperationContract, w obu klasach OperationContract musi mieć tę samą wartość właściwości „{5}”. W tym przypadku wartości są różne. Aby to naprawić, zmień właściwość „{5}” jednej z klas OperationContracts na zgodną z drugą. Ewentualnie można uniemożliwić dopasowanie, zmieniając nazwę jednej z metod.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método síncrono OperationContract coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem ter o mesmo valor para a propriedade '{5}'. Nesse caso, os valores são diferentes. Para corrigir isso, altere a propriedade '{5} de um dos OperationContracts para coincidir com o outro. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: '{1}' türündeki '{0}' zaman uyumlu OperationContract metodu, aynı işlem adı '{4}' değerine sahip olduklarından, zaman uyumlu olmayan '{2}' ve '{3}' OperationContract metotlarıyla eşleştirildi. Zaman uyumlu bir OperationContract metodu, zaman uyumsuz bir çift OperationContract metoduyla eşleştirildiğinde, iki OperationContracts öğesi de '{5}' özelliği için aynı değere sahip olmalıdır. Bu durumdaki değerler farklıdır. Bunu düzeltmek için bir OperationContracts öğesinin '{5} özelliğini diğeriyle eşleşecek biçimde değiştirin. Alternatif olarak, metotlardan birinin adını değiştirmeniz de eşleşmeyi önleyecektir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当同步 OperationContract 方法与一对异步 OperationContract 方法匹配时，这两个 OperationContracts 必须具有相同的“{5}”属性值。在本例中，值是不同的。要修复此问题，请更改其中一个 OperationContracts 的“{5}”属性以与另一个匹配。或者，更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 中的同步 OperationContract 方法 '{0}' 與非同步 OperationContract 方法 '{2}' 及 '{3}' 符合，因為它們都有相同的作業名稱 '{4}'。如果同步 OperationContract 方法符合一組非同步 OperationContract 方法，兩個 OperationContract 的 '{5}' 屬性值就會相同。在這種狀況下，兩個值是不同的。若要修正此問題，請變更其中一個 OperationContract 的 '{5} 屬性，使其彼此相符。或者也可以變更其中一個方法的名稱，即可避免發生相符狀況。
