Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# MultipleStreamUpgradeProvidersInParameters
source: More than one IStreamUpgradeProviderElement was found in the BindingParameters of the BindingContext. This usually is caused by having multiple IStreamUpgradeProviderElements in a CustomBinding. Remove all but one of these elements.
cs: Ve třídě BindingParameters třídy BindingContext bylo nalezeno více tříd IStreamUpgradeProviderElement. To je obvykle způsobeno existencí více tříd IStreamUpgradeProviderElements ve třídě CustomBinding. Až na jeden odeberte všechny tyto elementy.
de: In den BindingParameters von BindingContext wurde mehr als ein IStreamUpgradeProviderElement gefunden. Dies ist im Allgemeinen darauf zurückzuführen, dass eine CustomBinding mehrere IStreamUpgradeProviderElements enthält. Entfernen Sie alle Elemente bis auf eins.
es: Se encontró más de un elemento IStreamUpgradeProviderElement en los parámetros BindingParameter de BindingContext. La causa suele ser que hay varios elementos IStreamUpgradeProviderElements en un enlace CustomBinding. Quite todos estos elementos menos uno.
fr: Plusieurs éléments IStreamUpgradeProviderElement ont été trouvés dans les paramètres BindingParameters du contexte BindingContext. Cette situation est généralement due à l'existence de plusieurs éléments IStreamUpgradeProviderElements dans un élément CustomBinding. Supprimez tous ces éléments sauf un.
it: Nell'elemento BindingParameters di BindingContext sono stati trovati più elementi IStreamUpgradeProviderElement. Questa situazione si verifica in genere perché in un elemento CustomBinding sono presenti più elementi IStreamUpgradeProviderElement. Rimuovere tutti gli elementi tranne uno.
ja: BindingContext の BindingParameter に複数の IStreamUpgradeProviderElement が見つかりました。これは一般的には CustomBinding に複数の IStreamUpgradeProviderElement があることにより起こります。これらの要素のうち 1 つを除くすべてを削除してください。
ko: 둘 이상의 IStreamUpgradeProviderElement를 BindingContext의 BindingParameters에서 찾았습니다. 이것은 일반적으로 CustomBinding에 여러 IStreamUpgradeProviderElements가 있기 때문에 발생합니다. 이러한 요소를 하나만 제외하고 모두 제거하세요.
pl: W parametrach BindingParameters elementu BindingContext wykryto więcej niż jeden element IStreamUpgradeProviderElement. Jest to zazwyczaj spowodowane umieszczeniem wielu elementów IStreamUpgradeProviderElements w powiązaniu CustomBinding. Usuń wszystkie elementy z wyjątkiem jednego.
pt_br: Mais de um IStreamUpgradeProviderElement foi encontrado nos BindingParameters do BindingContext. Isso geralmente ocorre porque existem vários IStreamUpgradeProviderElements em uma CustomBinding. Remova esses elementos, deixando apenas um.
tr: BindingContext BindingParameters içinde birden çok IStreamUpgradeProviderElement bulundu. Bu genellikle, bir CustomBinding içinde birkaç IStreamUpgradeProviderElements bulunması nedeniyle oluşur. Öğeleri yalnızca bir tane kalacak biçimde kaldırın.
zh_hans: 在 BindingContext 的 BindingParameters 中找到多个 IStreamUpgradeProviderElement。这通常是因为 CustomBinding 中具有多个 IStreamUpgradeProviderElements 所导致的。请保留一个元素，删除所有剩余元素。
zh_hant: 在 BindingContext 的 BindingParameters 中找到多個 IStreamUpgradeProviderElement。這通常是因為 CustomBinding 中有多個 IStreamUpgradeProviderElements 所造成。請保留其中一項元素，其他全部移除。

# MultipleSupportingAuthenticatorsOfSameType
source: Multiple supporting token authenticators with the token parameter type equal to '{0}' cannot be specified. If more than one Supporting Token of the same type is expected in the response, then configure the supporting token collection with just one entry for that SecurityTokenParameters. The SecurityTokenAuthenticator that gets created from the SecurityTokenParameters will be used to authenticate multiple tokens. It is not possible to add SecurityTokenParameters of the same type in the SupportingTokenParameters collection or repeat it across EndpointSupportingTokenParameters and OperationSupportingTokenParameters.
cs: Nelze určit více ověřovacích dat podpůrného tokenu pomocí typu parametru tokenu, který má hodnotu {0}. Pokud je v odpovědi očekáván více než jeden podpůrný token stejného typu, nakonfigurujte kolekci podpůrných tokenů s pouze jednou položkou pro parametr SecurityTokenParameters. Ověřovací data SecurityTokenAuthenticator, která budou vytvořena na základě parametrů SecurityTokenParameter, budou použita k ověření více tokenů. Nelze přidat parametry SecurityTokenParameter stejného typu ke kolekci SupportingTokenParameters nebo je opakovat mezi parametry EndpointSupportingTokenParameter a OperationSupportingTokenParameter.
de: Es können nicht mehrere unterstützende Tokenauthentifizierer mit dem Tokenparametertyp "{0}" angegeben werden. Wenn in der Antwort mehr als ein unterstützendes Token desselben Typs erwartet wird, konfigurieren Sie die unterstützende Tokensammlung mit nur einem Eintrag für diese SecurityTokenParameters. Der SecurityTokenAuthenticator, der aus den SecurityTokenParameters erstellt wird, wird zum Authentifizieren mehrerer Token verwendet. Weder das Hinzufügen von SecurityTokenParameters desselben Typs in der SupportingTokenParameters-Sammlung noch das Wiederholen über EndpointSupportingTokenParameters und OperationSupportingTokenParameters ist möglich.
es: No se pueden especificar varios autenticadores de token auxiliar con el tipo de parámetro igual a "{0}". Si se espera más de un token auxiliar del mismo tipo en la respuesta, configure la colección de tokens auxiliares para una única entrada para dicho elemento SecurityTokenParameters. El objeto SecurityTokenAuthenticator que se crea con el elemento SecurityTokenParameters se usará para autenticar varios tokens. No es posible agregar el elemento SecurityTokenParameters del mismo tipo en la colección de SupportingTokenParameters o repetirlos en EndpointSupportingTokenParameters ni en OperationSupportingTokenParameters.
fr: Impossible de spécifier plusieurs authentificateurs de jeton de support avec le type de paramètre de jeton égal à '{0}'. Si plusieurs jetons de support du même type sont attendus dans la réponse, configurez la collection de jetons de support avec une seule entrée pour ces paramètres SecurityTokenParameters. L'authentificateur SecurityTokenAuthenticator créé à partir des paramètres SecurityTokenParameters sera utilisé pour authentifier plusieurs jetons. Il n'est pas possible d'ajouter des paramètres SecurityTokenParameters du même type dans la collection SupportingTokenParameters ou de les répéter dans les paramètres EndpointSupportingTokenParameters et OperationSupportingTokenParameters.
it: Non è possibile specificare più autenticatori di token di supporto con il tipo di parametro del token uguale a '{0}'. Se nella risposta sono previsti più token di supporto dello stesso tipo, configurare la raccolta di token di supporto con una sola voce per tale elemento SecurityTokenParameters. L'elemento SecurityTokenAuthenticator che viene creato da SecurityTokenParameters verrà usato per autenticare più token. Non è possibile aggiungere elementi SecurityTokenParameter dello stesso tipo nella raccolta di SupportingTokenParameters o ripeterli in EndpointSupportingTokenParameters e OperationSupportingTokenParameters.
ja: トークン パラメーターの型が '{0}' であるサポート トークン認証システムを複数指定することはできません。応答内で同じ種類の複数のサポート トークンが要求される場合は、サポート トークン コレクションをその SecurityTokenParameters に対する 1 つのエントリのみで構成します。SecurityTokenParameters から作成される SecurityTokenAuthenticator が、複数のトークンを認証するために使用されます。同じ種類の SecurityTokenParameters を SupportingTokenParameters コレクション内に追加したり、EndpointSupportingTokenParameters および OperationSupportingTokenParameters で繰り返したりすることはできません。
ko: '{0}'과(와) 동일한 토큰 매개 변수 형식을 사용하여 여러 지원 토큰 인증자를 지정할 수 없습니다. 응답에 동일한 형식의 지원 토큰이 둘 이상 필요할 경우 해당 SecurityTokenParameters에 대해 하나의 항목만을 사용하여 지원 토큰 컬렉션을 구성하세요. SecurityTokenParameters에서 만들어진 SecurityTokenAuthenticator는 여러 토큰을 인증하는 데 사용됩니다. SupportingTokenParameters 컬렉션에서 동일한 형식의 SecurityTokenParameters를 추가하거나 EndpointSupportingTokenParameters 및 OperationSupportingTokenParameters에서 SecurityTokenParameters를 반복할 수 없습니다.
pl: Nie można określić wielu wystawców uwierzytelnienia tokenu pomocniczego o typie parametru tokenu równym {0}. Jeśli w odpowiedzi jest oczekiwany więcej niż jeden token pomocniczy, należy skonfigurować kolekcję tokenów pomocniczych za pomocą tylko jednego wpisu klasy SecurityTokenParameters. Klasa SecurityTokenAuthenticator, która zostanie utworzona na podstawie klasy SecurityTokenParameters, będzie używana do uwierzytelniania wielu tokenów. Nie można dodać klasy SecurityTokenParameters tego samego typu w kolekcji SupportingTokenParameters ani powtórzyć jej we właściwościach EndpointSupportingTokenParameters i OperationSupportingTokenParameters.
pt_br: Não é possível especificar vários autenticadores de token de suporte com o tipo de parâmetro de token igual a '{0}'. Se mais de um Token de Suporte do mesmo tipo for esperado na resposta, configure a coleção de tokens de suporte com apenas uma entrada para os SecurityTokenParameters. O SecurityTokenAuthenticator criado com base nos SecurityTokenParameters será usado para autenticar vários tokens. Não é possível adicionar SecurityTokenParameters do mesmo tipo na coleção de SupportingTokenParameters ou repeti-los pelos EndpointSupportingTokenParameters e pelos OperationSupportingTokenParameters.
tr: Belirteç parametresi türü '{0}' değerine eşit olarak birden fazla destekleyici belirteç kimlik doğrulayıcısı belirtilemez. Yanıtta aynı türde birden fazla Destekleyici Belirteç bekleniyorsa, destekleyici belirteç koleksiyonunu bu SecurityTokenParameters için yalnızca bir girişle yapılandırın. SecurityTokenParameters'dan oluşturulan SecurityTokenAuthenticator birden fazla belirtecin kimliğini doğrulamak için kullanılacaktır. SupportingTokenParameters koleksiyonuna aynı türde SecurityTokenParameters eklemek veya bunu EndpointSupportingTokenParameters ile OperationSupportingTokenParameters boyunca yinelemek mümkün değildir.
zh_hans: 无法指定令牌参数类型等于“{0}”的多个支持令牌身份验证器。如果响应中预计有多个相同类型的支持令牌，则配置支持令牌集合时对该 SecurityTokenParameters 只应有一个条目。从 SecurityTokenParameters 创建的 SecurityTokenAuthenticator 将用于对多个令牌进行身份验证。无法在 SupportingTokenParameters 集合中添加相同类型的 SecurityTokenParameters，也无法在 EndpointSupportingTokenParameters 和 OperationSupportingTokenParameters 中重复它。
zh_hant: 無法指定多個權杖參數類型等於 '{0}' 的支援權杖驗證器。若在回應中應有多個相同類型的「支援權杖」，請為該 SecurityTokenParameters 設定只具有一個項目的支援權杖集合。系統會使用從 SecurityTokenParameters 建立的 SecurityTokenAuthenticator 驗證多個權杖。您無法在 SupportingTokenParameters 集合中新增相同類型的 SecurityTokenParameters，或是在 EndpointSupp`ortingTokenParameters 與 OperationSupportingTokenParameters 重複指定相同類型的 SecurityTokenParameters。

# NegotiationFailedIO
source: Transport security negotiation failed due to an underlying IO error: {0}.
cs: Vyjednávání zabezpečení přenosu se nezdařilo, protože došlo k zásadní vstupně-výstupní chybě: {0}.
de: Fehler bei der Aushandlung der Transportsicherheit aufgrund eines zugrunde liegenden E/A-Fehlers: {0}.
es: Error de la negociación de seguridad de transporte debido a un error de E/S subyacente: {0}.
fr: Échec de la négociation de sécurité du transport en raison d'une erreur d'E/S sous-jacente : {0}.
it: La negoziazione di sicurezza del trasporto non è riuscita a causa di un errore di IO sottostante: {0}.
ja: IO エラー {0} が原因で、トランスポート セキュリティのネゴシエーションが失敗しました。
ko: 기본 IO 오류로 인해 전송 보안 협상에 실패했습니다. {0}.
pl: Nie można wynegocjować zabezpieczeń transportu z powodu podstawowego błędu wejścia/wyjścia: {0}.
pt_br: Falha na negociação de segurança do transporte devido a um erro de E/S subjacente: {0}.
tr: Aktarım güvenliği anlaşması arka plandaki bir G/Ç hatası nedeniyle başarısız oldu: {0}.
zh_hans: 传输安全性协商由于基础 IO 错误而失败: {0}。
zh_hant: 傳輸安全性交涉失敗，因為其下的 IO 錯誤: {0}。

# NegotiationIsCompleted
source: The negotiation has already completed.
cs: Vyjednávání již bylo provedeno.
de: Die Aushandlung ist bereits abgeschlossen.
es: La negociación ya se completó.
fr: La négociation est déjà terminée.
it: Negoziazione già completata.
ja: ネゴシエーションは既に完了しています。
ko: 협상이 이미 완료되었습니다.
pl: Negocjowanie zostało już zakończone.
pt_br: A negociação já foi concluída.
tr: Anlaşma zaten tamamlandı.
zh_hans: 协商已完成。
zh_hant: 已完成交涉。

# NegotiationIsNotCompleted
source: The negotiation has not yet completed.
cs: Vyjednávání dosud nebylo provedeno.
de: Die Aushandlung ist noch nicht abgeschlossen.
es: La negociación todavía no se completó.
fr: La négociation n'est pas encore terminée.
it: Negoziazione non ancora completata.
ja: ネゴシエーションは完了していません。
ko: 협상이 아직 완료되지 않았습니다.
pl: Negocjowanie nie zostało jeszcze zakończone.
pt_br: A negociação ainda não foi concluída.
tr: Anlaşma henüz tamamlanmadı.
zh_hans: 协商尚未完成。
zh_hant: 尚未完成交涉。

# NoActionNoSequenceHeaderReason
source: The endpoint only processes messages using the WS-ReliableMessaging protocol. The message sent to the endpoint does not have an action or any headers used by the protocol and cannot be processed.
cs: Koncový bod zpracovává zprávy pouze pomocí protokolu WS-ReliableMessaging. Zpráva odeslaná koncovému bodu neobsahuje akci ani záhlaví používaná protokolem a nelze je zpracovat.
de: Der Endpunkt verarbeitet nur Nachrichten mit dem WS-ReliableMessaging-Protokoll. Die an den Endpunkt gesendete Nachricht enthält keine Aktion oder keine Header, die vom Protokoll verwendet werden, und kann nicht verarbeitet werden.
es: El extremo sólo procesa mensajes con el protocolo WS-ReliableMessaging. El mensaje enviado al extremo no tiene una acción ni encabezados usados por el protocolo, y no se puede procesar.
fr: Le point de terminaison traite seulement les messages utilisant le protocole WS-ReliableMessaging. Le message envoyé ne comporte par d'action ni aucun en-tête utilisés par le protocole et ne peut pas être traité.
it: L'endpoint elabora i messaggi solo utilizzando il protocollo WS-ReliableMessaging. Il messaggio inviato all'endpoint non contiene un'azione o intestazioni utilizzate dal protocollo e non può essere elaborato.
ja: エンドポイントは、WS-ReliableMessaging プロトコルのみを使用してメッセージを処理します。エンドポイントへ送信されたメッセージにはこのプロトコルによって使用されるアクションやヘッダーがないため、このメッセージを処理できません。
ko: 끝점은 단지 WS-ReliableMessaging 프로토콜을 사용하여 메시지를 처리합니다. 끝점에 보내진 메시지가 이 프로토콜에 사용되는 동작 또는 헤더가 없으므로 처리할 수 없습니다.
pl: Punkt końcowy przetwarza wiadomości tylko przy użyciu protokołu WS-ReliableMessaging. Wiadomość wysłana do punktu końcowego nie zawiera akcji ani żadnych nagłówków używanych w protokole i nie można jej przetworzyć.
pt_br: O ponto de extremidade apenas processa mensagens usando o protocolo WS-ReliableMessaging. A mensagem enviada ao ponto de extremidade não possui uma ação ou um cabeçalho usado pelo protocolo e não pode ser processada.
tr: Bitiş noktası yalnızca WS-ReliableMessaging protokolünü kullanan iletileri işler. Bitiş noktasına gönderilen iletide bir eylem ya da protokol tarafından kullanılan herhangi bir üst bilgi yok, bu nedenle ileti işlenemiyor.
zh_hans: 终结点仅使用 WS-ReliableMessaging 协议处理消息。发送到终结点的消息不具有该协议使用的操作或任何头，因而无法处理。
zh_hant: 端點僅會使用 WS-ReliableMessaging 通訊協定來處理訊息。傳送至端點的訊息不具有動作或通訊協定所用的標頭，因此無法處理。

# NoChannelBuilderAvailable
source: The binding (Name={0}, Namespace={1}) cannot be used to create a ChannelFactory or a ChannelListener because it appears to be missing a TransportBindingElement. Every binding must have at least one binding element that derives from TransportBindingElement.
cs: Vazbu (Název={0}, Obor názvů={1}) nelze použít k vytváření třídy ChannelFactory nebo ChannelListener, protože pravděpodobně chybí třída TransportBindingElement. Každá vazba musí mít aspoň jeden element vazby, který se odvozuje od třídy TransportBindingElement.
de: Die Bindung (Name={0}, Namespace={1}) kann nicht zum Erstellen einer ChannelFactory oder eines ChannelListener verwendet werden, da es sich scheinbar um ein fehlendes TransportBindingElement handelt. Jede Bindung muss mindestens über ein Bindungselement verfügen, das vom TransportBindingElement abgeleitet ist.
es: El enlace (Name={0}, Namespace={1}) no se puede usar para crear ChannelFactory o ChannelListener porque parece que le falta un elemento TransportBindingElement. Todos los enlaces deben tener al menos un elemento de enlace que se derive de TransportBindingElement.
fr: La liaison (Nom = {0}, Espace de noms = {1}) ne peut pas être utilisée pour créer un élément ChannelFactory ou ChannelListener, car il lui manque un élément TransportBindingElement. Chaque liaison doit contenir au moins un élément de liaison qui dérive de TransportBindingElement.
it: Non è possibile usare il binding (Name={0}, Namespace={1}) per creare un elemento ChannelFactory o ChannelListener perché sembra che manchi un elemento TransportBindingElement. Ogni binding deve contenere almeno un elemento di binding che deriva da TransportBindingElement.
ja: バインド (Name={0}、Namespace={1}) には TransportBindingElement が含まれていない可能性があるため、このバインドを使用して ChannelFactory や ChannelListener を作成することはできません。すべてのバインドには、TransportBindingElement から派生した 1 つ以上のバインド要素が含まれている必要があります。
ko: TransportBindingElement가 없는 것 같기 때문에 바인딩(이름={0}, 네임스페이스={1})을 사용하여 ChannelFactory 또는 ChannelListener를 만들 수 없습니다. 모든 바인딩은 TransportBindingElement에서 파생되는 최소한 하나 이상의 바인딩 요소를 가져야 합니다.
pl: Nie można użyć powiązania (Nazwa={0}, Przestrzeń nazw={1}) do utworzenia elementu ChannelFactory lub ChannelListener, ponieważ brakuje elementu TransportBindingElement. Każde powiązanie musi zawierać co najmniej jeden element wiążący pochodzący od elementu TransportBindingElement.
pt_br: A associação (Nome={0}, Namespace={1}) não pode ser usada para criar ChannelFactory ou ChannelListener porque ela parece não ter um TransportBindingElement. Todas as associações devem ter pelo menos um elemento de associação derivado de TransportBindingElement.
tr: Bir TransportBindingElement öğesi eksik olduğundan bağlama (Ad={0}, Ad Alanı={1}) bir ChannelFactory ya da ChannelListener oluşturmak için kullanılamıyor. Her bağlamanın, TransportBindingElement öğesinden türetilen en az bir bağlama öğesi bulunmalıdır.
zh_hans: 不能使用绑定(Name={0}，Namespace={1})创建 ChannelFactory 或 ChannelListener，因为似乎缺少 TransportBindingElement。每个绑定必须至少具有从 TransportBindingElement 派生的一个绑定元素。
zh_hant: 無法使用繫結 (Name={0}, Namespace={1}) 建立 ChannelFactory 或 ChannelListener，因為繫結似乎遺漏 TransportBindingElement。每個繫結至少必須要有一個衍生自 TransportBindingElement 的繫結元素。

# NoCloseTargetSpecified
source: The RequestSecurityToken must specify a CloseTarget.
cs: Třída RequestSecurityToken musí určovat třídu CloseTarget.
de: Das RequestSecurityToken muss ein CloseTarget angeben.
es: RequestSecurityToken debe especificar CloseTarget.
fr: L'élément RequestSecurityToken doit spécifier un élément CloseTarget.
it: RequestSecurityToken deve specificare un CloseTarget.
ja: RequestSecurityToken には CloseTarget を指定する必要があります。
ko: RequestSecurityToken은 CloseTarget을 지정해야 합니다.
pl: W tokenie RequestSecurityToken należy określić element CloseTarget.
pt_br: RequestSecurityToken deve especificar CloseTarget.
tr: RequestSecurityToken bir CloseTarget belirtmelidir.
zh_hans: RequestSecurityToken 必须指定 CloseTarget。
zh_hant: RequestSecurityToken 必須指定 CloseTarget。

# NoCookieInSct
source: The SecurityContextSecurityToken does not have a cookie.
cs: Třída SecurityContextSecurityToken neobsahuje soubor cookie.
de: Das SecurityContextSecurityToken weist kein Cookie auf.
es: El elemento SecurityContextSecurityToken no tiene una cookie.
fr: SecurityContextSecurityToken n'a aucun cookie.
it: L'elemento SecurityContextSecurityToken non contiene alcun cookie.
ja: SecurityContextSecurityToken にクッキーがありません。
ko: SecurityContextSecurityToken에 쿠키가 없습니다.
pl: Token SecurityContextSecurityToken nie zawiera pliku cookie.
pt_br: SecurityContextSecurityToken não tem um cookie.
tr: SecurityContextSecurityToken tanımlama bilgisine sahip değil.
zh_hans: SecurityContextSecurityToken 不具有 Cookie。
zh_hant: SecurityContextSecurityToken 沒有 cookie。

# NoEndMethodFoundForAsyncBeginMethod3
source: OperationContract method '{0}' in type '{1}' does not properly implement the async pattern, as no corresponding method '{2}' could be found. Either provide a method called '{2}' or set the AsyncPattern property on method '{0}' to false.
cs: Metoda OperationContract {0} v typu {1} neimplementuje správně asynchronní vzor, protože nelze nalézt odpovídající metodu {2}. Zadejte metodu nazvanou {2} nebo vlastnost AsyncPattern v metodě {0} nastavte na hodnotu false.
de: Die OperationContract-Methode "{0}" im Typ "{1}" implementiert das asynchrone Muster nicht korrekt, da keine entsprechende Methode "{2}" gefunden wurde. Geben Sie entweder eine Methode mit dem Namen "{2}" an, oder legen Sie die AsyncPattern-Eigenschaft für die Methode "{0}" auf "false" fest.
es: El método OperationContract "{0}" en el tipo "{1}" no implementa correctamente el patrón asincrónico, ya que no se encontró ningún método "{2}" correspondiente. Proporcione un método llamado "{2}" o establezca la propiedad AsyncPattern del método "{0}" en false.
fr: La méthode OperationContract '{0}' dans le type '{1}' n'implémente pas correctement le modèle asynchrone dans la mesure où aucune méthode '{2}' correspondante n'a pu être trouvée. Fournissez une méthode appelée '{2}' ou définissez la propriété AsyncPattern sur la méthode '{0}' à false.
it: Il metodo OperationContract '{0}' nel tipo '{1}' non implementa correttamente il modello asincrono perché non è stato trovato alcun metodo '{2}' corrispondente. Specificare un metodo denominato '{2}' o impostare su false la proprietà AsyncPattern nel metodo '{0}'.
ja: 対応するメソッド '{2}' が見つからなかったため、型 '{1}' の OperationContract メソッド '{0}' は非同期パターンを正しく実装していません。'{2}' という名前のメソッドを指定するか、メソッド '{0}' の AsyncPattern プロパティを False に設定してください。
ko: 해당 메서드 '{2}'을(를) 찾을 수 없으므로 형식 '{1}'의 OperationContract 메서드 '{0}'이(가) 비동기 패턴을 제대로 구현하지 않습니다. '{2}'(이)라는 메서드를 제공하거나 메서드 '{0}'에서 AsyncPattern 속성을 false로 설정하세요.
pl: Dla metody OperationContract „{0}” w typie „{1}” nie zaimplementowano poprawnie wzorca asynchronicznego, ponieważ nie można odnaleźć odpowiedniej metody „{2}”. Należy dostarczyć metodę o nazwie „{2}” lub ustawić wartość „false” dla właściwości AsyncPattern w metodzie „{0}”.
pt_br: O método OperationContract '{0}' no tipo '{1}' não implementa corretamente o padrão assíncrono, pois não foi possível encontrar um método correspondente '{2}'. Forneça um método denominado '{2}' ou defina a propriedade AsyncPattern no método '{0}' como false.
tr: '{1}' türündeki '{0}' OperationContract metodu, karşılık gelen herhangi bir '{2}' metodu bulunamadığından, asenkron yapıyı düzgün uygulayamıyor. '{2}' adlı metodu sağlayın ya da '{0}' metodundaki AsyncPattern özelliğini false olarak ayarlayın.
zh_hans: 类型“{1}”中的 OperationContract 方法“{0}”无法正确实现异步模式，因为找不到相应方法“{2}”。请提供名为“{2}”的方法或将方法“{0}”上的 AsyncPattern 属性设置为 false。
zh_hant: 類型 '{1}' 中的 OperationContract 方法 '{0}' 未正確實作非同步模式，因為找不到對應的方法 '{2}'。請提供呼叫 '{2}' 的方法，或將方法 '{0}' 上的 AsyncPattern 屬性設為 False。

# NoKeyIdentifierClauseFound
source: No clause of type '{0}' was found in the SecurityKeyIdentifier.
cs: V identifikátoru SecurityKeyIdentifier nebyla nalezena žádná klauzule typu {0}.
de: Im SecurityKeyIdentifier wurde keine Klausel vom Typ "{0}" gefunden.
es: No se encontró ninguna cláusula del tipo "{0}" en SecurityKeyIdentifier.
fr: La clause de type '{0}' est introuvable dans SecurityKeyIdentifier.
it: Non è stata trovata alcuna clausola di tipo '{0}' nell'elemento SecurityKeyIdentifier.
ja: '{0}' 型の句が SecurityKeyIdentifier にありません。
ko: SecurityKeyIdentifier에서 '{0}' 형식의 절을 찾을 수 없습니다.
pl: W elemencie SecurityKeyIdentifier nie odnaleziono żadnej klauzuli typu „{0}”.
pt_br: Nenhuma cláusula do tipo '{0}' foi encontrada no SecurityKeyIdentifier.
tr: SecurityKeyIdentifier içinde '{0}' türünde yan tümce bulunamadı.
zh_hans: 在 SecurityKeyIdentifier 中没有找到类型为“{0}”的子句。
zh_hant: 在 SecurityKeyIdentifier 中找不到類型 '{0}' 的子句。
