Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# X509IsInUntrustedStore
source: The {0} X.509 certificate is in an untrusted certificate store.
cs: Certifikát {0} X.509 je v úložišti nedůvěryhodných certifikátů.
de: Das X509-Zertifikat {0} befindet sich in einem nicht vertrauenswürdigen Zertifikatspeicher.
es: El certificado X.509 {0} se encuentra en un almacén de certificados que no son de confianza.
fr: Le certificat X.509 {0} se trouve dans un magasin de certificats non approuvés.
it: Il certificato X.509 {0} è presente in un archivio certificati non attendibile.
ja: {0} X.509 証明書は、信頼されていない証明書ストアにあります。
ko: X.509 인증서 {0}이(가) 신뢰할 수 없는 인증서 저장소에 있습니다.
pl: Certyfikat X.509 {0} znajduje się w niezaufanym magazynie certyfikatów.
pt_br: O certificado X.509 {0} está em um repositório de certificados não confiáveis.
tr: {0} X.509 sertifikası, güvenilmeyen bir sertifika deposunda.
zh_hans: {0} X.509 证书位于不受信任的证书存储中。
zh_hant: {0} X.509 憑證位於不受信任的憑證存放區。

# X509IsNotInTrustedStore
source: The X.509 certificate {0} is not in the trusted people store.
cs: Certifikát X.509 {0} není v úložišti důvěryhodné osoby.
de: Das X509-Zertifikat {0} befindet sich nicht im Speicher für vertrauenswürdige Personen.
es: El certificado X.509 {0} no está en el almacén de personas de confianza.
fr: Le certificat X.509 {0} ne se trouve pas dans le magasin de personnes approuvées.
it: Il certificato X.509 {0} non è presente nell'archivio Persone attendibili.
ja: X.509 証明書 {0} は、信頼されているユーザーのストアにありません。
ko: X.509 인증서 {0}이(가) 신뢰할 수 있는 사용자 저장소에 있지 않습니다.
pl: Certyfikat X.509 {0} nie znajduje się w magazynie zaufanych osób.
pt_br: O certificado X.509 {0} não está no repositório de pessoas confiáveis.
tr: {0} X.509 sertifikası, güvenilen kişiler deposunda değil.
zh_hans: X.509 证书 {0} 未位于受信任人的存储中。
zh_hant: X.509 憑證 {0} 不位於受信任的人員存放區。

# XDCannotFindValueInDictionaryString
source: Cannot find '{0}' value in dictionary string.
cs: Nelze nalézt hodnotu {0} v řetězci slovníku.
de: Der Wert "{0}" wurde nicht in der Wörterbuchzeichenfolge gefunden.
es: No se encuentra el valor "{0}" en la cadena de diccionario.
fr: Impossible de localiser la valeur '{0}' dans la chaîne de dictionnaire.
it: Il valore '{0}' non è stato trovato nella stringa del dizionario.
ja: 辞書の文字列に '{0}' 値が見つかりません。
ko: 사전 문자열에 '{0}' 값이 없습니다.
pl: Nie można odnaleźć wartości „{0}” w ciągu słownikowym.
pt_br: Não é possível encontrar o valor '{0}' na cadeia de caracteres de dicionário.
tr: Sözlük dizesinde '{0}' değeri bulunamıyor.
zh_hans: 在字典字符串中找不到“{0}”值。
zh_hant: 在字典字串中找不到 '{0}' 值。

# XmlArrayTooSmall
source: Array too small.
cs: Pole je příliš malé.
de: Das Array ist zu klein.
es: La matriz es demasiado pequeña.
fr: Tableau trop petit.
it: Le dimensioni della matrice sono troppo ridotte.
ja: 配列が小さすぎます。
ko: 배열이 너무 작습니다.
pl: Za mała tablica.
pt_br: Matriz muito pequena.
tr: Dizi çok küçük.
zh_hans: 数组过小。
zh_hant: 陣列太小。

# XmlBufferInInvalidState
source: An internal error has occurred. The XML buffer is not in the correct state to perform the operation.
cs: Došlo k vnitřní chybě. Vyrovnávací paměť XML není ve správném stavu k provedení operace.
de: Ein interner Fehler ist aufgetreten. Der XML-Puffer befindet sich nicht im richtigen Zustand zum Ausführen des Vorgangs.
es: Error interno. El búfer XML no se encuentra en el estado correcto para llevar a cabo la operación.
fr: Une erreur interne s'est produite. La mémoire tampon XML n'est pas dans l'état approprié pour effectuer l'opération.
it: Si è verificato un errore interno. Lo stato del buffer XML non è corretto per eseguire l'operazione.
ja: 内部エラーが発生しました。XML バッファーがこの操作を実行するための適切な状態にありません。
ko: 내부 오류가 발생했습니다. XML 버퍼가 올바른 상태가 아니므로 작업을 수행할 수 없습니다.
pl: Wystąpił błąd wewnętrzny. Stan buforu XML nie pozwala na wykonanie operacji.
pt_br: Erro interno. O buffer XML não está no estado correto para realizar a operação.
tr: Bir iç hata oluştu. XML arabelleği bu işlemi gerçekleştirmek için doğru durumda değil.
zh_hans: 发生内部错误。XML 缓冲区未处于正确状态，无法执行操作。
zh_hant: 發生內部錯誤。XML 緩衝區的狀態不正確，無法執行該作業。

# XmlBufferQuotaExceeded
source: The size necessary to buffer the XML content exceeded the buffer quota.
cs: Velikost nutná k uložení obsahu XML do vyrovnávací paměti překročila její kvótu.
de: Die erforderliche Größe zum Puffern der XML-Inhalte überschreitet das Pufferkontingent.
es: El tamaño necesario para almacenar en búfer el contenido XML superó la cuota del búfer.
fr: La taille nécessaire à la mise en mémoire tampon du contenu XML a dépassé le quota de mémoire tampon.
it: Le dimensioni necessarie per memorizzare il contenuto XML nel buffer superano la quota del buffer.
ja: XML コンテンツのバッファリングに必要なサイズがバッファー クォータを超過しました。
ko: XML 콘텐츠를 버퍼링하는 데 필요한 크기가 버퍼 할당량을 초과했습니다.
pl: Rozmiar wymagany do buforowania zawartości XML przekroczył limit przydziału buforu.
pt_br: O tamanho necessário para armazenar em buffer o conteúdo XML excedeu a cota do buffer.
tr: XML içeriğini ara belleğe almak için gerekli olan boyut, ara bellek kotasını aştı.
zh_hans: 缓冲处理 XML 内容所需的大小超出了缓冲区配额。
zh_hant: 用以緩衝 XML 內容所需的大小超過緩衝區配額。

# XmlInvalidBinHexLength
source: BinHex sequence length ({0}) not valid. Must be a multiple of 2.
cs: Délka sekvence BinHex ({0}) není platná. Musí být násobkem 2.
de: Ungültige BinHex-Sequenzlänge {0}. Der Wert muss ein Vielfaches von 2 sein.
es: La longitud de la secuencia BinHex ({0}) no es válida. Debe ser un múltiplo de 2.
fr: Longueur de la séquence BinHex ({0}) non valide. Elle doit être un multiple de 2.
it: La lunghezza della sequenza BinHex non è valida ({0}). Deve essere un multiplo di 2.
ja: BinHex シーケンスの長さ ({0}) が無効です。2 の倍数である必要があります。
ko: BinHex 시퀀스 길이({0})가 잘못되었습니다. 2의 배수여야 합니다.
pl: Długość sekwencji BinHex ({0}) jest nieprawidłowa. Musi być wielokrotnością liczby 2.
pt_br: Comprimento da sequência BinHex ({0}) inválido. Deve ser um múltiplo de 2.
tr: BinHex sıra uzunluğu ({0}) geçerli değil. Değer, 2'nin katı olmalıdır.
zh_hans: BinHex 序列长度({0})无效。必须为 2 的倍数。
zh_hant: BinHex 序列長度 ({0}) 無效。必須是 2 的倍數。

# XmlInvalidBinHexSequence
source: The characters '{0}' at offset {1} are not a valid BinHex sequence.
cs: Znaky {0} u odsazení {1} nejsou platná sekvence BinHex.
de: Die Zeichen "{0}" bei Offset {1} stellen keine gültige BinHex-Sequenz dar.
es: Los caracteres "{0}" del desplazamiento {1} no son una secuencia BinHex válida.
fr: Les caractères '{0}' au décalage {1} ne sont pas une séquence BinHex valide.
it: I caratteri '{0}' alla posizione di offset {1} non costituiscono una sequenza BinHex valida.
ja: オフセット {1} における文字 '{0}' は、有効な BinHex シーケンスではありません。
ko: 오프셋 {1}의 '{0}' 문자가 유효한 BinHex 시퀀스가 아닙니다.
pl: Znaki „{0}” w przesunięciu {1} nie są prawidłową sekwencją BinHex.
pt_br: Os caracteres '{0}' no deslocamento {1} não são uma sequência BinHex válida.
tr: '{1}' uzaklığındaki {0} karakter, geçerli bir BinHex sırası değildir.
zh_hans: 偏移量 {1} 上的字符“{0}”是无效的 BinHex 序列。
zh_hant: 位於位移 {1} 的字元 '{0}' 不是有效的 BinHex 序列。

# XmlInvalidConversion
source: The value '{0}' cannot be parsed as the type '{1}'.
cs: Hodnotu {0} nelze parsovat jako typ {1}.
de: Der Wert "{0}" kann nicht als Typ "{1}" analysiert werden.
es: El valor "{0}" no se puede analizar como el tipo "{1}".
fr: Impossible d'analyser la valeur '{0}' en tant que type '{1}'.
it: Il valore '{0}' non può essere analizzato come tipo '{1}'.
ja: 値 '{0}' を型 '{1}' として解析できません。
ko: '{0}' 값을 '{1}' 형식으로 구문 분석할 수 없습니다.
pl: Wartość „{0}” nie może być analizowana jako typ „{1}”.
pt_br: O valor '{0}' não pode ser analisado como o tipo '{1}'.
tr: '{0}' değeri, '{1}' türü olarak ayrıştırılamaz.
zh_hans: 不能将值“{0}”作为类型“{1}”来分析。
zh_hant: 值 '{0}' 無法剖析為類型 '{1}'。

# XmlInvalidStream
source: Stream returned by OperationStreamProvider cannot be null.
cs: Stream vrácený poskytovatelem OperationStreamProvider nemůže být null.
de: Der von OperationStreamProvider zurückgegebene Datenstrom darf nicht NULL sein.
es: La secuencia que devuelve OperationStreamProvider no puede ser nula.
fr: Le flux retourné par OperationStreamProvider ne peut pas avoir une valeur null.
it: Il flusso restituito da OperationStreamProvider non può essere Null.
ja: OperationStreamProvider によって返されるストリームを null にすることはできません。
ko: OperationStreamProvider에 의해 반환된 스트림은 null일 수 없습니다.
pl: Strumień zwrócony przez element OperationStreamProvider nie może mieć wartości null.
pt_br: O fluxo retornado por OperationStreamProvider não pode ser nulo.
tr: OperationStreamProvider tarafından döndürülen akış null olamaz.
zh_hans: IStreamProvider 返回的流不能为 Null。
zh_hant: OperationStreamProvider 傳回的資料流不可為 Null。

# XmlLangAttributeMissing
source: Required xml:lang attribute value is missing.
cs: Chybí požadovaná hodnota atributu xml:lang.
de: Der erforderliche xml:lang-Attributwert fehlt.
es: Falta el valor de atributo xml:lang requerido.
fr: La valeur de l'attribut xml:lang est manquante.
it: Manca il valore dell'attributo xml:lang.
ja: 必要な xml:lang 属性値がありません。
ko: 필수 xml:lang 특성 값이 없습니다.
pl: Brak wartości wymaganego atrybutu xml:lang.
pt_br: Falta o valor do atributo xml:lang obrigatório.
tr: Gereken xml:lang öznitelik değeri eksik.
zh_hans: 缺少所需的 xml:lang 特性值。
zh_hant: 必要的 xml:lang 屬性值已遺失。

# XmlLineInfo
source: Line {0}, position {1}.
cs: Řádek {0}, pozice {1}
de: Zeile {0}, Position {1}.
es: Línea {0}, posición {1}.
fr: Ligne {0}, position {1}.
it: Riga {0}, posizione {1}.
ja: 行 {0}、位置 {1} です。
ko: 줄 {0}, 위치 {1}.
pl: Wiersz {0}, pozycja {1}.
pt_br: Linha {0}, posição {1}.
tr: Satır {0}, konum {1}.
zh_hans: 行 {0}，位置 {1}。
zh_hant: 行 {0}，位置 {1}。

# XmlMaxStringContentLengthExceeded
source: The maximum string content length quota ({0}) has been exceeded while reading XML data. This quota may be increased by changing the MaxStringContentLength property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Při čtení dat XML byla překročena kvóta maximální délky obsahu řetězce ({0}). Tuto kvótu lze zvýšit změnou vlastnosti MaxStringContentLength u objektu XmlDictionaryReaderQuotas, který se používá při vytváření čtecí funkce XML.
de: Das Kontingent für die maximale Länge von Zeichenfolgeninhalt ({0}) wurde beim Lesen von XML-Daten überschritten. Dieses Kontingent kann durch Ändern der MaxStringContentLength-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la cuota de longitud del contenido de cadena ({0}) al leer los datos XML. Esta cuota se puede aumentar cambiando la propiedad MaxStringContentLength en el objeto XmlDictionaryReaderQuotas que se usa para crear el lector XML.
fr: Dépassement du quota maximal pour la longueur du contenu de chaîne ({0}) durant la lecture de données XML. Vous pouvez augmenter ce quota en changeant la propriété MaxStringContentLength sur l'objet XmlDictionaryReaderQuotas utilisé pendant la création du lecteur XML.
it: Durante la lettura dei dati XML è stata superata la quota per la lunghezza massima delle stringhe ({0}). Per incrementare questa quota, modificare la proprietà MaxStringContentLength dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: XML データの読み取り中に、最大文字列コンテンツ長のクォータ ({0}) を超えました。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxStringContentLength プロパティを変更してください。
ko: XML 데이터를 읽는 동안 최대 문자열 콘텐츠 길이 할당량({0})을 초과했습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxStringContentLength 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytywania danych XML został przekroczony maksymalny przydział długości zawartości ciągu ({0}). Wartość tę można zwiększyć, zmieniając właściwość MaxStringContentLength obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A cota máxima do comprimento do conteúdo da cadeia de caracteres ({0}) foi excedida durante a leitura dos dados XML. Essa cota pode ser aumentada com a alteração da propriedade MaxStringContentLength no objeto XmlDictionaryReaderQuotas usado na criação do leitor de XML.
tr: XML verileri okunurken, dize içerik uzunluğu kotası üst sınırı ({0}) aşıldı. Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxStringContentLength özelliği değiştirilerek artırılabilir.
zh_hans: 读取 XML 数据时超过了最大字符串内容长度配额({0})。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxStringContentLength 属性，可增加此配额。
zh_hant: 讀取 XML 資料時已經超過最大字串內容長度配額 ({0})。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxStringContentLength 屬性，便可以增加此配額。

# XmlWriterClosed
source: The XmlWriter is closed.
cs: Funkce XmlWriter je zavřena.
de: Der XmlWriter wurde geschlossen.
es: XmlWriter está cerrado.
fr: XmlWriter est fermé.
it: L'elemento XmlWriter è chiuso.
ja: XmlWriter は閉じられています。
ko: XmlWriter가 닫혀 있습니다.
pl: Element XmlWriter jest zamknięty.
pt_br: O XmlWriter está fechado.
tr: XmlWriter kapalı.
zh_hans: XmlWriter 已关闭。
zh_hant: XmlWriter 已關閉。

# Xml_InvalidNodeType
source: '{0}' is an invalid XmlNodeType.
cs: {0} je neplatný typ XmlNodeType.
de: "{0}" ist ein ungültiger XmlNodeType.
es: "{0}" es un XmlNodeType no válido.
fr: '{0}' est un XmlNodeType non valide.
it: '{0}' è un elemento XmlNodeType non valido.
ja: '{0}' は、XmlNodeType としては無効です。
ko: '{0}'은(는) 잘못된 XmlNodeType입니다.
pl: Element „{0}” jest nieprawidłowym typem XmlNodeType.
pt_br: '{0}' é uma expressão XmlNodeType inválida.
tr: '{0}', geçersiz bir XmlNodeType.
zh_hans: “{0}”是无效的 XmlNodeType。
zh_hant: '{0}' 是無效的 XmlNodeType。

# channelDoesNotHaveADuplexSession0
source: The current channel does not support closing the output session as this channel does not implement ISessionChannel<IDuplexSession>.
cs: Aktuální kanál nepodporuje ukončování výstupní relace, protože neimplementuje třídu ISessionChannel<IDuplexSession>.
de: Der aktuelle Kanal unterstützt das Schließen der Ausgabesitzung nicht, da dieser Kanal ISessionChannel<IDuplexSession> nicht implementiert.
es: El canal actual no admite el cierre de la sesión de salida, ya que en este canal no se implementa ISessionChannel<IDuplexSession>.
fr: Le canal actuel ne prend pas en charge la fermeture de la session de sortie, car ce canal n'implémente pas ISessionChannel<IDuplexSession>.
it: Il canale corrente non supporta la chiusura della sessione di output perché questo canale non implementa ISessionChannel<IDuplexSession>.
ja: 現在のチャネルは、ISessionChannel<IDuplexSession> を実装していないため出力セッションの終了をサポートしていません。
ko: 현재 채널은 ISessionChannel<IDuplexSession>을 구현하지 않으므로 출력 세션 닫기를 지원하지 않습니다.
pl: Ten kanał nie obsługuje zamykania sesji wyjściowej, ponieważ nie ma zaimplementowanego elementu ISessionChannel<IDuplexSession>.
pt_br: O canal atual não dá suporte ao fechamento da sessão de saída, pois este canal não implementa ISessionChannel<IDuplexSession>.
tr: Bu kanal, ISessionChannel<IDuplexSession> uygulamadığından, geçerli kanal çıkış oturumunu kapatmayı desteklemez.
zh_hans: 当前的通道不支持关闭输出会话，因为此通道未实现 ISessionChannel<IDuplexSession>。
zh_hant: 目前的通道不支援關閉輸出工作階段，因為此通道未實作 ISessionChannel<IDuplexSession>。

# channelIsNotAvailable0
source: Internal Error: The InnerChannel property is null.
cs: Vnitřní chyba: Vlastnost InnerChannel má hodnotu NULL.
de: Interner Fehler: Die InnerChannel-Eigenschaft ist NULL.
es: Error interno. La propiedad InnerChannel es nula.
fr: Erreur interne : la propriété InnerChannel a une valeur null.
it: Errore interno: la proprietà InnerChannel è Null.
ja: 内部エラー: InnerChannel プロパティが null です。
ko: 내부 오류: InnerChannel 속성이 null입니다.
pl: Błąd wewnętrzny: właściwość InnerChannel ma wartość null.
pt_br: Erro Interno: A propriedade InnerChannel é nula.
tr: İç Hata: InnerChannel özelliği null.
zh_hans: 内部错误: InnerChannel 属性为空。
zh_hant: 內部錯誤: InnerChannel 屬性為 null。

# couldnTFindRequiredAttributeOfTypeOn2
source: Couldn't find required attribute of type {0} on {1}.
cs: Nebyl nalezen požadovaný typ atributu {0} na {1}.
de: Das erforderliche Attribut vom Typ {0} für {1} wurde nicht gefunden.
es: No se encontró el atributo requerido de tipo {0} en {1}.
fr: Impossible de localiser l'attribut nécessaire de type {0} sur {1}.
it: L'attributo obbligatorio di tipo {0} non è stato trovato in {1}.
ja: {0} 型の必要な属性が {1} に見つかりませんでした。
ko: {1}에서 형식 {0}의 필수 특성을 찾을 수 없습니다.
pl: Nie można odnaleźć wymaganego atrybutu typu {0} w elemencie {1}.
pt_br: Não foi possível localizar o atributo necessário do tipo {0} em {1}.
tr: {1} üstünde {0} türündeki gereken öznitelik bulunamadı.
zh_hans: 在 {1} 上找不到所需类型 {0} 的特性。
zh_hant: 在 {1} 上找不到類型為 {0} 的必要屬性。

# ssl_io_cert_validation
source: The remote certificate is invalid according to the validation procedure.
cs: Na základě provedeného ověření není vzdálený certifikát platný.
de: Das Remotezertifikat ist laut Validierungsverfahren ungültig.
es: El certificado remoto no es válido según el procedimiento de validación.
fr: Le certificat distant n'est pas valide selon la procédure de validation.
it: Il certificato remoto non è stato ritenuto valido dalla procedura di convalida.
ja: 検証プロシージャによると、リモート証明書は無効です。
ko: 유효성 검사 절차에 따르면 원격 인증서가 잘못되었습니다.
pl: Według procedury walidacji certyfikat zdalny jest nieprawidłowy.
pt_br: O certificado remoto é inválido, de acordo com o procedimento de validação.
tr: Doğrulama yordamına göre uzak sertifika geçersiz.
zh_hans: 根据验证过程，远程证书无效。
zh_hant: 根據驗證程序，遠端憑證是無效的。

# tooManyAttributesOfTypeOn2
source: Too many attributes of type {0} on {1}.
cs: Příliš mnoho atributů typu {0} u {1}.
de: Es sind zu viele Attribute vom Typ {0} für {1} vorhanden.
es: Demasiados atributos de tipo {0} en {1}.
fr: Trop d'attributs de type {0} sur {1}.
it: Sono presenti troppi attributi di tipo {0} in {1}.
ja: {1} 上で、{0} 型の属性が多すぎます。
ko: {1}에 {0} 형식의 특성이 너무 많습니다.
pl: Zbyt wiele atrybutów typu {0} w elemencie {1}.
pt_br: Muitos atributos do tipo {0} em {1}.
tr: {1} üzerinde {0} türünden çok fazla öznitelik var.
zh_hans: {1} 上类型 {0} 的特性太多。
zh_hant: {1} 的屬性類型 {0} 過多。
