Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxOperationContractProviderOnNonServiceContract
source: Method '{1}' has {0}, but enclosing type '{2}' does not have ServiceContractAttribute. {0} can only be used on methods in ServiceContractAttribute types.
cs: Metoda {1} obsahuje objekt {0}, ale nadřazený typ {2} neobsahuje atribut ServiceContractAttribute. Objekt {0} lze použít pouze pro metody v typech ServiceContractAttribute.
de: Die Methode "{1}" weist {0} auf, der einschließende Typ "{2}" verfügt jedoch nicht über das ServiceContractAttribute. {0} kann nur für Methoden mit ServiceContractAttribute-Typen verwendet werden.
es: El método "{1}" tiene {0}, pero el tipo envolvente "{2}" no tiene ServiceContractAttribute. {0} solo puede usarse en métodos en tipos ServiceContractAttribute.
fr: La méthode '{1}' contient {0}, mais le type englobant '{2}' ne contient pas ServiceContractAttribute. {0} est utilisable uniquement sur les méthodes dans les types ServiceContractAttribute.
it: Il metodo '{1}' contiene {0}, ma il tipo di inclusione '{2}' non contiene ServiceContractAttribute. {0} può essere usato solo su metodi nei tipi ServiceContractAttribute.
ja: メソッド '{1}' には {0} がありますが、それを囲む型 '{2}' には ServiceContractAttribute がありません。{0} は、ServiceContractAttribute 型のメソッドでのみ使用できます。
ko: '{1}' 메서드에는 {0}이(가) 있지만 바깥쪽 형식 '{2}'에는 ServiceContractAttribute가 없습니다. {0}은(는) ServiceContractAttribute 형식의 메서드에만 사용할 수 있습니다.
pl: Metoda {1} ma atrybut {0}, ale typ otaczający {2} nie ma atrybutu ServiceContractAttribute. Atrybut {0} może być używany tylko w przypadku metod w typach ServiceContractAttribute.
pt_br: O método '{1}' tem {0}, mas o tipo de fechamento '{2}' não tem ServiceContractAttribute. {0} só pode ser usado em métodos nos tipos ServiceContractAttribute.
tr: '{1}' metodu {0} içeriyor, ancak kapsayan '{2}' türü ServiceContractAttribute içermiyor. {0} yalnızca ServiceContractAttribute türlerindeki metotlarda kullanılabilir.
zh_hans: 方法“{1}”具有 {0}，但封闭类型“{2}”没有 ServiceContractAttribute。{0} 只能用于 ServiceContractAttribute 类型中的方法。
zh_hant: 方法 '{1}' 具有 {0}，但封閉式類型 '{2}' 沒有 ServiceContractAttribute。{0} 只可用於 ServiceContractAttribute 類型中的方法上。

# SFxOperationDescriptionNameCannotBeEmpty
source: OperationDescription's Name must be a non-empty string.
cs: Název Name popisu OperationDescription musí být neprázdný řetězec.
de: Der Name von OperationDescription muss eine nicht leere Zeichenfolge sein.
es: Name debe ser una cadena no vacía en OperationDescription.
fr: Name de OperationDescription doit être une chaîne non vide.
it: L'elemento Name di OperationDescription deve essere una stringa non vuota.
ja: OperationDescription の名前は、空でない文字列にする必要があります。
ko: OperationDescription의 이름은 비어 있지 않은 문자열이어야 합니다.
pl: Nazwa obiektu OperationDescription nie może być pustym łańcuchem.
pt_br: O Nome da OperationDescription deve ser uma cadeia de caracteres não vazia.
tr: OperationDescription Name boş olmayan bir dize olmalıdır.
zh_hans: OperationDescription 的 Name 必须是非空字符串。
zh_hant: OperationDescription 的 Name 必須是非空白字串。

# SFxOperationMustHaveOneOrTwoMessages
source: OperationDescription '{0}' is invalid because its Messages property contains an invalid number of MessageDescription instances. Each OperationDescription must have one or two messages.
cs: Popis OperationDescription {0} není platný, protože jeho vlastnost Messages obsahuje neplatný počet instancí MessageDescription. Každý popis OperationDescription musí mít jednu nebo dvě zprávy.
de: Die OperationDescription "{0}" ist ungültig, weil die Messages-Eigenschaft eine ungültige Anzahl von MessageDescription-Instanzen enthält. Jede OperationDescription muss eine oder zwei Nachrichten aufweisen.
es: El elemento OperationDescription "{0}" no es válido porque su propiedad Messages contiene un número no válido de instancias de MessageDescription. Cada instancia de OperationDescription debe tener uno o dos mensajes.
fr: OperationDescription '{0}' est non valide, car sa propriété Messages contient un nombre d'instances de MessageDescription non valide. Chaque OperationDescription doit avoir un ou deux messages.
it: L'elemento '{0}' di OperationDescription non è valido perché la relativa proprietà Messages contiene un numero non valido di istanze di MessageDescription. Ogni elemento OperationDescription deve contenere uno o due messaggi.
ja: Messages プロパティに無効な数の MessageDescription インスタンスが含まれているため、OperationDescription '{0}' は無効です。それぞれの OperationDescription は、メッセージを 1 つまたは 2 つ持っている必要があります。
ko: OperationDescription '{0}'은(는) 해당 Messages 속성에 잘못된 수의 MessageDescription 인스턴스가 있으므로 잘못되었습니다. 각 OperationDescription에는 한 개 또는 두 개의 메시지가 있어야 합니다.
pl: Obiekt OperationDescription „{0}” jest nieprawidłowy, ponieważ jego właściwość Messages zawiera nieprawidłową liczbę wystąpień obiektu MessageDescription. Każdy obiekt OperationDescription może mieć tylko jeden lub dwa komunikaty.
pt_br: A OperationDescription '{0}' é inválida porque sua propriedade Messages contém um número inválido de instâncias da MessageDescription. Cada OperationDescription deve ter uma ou duas mensagens.
tr: Messages özelliğinde geçersiz sayıda MessageDescription örneği olduğundan OperationDescription '{0}' geçersiz. Her OperationDescription öğesinin bir ya da iki iletisi olması gerekir.
zh_hans: OperationDescription“{0}”无效，因为其 Messages 属性包含无效的 MessageDescription 实例数。每个 OperationDescription 必须有一条或两条消息。
zh_hant: 因為 OperationDescription '{0}' 的 Messages 屬性包含無效的 MessageDescription 執行個體數目，所以無效。每個 OperationDescription 必須要有一或兩則訊息。

# SFxParameterCountMismatch
source: There was a mismatch between the number of supplied arguments and the number of expected arguments. Specifically, the argument '{0}' has '{1}' elements while the argument '{2}' has '{3}' elements.
cs: Počet dodaných argumentů se neshoduje s počtem očekávaných argumentů. Argument {0} má {1} prvků a argument {2} má {3} prvků.
de: Die Anzahl bereitgestellter Argumente und die Anzahl erwarteter Argumente stimmen nicht überein. Insbesondere verfügt das Argument "{0}" über "{1}" Elemente, während das Argument "{2}" "{3}" Elemente aufweist.
es: No hay coincidencia entre el número de argumentos proporcionados y el número de argumentos esperados. En particular, el argumento "{0}" tiene "{1}" elementos, mientras que el argumento "{2}" tiene "{3}" elementos.
fr: Il existe une différence entre le nombre d'arguments fournis et le nombre d'arguments attendus. En particulier, l'argument '{0}' a '{1}' éléments, alors que l'argument '{2}' en contient '{3}'.
it: Il numero di argomenti forniti non corrisponde al numero di argomenti previsti. In particolare, l'argomento '{0}' contiene '{1}' elementi, mentre l'argomento '{2}' contiene '{3}' elementi.
ja: 指定された引数の数と必要な引数の数が一致しませんでした。具体的には、引数 '{0}' には '{1}' 個の要素があり、引数 '{2}' には '{3}' 個の要素があります。
ko: 제공된 인수의 수와 필요한 인수의 수가 일치하지 않습니다. 특히 '{0}' 인수에는 '{1}' 요소가 있는 반면에, '{2}' 인수에는 '{3}' 요소가 있습니다.
pl: Wystąpiła niezgodność między liczbą przekazanych argumentów a liczbą oczekiwanych argumentów. Liczba elementów dla argumentu „{0}” to „{1}”, a liczba elementów dla argumentu „{2}” to „{3}”.
pt_br: Há uma incompatibilidade entre o número de argumentos fornecidos e o número de argumentos esperado. Especificamente, o argumento '{0}' tem '{1}' elementos enquanto o argumento '{2}' tem '{3}' elementos.
tr: Sağlanan ve beklenen bağımsız değişken sayıları arasında bir uyumsuzluk var. Özellikle '{0}' bağımsız değişkeninde '{1}' öğe varken, '{2}' bağımsız değişkeni '{3}' öğeye sahip.
zh_hans: 提供的参数数目与所需的参数数目不匹配。具体而言，参数 "{0}" 有 {1} 个元素而参数 "{2}" 有 {3} 个元素。
zh_hant: 提供的引數數目與預期的引數數目不符。引數 '{0}' 具有 '{1}' 個元素，而引數 '{2}' 具有 '{3}' 個元素。

# SFxParameterMustBeArrayOfOneElement
source: The 'parameters' argument must be an array of one element.
cs: Argument parametry musí být pole jednoho prvku.
de: Das parameters-Argument muss ein aus einem Element bestehendes Array sein.
es: El argumento "parameters" debe ser una matriz de un elemento.
fr: L'argument 'parameters' doit être un tableau d'un seul élément.
it: L'argomento 'parameters' deve essere una matrice di un elemento.
ja: 'parameters' 引数は、1 つの要素の配列にする必要があります。
ko: 'parameters' 인수는 요소가 한 개인 배열이어야 합니다.
pl: Argument „parameters” musi być tablicą z jednym elementem.
pt_br: O argumento 'parameters' deve ser uma matriz de um elemento.
tr: 'Parameters' bağımsız değişkeni bir öğenin dizisi olmalıdır.
zh_hans: "parameters" 参数必须是具有一个元素的数组。
zh_hant: 'parameters' 引數必須是某一元素的陣列。

# SFxParameterMustBeMessage
source: The 'parameters' argument must be an array that contains a single Message object.
cs: Argument parametry musí být pole, které obsahuje jeden objekt Zpráva.
de: Das parameters-Argument muss ein Array sein, das ein einzelnes Message-Objekt enthält.
es: El argumento "parameters" debe ser una matriz que contenga un único objeto Message.
fr: L'argument 'parameters' doit être un tableau contenant un seul objet Message.
it: L'argomento 'parameters' deve essere una matrice contenente un singolo oggetto Message.
ja: 'parameters' 引数は、1 つのメッセージ オブジェクトを格納した配列にする必要があります。
ko: 'parameters' 인수는 단일 메시지 개체가 포함된 배열이어야 합니다.
pl: Argument „parameters” musi być tablicą zawierającą pojedynczy obiekt typu Message.
pt_br: O argumento 'parameters' deve ser uma matriz que contém um único objeto Message.
tr: 'Parameters' bağımsız değişkeni, bir tek Message nesnesi bulunduran bir dizi olmalıdır.
zh_hans: "parameters" 参数必须是包含单个 Message 对象的数组。
zh_hant: 'parameters' 引數必須是包含單一 Message 物件的陣列。

# SFxParameterNameCannotBeNull
source: All parameter names used in operations that make up a service contract must not be null.
cs: Všechny názvy parametrů použité v operacích, které tvoří kontrakt služby, nesmí mít hodnotu NULL.
de: Alle Parameternamen in den Vorgängen, aus denen ein Dienstvertrag besteht, dürfen nicht NULL sein.
es: Ningún nombre de parámetro usado en las operaciones que conforman un contrato de servicio debe ser nulo.
fr: Tous les noms de paramètres utilisés dans les opérations qui constituent un contrat de service doivent avoir une valeur non null.
it: Tutti i nomi di parametri usati nelle operazioni che costituiscono un contratto di servizio non devono essere Null.
ja: サービス コントラクトを構成する操作内で使用するすべてのパラメーター名は null にできません。
ko: 서비스 계약을 구성하는 작업에 사용되는 모든 매개 변수 이름은 null일 수 없습니다.
pl: Żadne nazwy parametrów używane w operacjach, które składają się na kontrakt usługi, nie mogą być wartościami null.
pt_br: Todos os nomes de parâmetro utilizados nas operações que compõem um contrato de serviço não devem ser nulo.
tr: Bir hizmet anlaşmasını oluşturan işlemlerde kullanılan parametre adlarını null olmamalıdır.
zh_hans: 对于构成服务协定的操作，其中使用的所有参数名称均不得为 null。
zh_hant: 構成服務合約的作業中所用的所有參數名稱，都不得為 null。

# SFxParametersMustBeEmpty
source: The 'parameters' argument must be either null or an empty array.
cs: Argument parametry musí být prázdná hodnota nebo prázdné pole.
de: Das parameters-Argument muss entweder NULL oder ein leeres Array sein.
es: El argumento "parameters" debe ser nulo o una matriz vacía.
fr: L'argument 'parameters' doit avoir une valeur null ou être un tableau vide.
it: L'argomento 'parameters' deve essere Null o una matrice vuota.
ja: 'parameters' 引数は、null または空の配列にする必要があります。
ko: 'parameters' 인수는 null 또는 빈 배열이어야 합니다.
pl: Argument „parameters” musi mieć wartość null albo być pustą tablicą.
pt_br: O argumento 'parameters' deve ser nulo ou uma matriz vazia.
tr: 'Parameters' bağımsız değişkeni null ya da boş bir dize olmalıdır.
zh_hans: "parameters" 参数必须是 Null 数组或空数组。
zh_hant: 'parameters' 引數必須是 null 或空白陣列。

# SFxProxyRuntimeMessageCannotBeNull
source: In operation '{0}', cannot pass null to methods that take Message as input parameter.
cs: V operaci {0}, nelze předat prázdnou hodnotu metodám, které přebírají Zprávu jako vstupní parametr.
de: Im Vorgang "{0}" kann nicht NULL an Methoden übergeben werden, die "Message" als Eingabeparameter akzeptieren.
es: En la operación "{0}", no se puede pasar un valor nulo a los métodos que toman Message como parámetro de entrada.
fr: Dans l'opération '{0}', impossible de passer une valeur null à des méthodes qui acceptent Message comme paramètre d'entrée.
it: Nell'operazione '{0}' non è possibile passare Null a metodi che accettano Message come parametro di input.
ja: 操作 '{0}' では、メッセージを入力パラメーターとして使用するメソッドに null を渡すことはできません。
ko: '{0}' 작업에서 메시지를 입력 매개 변수로 사용하는 메서드에 null을 전달할 수 없습니다.
pl: W operacji „{0}” nie można przekazać wartości null do metod, dla których komunikat jest parametrem wejściowym.
pt_br: Na operação '{0}', não é possível passar nulo para os métodos que recebem Mensagem como um parâmetro de entrada.
tr: '{0}' işleminde Message öğesini giriş parametresi olarak kullanan metotlara null değer geçirilemez.
zh_hans: 在操作“{0}”中，无法将 Null 传递给将 Message 作为输入参数的方法。
zh_hant: 在作業 '{0}' 中，無法將 null 傳入以 Message 作為輸入參數的方法。

# SFxReplyActionMismatch3
source: A reply message was received for operation '{0}' with action '{1}'. However, your client code requires action '{2}'.
cs: Pro operaci {0} byla přijata odpověď s akcí {1}. Kód klienta ale vyžaduje akci {2}.
de: Für den Vorgang "{0}" wurde eine Antwortnachricht mit der Aktion "{1}" empfangen. Der Clientcode erfordert jedoch die Aktion "{2}".
es: Se recibió un mensaje de respuesta para la operación "{0}" con la acción "{1}". Sin embargo, el código de cliente requiere la acción "{2}".
fr: Un message de réponse a été reçu pour l'opération '{0}' avec l'action '{1}'. Toutefois, le code de votre client nécessite l'action '{2}'.
it: È stato ricevuto un messaggio di risposta per l'operazione '{0}' con azione '{1}', ma il codice client richiede l'azione '{2}'.
ja: アクション '{1}' の操作 '{0}' についての応答メッセージを受信しました。ただし、クライアント コードでは、アクション '{2}' が必要です。
ko: '{1}' 동작의 '{0}' 작업에 대해 회신 메시지를 받았습니다. 그러나 클라이언트 코드에서는 '{2}' 동작이 필요합니다.
pl: Odebrano komunikat odpowiedzi z operacji „{0}” z akcją „{1}”. Kod klienta wymaga jednak akcji „{2}”.
pt_br: Uma mensagem de resposta foi recebida para a operação '{0}' com ação '{1}'. Entretanto, seu código de cliente requer a ação '{2}'.
tr: '{1}' eylemini içeren '{0}' işlemi için bir yanıt iletisi alındı. Bununla birlikte istemci kodunuz için '{2}' eylemi gerekiyor.
zh_hans: 收到对带有操作“{1}”的操作“{0}”的回复消息。但是，客户端代码需要操作“{2}”。
zh_hant: 已收到具有動作 '{1}' 的作業 '{0}' 之回覆訊息。但用戶端程式碼需要動作 '{2}'。

# SFxRequestHasInvalidFaultToOnClient
source: The request message has FaultTo='{0}' but IContextChannel.LocalAddress is '{1}'. When ManualAddressing is false, these values must be the same, null, or EndpointAddress.AnonymousAddress. Enable ManualAddressing or avoid setting FaultTo on the message.
cs: U zprávy s požadavkem je hodnota FaultTo={0}, ale adresa IContextChannel.LocalAddress je {1}. Když má vlastnost ManualAddressing hodnotu false, musejí být tyto hodnoty stejné, null nebo EndpointAddress.AnonymousAddress. Povolte vlastnost ManualAddressing nebo u zprávy nenastavujte hodnotu FaultTo.
de: Für die Anforderungsnachricht ist FaultTo="{0}" festgelegt, aber die IContextChannel.LocalAddress ist "{1}". Wenn ManualAddressing auf "false" festgelegt ist, müssen diese Werte identisch, NULL oder EndpointAddress.AnonymousAddress sein. Aktivieren Sie ManualAddressing, oder verwenden Sie für die Nachricht nicht die FaultTo-Einstellung.
es: El mensaje de solicitud tiene FaultTo="{0}" pero IContextChannel.LocalAddress es "{1}". Cuando ManualAddressing es false, estos valores deben ser Same, Null o EndpointAddress.AnonymousAddress. Habilite ManualAddressing o evite establecer FaultTo en el mensaje.
fr: Le message de requête comporte FaultTo='{0}', mais IContextChannel.LocalAddress est '{1}'. Quand ManualAddressing a la valeur false, ces valeurs doivent être identiques, null ou EndpointAddress.AnonymousAddress. Activez ManualAddressing ou évitez de définir FaultTo sur le message.
it: Il messaggio di richiesta contiene FaultTo='{0}', ma IContextChannel.LocalAddress è '{1}'. Quando ManualAddressing è false, questi valori devono essere uguali, Null o EndpointAddress.AnonymousAddress. Abilitare ManualAddressing o evitare di impostare FaultTo sul messaggio.
ja: 要求メッセージに FaultTo='{0}' がありますが、IContextChannel.LocalAddress が '{1}' です。ManualAddressing が False の場合は、これらの値は同じか、null か、EndpointAddress.AnonymousAddress である必要があります。ManualAddressing を有効にするか、メッセージで FaultTo を設定しないようにしてください。
ko: 요청 메시지에 FaultTo='{0}'이(가) 있지만 IContextChannel.LocalAddress는 '{1}'입니다. ManualAddressing이 false이면 이 값은 같거나, null 또는 EndpointAddress.AnonymousAddress이어야 합니다. ManualAddressing을 사용하거나 메시지에서 FaultTo를 설정하지 마세요.
pl: Komunikat żądania ma parametr FaultTo=„{0}”, lecz wartość IContextChannel.LocalAddress wynosi „{1}”. Kiedy wartość ManualAddressing wynosi false, te wartości muszą być takie same, równe null albo równe wartości EndpointAddress.AnonymousAddress. Włącz opcję ManualAddressing, aby uniknąć ustawienia parametru FaultTo w komunikacie.
pt_br: A mensagem de solicitação tem FaultTo='{0}', mas IContextChannel.LocalAddress é '{1}'. Quando ManualAddressing é false, esses valores devem ser iguais, nulos ou EndpointAddress.AnonymousAddress. Habilite ManualAddressing ou evite configurar FaultTo na mensagem.
tr: İstek iletisinde FaultTo='{0}' var, ancak IContextChannel.LocalAddress: '{1}'. ManualAddressing false olduğu zaman, bu değerlerin de aynı, null ya da EndpointAddress.AnonymousAddress olması gerekir. ManualAddressing işlevini etkinleştirin ya da iletide FaultTo ayarı yapmayın.
zh_hans: 请求消息具有 FaultTo=“{0}”，但 IContextChannel.LocalAddress 是“{1}”。当 ManualAddressing 是 False 时，这些值必须相同、为 null 或为 EndpointAddress.AnonymousAddress。请启用 ManualAddressing 或避免在消息上设置 FaultTo。
zh_hant: 要求訊息具有 FaultTo='{0}'，但是 IContextChannel.LocalAddress 為 '{1}'。當 ManualAddressing 為 False 時，這些值必須相同、null 或為 EndpointAddress.AnonymousAddress。請啟用 ManualAddressing 或避免在訊息上設定 FaultTo。

# SFxRequestHasInvalidFromOnClient
source: The request message has From='{0}' but IContextChannel.LocalAddress is '{1}'. When ManualAddressing is false, these values must be the same, null, or EndpointAddress.AnonymousAddress. Enable ManualAddressing or avoid setting From on the message.
cs: U zprávy s požadavkem je hodnota From={0}, ale adresa IContextChannel.LocalAddress je {1}. Když jeho hodnota vlastnosti ManualAddressing nepravda, musejí být tyto hodnoty stejné, prázdné nebo EndpointAddress.AnonymousAddress. Povolte vlastnost ManualAddressing nebo u zprávy nenastavujte hodnotu From.
de: Bei der Anforderungsnachricht ist From="{0}" festgelegt, aber die IContextChannel.LocalAddress ist "{1}". Wenn ManualAddressing FALSE ist, müssen diese Werte identisch, NULL oder EndpointAddress.AnonymousAddress sein. Aktivieren Sie ManualAddressing, oder verwenden Sie für die Nachricht nicht die From-Einstellung.
es: El mensaje de solicitud tiene From='{0}' pero IContextChannel.LocalAddress es '{1}'. Cuando ManualAddressing es false, estos valores deben ser Same, Null o EndpointAddress.AnonymousAddress. Habilite ManualAddressing o evite establecer From en el mensaje.
fr: Le message de demande possède From='{0}', mais IContextChannel.LocalAddress est '{1}'. Lorsque ManualAddressing est False, ces valeurs doivent être identiques, Null ou EndpointAddress.AnonymousAddress. Activez ManualAddressing ou évitez de définir From sur le message.
it: Il messaggio di richiesta ha From='{0}' ma IContextChannel.LocalAddress è '{1}'. Quando ManualAddressing è False, tali valori devono essere uguali, Null o EndpointAddress.AnonymousAddress. Abilitare ManualAddressing o evitare di impostare From nel messaggio.
ja: 要求メッセージに From='{0}' がありますが、IContextChannel.LocalAddress が '{1}' です。ManualAddressing が False の場合は、これらの値は同じか、NULL か、EndpointAddress.AnonymousAddress である必要があります。ManualAddressing を有効にするか、メッセージで From を設定しないようにしてください。
ko: 요청 메시지에 From='{0}'이(가) 있지만 IContextChannel.LocalAddress는 '{1}'입니다. ManualAddressing이 false이면 이 값은 같거나, null 또는 EndpointAddress.AnonymousAddress이어야 합니다. ManualAddressing을 사용하거나 메시지에서 From을 설정하지 마십시오.
pl: Komunikat żądania ma parametr From=„{0}”, lecz IContextChannel.LocalAddress wynosi „{1}”. Kiedy wartość ManualAddressing wynosi false, te wartości muszą być takie same, zerowe, albo równe EndpointAddress.AnonymousAddress. Aby zapobiec ustawianiu pola Form w komunikacie, włącz opcję ManualAddressing.
pt_br: A mensagem de solicitação tem From='{0}', mas IContextChannel.LocalAddress é '{1}'. Quando ManualAddressing é false, esses valores devem ser iguais, nulos ou EndpointAddress.AnonymousAddress. Habilite ManualAddressing ou evite configurar From na mensagem.
tr: İstek iletisinde From='{0}' var, ancak IContextChannel.LocalAddress: '{1}'. ManualAddressing yanlış olduğunda, bu değerlerin de aynı, boş ya da EndpointAddress.AnonymousAddress olması gerekir. ManualAddressing işlevini etkinleştirin ya da iletide From ayarı yapmayın.
zh_hans: 请求消息具有 From=“{0}”，但 IContextChannel.LocalAddress 是“{1}”。当 ManualAddressing 为 False 时，这些值必须相同、为空或为 EndpointAddress.AnonymousAddress。启用 ManualAddressing 或避免在消息上设置 From。
zh_hant: 要求訊息具有 From='{0}'，但是 IContextChannel.LocalAddress 為 '{1}'。當 ManualAddressing 為 False 時，這些值必須相同、null 或為 EndpointAddress.AnonymousAddress。請啟用 ManualAddressing 或避免在訊息上設定 From。
