Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# PrivateKeyNotRSA
source: The private key is not a RSA key.
cs: Privátní klíč není klíč RSA.
de: Der private Schlüssel ist kein RSA-Schlüssel.
es: La clave privada no es una clave RSA.
fr: La clé privée n'est pas une clé RSA.
it: La chiave privata non è una chiave RSA.
ja: 秘密キーは RSA キーではありません。
ko: 개인 키가 RSA 키가 아닙니다.
pl: Klucz prywatny nie jest kluczem RSA.
pt_br: A chave privada não é uma chave RSA.
tr: Ortak anahtar bir RSA anahtarı değil.
zh_hans: 私钥不是 RSA 密钥。
zh_hant: 私密金鑰並非 RSA 金鑰。

# PrivateKeyNotSupported
source: The key algorithm for this private key is not supported.
cs: Algoritmus klíče pro tento privátní klíč není podporován.
de: Der Schlüsselalgorithmus für diesen privaten Schlüssel wird nicht unterstützt.
es: El algoritmo de la clave para esta clave privada no es compatible.
fr: L’algorithme de clé pour cette clé privée n’est pas pris en charge.
it: L'algoritmo della chiave per questa chiave privata non è supportato.
ja: この秘密キーのキー アルゴリズムはサポートされていません。
ko: 이 프라이빗 키에 대한 키 알고리즘은 지원되지 않습니다.
pl: Algorytm klucza dla tego klucza prywatnego nie jest obsługiwany.
pt_br: O algoritmo chave para esta chave privada não é suportado.
tr: Bu özel anahtar için anahtar algoritması desteklenmiyor.
zh_hans: 不支持此私钥的密钥算法。
zh_hant: 不支援此私密金鑰的金鑰演算法。

# PropertySettingErrorOnProtocolFactory
source: The required '{0}' property on the '{1}' security protocol factory is not set or has an invalid value.
cs: Požadovaná vlastnost {0} není v objektu pro vytváření protokolu zabezpečení {1} nastavena nebo má neplatnou hodnotu.
de: Die erforderliche {0}-Eigenschaft für die {1}-Sicherheitsprotokollfactory ist nicht festgelegt oder weist einen ungültigen Wert auf.
es: La propiedad requerida "{0}" en el generador de protocolos de seguridad "{1}" no está establecida o tiene un valor no válido.
fr: La propriété nécessaire '{0}' sur la fabrique de protocoles de sécurité '{1}' n'est pas définie ou a une valeur non valide.
it: La proprietà obbligatoria '{0}' nella factory protocollo di sicurezza '{1}' non è impostata o contiene un valore non valido.
ja: セキュリティ プロトコル ファクトリ '{1}' で必要なプロパティ '{0}' が設定されていないか、またはこのプロパティに無効な値が設定されています。
ko: '{1}' 보안 프로토콜 팩터리의 필수 '{0}' 속성이 설정되지 않았거나 잘못된 값을 가집니다.
pl: Wymagana właściwość „{0}” fabryki protokołów zabezpieczeń „{1}” nie została ustawiona lub ma nieprawidłową wartość.
pt_br: A propriedade '{0}' necessária na fábrica de protocolos de segurança '{1}' não está definida ou tem um valor inválido.
tr: '{1}' güvenlik protokolü fabrikasında gerekli olan '{0}' özelliği ayarlanmamış ya da geçersiz bir değere sahip.
zh_hans: “{1}”安全协议工厂上必需的“{0}”属性尚未设置或具有无效的值。
zh_hant: '{1}' 安全性通訊協定處理站上的必要 '{0}' 屬性未設定，或是具有無效值。

# ProtocolFactoryCouldNotCreateProtocol
source: The protocol factory cannot create a protocol.
cs: Objekt pro vytváření protokolu nemůže vytvořit protokol.
de: Die Protokollfactory kann kein Protokoll erstellen.
es: El generador de protocolos no puede crear un protocolo.
fr: La fabrique de protocoles ne peut pas créer un protocole.
it: La factory protocollo non può creare un protocollo.
ja: このプロトコル ファクトリでプロトコルを作成できません。
ko: 프로토콜 팩터리가 프로토콜을 만들 수 없습니다.
pl: Fabryka protokołów nie może utworzyć protokołu.
pt_br: A fábrica de protocolos não pode criar um protocolo.
tr: Protokol fabrikası, bir protokol oluşturamıyor.
zh_hans: 协议工厂无法创建协议。
zh_hant: 通訊協定處理站無法建立通訊協定。

# ProtocolMisMatch
source: Security protocol must be '{0}', type is: '{1}'.;
cs: Protokol zabezpečení musí být {0}, typ je: {1}.;
de: Das Sicherheitsprotokoll muss "{0}" sein, der Typ lautet: "{1}".;
es: El protocolo de seguridad debe ser '{0}'. El tipo es: '{1}'.;
fr: Le protocole de sécurité doit être '{0}', le type est : '{1}'.;
it: Il protocollo di sicurezza deve essere '{0}', il tipo è: '{1}'.;
ja: セキュリティ プロトコルは '{0}' でなければならず、種類は '{1}' です。
ko: 보안 프로토콜이 '{0}'이어야 합니다. 형식이 '{1}'입니다.;
pl: Wymagany jest następujący protokół zabezpieczeń: „{0}”, obecny typ to: „{1}”.;
pt_br: O protocolo de segurança deve ser '{0}'; o tipo é: '{1}'.;
tr: Güvenlik protokolü '{0}' olmalıdır, tür: '{1}'.;
zh_hans: 安全协议必须为“{0}”，类型为:“{1}”。；
zh_hant: 安全性通訊協定必須是 '{0}'，類型為: '{1}'。;

# ProtocolMustBeInitiator
source: '{0}' protocol can only be used by the Initiator.
cs: Protokol {0} může být používán pouze funkcí Iniciátor.
de: Das {0}-Protokoll kann nur vom Initiator verwendet werden.
es: Sólo el iniciador puede usar el protocolo '{0}'.
fr: Le protocole '{0}' peut être utilisé seulement par l'élément Initiator.
it: Il protocollo '{0}' può essere utilizzato soltanto dall'Initiator.
ja: '{0}' プロトコルは開始者のみが使用できます。
ko: '{0}' 프로토콜은 초기자만 사용할 수 있습니다.
pl: Protokół „{0}” może być używany tylko przez inicjatora.
pt_br: O protocolo '{0}' apenas pode ser usado pelo Iniciador.
tr: '{0}' protokolü, yalnızca Initiator tarafından kullanılabilir.
zh_hans: “{0}”协议只能由发起程序使用。
zh_hant: '{0}' 通訊協定只有啟動器才能使用。

# ProvidedNetworkCredentialsForKerberosHasInvalidUserName
source: The NetworkCredentials provided for the Kerberos Token does not have a valid UserName.
cs: Přihlašovací údaje NetworkCredentials, které byly zadány pro token protokolu Kerberos, neobsahují platné jméno UserName.
de: Die für das Kerberos-Token angegebenen NetworkCredentials enthalten keinen gültigen UserName.
es: El elemento NetworkCredentials proporcionado para el token de Kerberos no tiene un nombre de usuario válido.
fr: Le NetworkCredentials fourni pour le jeton Kerberos n'a aucun UserName valide.
it: Nelle credenziali di rete specificate per il token Kerberos non è presente un nome utente valido.
ja: Kerberos トークンに指定された NetworkCredentials に有効な UserName がありません。
ko: Kerberos 토큰에 제공된 NetworkCredentials에 유효한 UserName이 없습니다.
pl: Element NetworkCredentials podany dla tokenu protokołu Kerberos nie zawiera prawidłowej nazwy użytkownika.
pt_br: As NetworkCredentials fornecidas para o Token Kerberos não tem um UserName válido.
tr: Kerberos Belirteci için sağlanan NetworkCredentials geçerli bir UserName değerine sahip değil.
zh_hans: 为 Kerberos 令牌提供的 NetworkCredentials 没有有效的用户名。
zh_hant: 為 Kerberos 權杖提供的 NetworkCredentials 未具備有效的 UserName。

# ProxyAuthenticationLevelMismatch
source: The HTTP proxy authentication credential specified an mutual authentication requirement ({0}) that is stricter than the requirement for target server authentication ({1}).
cs: Pověření pro ověření proxy serveru HTTP určilo požadavek vzájemného ověřování ({0}), který je přísnější než požadavek na ověření cílového serveru ({1}).
de: In den Anmeldeinformationen für die HTTP-Proxyauthentifizierung ist eine gegenseitige Authentifizierungsanforderung ({0}) angegeben, die strenger ist als die Anforderung für die Zielserverauthentifizierung ({1}).
es: La credencial de autenticación de proxy HTTP especificó un requisito de autenticación mutua ({0}) más estricto que el requisito de autenticación del servidor de destino ({1}).
fr: Les informations d'identification d'authentification du proxy HTTP spécifiaient une exigence d'authentification mutuelle ({0}) qui est plus stricte que l'exigence pour l'authentification du serveur cible ({1}).
it: La credenziale di autenticazione del proxy HTTP ha specificato un requisito di autenticazione reciproca ({0}) più restrittivo rispetto al requisito per l'autenticazione del server di destinazione ({1}).
ja: HTTP プロキシ認証の資格情報で、対象サーバーの認証要件 ({1}) より厳しい要件である、相互の認証 ({0}) が必要なことが指定されています。
ko: HTTP 프록시 인증 자격 증명이 대상 서버 인증에 대한 요구 사항({1})보다 엄격한 상호 인증 요구 사항({0})을 지정했습니다.
pl: Poświadczenie uwierzytelnienia serwera proxy HTTP określiło wymaganie wzajemnego uwierzytelnienia ({0}), które jest bardziej restrykcyjne od wymagania dotyczącego uwierzytelnienia serwera docelowego ({1}).
pt_br: A credencial de autenticação de proxy HTTP especificou um requisito de autenticação mútua ({0}) mais rígido que o requisito para autenticação de servidores de destino ({1}).
tr: HTTP proxy kimlik doğrulama bilgileri, hedef sunucu kimlik doğrulamasından ({1}) daha katı olan bir karşılıklı kimlik doğrulama gerekliliği ({0}) belirtti.
zh_hans: HTTP 代理身份验证凭据指定了互相身份验证要求({0})，该要求比对目标服务器身份验证({1})的要求更严格。
zh_hant: HTTP Proxy 驗證認證指定的相互驗證需求 ({0})，比目標伺服器驗證需求 ({1}) 更為嚴格。

# ProxyImpersonationLevelMismatch
source: The HTTP proxy authentication credential specified an impersonation level restriction ({0}) that is stricter than the restriction for target server authentication ({1}).
cs: Pověření pro ověření proxy serveru HTTP určilo omezení úrovně zosobnění ({0}), které je přísnější než omezení cílového serveru ({1}).
de: In den Anmeldeinformationen für die HTTP-Proxyauthentifizierung ist eine Identitätswechseleinschränkung ({0}) angegeben, die strenger ist als die Einschränkung für die Zielserverauthentifizierung ({1}).
es: La credencial de autenticación de proxy HTTP especificó una restricción de nivel de suplantación ({0}) más estricta que la restricción de autenticación del servidor de destino ({1}).
fr: Les informations d'identification d'authentification du proxy HTTP spécifiaient une restriction de niveau d'emprunt d'identité ({0}) qui est plus stricte que la restriction pour l'authentification du serveur cible ({1}).
it: La credenziale di autenticazione del proxy HTTP ha specificato una restrizione del livello di rappresentazione ({0}) più limitante rispetto alla restrizione per l'autenticazione server di destinazione ({1}).
ja: HTTP プロキシ認証の資格情報で、対象サーバーの認証制限 ({1}) より厳しい制限である、偽装レベルの制限 ({0}) が指定されています。
ko: HTTP 프록시 인증 자격 증명이 대상 서버 인증에 대한 제한({1})보다 엄격한 가장 수준 제한({0})을 지정했습니다.
pl: Poświadczenie uwierzytelnienia serwera proxy HTTP określiło ograniczenie poziomu personifikacji ({0}), które jest bardziej restrykcyjne od ograniczenia dotyczącego uwierzytelnienia serwera docelowego ({1}).
pt_br: A credencial de autenticação de proxy HTTP especificou uma restrição de nível de representação ({0}) mais rígida que a restrição para autenticação de servidores de destino ({1}).
tr: HTTP proxy kimlik doğrulama bilgileri, hedef sunucu kimlik doğrulamasından ({1}) daha katı olan bir kimliğe bürünme düzeyi sınırlaması ({0}) belirtti.
zh_hans: HTTP 代理身份验证凭据指定了模拟级别限制({0})，该限制比对目标服务器身份验证({1})的限制更严格。
zh_hant: HTTP Proxy 驗證認證指定的模擬層級限制 ({0})，比目標伺服器驗證限制 ({1}) 更為嚴格。

# Psha1KeyLengthInvalid
source: The PSHA1 key length '{0}' is invalid.
cs: Délka klíče PSHA1 {0} je neplatná.
de: Die Schlüssellänge "{0}" für PSHA1-Schlüssel ist ungültig.
es: La longitud de la clave PSHA1 "{0}" no es válida.
fr: La longueur de la clé PSHA1 '{0}' est non valide.
it: La lunghezza della chiave PSHA1 '{0}' non è valida.
ja: PSHA1 キーの長さ '{0}' は無効です。
ko: PSHA1 키 길이 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowa długość klucza PSHA1: „{0}”.
pt_br: O comprimento da chave PSHA1 '{0}' é inválido.
tr: '{0}' PSHA1 anahtar uzunluğu geçersiz.
zh_hans: PSHA1 密钥长度“{0}”无效。
zh_hant: PSHA1 金鑰長度 '{0}' 無效。

# PublicKeyNotDSA
source: The public key is not a DSA key.
cs: Veřejný klíč není klíč DSA.
de: Der öffentliche Schlüssel ist kein DSA-Schlüssel.
es: La clave pública no es una clave DSA.
fr: La clé publique n'est pas une clé DSA.
it: La chiave pubblica non è una chiave DSA.
ja: 公開キーは DSA キーではありません。
ko: 공개 키가 DSA 키가 아닙니다.
pl: Klucz publiczny nie jest kluczem DSA.
pt_br: A chave pública não é uma chave DSA.
tr: Ortak anahtar bir RSA anahtarı değil.
zh_hans: 公钥不是 DSA 密钥。
zh_hant: 公開金鑰並非 DSA 金鑰。

# PublicKeyNotRSA
source: The public key is not an RSA key.
cs: Veřejný klíč není klíčem RSA.
de: Der öffentliche Schlüssel ist kein RSA-Schlüssel.
es: La clave pública no es RSA.
fr: La clé publique n'est pas une clé RSA.
it: La chiave pubblica non è una chiave RSA.
ja: 公開キーは RSA キーではありません。
ko: 공개 키가 RSA 키가 아닙니다.
pl: Klucz publiczny nie jest kluczem RSA.
pt_br: A chave pública não é uma chave RSA.
tr: Ortak anahtar anahtar bir RSA anahtarı değil.
zh_hans: 公钥不是 RSA 密钥。
zh_hant: 公開金鑰不是 RSA 金鑰。

# PublicKeyNotSupported
source: The key algorithm for this public key is not supported.
cs: Algoritmus klíče pro tento veřejný klíč není podporován.
de: Der Schlüsselalgorithmus für diesen öffentlichen Schlüssel wird nicht unterstützt.
es: El algoritmo de clave para esta clave pública no es compatible.
fr: L’algorithme de clé pour cette clé publique n’est pas pris en charge.
it: L'algoritmo della chiave per questa chiave pubblica non è supportato.
ja: この公開キーのキー アルゴリズムはサポートされていません。
ko: 이 퍼블릭 키에 대한 키 알고리즘은 지원되지 않습니다.
pl: Algorytm klucza dla tego klucza publicznego nie jest obsługiwany.
pt_br: O algoritmo chave para esta chave pública não é suportado.
tr: Bu ortak anahtar için anahtar algoritması desteklenmiyor.
zh_hans: 不支持此公钥的密钥算法。
zh_hant: 不支援此公開金鑰的金鑰演算法。

# ReadNotSupportedOnStream
source: Read not supported on stream '{0}'.
cs: Čtení není u streamu {0} podporované.
de: Für den Datenstrom "{0}" wird der Lesezugriff nicht unterstützt.
es: No se admite lectura en la secuencia '{0}'.
fr: Lecture non prise en charge sur le flux '{0}'.
it: Lettura non supportata sul flusso '{0}'.
ja: ストリーム '{0}' での読み取りはサポートされていません。
ko: 스트림 '{0}'에서 읽기가 지원되지 않습니다.
pl: Odczyt nie jest obsługiwany w strumieniu „{0}”.
pt_br: Não há suporte para leitura no fluxo '{0}'.
tr: '{0}' akışında Read desteklenmiyor.
zh_hans: “{0}”流不支持读取。
zh_hant: 資料流 '{0}' 上不支援讀取。

# ReceiveShutdownReturnedFault
source: The channel received an unexpected fault input message while closing. The fault reason given is: '{0}'
cs: Během uzavírání přijal kanál neočekávanou zprávu vstupní chyby. Uvedený důvod chyby je: {0}
de: Der Kanal hat beim Schließen eine unerwartete Fehlereingabenachricht empfangen. Angegebene Fehlerursache: "{0}"
es: El canal recibió un mensaje de entrada de error inesperado al cerrarse. Razón del error: "{0}"
fr: Le canal a reçu un message d'entrée d'erreur inattendu durant sa fermeture. La raison de l'erreur donnée est : '{0}'
it: Il canale ha ricevuto un messaggio input di errore imprevisto durante la chiusura. Motivo dell'errore: '{0}'
ja: チャネルを閉じているときに、予期しないフォールト入力メッセージを受信しました。提示されたフォールトの原因は '{0}' です。
ko: 채널이 닫히는 도중에 예기치 않은 오류 입력 메시지를 수신했습니다. 주어진 오류 원인은 '{0}'입니다.
pl: Podczas zamykania kanał odebrał nieoczekiwany komunikat wejściowy o błędzie. Podana przyczyna błędu to: „{0}”
pt_br: O canal recebeu uma mensagem de entrada inesperada com falha durante o fechamento. O motivo determinado da falha é: '{0}'
tr: Kanal kapatılırken beklenmeyen bir hatalı giriş iletisi aldı. Verilen hata nedeni: '{0}'
zh_hans: 通道在关闭时接收到意外的错误输入消息。给出的错误原因为:“{0}”
zh_hant: 通道在關閉時，收到非預期的錯誤輸入訊息。提供的錯誤原因為: '{0}'

# ReceiveShutdownReturnedLargeFault
source: The channel received an unexpected fault input message with Action = '{0}' while closing. You should only close your channel when you are not expecting any more input messages.
cs: Kanál přijal neočekávanou zprávu vstupní chyby s akcí = {0}. Kanál byste měli uzavírat pouze tehdy, jestliže neočekáváte další zprávy o zadávání.
de: Der Kanal hat beim Schließen eine unerwartete Fehlereingabenachricht mit Aktion = "{0}" empfangen. Sie sollten den Kanal nur schließen, wenn Sie keine weiteren Eingabenachrichten erwarten.
es: El canal recibió un mensaje de entrada de error inesperado con Action = "{0}" al cerrarse. Solo debe cerrar el canal cuando no espere ningún otro mensaje de entrada.
fr: Le canal a reçu un message d'entrée d'erreur inattendu avec Action = '{0}' durant sa fermeture. Vous devez fermer le canal uniquement quand vous n'attendez plus de messages d'entrée.
it: Il canale ha ricevuto un messaggio input di errore imprevisto con Action = '{0}' durante la chiusura. È consigliabile chiudere il canale solo quando non sono previsti altri messaggi di input.
ja: チャネルを閉じているときに、Action = '{0}' の予期しないフォールト入力メッセージを受信しました。チャネルは、追加の入力メッセージを受信する可能性がない場合に閉じる必要があります。
ko: 채널이 닫는 도중에 Action='{0}'이(가) 있는 예기치 않은 오류 입력 메시지를 수신했습니다. 입력 메시지가 더 이상 필요하지 않은 경우에만 채널을 닫아야 합니다.
pl: Podczas zamykania kanał odebrał nieoczekiwany komunikat wejściowy o błędzie z wartością Action = „{0}”. Kanał należy zamykać tylko wtedy, gdy żadne komunikaty wejściowe nie są oczekiwane.
pt_br: O canal recebeu uma mensagem de entrada com falha inesperada com Ação = '{0}' durante o fechamento. Apenas feche o canal quando não estiver esperando mais mensagens de entrada.
tr: Kanal, kapatılırken Action = '{0}' olan beklenmeyen bir hatalı giriş iletisi aldı. Kanalınızı, yalnızca başka giriş iletisi beklemediğinizde kapatmalısınız.
zh_hans: 通道在关闭时接收到意外的错误输入消息，Action=“{0}”。只应在不再需要任何输入消息时关闭通道。
zh_hant: 通道在關閉時，收到 Action = '{0}' 的未預期錯誤輸入訊息。只有在未預期收到任何其他輸入訊息時，才可關閉通道。

# ReceiveShutdownReturnedMessage
source: The channel received an unexpected input message with Action '{0}' while closing. You should only close your channel when you are not expecting any more input messages.
cs: Během uzavírání přijal kanál neočekávanou zprávu o zadávání s akcí {0}. Kanál byste měli uzavírat pouze tehdy, jestliže neočekáváte další zprávy o zadávání.
de: Der Kanal hat beim Schließen eine unerwartete Eingabenachricht mit Aktion "{0}" empfangen. Sie sollten den Kanal nur schließen, wenn Sie keine weiteren Eingabenachrichten erwarten.
es: El canal recibió un mensaje de entrada inesperado con Action = "{0}" al cerrarse. Solo debe cerrar el canal cuando no espere ningún otro mensaje de entrada.
fr: Le canal a reçu un message d'entrée inattendu avec Action '{0}' durant sa fermeture. Vous devez fermer le canal uniquement quand vous n'attendez plus de messages d'entrée.
it: Il canale ha ricevuto un messaggio di input imprevisto con Action '{0}' durante la chiusura. È consigliabile chiudere il canale solo quando non sono previsti altri messaggi di input.
ja: チャネルを閉じているときに、アクションが '{0}' の予期しない入力メッセージを受信しました。チャネルは、追加の入力メッセージを受信する可能性がない場合にのみ閉じる必要があります。
ko: 닫는 동안 채널이 '{0}' 동작을 가진 예기치 않은 입력 메시지를 수신했습니다. 입력 메시지가 더 이상 필요하지 않은 경우에만 채널을 닫아야 합니다.
pl: Podczas zamykania kanał odebrał nieoczekiwany komunikat wejściowy z wartością Action: „{0}”. Kanał należy zamykać tylko wtedy, gdy żadne komunikaty wejściowe nie są oczekiwane.
pt_br: O canal recebeu uma mensagem de entrada inesperada com Ação = '{0}' durante o fechamento. Apenas feche o canal quando não estiver esperando mais mensagens de entrada.
tr: Kanal kapatılırken '{0}' Eylemi içeren beklenmeyen bir giriş iletisi aldı. Kanalınızı yalnızca başka giriş iletisi beklemediğinizde kapatmalısınız.
zh_hans: 通道在关闭时接收到意外的输入消息，Action 为“{0}”。只应在不再需要任何输入消息时关闭通道。
zh_hant: 通道在關閉時，收到 Action '{0}' 的未預期輸入訊息。只有在未預期任何其他輸入訊息時，才可關閉通道。

# ReceiveTimedOut
source: Receive on local address {0} timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Příjmu na místní adrese {0} skončila platnost po {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Empfang an der lokalen Adresse {0} ist nach {1} ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de recepción en la dirección local {0} después de {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La réception sur l'adresse locale {0} a dépassé le délai imparti après {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di ricezione sull'indirizzo locale {0} dopo {1}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: ローカル アドレス {0} での受信が {1} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 로컬 주소 {0}의 수신이 {1} 이후에 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Limit czasu odbioru dla adresu lokalnego {0} został przekroczony po {1}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A recepção no endereço local {0} atingiu o tempo limite após {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} yerel adresindeki Receive {1} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 本地地址 {0} 上的接收操作在 {1} 后超时。分配给此操作的时间可能比超时长。
zh_hant: 在本機位址 {0} 上接收已於 {1} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# ReceiveTimedOut2
source: Receive timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit pro příjem skončil po {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Timeout beim Empfang nach {0}. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de recepción después de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La réception a expiré après {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di ricezione dopo {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 受信が {0} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {0} 이후에 수신이 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Limit czasu odbioru został przekroczony po {0}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A recepção atingiu o tempo limite após {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} sonra alma işlemi zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 接收操作在 {0} 之后超时。分配给此操作的时间可能比超时长。
zh_hant: 接收於 {0} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# ReceiveTimedOutNoLocalAddress
source: Receive timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit pro příjem skončil po {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Timeout beim Empfang nach {0}. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de recepción después de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La réception a expiré après {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di ricezione dopo {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 受信が {0} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {0} 이후에 수신이 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Limit czasu odbioru został przekroczony po {0}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A recepção atingiu o tempo limite após {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} sonra alma işlemi zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 接收操作在 {0} 之后超时。分配给此操作的时间可能比超时长。
zh_hant: 接收於 {0} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。
