Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SecurityAuditPlatformNotSupported
source: Writing audit messages to the Security log is not supported by the current platform. You must write audit messages to the Application log.
cs: Zápis zpráv auditu do protokolu zabezpečení aktuální platforma nepodporuje. Zprávy auditu je nutné zapsat do protokolu aplikace.
de: Das Schreiben von Überwachungsmeldungen in das Sicherheitsprotokoll wird von der aktuellen Plattform nicht unterstützt. Sie müssen die Überwachungsmeldungen in das Anwendungsprotokoll schreiben.
es: La plataforma actual no admite la escritura de mensajes de auditoría en el registro de seguridad. Deberá escribir los mensajes de auditoría en el registro de la aplicación.
fr: L'écriture de messages d'audit dans le journal de sécurité n'est pas prise en charge par la plateforme actuelle. Vous devez écrire les messages de type dans le journal des applications.
it: La scrittura dei messaggi di controllo nel log di sicurezza non è supportata dalla piattaforma corrente. È necessario scrivere i messaggi di controllo nel registro applicazioni.
ja: 現在のプラットフォームでは、セキュリティ ログへの監査メッセージの書き込みはサポートされていません。監査メッセージはアプリケーション ログに書き込む必要があります。
ko: 감사 메시지를 보안 로그에 쓰는 것이 현재 플랫폼에서 지원되지 않습니다. 감사 메시지를 응용 프로그램 로그에 써야 합니다.
pl: Bieżąca platforma nie obsługuje zapisywania komunikatów inspekcji do dziennika zabezpieczeń. Komunikaty inspekcji należy zapisywać do dziennika aplikacji.
pt_br: Não há suporte para a gravação de mensagens de auditoria no log de Segurança na plataforma atual. É necessário gravar mensagens de auditoria no log de Aplicativos.
tr: Security günlüğüne denetleme iletileri yazılması geçerli platform tarafından desteklenmez. Denetleme iletilerini Application günlüğüne yazmalısınız.
zh_hans: 当前平台不支持将审核消息写入安全日志。必须将审核消息写入应用程序日志。
zh_hant: 目前的平台不支援將稽核訊息寫入安全性記錄檔。您必須將稽核訊息寫入應用程式記錄檔。

# SecurityCapabilitiesMismatched
source: The security capabilities of binding '{0}' do not match those of the generated runtime object. Most likely this means the binding contains a StreamSecurityBindingElement, but lacks a TransportBindingElement that supports Stream Security (such as TCP or Named Pipes). Either remove the unused StreamSecurityBindingElement or use a transport that supports this element.
cs: Schopnosti zabezpečení vazby {0} neodpovídají těm, které patří k vytvořenému objektu modulu runtime. Pravděpodobně to znamená, že vazba obsahuje třídu StreamSecurityBindingElement, ale schází jí třída TransportBindingElement, která podporuje zabezpečení datových proudů (například protokol TCP nebo pojmenované kanály). Buď odeberte nepoužívaný element StreamSecurityBindingElement, nebo používejte přenos, který tento element podporuje.
de: Die Sicherheitsfunktionen der Bindung "{0}" stimmen nicht mit denen des generierten Laufzeitobjekts überein. Dies bedeutet höchstwahrscheinlich, dass die Bindung ein StreamSecurityBindingElement enthält, jedoch kein TransportBindingElement, das Stream Security unterstützt (zum Beispiel TCP oder Named Pipes). Entfernen Sie entweder das nicht verwendete StreamSecurityBindingElement, oder verwenden Sie einen Transport, der dieses Element unterstützt.
es: Las capacidades de seguridad del enlace "{0}" no coinciden con las del objeto de tiempo de ejecución generado. Probablemente, esto significa que el enlace contiene StreamSecurityBindingElement, pero carece de un elemento TransportBindingElement que admita seguridad de secuencias (como TCP o Canalizaciones con nombre). Quite el StreamSecurityBindingElement no usado o use un transporte que admita este elemento.
fr: Les fonctionnalités de sécurité de la liaison '{0}' ne correspondent pas à celle de l'objet d'exécution généré. Cela signifie très probablement que la liaison contient l'élément StreamSecurityBindingElement, mais sans TransportBindingElement pour prendre en charge la sécurité de flux (tel que TCP ou les canaux nommés). Supprimez l'élément StreamSecurityBindingElement inutilisé ou utilisez un transport qui le prend en charge.
it: Le funzionalità di sicurezza del binding '{0}' non corrispondono a quelle dell'oggetto runtime generato. È probabile che il binding contenga un elemento StreamSecurityBindingElement, ma non includa un elemento TransportBindingElement che supporta la sicurezza dei flussi, ad esempio TCP o named pipe. Rimuovere l'elemento StreamSecurityBindingElement inutilizzato o usare un trasporto che supporta questo elemento.
ja: バインド '{0}' のセキュリティの性能が、生成されたランタイム オブジェクトと一致しません。これは多くの場合、バインドに StreamSecurityBindingElement があるが Stream Security をサポートする TransportBindingElement (TCP や名前付きパイプなど) がないことを意味します。使用していない StreamSecurityBindingElement を削除するか、この要素をサポートしているトランスポートを使用してください。
ko: 바인딩 '{0}'의 보안 기능이 생성된 런타임 개체의 보안 기능과 일치하지 않습니다. 대개 이것은 바인딩에 StreamSecurityBindingElement가 있지만 스트림 보안(예: TCP 또는 명명된 파이프)을 지원하는 TransportBindingElement가 없다는 것을 의미합니다. 사용하지 않는 StreamSecurityBindingElement를 제거하거나 이 요소를 지원하는 전송을 사용하세요.
pl: Możliwości zabezpieczeń powiązania „{0}” nie pasują do właściwości wygenerowanego obiektu wykonawczego. Najprawdopodobniej oznacza to, że powiązanie zawiera element StreamSecurityBindingElement, ale nie zawiera elementu TransportBindingElement obsługującego zabezpieczenia strumienia (takie jak protokół TCP lub Named Pipes). Usuń nieużywany element StreamSecurityBindingElement albo użyj transportu, który go obsługuje.
pt_br: Os recursos de segurança da associação '{0}' não correspondem àqueles do objeto gerado no tempo de execução. Provavelmente isso significa que a associação contém StreamSecurityBindingElement, mas não contém TransportBindingElement que dá suporte à Segurança de Fluxo (como TCP ou Pipes Nomeados). Remova o StreamSecurityBindingElement não usado ou use um transporte que dê suporte a esse elemento.
tr: '{0}' bağlamasının güvenlik yetenekleri türetilen çalışma zamanı nesnesininkilerle eşleşmiyor. Büyük bir olasılıkla bunun anlamı bağlamanın StreamSecurityBindingElement öğesine sahip olması, ancak Akış Güvenliği (TCP veya Adlandırılmış Kanallar gibi) desteği olan bir TransportBindingElement öğesine sahip olmamasıdır. Kullanılmayan StreamSecurityBindingElement öğesini kaldırın ya da bu öğeyi destekleyen bir aktarım kullanın.
zh_hans: 绑定“{0}”的安全功能与生成的运行时对象的安全功能不匹配。这很可能意味着该绑定包含 StreamSecurityBindingElement，但缺少支持流安全(如 TCP 或命名管道)的 TransportBindingElement。请删除未使用的 StreamSecurityBindingElement 或使用支持此元素的传输。
zh_hant: 繫結 '{0}' 的安全性功能與產生的執行階段物件之安全性功能不符。這通常代表繫結包含 StreamSecurityBindingElement，但遺漏支援資料流安全性 (例如 TCP 或具名管道) 的 TransportBindingElement。請移除未使用的 StreamSecurityBindingElement 或使用支援此元素的傳輸。

# SecurityContextNotRegistered
source: The SecurityContextSecurityToken with context-id={0} (key generation-id={1}) is not registered.
cs: Třída SecurityContextSecurityToken s identifikátorem context-id={0} (identifikátor klíče generation-id={1}) není registrována.
de: Das SecurityContextSecurityToken mit "context-id={0}" (key generation-id={1}) ist nicht registriert.
es: El elemento SecurityContextSecurityToken con context-id={0} (generation-id de clave={1}) no está registrado.
fr: Le SecurityContextSecurityToken avec context-id={0} (generation-id de clé={1}) n'est pas inscrit.
it: L'elemento SecurityContextSecurityToken con context-id={0} (key generation-id={1}) non è registrato.
ja: コンテキスト ID が {0} (キー生成 ID は {1}) である SecurityContextSecurityToken が登録されていません。
ko: context-id={0}(key generation-id={1})을(를) 가진 SecurityContextSecurityToken이 등록되지 않았습니다.
pl: Element SecurityContextSecurityToken o identyfikatorze kontekstu={0} (identyfikator generowania klucza={1}) nie jest zarejestrowany.
pt_br: A SecurityContextSecurityToken com ID de contexto={0} (ID de geração de chave={1}) não está registrada.
tr: {0} bağlam kimlikli (anahtar oluşturma kimliği={1}) SecurityContextSecurityToken kayıtlı değil.
zh_hans: 带有 context-id={0} (密钥生成 ID={1})的 SecurityContextSecurityToken 未注册。
zh_hant: 具有 context-id={0} (金鑰 generation-id={1}) 的 SecurityContextSecurityToken 未註冊。

# SecurityEndpointNotFound
source: Server '{0}' sent back a fault indicating it is in the process of shutting down. Please see the inner exception for fault details.
cs: Server {0} odeslal zpět chybu, která udává, že probíhá jeho vypínání. Podrobné informace o chybě naleznete v popisu vnitřní výjimky.
de: Der Server "{0}" hat einen Fehler zurückgesendet, der darauf hinweist, dass der Server gerade heruntergefahren wird. Detaillierte Fehlerinformationen finden Sie in der inneren Ausnahme.
es: El servidor '{0}' devolvió un error que indica que está en proceso de cerrarse. Consulte la excepción interna para obtener más información del error.
fr: Le serveur '{0}' a renvoyé une erreur indiquant qu'il est en cours d'arrêt. Consultez l'exception interne pour obtenir des détails sur l'erreur.
it: Il server '{0}' ha restituito un errore che indica che è in fase di arresto. Per ulteriori informazioni sull'errore, vedere l'eccezione interna.
ja: サーバー '{0}' は、シャットダウンの処理中であることを示すフォールトを返信しました。詳細については、内部例外を参照してください。
ko: 종료하는 중이라는 것을 나타내는 오류를 '{0}' 서버가 다시 보냈습니다. 자세한 오류 내용은 내부 예외를 참조하십시오.
pl: Serwer „{0}” zwrócił błąd wskazujący, że właśnie trwa jego zamykanie. Szczegółowe informacje o błędzie można znaleźć w wewnętrznym wyjątku.
pt_br: O servidor '{0}' retornou uma falha indicando que ele está desligando. Consulte a exceção interna para obter os detalhes da falha.
tr: '{0}' sunucusu, kapanmakta olduğunu belirten bir hata gönderdi. Hata ayrıntıları için iç özel duruma bakın.
zh_hans: 服务器“{0}”发回错误，指示其正在关机。有关错误的详细信息，请参见内部异常。
zh_hant: 伺服器 '{0}' 傳回錯誤，指出正在進行關機。如需錯誤詳細資訊，請參閱內部例外狀況。

source: Security header is empty.
cs: Záhlaví zabezpečení je prázdné.
de: Der Sicherheitsheader ist leer.
es: El encabezado de seguridad está vacío.
fr: L'en-tête de sécurité est vide.
it: Intestazione di sicurezza vuota.
ja: セキュリティ ヘッダーが空です。
ko: 보안 헤더가 비어 있습니다.
pl: Nagłówek zabezpieczeń jest pusty.
pt_br: O cabeçalho de segurança está vazio.
tr: Güvenlik üst bilgisi boş.
zh_hans: 安全标头为空。
zh_hant: 安全性標頭空白。

# SecurityNegotiationCannotProtectConfidentialEndpointHeader
source: The security negotiation with '{0}' cannot be initiated because the confidential endpoint address header ('{1}', '{2}') cannot be encrypted during the course of the negotiation.
cs: Vyjednávání zabezpečení s {0} nelze iniciovat, protože důvěrné záhlaví adresy koncového bodu ({1}, {2}) nelze během vyjednávání zašifrovat.
de: Die Sicherheitsaushandlung mit "{0}" kann nicht eingeleitet werden, weil der vertrauliche Endpunktadressheader ("{1}", "{2}") im Verlauf der Aushandlung nicht verschlüsselt werden kann.
es: La negociación de seguridad con '{0}' no se puede iniciar porque el encabezado de dirección de extremo confidencial ('{1}', '{2}') no se puede cifrar durante el curso de la negociación.
fr: La négociation de sécurité avec '{0}' ne peut pas être lancée car l'en-tête de l'adresse du point de terminaison confidentiel ('{1}', '{2}') ne peut pas être chiffré pendant la négociation.
it: Impossibile avviare la negoziazione di sicurezza con '{0}' perché l'intestazione riservata ('{1}', '{2}') dell'indirizzo endpoint non può essere crittografata durante la negoziazione.
ja: ネゴシエーションの過程で機密のエンドポイント アドレス ヘッダー ('{1}'、'{2}') を暗号化できないため、'{0}' とのセキュリティ ネゴシエーションを開始できません。
ko: 기밀 끝점 주소 헤더('{1}', '{2}')를 협상 도중에 암호화할 수 없기 때문에 '{0}'과(와)의 보안 협상을 시작할 수 없습니다.
pl: Nie można zainicjować negocjowania zabezpieczeń z „{0}”, ponieważ w trakcie negocjacji nie można zaszyfrować poufnego nagłówka adresu punktu końcowego („{1}”, „{2}”).
pt_br: Não é possível iniciar a negociação de segurança com '{0}' porque o cabeçalho de endereço de ponto de extremidade confidencial ('{1}', '{2}') não pode ser criptografado durante o curso da negociação.
tr: Gizli bitiş noktası adres üst bilgisi ('{1}', '{2}'), anlaşma işlemi boyunca şifrelenemediğinden, '{0}' öğesine sahip güvenlik anlaşması başlatılamıyor.
zh_hans: 无法启动与“{0}”的安全协商，因为在协商过程中无法对机密终结点地址标头(“{1}”、“{2}”)加密。
zh_hant: 無法初始化具有 '{0}' 的安全性交涉，因為機密端點位址標頭 ('{1}'、'{2}') 無法在交涉期間加密。

# SecurityProtocolCannotDoReplayDetection
source: The security protocol '{0}' cannot do replay detection.
cs: Protokol zabezpečení {0} nemůže rozpoznat opětovné přehrání.
de: Das Sicherheitsprotokoll "{0}" kann keine Replay-Erkennung ausführen.
es: El protocolo de seguridad "{0}" no puede llevar a cabo la detección de reproducción.
fr: Le protocole de sécurité '{0}' ne peut pas effectuer la détection de réexécution.
it: Il protocollo di sicurezza '{0}' non può effettuare il rilevamento riproduzione.
ja: セキュリティ プロトコル '{0}' は再生検出を実行できません。
ko: 보안 프로토콜 '{0}'이(가) 재생 검색을 수행할 수 없습니다.
pl: Protokół zabezpieczeń „{0}” nie może przeprowadzić wykrywania powtarzania.
pt_br: O protocolo de segurança '{0}' não pode executar a detecção de reprodução.
tr: '{0}' güvenlik protokolü yeniden yürütme algılaması yapamaz.
zh_hans: 安全协议“{0}”无法进行重放检测。
zh_hant: 安全性通訊協定 '{0}' 無法執行偵測重送攻擊。

# SecurityProtocolFactoryShouldBeSetBeforeThisOperation
source: The security protocol factory must be set before this operation is performed.
cs: Výroba protokolu zabezpečení musí být nastavena před prováděním této operace.
de: Die Sicherheitsprotokollfactory muss festgelegt sein, bevor dieser Vorgang ausgeführt wird.
es: El generador de protocolos de seguridad debe establecerse antes de realizar esta operación.
fr: La fabrique de protocoles de sécurité doit être définie avant l'exécution de cette opération.
it: Impostare la protocol factory di sicurezza prima di eseguire l'operazione.
ja: この操作が実行される前に、セキュリティ プロトコル ファクトリが設定されている必要があります。
ko: 이 작업을 수행하기 전에 보안 프로토콜 팩터리를 설정해야 합니다.
pl: Przed wykonaniem tej operacji należy ustawić fabrykę protokołów zabezpieczeń.
pt_br: A fábrica de protocolo de segurança deve ser definida antes de esta operação ser executada.
tr: Güvenlik protokolü fabrikası bu işlem gerçekleştirilmeden önce ayarlanmalıdır.
zh_hans: 执行此操作以前必须先设置安全协议工厂。
zh_hant: 必須先設定安全性通訊協定處理站，才能執行此作業。

# SecurityServerTooBusy
source: Server '{0}' sent back a fault indicating it is too busy to process the request. Please retry later. Please see the inner exception for fault details.
cs: Server {0} odeslal zpět chybu, která udává, že je příliš zaneprázdněn a nemůže zpracovat požadavek. Podrobné informace o chybě naleznete v popisu vnitřní výjimky.
de: Der Server "{0}" hat einen Fehler zurückgesendet, der darauf hinweist, dass er zu ausgelastet ist, um die Anforderung zu verarbeiten. Versuchen Sie es später noch mal. Detaillierte Fehlerinformationen finden Sie in der inneren Ausnahme.
es: El servidor "{0}" devolvió un error que indica que está demasiado ocupado para procesar la solicitud. Inténtelo de nuevo más adelante. Consulte la excepción interna para obtener más información del error.
fr: Le serveur '{0}' a envoyé une erreur indiquant qu'il est trop occupé pour traiter la requête. Réessayez plus tard. Consultez l'exception interne pour obtenir des détails sur l'erreur.
it: Il server '{0}' ha restituito un errore che indica che è troppo occupato per elaborare la richiesta. Riprovare più tardi. Per dettagli sull'errore, vedere l'eccezione interna.
ja: サーバー '{0}' は、ビジー状態のため要求を処理できないことを示すフォールトを送り返しました。後で再試行してください。フォールトの詳細については、内部例外を参照してください。
ko: 사용 중이어서 요청을 처리할 수 없다는 것을 나타내는 오류를 '{0}' 서버가 다시 보냈습니다. 나중에 다시 시도하세요. 자세한 오류 내용은 내부 예외를 참조하세요.
pl: Serwer „{0}” zwrócił błąd wskazujący, że jest zbyt obciążony, aby obsłużyć żądanie. Spróbuj ponownie później. Szczegółowe informacje o błędzie można znaleźć w wewnętrznym wyjątku.
pt_br: O servidor '{0}' retornou uma falha indicando que ele está muito ocupado para processar a solicitação. Tente novamente mais tarde. Consulte a exceção interna para obter os detalhes da falha.
tr: '{0}' sunucusu bir hata geri göndererek, isteği işleyemeyecek kadar meşgul olduğunu belirtti. Lütfen daha sonra yeniden deneyin. Hata ayrıntıları için iç özel duruma bakın.
zh_hans: 服务器“{0}”发回错误，指示其太忙，无法处理请求。请稍后重试。有关错误的详细信息，请参见内部异常。
zh_hant: 伺服器 '{0}' 傳回錯誤，指出因過於忙碌，無法處理要求。請稍後重試。請參考內部例外狀況，以取得錯誤詳細資料。

# SecuritySessionFaultReplyWasSent
source: The receiver sent back a security session fault message. Retry the request.
cs: Příjemce odeslal zpět zprávu o chybě relace zabezpečení. Opakujte požadavek.
de: Der Empfänger hat eine Fehlermeldung der Sicherheitssitzung zurückgesendet. Wiederholen Sie die Anforderung.
es: El destinatario devolvió un mensaje de error de sesión de seguridad. Intente realizar la solicitud de nuevo.
fr: Le récepteur a renvoyé un message d'erreur de session de sécurité. Réessayez.
it: Il destinatario ha restituito un messaggio di errore della sessione di sicurezza. Ritentare la richiesta.
ja: 受信側から、セキュリティ セッション エラー メッセージが戻されました。要求を再試行してください。
ko: 수신자가 보안 세션 오류 메시지를 다시 보냈습니다. 요청을 다시 시도하십시오.
pl: Odbiorca odesłał komunikat o błędzie sesji zabezpieczeń. Ponów żądanie.
pt_br: O receptor retornou uma mensagem de falha de sessão de segurança. Repita a solicitação.
tr: Alıcı, bir güvenlik oturumu hata iletisi geri gönderdi. İsteği yeniden deneyin.
zh_hans: 接收器发回安全会话错误消息。重试该请求。
zh_hant: 接收者傳回安全性工作階段錯誤訊息。請稍後再試。

# SecuritySessionProtocolFactoryShouldBeSetBeforeThisOperation
source: Security session protocol factory must be set before this operation is performed.
cs: Výroba protokolu relace zabezpečení musí být nastavena před prováděním této operace.
de: Die Sicherheitssitzungsprotokoll-Factory muss festgelegt sein, bevor dieser Vorgang ausgeführt wird.
es: Se debe establecer el generador de protocolos de sesión de seguridad antes de realizar esta operación.
fr: La fabrique de protocoles de session de sécurité doit être définie avant l'exécution de cette opération.
it: La protocol factory della sessione di sicurezza deve essere impostata prima dell'esecuzione dell'operazione.
ja: この操作が実行される前に、セキュリティ セッション プロトコル ファクトリを設定する必要があります。
ko: 이 작업을 수행하기 전에 보안 세션 프로토콜 팩터리를 설정해야 합니다.
pl: Przed wykonaniem tej operacji należy określić fabrykę protokołów sesji zabezpieczeń.
pt_br: A fábrica de protocolo de sessão de segurança deve ser definida antes que esta operação seja executada.
tr: Güvenlik oturumu protokolü fabrikası, işlem gerçekleştirilmeden önce ayarlanmalıdır.
zh_hans: 执行此操作以前必须先设置安全会话协议工厂。
zh_hant: 必須先設定安全性工作階段通訊協定處理站，才能執行此作業。

# SecurityStandardsManagerNotSet
source: The security standards manager was not specified on '{0}'.
cs: Správce norem zabezpečení nebyl určen v {0}.
de: Der Sicherheitsstandard-Manager wurde auf "{0}" nicht angegeben.
es: No se especificó el administrador de niveles de seguridad en '{0}'.
fr: Le gestionnaire des standards de sécurité n'a pas été spécifié sur '{0}'.
it: Gestore degli standard di sicurezza non specificato in '{0}'.
ja: セキュリティ標準マネージャーが '{0}' で指定されませんでした。
ko: 보안 표준 관리자가 '{0}'에서 지정되지 않았습니다.
pl: W elemencie „{0}” nie określono menedżera standardów zabezpieczeń.
pt_br: O gerenciador de padrões de segurança não foi especificado em '{0}'.
tr: Güvenlik standartları yöneticisi, '{0}' üstünde belirtilmedi.
zh_hans: “{0}”上未指定安全标准管理器。
zh_hant: '{0}' 上未指定安全性標準管理員。

# SecurityTokenManagerCannotCreateAuthenticatorForRequirement
source: The security token manager cannot create a token authenticator for requirement '{0}'.
cs: Správce tokenu zabezpečení nemůže vytvořit ověřovací data tokenu pro požadavek {0}.
de: Der Sicherheitstoken-Manager kann keinen Tokenauthentifizierer für die Anforderung "{0}" erstellen.
es: El administrador de tokens de seguridad no puede crear un autenticador de tokens para el requisito "{0}".
fr: Le gestionnaire de jetons de sécurité ne peut pas créer d'authentificateur de jeton pour l'exigence '{0}'.
it: Il gestore del token di sicurezza non può creare un autenticatore di token per il requisito '{0}'.
ja: セキュリティ トークン マネージャーは、要件 '{0}' に対するトークン認証システムを作成できません。
ko: 보안 토큰 관리자가 요구 사항 '{0}'에 대한 토큰 인증자를 만들 수 없습니다.
pl: Menedżer tokenów zabezpieczeń nie może utworzyć wystawcy uwierzytelnienia tokenu dla wymagania „{0}”.
pt_br: O gerenciador de token de segurança não pode criar um autenticador de token para o requisito '{0}'.
tr: Güvenlik belirteci yöneticisi '{0}' gereksinimi için bir belirteç kimlik doğrulayıcısı oluşturamıyor.
zh_hans: 安全令牌管理器无法为要求“{0}”创建令牌身份验证器。
zh_hant: 安全性權杖管理員無法為需求 '{0}' 建立權杖驗證器。

# SecurityTokenManagerCannotCreateProviderForRequirement
source: The security token manager cannot create a token provider for requirement '{0}'.
cs: Správce tokenů zabezpečení nemůže vytvořit poskytovatele tokenů pro požadavek {0}.
de: Der Sicherheitstoken-Manager kann keinen Tokenanbieter für die Anforderung "{0}" erstellen.
es: El administrador de tokens de seguridad no puede crear un proveedor de tokens para el requisito "{0}".
fr: Le gestionnaire de jetons de sécurité ne peut pas créer de fournisseur de jeton pour l'exigence '{0}'.
it: Il gestore del token di sicurezza non può creare un provider di token per il requisito '{0}'.
ja: セキュリティ トークン マネージャーは、要件 '{0}' に対するトークン プロバイダーを作成できません。
ko: 보안 토큰 관리자가 요구 사항 '{0}'에 대한 토큰 공급자를 만들 수 없습니다.
pl: Menedżer tokenów zabezpieczeń nie może utworzyć dostawcy tokenu dla wymagania „{0}”.
pt_br: O gerenciador de token de segurança não pode criar um provedor de token para o requisito '{0}'.
tr: Güvenlik belirteci yöneticisi, '{0}' gereksinimi için bir belirteç sağlayıcısı oluşturamıyor.
zh_hans: 安全令牌管理器无法为要求“{0}”创建令牌提供程序。
zh_hant: 安全性權杖管理員無法為需求 '{0}' 建立權杖提供者。

# SecurityTokenManagerCannotCreateSerializerForVersion
source: The security token manager cannot create a token serializer for security token version '{0}'.
cs: Správce tokenů zabezpečení nemůže vytvořit serializátor pro verzi tokenu zabezpečení {0}.
de: Der Sicherheitstoken-Manager kann keinen Tokenserialisierer für die Sicherheitstokenversion "{0}" erstellen.
es: El administrador de tokens de seguridad no puede crear un serializador de tokens para la versión de token de seguridad '{0}'.
fr: Le gestionnaire de jetons de sécurité ne peut pas créer de sérialiseur de jeton pour la version de jeton de sécurité '{0}'.
it: Il gestore del token di sicurezza non è in grado di creare un serializzatore di token per la versione del token di sicurezza '{0}'.
ja: セキュリティ トークン マネージャーは、セキュリティ トークン バージョン '{0}' に対するトークン シリアライザーを作成できません。
ko: 보안 토큰 관리자가 보안 토큰 버전 '{0}'에 대한 토큰 직렬화기를 만들 수 없습니다.
pl: Menedżer tokenów zabezpieczających nie może utworzyć serializatora tokenu dla wersji „{0}” tokenu zabezpieczającego.
pt_br: O gerenciador de token de segurança não pode criar um serializador de token para a versão de token de segurança '{0}'.
tr: Güvenlik belirteci yöneticisi, '{0}' güvenlik belirteci sürümü için bir belirteç seri hale getiricisi oluşturamıyor.
zh_hans: 安全令牌管理器无法创建安全令牌版本“{0}”的令牌序列化程序。
zh_hant: 安全性權杖管理員無法為安全性權杖版本 '{0}' 建立權杖序列化程式。

# SecurityTokenParametersCloneInvalidResult
source: The CloneCore method of {0} type returned an invalid result.
cs: Metoda CloneCore typu {0} vrátila neplatný výsledek.
de: Die CloneCore-Methode vom {0}-Typ hat ein ungültiges Ergebnis zurückgegeben.
es: El método CloneCore de tipo {0} devolvió un resultado no válido.
fr: La méthode CloneCore de type {0} a retourné un résultat non valide.
it: Il metodo CloneCore del tipo {0} ha restituito un risultato non valido.
ja: {0} 型の CloneCore メソッドが無効な結果を返しました。
ko: {0} 형식의 CloneCore 메서드가 잘못된 결과를 반환했습니다.
pl: Metoda CloneCore typu {0} zwróciła nieprawidłowy wynik.
pt_br: O método CloneCore do tipo {0} retornou um resultado inválido.
tr: {0} türündeki CloneCore metodu geçersiz bir sonuç döndürdü.
zh_hans: {0} 类型的 CloneCore 方法返回了无效的结果。
zh_hant: {0} 類型的 CloneCore 方法傳回無效的結果。
