Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# NoKeyInfoClausesToWrite
source: The SecurityKeyIdentifier has no key identifier clauses to write.
cs: SecurityKeyIdentifier nemá žádné klazule identifikátoru klíče k zápisu.
de: Der SecurityKeyIdentifier weist keine Schlüsselbezeichnerklauseln zum Schreiben auf.
es: El elemento SecurityKeyIdentifier no tiene cláusulas de identificador de clave para escribir.
fr: SecurityKeyIdentifier n'a aucune clause d'identificateur de clé à écrire.
it: L'elemento SecurityKeyIdentifier non contiene clausole di identificatore chiave da scrivere.
ja: SecurityKeyIdentifier には、書き込むことができるキー識別子句がありません。
ko: 쓰려는 키 식별자 절이 SecurityKeyIdentifier에 없습니다.
pl: Element SecurityKeyIdentifier nie ma klauzul identyfikatora klucza do zapisania.
pt_br: O SecurityKeyIdentifier não tem cláusulas do identificador da chave a serem gravadas.
tr: SecurityKeyIdentifier öğesinin yazılacak anahtar tanımlayıcı ifadesi yok.
zh_hans: SecurityKeyIdentifier 不具有任何要写入的密钥标识符子句。
zh_hant: SecurityKeyIdentifier 沒有可寫入的金鑰識別碼子句。

# NoLicenseXml
source: RequestedSecurityToken not specified in RequestSecurityTokenResponse.
cs: Ve třídě RequestSecurityTokenResponse nebyla určena třída RequestedSecurityToken.
de: RequestedSecurityToken ist nicht in RequestSecurityTokenResponse angegeben.
es: No se especificó RequestedSecurityToken en RequestSecurityTokenResponse.
fr: RequestedSecurityToken n'est pas spécifié dans RequestSecurityTokenResponse.
it: RequestedSecurityToken non specificato in RequestSecurityTokenResponse.
ja: RequestSecurityTokenResponse に RequestedSecurityToken が指定されていません。
ko: RequestedSecurityToken이 RequestSecurityTokenResponse에 지정되지 않았습니다.
pl: Nie określono tokenu RequestedSecurityToken w elemencie RequestSecurityTokenResponse.
pt_br: Objeto RequestedSecurityToken não especificado em RequestSecurityTokenResponse.
tr: RequestSecurityTokenResponse içinde RequestedSecurityToken belirtilmedi.
zh_hans: RequestSecurityTokenResponse 中未指定 RequestedSecurityToken。
zh_hant: RequestSecurityTokenResponse 中未指定 RequestedSecurityToken。

# NoMatchingTranslationFoundForFaultText
source: The fault reason does not contain any text translations.
cs: Důvod chyby neobsahuje překlady textů.
de: Die Fehlerursache enthält keine Textübersetzung.
es: La razón del error no contiene ninguna traducción de texto.
fr: La raison de l'erreur ne contient aucune traduction de texte.
it: Il motivo dell'errore non contiene traduzioni del testo.
ja: フォールトの理由には、テキスト変換が含まれていません。
ko: 오류 원인에 텍스트 변환이 포함되어 있지 않습니다.
pl: Przyczyna błędu nie zawiera żadnych tłumaczeń tekstu.
pt_br: O motivo da falha não contém traduções de texto.
tr: Hata nedeninde herhangi bir metin çevirisi yok.
zh_hans: 错误原因不包含任何文本转换。
zh_hant: 錯誤原因未包含任何文字翻譯。

# NoNegotiationMessageToSend
source: There is no negotiation message to send.
cs: K odeslání neexistuje žádná zpráva vyjednávání.
de: Es ist keine zu sendende Aushandlungsnachricht vorhanden.
es: No hay ningún mensaje de negociación que enviar.
fr: Il n'existe pas de message de négociation à envoyer.
it: Nessun messaggio di negoziazione da inviare.
ja: 送信するネゴシエーション メッセージがありません。
ko: 보낼 협상 메시지가 없습니다.
pl: Brak komunikatu negocjacji do wysłania.
pt_br: Não há mensagem de negociação para envio.
tr: Gönderilecek anlaşma iletisi yok.
zh_hans: 不存在要发送的协商消息。
zh_hant: 沒有交涉訊息可傳送。

# NoNullTranslations
source: The translation set cannot contain nulls.
cs: Sada překladů nesmí obsahovat hodnoty Null.
de: Die festgelegte Übersetzung darf keine NULL-Werte enthalten.
es: El conjunto de traslaciones no puede contener valores nulos.
fr: L'ensemble de traductions ne peut pas contenir de valeurs null.
it: I set di traduzione non possono contenere valori Null.
ja: 変換セットには null を含めることはできません。
ko: 변환 집합은 null을 포함할 수 없습니다.
pl: Zbiór tłumaczeń nie może zawierać wartości null.
pt_br: O conjunto de traduções não pode conter itens nulos.
tr: Çeviri kümesinde null bulunamaz.
zh_hans: 转换集不能包含 null。
zh_hant: 翻譯集不可包含 null。

# NoPartsOfMessageMatchedPartsToSign
source: No signature was created because not part of the message matched the supplied message part specification.
cs: Nebyl vytvořen žádný podpis, protože žádná část zprávy neodpovídala zadané specifikaci části zprávy.
de: Es wurde keine Signatur erstellt, da kein Teil der Nachricht mit der angegebenen Nachrichtenteilspezifikation übereinstimmte.
es: No se creó ninguna signatura, puesto que ninguna parte del mensaje coincidió con la especificación de partes de mensaje suministrada.
fr: Aucune signature n'a été créée car aucune partie du message ne correspondait à la spécification fournie pour les parties du message.
it: Nessuna firma creata perché nessuna parte del messaggio corrispondeva alla specifica della parte del messaggio fornita.
ja: メッセージ部の中に、指定されたメッセージ部仕様に合うものがなかったため、署名は作成されませんでした。
ko: 제공된 메시지 부분 지정과 일치하는 메시지 부분이 없기 때문에 서명이 만들어지지 않았습니다.
pl: Nie utworzono żadnego podpisu, ponieważ żadna część wiadomości nie była zgodna z dostarczoną specyfikacją części wiadomości.
pt_br: Nenhuma assinatura foi criada porque nenhuma parte da mensagem correspondeu à especificação de partes de mensagem fornecida.
tr: İletinin parçası sağlanan ileti parçası özelikleriyle eşleşmediğinden hiçbir imza oluşturulmadı.
zh_hans: 没有创建签名，因为不存在符合提供的消息部分规范的消息部分。
zh_hant: 未建立簽章，因為訊息中沒有任何部分符合所提供的訊息部分規格。

# NoRequestSecurityTokenResponseElements
source: No RequestSecurityTokenResponse elements were found.
cs: Nebyly nalezeny žádné elementy RequestSecurityTokenResponse.
de: Es wurden keine RequestSecurityTokenResponse-Elemente gefunden.
es: No se encontró ningún elemento RequestSecurityTokenResponse.
fr: Aucun élément RequestSecurityTokenResponse n'a été trouvé.
it: Non sono stati trovati elementi RequestSecurityTokenResponse.
ja: RequestSecurityTokenResponse 要素が見つかりませんでした。
ko: RequestSecurityTokenResponse 요소를 찾을 수 없습니다.
pl: Nie znaleziono elementów RequestSecurityTokenResponse.
pt_br: Nenhum elemento RequestSecurityTokenResponse encontrado.
tr: Herhangi bir RequestSecurityTokenResponse öğesi bulunmadı.
zh_hans: 找不到 RequestSecurityTokenResponse 元素。
zh_hant: 找不到任何 RequestSecurityTokenResponse 元素。

# NoSecurityContextIdentifier
source: The SecurityContextSecurityToken does not have a context-id.
cs: Třída SecurityContextSecurityToken nemá identifikaci context-id.
de: Das SecurityContextSecurityToken weist keine Kontext-ID auf.
es: El elemento SecurityContextSecurityToken no tiene un id. de contexto.
fr: SecurityContextSecurityToken n'a pas d'ID de contexte.
it: L'elemento SecurityContextSecurityToken non contiene un elemento context-id.
ja: SecurityContextSecurityToken に context-id がありません。
ko: SecurityContextSecurityToken에 context-id가 없습니다.
pl: Element SecurityContextSecurityToken nie zawiera identyfikatora kontekstu.
pt_br: SecurityContextSecurityToken não tem uma ID de contexto.
tr: SecurityContextSecurityToken bir bağlam kimliğine sahip değil.
zh_hans: SecurityContextSecurityToken 没有上下文 ID。
zh_hant: SecurityContextSecurityToken 沒有 context-id。

# NoUserNameTokenProvided
source: The required UserNameSecurityToken was not provided.
cs: Požadovaná třída UserNameSecurityToken nebyla zadána.
de: Das erforderliche UserNameSecurityToken war nicht angegeben.
es: No se proporcionó el valor de UserNameSecurityToken requerido.
fr: Le UserNameSecurityToken nécessaire n'a pas été fourni.
it: L'elemento UserNameSecurityToken obbligatorio non è stato fornito.
ja: 必要な UserNameSecurityToken が指定されていません。
ko: 필수 UserNameSecurityToken이 제공되지 않았습니다.
pl: Nie dostarczono wymaganego elementu UserNameSecurityToken.
pt_br: A classe necessária UserNameSecurityToken não foi fornecida.
tr: Gereken UserNameSecurityToken sağlanmadı.
zh_hans: 未提供所需的 UserNameSecurityToken。
zh_hant: 未提供必要的 UserNameSecurityToken。

# NonEmptyWsrmMessageIsEmpty
source: A message with action {0} is an empty message. This message cannot be processed because the body of this WS-ReliableMessaging protocol message must carry information pertaining to a reliable session.
cs: Zprávou s akcí {0} je prázdná zpráva. Tuto zprávu nelze zpracovat, protože text zprávy protokolu WS-ReliableMessaging musí obsahovat informace, které náleží stabilní relaci.
de: Eine Nachricht mit Aktion {0} ist eine leere Nachricht. Diese Nachricht kann nicht verarbeitet werden, da der Text dieser WS-ReliableMessaging-Protokollnachricht Informationen enthalten muss, die sich auf eine zuverlässige Sitzung beziehen.
es: Los mensajes con la acción {0} son mensajes vacíos. No se puede procesar este mensaje porque el cuerpo del mensaje del protocolo WS-ReliableMessaging debe llevar información relacionada con una sesión confiable.
fr: Un message avec l'action {0} est un message vide. Ce message ne peut pas être traité car le corps de ce message de protocole WS-ReliableMessaging doit contenir des informations relatives à une session fiable.
it: Un messaggio con azione {0} è vuoto. Impossibile elaborare il messaggio perché il corpo di questo messaggio del protocollo WS-ReliableMessaging deve contenere informazioni relative a una sessione affidabile.
ja: アクション {0} を含むメッセージは空のメッセージです。この WS-ReliableMessaging プロトコル メッセージの本文には信頼できるセッションに関する情報が含まれている必要があるため、このメッセージを処理できません。
ko: {0} 동작을 가진 메시지가 빈 메시지입니다. 이 WS-ReliableMessaging 프로토콜 메시지의 본문에 신뢰할 수 있는 세션과 관련된 정보가 있어야 하므로 이 메시지를 처리할 수 없습니다.
pl: Komunikat z akcją {0} jest pusty. Nie można przetworzyć tego komunikatu protokołu WS-ReliableMessaging, ponieważ w jego treści musi być przekazana informacja związana z określoną sesją.
pt_br: Uma mensagem com ação {0} está em uma mensagem vazia. Essa mensagem não pode ser processada porque o corpo da mensagem de protocolo WS-ReliableMessaging deve conter informações referentes a uma sessão confiável.
tr: {0} eylemine sahip bir ileti boş iletidir. Bu WS-ReliableMessaging protokolü ileti gövdesinde güvenilir bir oturuma ait bilgiler bulunması gerektiğinden bu ileti işlenemez.
zh_hans: 具有操作 {0} 的消息是空消息。无法处理此消息，因为此 WS-ReliableMessaging 协议消息的正文必须包含与可靠会话相关的信息。
zh_hant: 具有動作 {0} 的訊息為空訊息。無法處理此訊息，因為此 WS-ReliableMessaging 通訊協定訊息的本文必須具有與可靠工作階段相關的資訊。

# NonWsrmFeb2005ActionNotSupported
source: The action {0} is not supported by this endpoint. Only WS-ReliableMessaging February 2005 messages are processed by this endpoint.
cs: Akce {0} není podporována tímto koncovým bodem. Tímto koncovým bodem jsou zpracovávány pouze zprávy WS-ReliableMessaging February 2005.
de: Die Aktion {0} wird von diesem Endpunkt nicht unterstützt. Durch diesen Endpunkt werden nur Nachrichten verarbeitet, die der Spezifikation für WS-ReliableMessaging vom Februar 2005 entsprechen.
es: Este extremo no admite la acción {0} y sólo procesa mensajes WS-ReliableMessaging de febrero de 2005.
fr: L'action {0} n'est pas prise en charge par ce point de terminaison. Seuls les messages WS-ReliableMessaging de février 2005 sont traités par ce point de terminaison.
it: L'azione {0} non è supportata dall'endpoint. Solo i messaggi WS-ReliableMessaging di febbraio 2005 vengono elaborati dall'endpoint.
ja: このエンドポイントでは、アクション {0} はサポートされていません。このエンドポイントでは WS-ReliableMessaging February 2005 メッセージのみが処理されます。
ko: 이 끝점에서는 {0} 동작이 지원되지 않습니다. 이 끝점은 WS-ReliableMessaging 2005년 2월 메시지만 처리합니다.
pl: Ten punkt końcowy nie obsługuje akcji {0}. Punkt końcowy przetwarza tylko komunikaty WS-ReliableMessaging February 2005.
pt_br: Esse ponto de extremidade não oferece suporte à ação {0}. Somente mensagens WS-ReliableMessaging de fevereiro de 2005 são processadas por esse ponto de extremidade.
tr: {0} eylemi bu bitiş noktası tarafından desteklenmiyor. Yalnızca WS-ReliableMessaging Şubat 2005 iletileri bu bitiş noktası tarafından işleniyor.
zh_hans: 此终结点不支持操作 {0}。此终结点仅处理 WS-ReliableMessaging 2005 年 2 月的消息。
zh_hant: 此端點不支援動作 {0}。此端點只能處理 WS-ReliableMessaging February 2005 訊息。

# NonceLengthTooShort
source: The specified nonce is too short. The minimum required nonce length is 4 bytes.
cs: Určená hodnota Nonce je příliš krátká. Minimální požadovaná délka hodnoty Nonce je 4 bajty.
de: Die angegebene Nonce ist zu kurz. Die erforderliche minimale Noncelänge beträgt 4 Byte.
es: El valor de seguridad (nonce) especificado es demasiado corto. La longitud mínima requerida es 4 bytes.
fr: La valeur à usage unique spécifiée est trop courte. La longueur minimale nécessaire pour le nonce est de 4 octets.
it: Il parametro nonce specificato è troppo breve. La lunghezza minima richiesta per il parametro nonce è pari a 4 byte.
ja: 指定された nonce が短すぎます。nonce の長さは少なくとも 4 バイト必要です。
ko: 지정한 nonce가 너무 짧습니다. 필요한 최소 nonce 길이는 4바이트입니다.
pl: Określony identyfikator jednorazowy jest zbyt krótki. Identyfikator jednorazowy musi mieć długość co najmniej 4 bajtów.
pt_br: O nonce especificado é muito curto. O comprimento mínimo necessário para nonce é de 4 bytes.
tr: Belirtilen nonce çok kısa. Gereken en küçük nonce değeri 4 bayttır.
zh_hans: 指定的 Nonce 太短。要求的最小 Nonce 长度是 4 个字节。
zh_hant: 指定的 Nonce 太短。Nonce 所需的最小長度為 4 個位元組。

# NoncesCachedInfinitely
source: The ReplayWindow and ClockSkew cannot be the maximum possible value when replay detection is enabled.
cs: Třída ReplayWindow a ClockSkew nesmí být maximální možnou hodnotou, pokud je povoleno zjišťování opakovaného přehrání.
de: ReplayWindow und ClockSkew können nicht die möglichen Maximalwerte sein, wenn die Replay-Erkennung aktiviert ist.
es: Los elementos ReplayWindow y ClockSkew no pueden ser el valor máximo posible cuando está habilitada la detección de reproducción.
fr: ReplayWindow et ClockSkew ne peuvent pas avoir la valeur maximale possible quand la détection de réexécution est activée.
it: Quando è abilitato il rilevamento riproduzione, il valore di ReplayWindow e ClockSkew non può essere quello massimo possibile.
ja: 再生検出が有効な場合、ReplayWindow および ClockSkew の値を最大値にすることはできません。
ko: 재생 검색이 사용하도록 설정된 경우 ReplayWindow 및 ClockSkew는 가능한 최대값이 될 수 없습니다.
pl: Przy włączonym wykrywaniu powtarzania elementy ReplayWindow oraz ClockSkew nie mogą mieć maksymalnej dopuszczalnej wartości.
pt_br: ReplayWindow e ClockSkew não podem ser o valor máximo possível quando a detecção de reprodução está habilitada.
tr: Yeniden yürütme algılaması etkinleştirildiğinde ReplayWindow ve ClockSkew olası en yüksek değerleri alamaz.
zh_hans: 启用重放检测时，ReplayWindow 和 ClockSkew 不能是最大可能值。
zh_hant: 啟用偵測重送攻擊時，ReplayWindow 與 ClockSkew 不可為最大可能值。

# NotAllBindingElementsBuilt
source: Some of the binding elements in this binding were not used when building the ChannelFactory / ChannelListener. This may be have been caused by the binding elements being misordered. The recommended order for binding elements is: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Note that the TransportBindingElement must be last. The following binding elements were not built: {0}.
cs: Některé elementy vazby v této vazbě nebyly při vytváření třídy ChannelFactory nebo ChannelListener použity. To bylo pravděpodobně způsobeno nesprávným seřazením elementů vazby. Doporučené pořadí elementů vazby je toto: TransactionFlow, ReliableSession, Security (Zabezpečení), CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport (Přenos). Nezapomeňte, že třída TransportBindingElement musí být poslední. Následující elementy vazby nebyly vytvořeny: {0}.
de: Einige Bindungselemente in dieser Bindung wurden beim Erstellen der ChannelFactory/des ChannelListener nicht verwendet. Dies ist möglicherweise auf eine falsche Reihenfolge der Bindungselemente zurückzuführen. Die empfohlene Reihenfolge ist: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Beachten Sie, dass das TransportBindingElement zuletzt aufgeführt werden muss. Folgende Bindungselemente wurden nicht erstellt: {0}.
es: Algunos de los elementos de este enlace no se usaron al compilar ChannelFactory / ChannelListener. La causa puede ser la falta de ordenación de los elementos del enlace. El orden recomendado para los elementos del enlace es: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Tenga en cuenta que TransportBindingElement debe ser el último. Los siguientes elementos del enlace no se crearon: {0}.
fr: Certains éléments de liaison de cette liaison n'ont pas été utilisés durant la génération des éléments ChannelFactory / ChannelListener. Il est possible que l'ordre des éléments soit incorrect. L'ordre recommandé pour les éléments de liaison est le suivant : TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Notez que l'élément TransportBindingElement doit apparaître en dernier. Les éléments de liaison suivants n'ont pas été générés : {0}.
it: Alcuni degli elementi di binding in questo binding non sono stati usati durante la compilazione di ChannelFactory/ChannelListener. È possibile che gli elementi di binding non fossero ordinati correttamente. L'ordine consigliato per gli elementi di binding è: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Si noti che TransportBindingElement deve essere l'ultimo elemento. Gli elementi di binding seguenti non sono stati creati: {0}.
ja: このバインド内の一部のバインド要素は、ChannelFactory/ChannelListener の構築時に使用されませんでした。この原因としては、バインド要素の順序が間違っていることが考えられます。バインド要素の推奨順序は、TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport です。TransportBindingElement は最後である必要があります。次のバインド要素は構築されませんでした: {0}。
ko: ChannelFactory / ChannelListener를 작성할 때 이 바인딩의 바인딩 요소 중 일부가 사용되지 않았습니다. 이것은 순서가 잘못된 바인딩 요소로 인해 발생할 수 있습니다. 바인딩 요소에 권장되는 순서는 TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport입니다. TransportBindingElement가 마지막이어야 한다는 것에 주의하세요. 다음 바인딩 요소가 작성되지 않았습니다. {0}.
pl: Niektóre elementy tego powiązania nie zostały użyte podczas budowania elementów ChannelFactory/ChannelListener. Przyczyną tej sytuacji może być umieszczenie elementów powiązania w nieprawidłowej kolejności. Zalecana kolejność elementów powiązania to: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Należy pamiętać, że element TransportBindingElement musi być ostatni. Nie zostały zbudowane następujące elementy powiązania: {0}.
pt_br: Alguns dos elementos de associação nesta associação não foram usados durante a construção de ChannelFactory/ChannelListener. Isso pode ter sido causado pela ordenação incorreta desses elementos de associação. A ordem recomendada para elementos de associação é: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Observe que TransportBindingElement deve vir por último. Os seguintes elementos de associação não foram compilados: {0}.
tr: Bu bağlamadaki bazı bağlama öğeleri ChannelFactory / ChannelListener oluşturulurken kullanılmadı. Bunun nedeni bağlama öğelerinin hatalı sıralanmış olması olabilir. Bağlama öğeleri için önerilen sıra: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. TransportBindingElement öğesinin en sonda olması gerektiğine dikkat edin. Aşağıdaki bağlama öğeleri oluşturulmadı: {0}.
zh_hans: 绑定 ChannelFactory/ChannelListener 时，没有使用此绑定中的某些绑定元素。这可能是因为绑定元素顺序混乱所导致的。建议的绑定元素顺序是: TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport。请注意，TransportBindingElement 必须位于最后。没有生成以下绑定元素: {0}。
zh_hant: 建置 ChannelFactory / ChannelListener 時，未使用此繫結中的部分繫結元素。這可能是因為繫結元素的順序有誤所造成。繫結元素的建議順序為: TransactionFlow、ReliableSession、Security、CompositeDuplex、OneWay、StreamSecurity、MessageEncoding、Transport。請注意，TransportBindingElement 必須是最後一項。未建立下列繫結元素: {0}。

# ObjectDisposed
source: The {0} object has been disposed.
cs: Objekt {0} byl uvolněn.
de: Das {0}-Objekt wurde gelöscht.
es: El objeto {0} se ha desechado.
fr: L'objet {0} a été éliminé.
it: L'oggetto {0} è stato eliminato.
ja: {0} オブジェクトは破棄されています。
ko: {0} 개체가 삭제되었습니다.
pl: Obiekt {0} został usunięty.
pt_br: O objeto {0} foi descartado.
tr: {0} nesnesi atıldı.
zh_hans: {0} 对象已被释放。
zh_hant: 已處置 {0} 物件。

source: Object is read-only.
cs: Objekt je jen pro čtení.
de: Das Objekt ist schreibgeschützt.
es: El objeto es de solo lectura.
fr: L'objet est en lecture seule.
it: L'oggetto è di sola lettura.
ja: オブジェクトが読み取り専用です。
ko: 개체가 읽기 전용입니다.
pl: Obiekt jest tylko do odczytu.
pt_br: O objeto é somente leitura.
tr: Nesne salt okunur.
zh_hans: 对象是只读的。
zh_hant: 唯讀的物件。

# OffsetExceedsBufferSize
source: The specified offset exceeds the buffer size ({0} bytes).
cs: Zadaný posun překračuje velikost vyrovnávací paměti (počet bajtů: {0}).
de: Der angegebene Offset überschreitet die Puffergröße ({0} Bytes).
es: El desplazamiento especificado supera el tamaño del búfer ({0} bytes).
fr: Le décalage spécifié est supérieur à la taille de la mémoire tampon ({0} octets).
it: L'offset specificato supera le dimensioni del buffer ({0} byte).
ja: 指定したオフセットは、バッファー サイズ ({0} バイト) を超えています。
ko: 지정된 오프셋이 버퍼 크기({0}바이트)를 초과합니다.
pl: Określone przesunięcie przekracza rozmiar buforu ({0} B).
pt_br: O deslocamento especificado excede o tamanho do buffer ({0} bytes).
tr: Belirtilen uzaklık arabellek boyutunu ({0} bayt) aşıyor.
zh_hans: 指定的偏移量超出了缓冲区大小({0} 个字节)。
zh_hant: 指定的位移超過緩衝區大小 ({0} 個位元組)。
