Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxChannelTerminated0
source: An operation marked as IsTerminating has already been invoked on this channel, causing the channel's connection to terminate. No more operations may be invoked on this channel. Please re-create the channel to continue communication.
cs: Operace označená jako IsTerminating již byla v tomto kanálu spuštěna a způsobila ukončení připojení kanálu. Další operace na tomto kanálu nemohou být spuštěny. Aby mohl kanál pokračovat v komunikaci, je nutné jej přepracovat.
de: Ein als "IsTerminating" gekennzeichneter Vorgang wurde bereits für diesen Kanal aufgerufen. Dies führt dazu, dass die Kanalverbindung beendet wird. Über diesen Kanal können keinen weiteren Vorgänge aufgerufen werden. Erstellen Sie den Kanal erneut, um die Kommunikation fortzusetzen.
es: Ya se llamó a una operación marcada como IsTerminating en este canal, por lo que se terminó la conexión del canal. No se pueden invocar más operaciones en este canal. Vuelva a crear el canal para continuar la comunicación.
fr: Une opération marquée comme IsTerminating a déjà été appelée sur ce canal, provoquant l'interruption de la connexion du canal. Aucune opération supplémentaire ne peut être appelée sur ce canal. Créez à nouveau le canal pour poursuivre la communication.
it: È già stata richiamata nel canale un'operazione contrassegnata come IsTerminating, causando l'interruzione della connessione del canale. Impossibile richiamare altre operazioni nel canale. Ricreare il canale per continuare la comunicazione.
ja: IsTerminating が設定された操作はこのチャネルで既に呼び出されており、その結果このチャネルの接続は終了しました。このチャネルでは追加の操作を呼び出すことはできません。通信を構造するには、このチャネルを再作成してください。
ko: IsTerminating으로 표시된 작업이 이미 이 채널에서 호출되어, 채널의 연결이 끊어졌습니다. 이 채널에서 추가로 작업을 호출할 수 없습니다. 계속 통신하려면 채널을 다시 만드십시오.
pl: W tym kanale wywołano już operację oznaczoną jako IsTerminating, co spowodowało zamknięcie połączenia dla tego kanału. W tym kanale nie można już wywołać kolejnych operacji. Aby kontynuować komunikację, utwórz kanał ponownie.
pt_br: Uma operação marcada como IsTerminating já foi invocada neste canal, causando o término da conexão do canal. Nenhuma outra operação pode ser invocada neste canal. Recrie o canal para continuar a comunicação.
tr: IsTerminating olarak işaretlenen bir işlem bu kanalda zaten başlatılarak, kanal bağlantısının sonlandırılmasına neden oldu. Bu kanalda başka işlem başlatılamaz. İletişime devam edebilmek için kanalı yeniden oluşturun.
zh_hans: 已经在此通道上调用了标记为 IsTerminating 的操作，导致要终止通道的连接。可能不会在此通道上调用更多操作。请重新创建通道以继续通信。
zh_hant: 標示為 IsTerminating 的作業，已在此通道上啟動，使得通道的連線終止。此通道上無法再啟動任何作業。請重新建立通道，以繼續通訊。

# SFxClientOutputSessionAutoClosed
source: This channel can no longer be used to send messages as the output session was auto-closed due to a server-initiated shutdown. Either disable auto-close by setting the DispatchRuntime.AutomaticInputSessionShutdown to false, or consider modifying the shutdown protocol with the remote server.
cs: Tento kanál již nemůže být používán k odesílání zpráv, protože výstupní relace byla automaticky ukončena, protože došlo k vypnutí serverem. Zakažte automatické ukončení nastavením třídy DispatchRuntime.AutomaticInputSessionShutdown na hodnotu false nebo zvažte úpravu protokolu ukončování prostřednictvím vzdáleného serveru.
de: Dieser Kanal kann nicht mehr zum Senden von Nachrichten verwendet werden, da die Ausgabesitzung aufgrund eines vom Server initiierten Herunterfahrens automatisch geschlossen wurde. Deaktivieren Sie entweder das automatische Schließen, indem Sie DispatchRuntime.AutomaticInputSessionShutdown auf "false" setzen, oder ändern Sie ggf. das Protokoll zum Herunterfahren für den Remoteserver.
es: Este canal ya no se puede usar para enviar mensajes porque la sesión de salida se cerró automáticamente debido a un apagado iniciado por el servidor. Deshabilite el cierre automático estableciendo DispatchRuntime.AutomaticInputSessionShutdown en false o considere la posibilidad de modificar el protocolo de apagado en el servidor remoto.
fr: Ce canal n'est plus utilisable pour envoyer des messages, car la session de sortie s'est fermée automatiquement en raison d'un arrêt lancé par le serveur. Désactivez la fermeture automatique en affectant la valeur false à DispatchRuntime.AutomaticInputSessionShutdown, ou modifiez le protocole d'arrêt avec le serveur distant.
it: Non è più possibile usare questo canale per inviare messaggi perché la sessione di output è stata chiusa automaticamente a causa di un arresto avviato dal server. Disabilitare la chiusura automatica impostando DispatchRuntime.AutomaticInputSessionShutdown su false o modificare il protocollo di arresto con il server remoto.
ja: サーバーによって開始されたシャットダウンが原因で出力セッションが自動的に閉じられたため、このチャネルを使用してメッセージを送信できません。DispatchRuntime.AutomaticInputSessionShutdown を False に設定して自動クローズを無効にするか、リモート サーバーでシャットダウン プロトコルを変更してください。
ko: 서버가 시스템 종료를 실행하여 출력 세션이 자동으로 닫혔으므로 더 이상 이 채널을 사용하여 메시지를 보낼 수 없습니다. DispatchRuntime.AutomaticInputSessionShutdown을 "false"로 설정하여 자동 닫힘을 사용하지 않거나, 원격 서버에서 시스템 종료 프로토콜을 수정하세요.
pl: Nie można dłużej używać tego kanału do wysyłania komunikatów, ponieważ sesja wyjściowa została automatycznie zamknięta z powodu zamknięcia zainicjowanego przez serwer. Wyłącz możliwość automatycznego zamykania, ustawiając wartość atrybutu DispatchRuntime.AutomaticInputSessionShutdown na false, albo zmodyfikuj protokół zamykania po stronie zdalnego serwera.
pt_br: Este canal não pode mais ser usado para enviar mensagens porque a sessão de saída foi fechada automaticamente devido ao desligamento iniciado pelo servidor. Desabilite o desligamento automático configurando DispatchRuntime.AutomaticInputSessionShutdown como false ou considere modificar o protocolo de desligamento com o servidor remoto.
tr: Çıkış oturumu sunucu tarafından başlatılan bir kapatma nedeniyle otomatik olarak kapatıldığından, bu kanal artık ileti göndermek için kullanılamaz. DispatchRuntime.AutomaticInputSessionShutdown değerini false olarak ayarlayarak otomatik kapatmayı devre dışı bırakın ya da uzak sunucu kapatma protokolünü değiştirmeyi deneyin.
zh_hans: 此通道已无法再用于发送消息，因为输出会话由于启动的服务器关机而自动关闭。可通过将 DispatchRuntime.AutomaticInputSessionShutdown 设置为 false 禁用自动关闭，或考虑使用远程服务器修改关机协议。
zh_hant: 伺服器啟動關閉，導致輸出工作階段自動關閉，因此無法再使用此通道來傳送訊息。若要停用自動關閉，請將 DispatchRuntime.AutomaticInputSessionShutdown 設為 False，或考慮修改遠端伺服器的關閉通訊協定。

# SFxCloseTimedOut1
source: The ServiceHost close operation timed out after {0}. This could be because a client failed to close a sessionful channel within the required time. The time allotted to this operation may have been a portion of a longer timeout.
cs: Platnost operace ukončení třídy ServiceHost skončila po {0}. Může to být proto, že se klientovi nepodařilo uzavřít kanál s relacemi v požadovaném čase. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Schließen des ServiceHost ist nach {0} ein Timeout aufgetreten. Möglicherweise konnte ein Client einen sitzungsbasierten Kanal nicht innerhalb der erforderlichen Zeit schließen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La operación de cierre de ServiceHost agotó el tiempo de espera después de {0}. La razón puede ser que un cliente no pudo cerrar un canal con sesión en el tiempo requerido. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération de fermeture de ServiceHost a dépassé le délai imparti après {0}. Ceci peut être dû à un client qui n'a pas fermé un canal de session dans le délai imparti. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout dell'operazione di chiusura di ServiceHost dopo {0}. Un client potrebbe non essere riuscito a chiudere un canale con sessione entro il tempo richiesto. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: ServiceHost の閉じる操作が {0} 後にタイムアウトしました。クライアントがセッションフル チャネルを規定の時間内に閉じることができなかったことが原因である可能性があります。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: ServiceHost 닫기 작업이 {0} 이후에 시간 초과되었습니다. 클라이언트가 필요한 시간 내에 세션 채널을 닫지 못했기 때문입니다. 이 작업에 할당된 시간은 보다 긴 시간 제한의 일부입니다.
pl: Operacja zamykania dla elementu ServiceHost przekroczyła limit czasu po {0}. Mogło to być spowodowane niepowodzeniem podczas zamykania kanału sesji w wymaganym czasie po stronie klienta. Czas przeznaczony na tę operację może być częścią większego limitu czasu.
pt_br: A operação de fechamento do ServiceHost excedeu o tempo limite após {0}. Isso pode ter ocorrido devido a uma falha do cliente ao fechar um canal de sessão no tempo necessário. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} sonrasında ServiceHost kapatma işlemi zaman aşımına uğradı. Bu durum, bir istemcinin oturumdaki kanalı gereken sürede kapatamaması nedeniyle oluşmuş olabilir. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: ServiceHost 关闭操作在 {0} 以后超时。这可能是由于客户端无法在必需的时间内关闭会话的通道。分配给此操作的时间可能比超时长。
zh_hant: ServiceHost 關閉作業在 {0} 之後逾時。這可能是因為用戶端無法在要求的時間內關閉工作階段通道所造成。分配給此作業的時間，可能是較長逾時的一部分。

# SFxCollectionDoesNotSupportSet0
source: This collection does not support setting items by index.
cs: Tato kolekce nepodporuje nastavování položek podle indexů.
de: Diese Sammlung unterstützt das Festlegen von Elementen nach Index nicht.
es: Esta colección no es compatible con el establecimiento de elementos por índice.
fr: Cette collection ne prend pas en charge la définition d'éléments par index.
it: Questa raccolta non supporta l'impostazione di elementi per indice.
ja: このコレクションは、インデックスで項目を設定することをサポートしていません。
ko: 이 컬렉션은 인덱스를 사용한 항목 설정을 지원하지 않습니다.
pl: Ta kolekcja nie obsługuje ustawiania elementów według indeksu.
pt_br: Não há suporte para configuração de itens por índice nesta coleção.
tr: Bu koleksiyon öğeleri dizine göre ayarlamayı desteklemiyor.
zh_hans: 此集合不支持按索引设置项。
zh_hant: 此集合不支援依索引設定項目。

# SFxCollectionReadOnly
source: This operation is not supported because the collection is read-only.
cs: Tato operace není podporována, protože kolekce je jen pro čtení.
de: Dieser Vorgang wird nicht unterstützt, weil die Sammlung schreibgeschützt ist.
es: Esta operación no se admite porque la colección es de solo lectura.
fr: Cette opération n'est pas prise en charge, car la collection est en lecture seule.
it: Questa operazione non è supportata perché la raccolta è di sola lettura.
ja: コレクションが読み取り専用であるため、この操作はサポートされません。
ko: 컬렉션이 읽기 전용이므로 이 작업은 지원되지 않습니다.
pl: Ta operacja nie jest obsługiwana, ponieważ kolekcja jest tylko do odczytu.
pt_br: Não há suporte para esta operação porque a coleção é somente leitura.
tr: Koleksiyon salt okunur olduğundan bu işlem desteklenmiyor.
zh_hans: 不支持此操作，因为该集合是只读的。
zh_hant: 由於集合為唯讀，因此不支援此作業。

# SFxCollectionWrongType2
source: The collection of type {0} does not support values of type {1}.
cs: Kolekce typu {0} nepodporuje hodnoty typu {1}.
de: Die Sammlung vom Typ {0} unterstützt keine Werte vom Typ {1}.
es: La colección de tipo {0} no admite valores de tipo {1}.
fr: La collection de type {0} ne prend pas en charge les valeurs de type {1}.
it: La raccolta di tipo {0} non supporta i valori di tipo {1}.
ja: {0} 型のコレクションでは、{1} 型の値はサポートされません。
ko: {0} 형식의 컬렉션은 {1} 형식의 값을 지원하지 않습니다.
pl: Kolekcja typu {0} nie obsługuje wartości typu {1}.
pt_br: Não há suporte para valores do tipo {1} na coleção de tipos {0}.
tr: {0} koleksiyon türü {1} türündeki değerleri desteklemiyor.
zh_hans: 类型为 {0} 的集合不支持类型为 {1} 的值。
zh_hant: 類型 {0} 的集合不支援類型 {1} 的值。

# SFxConfigurationNameCannotBeEmpty
source: The ConfigurationName property must be a non-empty string.
cs: Vlastností ConfigurationName musí být neprázdný řetězec.
de: Die ConfigurationName-Eigenschaft darf keine leere Zeichenfolge sein.
es: La propiedad ConfigurationName debe ser una cadena no vacía.
fr: La propriété ConfigurationName doit être une chaîne non vide.
it: La proprietà ConfigurationName non deve essere una stringa vuota.
ja: ConfigurationName プロパティは、空ではない文字列である必要があります。
ko: ConfigurationName 속성은 비어 있지 않은 문자열이어야 합니다.
pl: Właściwość ConfigurationName musi być niepustym ciągiem.
pt_br: A propriedade ConfigurationName deve ser uma cadeia de caracteres não vazia.
tr: ConfigurationName özelliği, boş olmayan bir dize olmalıdır.
zh_hans: ConfigurationName 属性必须是非空字符串。
zh_hant: ConfigurationName 屬性必須是非空白字串。

# SFxContextModifiedInsideScope0
source: The value of OperationContext.Current is not the OperationContext value installed by this OperationContextScope.
cs: Hodnota třídy OperationContext.Current není hodnotou OperationContext instalovanou třídou OperationContextScope.
de: Der Wert von OperationContext.Current ist nicht der OperationContext-Wert, der von diesem OperationContextScope installiert wurde.
es: El valor de OperationContext.Current no es el valor de OperationContext instalado por este elemento OperationContextScope.
fr: La valeur de OperationContext.Current n'est pas celle du OperationContext installé par cet OperationContextScope.
it: Il valore di OperationContext.Current non è il valore di OperationContext installato da questo elemento OperationContextScope.
ja: OperationContext.Current の値が、この OperationContextScope によってインストールされた OperationContext 値ではありません。
ko: OperationContext.Current 값이 이 OperationContextScope에 의해 설치된 OperationContext 값이 아닙니다.
pl: Wartość właściwości OperationContext.Current nie jest wartością elementu OperationContext zainstalowaną przez ten element OperationContextScope.
pt_br: O valor de OperationContext.Current não é o valor de OperationContext instalado por este OperationContextScope.
tr: OperationContext.Current değeri, bu OperationContextScope tarafından yüklenen OperationContext değeri değil.
zh_hans: OperationContext.Current 值不是由此 OperationContextScope 安装的 OperationContext 值。
zh_hant: OperationContext.Current 的值不是此 OperationContextScope 所安裝的 OperationContext 值。

# SFxContractDescriptionNameCannotBeEmpty
source: ContractDescription's Name must be a non-empty string.
cs: Názvem třídy ContractDescription musí být neprázdný řetězec.
de: Der Name von ContractDescription muss eine nicht leere Zeichenfolge sein.
es: Name debe ser una cadena no vacía en ContractDescription.
fr: Le nom Name de ContractDescription doit être une chaîne non vide.
it: Il nome di ContractDescription deve essere una stringa non vuota.
ja: ContractDescription の名前は、空でない文字列にする必要があります。
ko: ContractDescription의 이름은 비어 있지 않은 문자열이어야 합니다.
pl: Nazwa elementu ContractDescription musi być niepustym ciągiem.
pt_br: O nome da ContractDescription deve ser uma cadeia de caracteres não vazia.
tr: ContractDescription Adı boş olmayan bir dize olmalıdır.
zh_hans: ContractDescription 的名称必须是非空字符串。
zh_hant: ContractDescription 的 Name 必須是非空白字串。

# SFxContractHasZeroInitiatingOperations
source: ContractDescription '{0}' has zero IsInitiating=true operations; a contract must have at least one IsInitiating=true operation.
cs: Třída ContractDescription {0} má nulový počet operací IsInitiating=true; kontrakt musí mít alespoň jednu operaci IsInitiating=true.
de: Die ContractDescription "{0}" enthält keine "IsInitiating=true"-Vorgänge. Ein Vertrag muss mindestens einen "IsInitiating=true"-Vorgang enthalten.
es: El elemento ContractDescription "{0}" tiene cero operaciones IsInitiating=true. Un contrato debe tener al menos una operación IsInitiating=true.
fr: ContractDescription '{0}' ne contient aucune opération IsInitiating=true ; un contrat doit contenir au moins une opération IsInitiating=true.
it: L'elemento '{0}' di ContractDescription contiene zero operazioni IsInitiating=true. Un contratto deve contenere almeno un'operazione IsInitiating=true.
ja: ContractDescription '{0}' には、IsInitiating=True 操作がありません。コントラクトには、少なくとも 1 つの IsInitiating=True 操作が必要です。
ko: ContractDescription '{0}'에 IsInitiating=true 작업이 없습니다. 계약에는 최소한 하나의 IsInitiating=true 작업이 있어야 합니다.
pl: Element ContractDescription „{0}” ma zero operacji IsInitiating=true; kontrakt musi zawierać co najmniej jedną operację IsInitiating=true.
pt_br: A ContractDescription '{0}' tem zero operações IsInitiating=true; um contrato deve ter ao menos uma operação IsInitiating=true.
tr: ContractDescription '{0}' içinde sıfır IsInitiating=true işlemi var; bir anlaşmanın en az bir IsInitiating=true işleme sahip olması gerekir.
zh_hans: ContractDescription“{0}”没有 IsInitiating=true 操作；协定必须至少有一个 IsInitiating=true 操作。
zh_hant: ContractDescription '{0}' 沒有 IsInitiating=true 作業; 合約至少必須要有一項 IsInitiating=true 作業。

# SFxContractHasZeroOperations
source: ContractDescription '{0}' has zero operations; a contract must have at least one operation.
cs: Třída ContractDescription {0} má nulový počet operací; kontrakt musí mít alespoň jednu operaci.
de: Die ContractDescription "{0}" enthält keine Vorgänge. Ein Vertrag muss mindestens einen Vorgang enthalten.
es: El elemento ContractDescription "{0}" tiene cero operaciones; un contrato debe tener al menos una operación.
fr: ContractDescription '{0}' ne contient aucune opération ; un contrat doit contenir au moins une opération.
it: L'elemento '{0}' di ContractDescription contiene zero operazioni. Un contratto deve contenere almeno un'operazione.
ja: ContractDescription '{0}' には、操作がありません。コントラクトには、少なくとも 1 つの操作が必要です。
ko: ContractDescription '{0}'에 작업이 없습니다. 계약에는 최소한 하나의 작업이 있어야 합니다.
pl: Element ContractDescription „{0}” ma zero operacji; kontrakt musi zawierać co najmniej jedną operację.
pt_br: A ContractDescription '{0}' não tem nenhuma operação; um contrato deve ter ao menos uma operação.
tr: ContractDescription '{0}' içinde sıfır işlem var; bir anlaşmada en az bir işlem olmalıdır.
zh_hans: ContractDescription“{0}”没有任何操作；协定必须至少有一个操作。
zh_hant: ContractDescription '{0}' 沒有作業; 合約至少必須具有一項作業。

# SFxContractInheritanceRequiresInterfaces
source: The service class of type {0} both defines a ServiceContract and inherits a ServiceContract from type {1}. Contract inheritance can only be used among interface types. If a class is marked with ServiceContractAttribute, it must be the only type in the hierarchy with ServiceContractAttribute. Consider moving the ServiceContractAttribute on type {1} to a separate interface that type {1} implements.
cs: Třída služby typu {0} definuje třídu ServiceContract a dědí třídu ServiceContract z typu {1}. Dědičnost kontraktů lze použít pouze mezi typy rozhraní. Pokud má třída označení ServiceContractAttribute, musí to být jediný typ v hierarchii s třídou ServiceContractAttribute. Zvažte přesunutí třídy ServiceContractAttribute na typu {1} do zvláštního rozhraní, které typ {1} implementuje.
de: Die Dienstklasse vom Typ {0} definiert einen ServiceContract und erbt einen ServiceContract vom Typ {1}. Die Vertragsvererbung kann nur unter Schnittstellentypen verwendet werden. Wenn eine Klasse mit ServiceContractAttribute markiert ist, muss sie der einzige Typ in der Hierarchie mit einem ServiceContractAttribute sein. Verschieben Sie das ServiceContractAttribute für den Typ {1} ggf. in eine separate Schnittstelle, die den Typ {1} implementiert.
es: La clase de servicio de tipo {0} define ServiceContract y hereda ServiceContract a partir del tipo {1}. La herencia de contratos solo se puede usar entre tipos de interfaz. Si una clase está marcada con el atributo ServiceContractAttribute, debe ser el único tipo en la jerarquía con ServiceContractAttribute. Considere la posibilidad de mover ServiceContractAttribute en el tipo {1} a una interfaz independiente implementada por el tipo {1}.
fr: La classe de service de type {0} définit un ServiceContract et hérite d'un ServiceContract du type {1}. L'héritage de contrat est utilisable uniquement parmi les types d'interface. Si une classe est marquée avec ServiceContractAttribute, elle doit être le seul type de la hiérarchie avec ServiceContractAttribute. Déplacez l'attribut ServiceContractAttribute sur le type {1} vers une interface distincte implémentée par le type {1}.
it: La classe del servizio di tipo {0} definisce ed eredita allo stesso tempo un elemento ServiceContract dal tipo {1}. L'ereditarietà del contratto può essere usata solo tra i tipi di interfaccia. Se una classe è contrassegnata con ServiceContractAttribute, deve essere l'unico tipo nella gerarchia con ServiceContractAttribute. Provare a spostare ServiceContractAttribute nel tipo {1} in un'interfaccia distinta implementata dal tipo {1}.
ja: 型 {0} のサービス クラスでは、ServiceContract が定義されていると共に、型 {1} の ServiceContract が継承されています。コントラクトの継承はインターフェイス型の中でのみ使用できます。クラスに ServiceContractAttribute が設定されている場合、そのクラスは、ServiceContractAttribute が設定された階層内の唯一の型である必要があります。型 {1} の ServiceContractAttribute を、型 {1} で実装されている別のインターフェイスに移動してください。
ko: {0} 형식의 서비스 클래스는 ServiceContract를 정의함과 동시에 {1} 형식에서 ServiceContract를 상속합니다. 인터페이스 형식 간에만 계약 상속을 사용할 수 있습니다. ServiceContractAttribute로 표시되어 있는 클래스는 ServiceContractAttribute가 있는 계층 구조의 유일한 형식이어야 합니다. {1} 형식의 ServiceContractAttribute를 {1} 형식이 구현하는 별도의 인터페이스로 이동해 보세요.
pl: Klasa usług typu {0} jednocześnie definiuje obiekt ServiceContract i dziedziczy go z typu {1}. Dziedziczenie kontraktów jest możliwe tylko między typami interfejsów. Jeśli klasa jest oznaczona przy użyciu atrybutu ServiceContractAttribute, musi być jedynym typem w hierarchii zawierającym ten atrybut. Spróbuj przenieść atrybut ServiceContractAttribute z typu {1} do osobnego interfejsu implementowanego przez typ {1}.
pt_br: A classe de serviço do tipo {0} define um ServiceContract e herda um ServiceContract do tipo {1}. A herança de contrato só pode ser usada entre tipos de interface. Se uma classe está marcada com ServiceContractAttribute, ela deve ser o único tipo na hierarquia com ServiceContractAttribute. Considere mover ServiceContractAttribute no tipo {1} para uma interface separada que o tipo {1} implementa.
tr: {0} türü hizmet sınıfı, hem bir ServiceContract tanımlar hem de {1} türünden bir ServiceContract alır. Anlaşma devralma yalnızca arabirim türleri arasında kullanılabilir. Bir sınıf ServiceContractAttribute ile işaretlenmişse, hiyerarşide ServiceContractAttribute özelliğine sahip tek tür olmalıdır. {1} türünde bulunan ServiceContractAttribute özelliğini, {1} türünün uyguladığı ayrı bir arabirime taşımayı düşünebilirsiniz.
zh_hans: 类型 {0} 的服务类定义 ServiceContract 并从类型 {1} 中继承 ServiceContract。协定继承只能在接口类型之间使用。如果使用 ServiceContractAttribute 标记某个类，则该类必须是层次结构中使用 ServiceContractAttribute 的唯一类型。请考虑将类型 {1} 上的 ServiceContractAttribute 移到类型 {1} 实现的单独接口。
zh_hant: 類型 {0} 的服務類別同時定義 ServiceContract 並繼承類型 {1} 的 ServiceContract。合約繼承只能用於介面類型。若類別標示有 ServiceContractAttribute，它必須是階層中唯一具有 ServiceContractAttribute 的類型。請考慮將類型 {1} 上的 ServiceContractAttribute，移至類型 {1} 實作的其他介面。
