Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# OneWayAndFaultsIncompatible2
source: The method '{1}' in type '{0}' is marked IsOneWay=true and declares one or more FaultContractAttributes. One-way methods cannot declare FaultContractAttributes. To fix it, change IsOneWay to false or remove the FaultContractAttributes.
cs: Metoda {1} v typu {0} je označena jako IsOneWay=true a deklaruje jednu nebo více tříd FaultContractAttributes. Jednosměrné metody nesmějí deklarovat třídu FaultContractAttributes. Pokud chcete problém odstranit, změňte třídu IsOneWay na hodnotu false nebo odeberte třídu FaultContractAttributes.
de: Die Methode "{1}" in Typ "{0}" ist als "IsOneWay=true" markiert und deklariert mindestens ein FaultContractAttribute. Unidirektionale Methoden können FaultContractAttributes nicht deklarieren. Ändern Sie IsOneWay in "false", oder entfernen Sie die FaultContractAttributes, um den Fehler zu beheben.
es: El método "{1}" en el tipo "{0}" está marcado con IsOneWay=true y declara uno o varios atributos FaultContractAttribute. Los métodos unidireccionales no pueden declarar atributos FaultContractAttribute. Para corregirlo, cambie IsOneWay a false o quite los atributos FaultContractAttribute.
fr: La méthode '{1}' dans le type '{0}' est spécifiée avec 'IsOneWay=true' et déclare un ou plusieurs attributs FaultContractAttributes. Les méthodes unidirectionnelles ne peuvent pas déclarer d'attributs FaultContractAttributes. Pour résoudre ce problème, changez IsOneWay en lui affectant la valeur 'false' ou supprimez les attributs FaultContractAttributes.
it: Il metodo '{1}' nel tipo '{0}' è contrassegnato con IsOneWay=true e dichiara uno o più attributi FaultContractAttribute. I metodi unidirezionali non possono dichiarare attributi FaultContractAttribute. Per risolvere il problema, impostare IsOneWay su false o rimuovere gli attributi FaultContractAttribute.
ja: 型 '{0}' のメソッド '{1}' では、IsOneWay=true が設定されており、1 つ以上の FaultContractAttributes が宣言されています。一方向のメソッドでは FaultContractAttributes を宣言できません。この問題を修正するには、IsOneWay を false に変更するか、FaultContractAttributes を削除してください。
ko: 형식 '{0}'의 '{1}' 메서드가 IsOneWay=true로 표시되었으며 하나 이상의 FaultContractAttributes를 선언합니다. 단방향 메서드는 FaultContractAttributes를 선언할 수 없습니다. 이것을 해결하려면 IsOneWay를 false로 변경하거나 FaultContractAttributes를 제거하세요.
pl: Metoda „{1}” w typie „{0}” jest oznaczona jako IsOneWay=true, ale deklaruje co najmniej jeden element FaultContractAttributes. Metody jednokierunkowe nie mogą deklarować elementów FaultContractAttributes. Aby rozwiązać problem, zmień ustawienie właściwości IsOneWay na „false” lub usuń element FaultContractAttributes.
pt_br: O método '{1}' no tipo '{0}' está marcado como IsOneWay=true e declara um ou mais FaultContractAttributes. Métodos unidirecionais não podem declarar FaultContractAttributes. Para corrigir isso, altere IsOneWay para false ou remova FaultContractAttributes.
tr: '{0}' türündeki '{1}' metodu IsOneWay=true olarak işaretlenmiş ve bir ya da birkaç FaultContractAttributes bildiriyor. One-way metotları, FaultContractAttributes bildiremez. Bunu düzeltmek için IsOneWay değerini false olarak değiştirin ya da FaultContractAttributes öğesini kaldırın.
zh_hans: 将类型“{0}”中的方法“{1}”标记为 IsOneWay=true 并且声明了一个或多个 FaultContractAttributes。单向方法不能声明 FaultContractAttributes。若要修复此问题，请将 IsOneWay 更改为 false 或删除 FaultContractAttributes。
zh_hant: 類型 '{0}' 中的方法 '{1}' 標示為 IsOneWay=true，且宣告了一或多個 FaultContractAttributes。單向方法不可宣告 FaultContractAttributes。若要更正此問題，請將 IsOneWay 變更為 False 或移除 FaultContractAttributes。

# OneWayOperationReturnedFault
source: The one-way operation returned a fault message. The reason for the fault was '{0}'.
cs: Jednosměrná operace vrátila zprávu o chybě. Důvod chyby je {0}.
de: Der unidirektionale Vorgang hat eine Fehlermeldung zurückgegeben. Fehlerursache: "{0}".
es: La operación unidireccional devolvió un mensaje de error. Razón del error: "{0}".
fr: L'opération unidirectionnelle a retourné un message d'erreur. La raison de l'erreur était '{0}'.
it: L'operazione unidirezionale ha restituito un messaggio di errore. Motivo dell'errore: '{0}'.
ja: 一方向の操作がフォールト メッセージを戻しました。フォールトの原因は '{0}' です。
ko: 단방향 작업이 오류 메시지를 반환했습니다. 오류의 원인은 '{0}'입니다.
pl: Operacja jednokierunkowa zwróciła komunikat o błędzie. Przyczyna błędu to „{0}”.
pt_br: A operação unidirecional retornou uma mensagem de falha. O motivo da falha foi '{0}'.
tr: Tek yönlü işlem, bir hata iletisi döndürdü. Hata nedeni: '{0}'.
zh_hans: 单向操作返回错误消息。错误原因为“{0}”。
zh_hant: 單向作業傳回錯誤訊息。錯誤原因為 '{0}'。

# OneWayOperationReturnedLargeFault
source: The one-way operation returned a fault message with Action='{0}'.
cs: Jednosměrná operace vrátila zprávu o chybě s akcí={0}.
de: Der unidirektionale Vorgang hat eine Fehlermeldung mit Action="{0}" zurückgegeben.
es: La operación unidireccional devolvió un mensaje de error con Action="{0}".
fr: L'opération unidirectionnelle a retourné un message d'erreur avec Action='{0}'.
it: L'operazione unidirezionale ha restituito un messaggio di errore con Action='{0}'.
ja: 一方向の操作が Action='{0}' を含むフォールト メッセージを戻しました。
ko: 단방향 작업이 Action='{0}'이(가) 있는 오류 메시지를 반환했습니다.
pl: Operacja jednokierunkowa zwróciła komunikat o błędzie z wartością Action=„{0}”.
pt_br: A operação unidirecional retornou uma mensagem de falha com Ação='{0}'.
tr: Tek yönlü işlem Action='{0}' ile bir hata iletisi döndürdü.
zh_hans: 单向操作返回具有 Action='{0}' 的错误消息。
zh_hant: 單向作業傳回具有 Action='{0}' 的失敗訊息。

# OneWayOperationReturnedMessage
source: The one-way operation returned a non-null message with Action='{0}'.
cs: Jednosměrná operace vrátila zprávu, která nemá hodnotu Null s akcí={0}.
de: Der unidirektionale Vorgang hat eine Nicht-NULL-Meldung mit Action="{0}" zurückgegeben.
es: La operación unidireccional devolvió un mensaje no nulo con Action="{0}".
fr: L'opération unidirectionnelle a retourné un message non null avec Action='{0}'.
it: L'operazione unidirezionale ha restituito un messaggio diverso da Null con Action='{0}'.
ja: 一方向の操作が Action='{0}' を含む null 以外のメッセージを戻しました。
ko: 단방향 작업이 Action='{0}'이(가) 있는 null이 아닌 메시지를 반환했습니다.
pl: Operacja jednokierunkowa zwróciła komunikat inny niż null, akcja=„{0}”.
pt_br: A operação unidirecional retornou uma mensagem não nula com Ação='{0}'.
tr: Tek yönlü işlem Action='{0}' ile null olmayan ileti döndürdü.
zh_hans: 单向操作返回具有 Action='{0}' 的非 null 消息。
zh_hant: 單向作業傳回含有 Action='{0}' 的非 null 訊息。

# OneWayOperationShouldNotSpecifyAReplyAction1
source: One way operation {0} cannot not specify a reply action.
cs: Jednosměrná operace {0} nesmí specifikovat akci odpovědi.
de: Der unidirektionale Vorgang {0} kann keine Antwortaktion angeben.
es: La operación unidireccional {0} no puede especificar una acción de respuesta.
fr: Une opération unidirectionnelle {0} ne peut pas spécifier une action de réponse.
it: L'operazione unidirezionale {0} non può specificare un'azione di risposta.
ja: 一方向の操作 {0} には、応答アクションを指定できません。
ko: 단방향 작업 {0}이(가) 회신 동작을 지정할 수 없습니다.
pl: Operacja jednokierunkowa {0} nie może określić akcji odpowiedzi.
pt_br: A operação unidirecional {0} não pode especificar uma ação de resposta.
tr: {0} tek yönlü işlemi, bir yanıt eylemi belirtemez.
zh_hans: 单向操作 {0} 无法指定回复操作。
zh_hant: 單向作業 {0} 不可指定回覆動作。

# OnlyBodyReturnValuesSupported
source: Only body return values are supported currently for protection, MessagePartDescription was specified.
cs: Pro ochranu jsou aktuálně podporovány pouze hodnoty vrácených textů, byla určena třída MessagePartDescription.
de: Derzeit werden nur Textkörper-Rückgabewerte zum Schützen unterstützt. MessagePartDescription wurde angegeben.
es: Actualmente, solo se admiten valores devueltos de cuerpo para protección. Se especificó MessagePartDescription.
fr: Seules les valeurs retournées du corps sont prises en charge pour la protection. MessagePartDescription a été spécifié.
it: Per la protezione sono attualmente supportati solo valori restituiti di body. È stato specificato MessagePartDescription.
ja: 現在は本文の戻り値のみが保護のためにサポートされており、MessagePartDescription が指定されています。
ko: 현재는 보호를 위해 본문 반환 값만 지원됩니다. MessagePartDescription이 지정되었습니다.
pl: Możliwość ochrony dotyczy aktualnie tylko wartości zwracanych przez treść. Określono element MessagePartDescription.
pt_br: Neste momento, há suporte apenas para valores retornados de corpo para proteção; MessagePartDescription foi especificada.
tr: Koruma için şu anda yalnızca gövde dönüş değerleri desteklenir, MessagePartDescription belirtildi.
zh_hans: 出于保护目的，当前仅支持正文返回值，指定了 MessagePartDescription。
zh_hant: 目前僅支援保護內文傳回值，但指定了 MessagePartDescription。

# OnlyDefaultSpnServiceSupported
source: Only HOST and HTTP service principal names are supported .
cs: Jsou podporovány pouze hlavní názvy služby typu HOST a HTTP.
de: Es werden nur Host- und HTTP-Dienstprinzipalnamen unterstützt.
es: Sólo son compatibles los nombres de HOST y de la entidad principal del servicio HTTP.
fr: Seuls les noms HOST et de principal du service HTTP sont pris en charge.
it: Sono supportati solo i nomi dell'entità servizio HOST e HTTP.
ja: ホストと HTTP サービス プリンシパル名のみがサポートされています。
ko: HOST 및 HTTP 서비스 사용자 이름만 지원됩니다.
pl: Obsługiwane są tylko główne nazwy usługi HOST i HTTP.
pt_br: Somente os nomes da entidade de serviço de HOST e HTTP são suportados.
tr: Yalnızca HOST ve HTTP hizmet sorumlusu adları desteklenir.
zh_hans: 仅支持 HOST 和 HTTP 服务主体名称。
zh_hant: 只支援 HOST 和 HTTP 服務主體名稱。

# OpenTimedOutEstablishingTransportSession
source: Open timed out after {0} while establishing a transport session to {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Otevření bylo načasováno po {0}, zatímco ustavení relace přenosu do {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Öffnen ist nach {0} ein Timeout aufgetreten, während versucht wurde, eine Transportsitzung mit {1} herzustellen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La apertura agotó el tiempo de espera después de {0} al establecer una sesión de transporte en {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Dépassement du délai d'expiration d'ouverture après {0} durant l'établissement d'une session de transport vers {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di Open dopo {0} mentre veniva stabilita una sessione di trasporto per {1}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: {1} に対するトランスポート セッションの確立中に、Open 処理は {0} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {1}에 대한 전송 세션을 설정하는 동안 {0} 이후에 Open이 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Przekroczono limit czasu otwarcia po {0} podczas ustanawiania sesji transportu z {1}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: Tempo limite de abertura atingido após {0} ao estabelecer uma sessão de transporte com {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Open işlemi, {1} öğesine bir aktarım oturumu oluştururken, {0} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 建立指向 {1} 的传输会话时在 {0} 后打开超时。分配给此操作的时间可能比超时长。
zh_hant: 建立 {1} 的傳輸工作階段時，在 {0} 之後開啟逾時。分配給此作業的時間可能是較長逾時的一部分。

# OperationAbortedDuringConnectionEstablishment
source: Operation was aborted while establishing a connection to {0}.
cs: Operace byla přerušena při ustavování připojení k {0}.
de: Der Vorgang wurde beim Herstellen einer Verbindung mit {0} abgebrochen.
es: Se anuló la operación al establecer una conexión a {0}.
fr: L'opération a été annulée durant l'établissement d'une connexion à {0}.
it: L'operazione interrotta durante il tentativo di stabilire una connessione a {0}.
ja: {0} との接続の確立中に操作が中止されました。
ko: {0}에 대한 연결을 설정하는 동안 작업이 중단되었습니다.
pl: Operacja została przerwana podczas nawiązywania połączenia z {0}.
pt_br: A operação foi anulada durante o estabelecimento de uma conexão com {0}.
tr: İşlem, {0} bağlantısı kurmaya çalışırken iptal edildi.
zh_hans: 建立到 {0} 的连接时操作中止。
zh_hant: 建立 {0} 連線時，作業中止。

# OperationCannotBeDoneAfterProcessingIsStarted
source: This operation cannot be done after processing is started.
cs: Tuto operaci nelze provést po spuštění zpracování.
de: Dieser Vorgang kann nicht ausgeführt werden, nachdem die Verarbeitung gestartet wurde.
es: Esta operación no se puede realizar después de iniciarse el procesamiento.
fr: Cette opération ne peut pas être effectuée après le démarrage du traitement.
it: Non è possibile eseguire l'operazione dopo l'avvio dell'elaborazione.
ja: 処理の開始後にこの操作を実行することはできません。
ko: 처리가 시작된 후 이 작업을 수행할 수 없습니다.
pl: Tej operacji nie można wykonać po rozpoczęciu przetwarzania.
pt_br: Essa operação não pode ser realizada após o início do processamento.
tr: İşleme başlatıldıktan sonra bu işlem gerçekleştirilemez.
zh_hans: 启动进程后无法完成此操作。
zh_hant: 開始處理後，無法執行此作業。

# OperationInvalidBeforeSecurityNegotiation
source: This operation is not valid until security negotiation is complete.
cs: Tato operace není platná, dokud není dokončeno vyjednávání zabezpečení.
de: Dieser Vorgang ist erst nach Abschluss der Sicherheitsaushandlung gültig.
es: Esta operación no es válida hasta que se complete la negociación de seguridad.
fr: Cette opération est non valide tant que la négociation de sécurité n'a pas été effectuée.
it: Questa operazione non è valida finché non viene completata la negoziazione di sicurezza.
ja: セキュリティ ネゴシエーションが完了しないと、この操作は有効になりません。
ko: 보안 협상이 완료될 때까지 이 작업이 유효하지 않습니다.
pl: Ta operacja będzie nieprawidłowa, dopóki negocjowanie zabezpieczeń nie zostanie zakończone.
pt_br: Esta operação permanecerá inválida até a conclusão da negociação de segurança.
tr: Güvenlik anlaşması tamamlanıncaya kadar bu işlem geçerli değildir.
zh_hans: 在安全性协商结束前，此操作始终无效。
zh_hant: 除非完成安全性交涉，否則此作業無效。

# OutputNotExpected
source: Send cannot be called when the session does not expect output.
cs: Odeslání nelze vyvolat, pokud relace neočekává výstup.
de: Send kann nicht aufgerufen werden, wenn die Sitzung keine Ausgabe erwartet.
es: No se puede llamar a Send cuando la sesión no espera salida.
fr: La méthode Send ne peut pas être appelée quand la session n'attend pas de sortie.
it: Impossibile chiamare Send quando per la sessione non è previsto output.
ja: セッションで出力が予期されていない場合、Send を呼び出すことはできません。
ko: 세션에서 출력이 필요하지 않은 경우 Send를 호출할 수 없습니다.
pl: Nie można wywołać wysyłania, gdy w sesji nie są oczekiwane dane wyjściowe.
pt_br: Não é possível chamar Send quando a sessão não espera nenhuma saída.
tr: Send, oturum çıktı beklemediğinde çağrılamıyor.
zh_hans: 会话不需要输出时无法调用 Send。
zh_hant: 當工作階段未預期輸出時，無法呼叫傳送。

# PeerTrustNotSupportedOnOSX
source: Peer Trust certificate validation is not supported on OSX. See https://go.microsoft.com/fwlink/?linkid=849976 for details.
cs: Ověření certifikátů důvěryhodných pro druhou stranu se v systému OSX nepodporuje. Podrobnosti najdete tady: https://go.microsoft.com/fwlink/?linkid=849976.
de: Die Überprüfung des Peer-Vertrauenszertifikats wird unter OSX nicht unterstützt. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=849976.
es: La validación de certificados de confianza del mismo nivel no es compatible con OSX. Consulte https://go.microsoft.com/fwlink/?linkid=849976 para obtener más detalles.
fr: La validation du certificat de confiance entre homologues n’est pas prise en charge sur OSX. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=849976.
it: La convalida del certificato di attendibilità peer non è supportata in OSX. Per informazioni dettagliate, vedere https://go.microsoft.com/fwlink/?linkid=849976.
ja: ピア信頼証明書の検証は、OSX ではサポートされていません。詳細については、https://go.microsoft.com/fwlink/?linkid=849976 を参照してください。
ko: 피어 트러스트 인증서 유효성 검사는 OSX에서 지원되지 않습니다. 자세한 내용은 https://go.microsoft.com/fwlink/?linkid=849976을 참조하세요.
pl: Sprawdzanie poprawności certyfikatu zaufania elementu równorzędnego nie jest obsługiwane w systemie OSX. Zobacz https://go.microsoft.com/fwlink/?linkid=849976, aby uzyskać szczegółowe informacje.
pt_br: A validação do certificado de confiança de mesmo nível não é suportada com OSX. Consulte https://go.microsoft.com/fwlink/?linkid=849976 para obter detalhes.
tr: OSX üzerinde Eşler Arası Güven sertifikası doğrulaması desteklenmez. Ayrıntılar için bkz. https://go.microsoft.com/fwlink/?linkid=849976.
zh_hans: OSX 不支持对等信任证书验证。有关详细信息，请参阅 https://go.microsoft.com/fwlink/?linkid=849976。
zh_hant: OSX 上不支援對等信任憑證驗證。如需詳細資料，請參閱 https://go.microsoft.com/fwlink/?linkid=849976。

# PreambleAckIncorrect
source: You have tried to create a channel to a service that does not support .Net Framing.
cs: Pokusili jste se vytvořit kanál ke službě, která nepodporuje funkci .Net Framing.
de: Sie haben versucht, einen Kanal zu einem Dienst zu erstellen, der das .NET-Framing nicht unterstützt.
es: Ha intentado crear un canal a un servicio que no es compatible con tramas .Net.
fr: Vous avez tenté de créer un canal vers un service qui ne prend pas en charge le tramage .Net.
it: Si è provato a creare un canale per un servizio che non supporta .NET Framing.
ja: .NET Framing をサポートしないサービスへのチャネルを作成しようとしました。
ko: .NET 프레이밍을 지원하지 않는 서비스에 대한 채널을 만들려고 했습니다.
pl: Nastąpiła próba utworzenia kanału do usługi, która nie obsługuje programu .Net Framing.
pt_br: Você tentou criar um canal para um serviço que não dá suporte ao .Net Framing.
tr: .Net Framing desteği olmayan bir hizmete bir kanal oluşturmaya çalıştınız.
zh_hans: 已尝试创建连接不支持 .Net Framing 的服务的通道。
zh_hant: 您嘗試建立的服務通道不支援 .Net Framing。

# PreambleAckIncorrectMaybeHttp
source: You have tried to create a channel to a service that does not support .Net Framing. It is possible that you are encountering an HTTP endpoint.
cs: Pokusili jste se vytvořit kanál ke službě, která nepodporuje funkci .Net Framing. Je možné, že zjistíte koncový bod HTTP.
de: Sie haben versucht, einen Kanal zu einem Dienst zu erstellen, der das .NET-Framing nicht unterstützt. Es ist möglich, dass Sie auf einen HTTP-Endpunkt treffen.
es: Ha intentado crear un canal a un servicio que no es compatible con tramas .Net. Es posible que se encuentre un punto de conexión HTTP.
fr: Vous avez tenté de créer un canal vers un service qui ne prend pas en charge le tramage .Net. Il est possible que vous rencontriez un point de terminaison HTTP.
it: Si è provato a creare un canale per un servizio che non supporta .NET Framing. È possibile che sia rilevato un endpoint HTTP.
ja: .NET Framing をサポートしないサービスへのチャネルを作成しようとしました。HTTP エンドポイントが検出された可能性があります。
ko: .NET 프레이밍을 지원하지 않는 서비스에 대한 채널을 만들려고 했습니다. HTTP 엔드포인트에 도달했을 수 있습니다.
pl: Nastąpiła próba utworzenia kanału do usługi, która nie obsługuje programu .Net Framing. Być może napotkano punkt końcowy HTTP.
pt_br: Você tentou criar um canal para um serviço que não dá suporte ao .Net Framing. É possível que você esteja encontrando um ponto de extremidade HTTP.
tr: .Net Framing desteği olmayan bir hizmete bir kanal oluşturmaya çalıştınız. Bir HTTP uç noktası ile karşılaşıyor olmanız mümkündür.
zh_hans: 已尝试创建连接不支持 .Net Framing 的服务的通道。可能遇到的是 HTTP 终结点。
zh_hant: 您嘗試建立的服務通道不支援 .Net Framing。可能面對的是 HTTP 端點。

source: Primary signature must be computed before supporting token signatures.
cs: Primární podpis musí být vypočítán dříve než podpisy podpůrných tokenů.
de: Die primäre Signatur muss berechnet werden, bevor Tokensignaturen unterstützt werden können.
es: Debe calcularse la signatura principal para poder admitir signaturas de token.
fr: La signature principale doit être calculée avant la prise en charge de signatures de jeton.
it: La firma primaria deve essere calcolata prima di supportare firme token.
ja: トークン署名をサポートするにはプライマリ署名を計算する必要があります。
ko: 토큰 서명을 지원하기 전에 주 서명이 계산되어야 합니다.
pl: Przed rozpoczęciem obsługi podpisów tokenów należy obliczyć podpis podstawowy.
pt_br: A assinatura principal deve ser calculada antes de oferecer suporte a assinaturas de token.
tr: Belirteç imzalarının desteklenmesi için birinci imzanın hesaplanması gerekir.
zh_hans: 必须先计算主签名方可支持令牌签名。
zh_hant: 主要簽章必須先經計算後，才能支援權杖簽章。

# PrimarySignatureWasNotSignedByDerivedKey
source: The primary signature is not signed with a derived key. The binding's primary token parameter '{0}' requires key derivation.
cs: Primární podpis není podepsán s odvozeným klíčem. Parametr primárního tokenu vazby {0} vyžaduje odvození klíče.
de: Die primäre Signatur ist nicht mit einem abgeleiteten Schlüssel signiert. Der primäre Tokenparameter "{0}" der Bindung erfordert eine Schlüsselableitung.
es: La signatura principal no está firmada con una clave derivada. El parámetro de token primario '{0}' del enlace requiere la derivación de la clave.
fr: La signature principale n'est pas signée avec une clé dérivée. Le paramètre '{0}' du jeton principal de la liaison requiert une dérivation de clé.
it: Firma primaria non firmata con una chiave derivata. Il parametro '{0}' del token primario del binding richiede la derivazione della chiave.
ja: このプライマリ署名は派生キーを使用して署名されていません。バインドのプライマリ トークン パラメーター '{0}' では、キーの派生が必要です。
ko: 주 서명이 파생 키로 서명되지 않습니다. 바인딩의 주 토큰 매개 변수 '{0}'에 키 파생이 필요합니다.
pl: Podpis podstawowy nie jest podpisany kluczem pochodnym. Parametr podstawowego tokenu powiązania „{0}” wymaga klucza pochodnego.
pt_br: A assinatura principal não usa uma chave derivada. O parâmetro de token principal da associação '{0}' requer derivação de chaves.
tr: Birincil imza, elde edilen bir anahtarla imzalanmadı. Bağlamanın birincil belirteç parametresi '{0}', anahtar elde edilmesini gerektirir.
zh_hans: 未使用派生密钥对主签名进行签名。绑定的主令牌参数“{0}”需要密钥派生。
zh_hant: 主要簽章未經衍生金鑰簽署。繫結的主要權杖參數 '{0}' 需要金鑰衍生。

# PrimarySignatureWasNotSignedByDerivedWrappedKey
source: The primary signature is not signed with a key derived from the encrypted key. The binding's token parameter '{0}' requires key derivation.
cs: Primární podpis není podepsán s klíčem odvozeným od šifrovaného klíče. Parametr tokenu vazby {0} vyžaduje odvození klíče.
de: Die primäre Signatur ist nicht mit einem Schlüssel signiert, der von einem verschlüsselten Schlüssel abgeleitet wurde. Der Tokenparameter "{0}" der Bindung erfordert eine Schlüsselableitung.
es: La signatura no está firmada con una clave derivada de la clave cifrada. El parámetro de token '{0}' del enlace requiere la derivación de la clave.
fr: La signature principale n'est pas signée avec une clé dérivée de la clé chiffrée. Le paramètre '{0}' du jeton de la liaison requiert la dérivation de clé.
it: Firma primaria non firmata con una chiave derivata dalla chiave crittografata. Il parametro '{0}' del token del binding richiede la derivazione della chiave.
ja: このプライマリ署名は、暗号化キーから派生したキーを使用して署名されていません。バインドのトークン パラメーター '{0}' では、キーの派生が必要です。
ko: 주 서명이 암호화된 키에서 파생된 키로 서명되지 않습니다. 바인딩의 토큰 매개 변수 '{0}'에 키 파생이 필요합니다.
pl: Podpis podstawowy nie jest podpisany kluczem pochodzącym z klucza zaszyfrowanego. Parametr tokenu powiązania „{0}” wymaga klucza pochodnego.
pt_br: A assinatura principal não usa uma chave derivada da chave criptografada. O parâmetro de token da associação '{0}' requer derivação de chaves.
tr: Birincil imza, şifrelenen anahtardan elde edilen bir anahtarla imzalanmadı. '{0}' bağlama belirteç parametresi, anahtar elde edilmesini gerektirir.
zh_hans: 未使用从加密密钥派生的密钥对主签名进行签名。绑定的令牌参数“{0}”需要密钥派生。
zh_hant: 主要簽章未經衍生自加密金鑰的金鑰簽署。繫結的權杖參數 '{0}' 需要金鑰衍生。

# PrivateKeyNotDSA
source: The private key is not a DSA key.
cs: Privátní klíč není klíč DSA.
de: Der private Schlüssel ist kein DSA-Schlüssel.
es: La clave privada no es DSA.
fr: La clé privée n'est pas une clé DSA.
it: La chiave privata non è una chiave DSA.
ja: 秘密キーは DSA キーではありません。
ko: 개인 키가 DSA 키가 아닙니다.
pl: Klucz prywatny nie jest kluczem DSA.
pt_br: A chave privada não é uma chave DSA.
tr: Özel anahtar bir DSA anahtarı değil.
zh_hans: 私钥不是 DSA 密钥。
zh_hant: 私密金鑰不是 DSA 金鑰。
