Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# TaskAsyncMatchConsistency_Attributes6
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, any additional attributes must be declared on the task-based asynchronous OperationContract method. In this case, the asynchronous OperationContract method '{2}' has one or more attributes of type '{5}'. To fix it, remove the '{5}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
cs: Úlohově orientovaná asynchronní metoda OperationContract {0} typu {1} se shoduje s asynchronními metodami OperationContract {2} a {3}, protože mají shodný název operace {4}. Pokud se úlohově orientovaná asynchronní metoda OperationContract shoduje s párem asynchronních metod OperationContract, musejí být jakékoli dodatečné atributy deklarovány pro úlohově orientovanou asynchronní metodu OperationContract. V tomto případě má asynchronní metoda OperationContract {2} jeden nebo více atributů typu {5}. Tento problém je možné odstranit tak, že odeberete atributy {5} z metody {2}. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die aufgabenbasierte asynchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine aufgabenbasierte asynchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen alle zusätzlichen Attribute in der aufgabenbasierten asynchronen OperationContract-Methode deklariert werden. In diesem Fall verfügt die asynchrone OperationContract-Methode "{2}" über mindestens ein Attribut vom Typ "{5}". Entfernen Sie das bzw. die {5}-Attribute aus der Methode "{2}", um dieses Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract asincrónico basado en tareas en el tipo "{1}" coincide con los métodos "{2}" y "{3}" OperationContract asincrónicos porque tienen el mismo nombre de operación "{4}". Cuando un método OperationContract asincrónico basado en tares coincide con un par de métodos OperationContract asincrónicos, es preciso que los atributos adicionales se declaren en el método OperationContract asincrónico basado en tareas. En este caso, el método "{2}" OperationContract asincrónico tiene uno o más atributos de tipo "{5}". Para solucionarlo, quite el atributo o atributos "{5}" del método "{2}". También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract asynchrone basée sur les tâches '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract asynchrone basée sur les tâches est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les attributs supplémentaires doivent être déclarés sur la méthode OperationContract asynchrone basée sur les tâches. Dans ce cas, la méthode OperationContract '{2}' asynchrone comporte un ou plusieurs attributs de type '{5}'. Pour corriger le problème, supprimez les attributs '{5}' de la méthode '{2}'. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' asincrono basato su attività nel tipo '{1}' è stato associato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract asincrono basato su attività viene abbinato a una coppia di metodi OperationContract asincroni, tutti gli attributi aggiuntivi devono essere dichiarati nel metodo OperationContract asincrono basato su attività. In questo caso, il metodo OperationContract '{2}' asincrono contiene include uno o più attributi di tipo '{5}'. Per risolvere il problema, rimuovere l'attributo o gli attributi '{5}' dal metodo '{2}'. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' のタスクベースの非同期 OperationContract メソッド '{0}' が非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。タスクベースの非同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、タスクベースの非同期 OperationContract メソッドに対して追加の属性を宣言する必要があります。このケースでは、非同期 OperationContract メソッド '{2}' に '{5}' 型の属性が 1 つ以上あります。この問題を修正するには、メソッド '{2}' から '{5}' 属性を削除します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: 두 메서드가 동일한 작업 이름 '{4}'을(를) 포함하기 때문에 '{1}' 형식의 작업 기반 비동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 일치했습니다. 작업 기반 비동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하는 경우 추가 특성은 작업 기반 비동기 OperationContract 메서드에서 선언해야 합니다. 이 경우 비동기 OperationContract 메서드 '{2}'에 하나 이상의 '{5}' 형식의 특성이 포함되어 있습니다. 이를 해결하려면 메서드 '{2}'에서 '{5}' 특성을 제거하세요. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Oparta na zadaniach asynchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do asynchronicznych metod klasy OperationContract „{2}” i „{3}”, ponieważ zawierają one operację o takiej samej nazwie „{4}”. Gdy oparta na zadaniach asynchroniczna metoda OperationContract jest dopasowywana do pary asynchronicznych metod klasy OperationContract, wszystkie dodatkowe atrybuty muszą zostać zadeklarowane w opartej na zadaniach asynchronicznej metodzie klasy OperationContract. W tym przypadku asynchroniczna metoda klasy OperationContract „{2}” ma co najmniej jeden atrybut typu „{5}”. Aby rozwiązać ten problem, usuń atrybut lub atrybuty „{5}” z metody „{2}”. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método assíncrono OperationContract baseado em tarefa '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método assíncrono OperationContract baseado em tarefa coincide com um par de métodos assíncronos OperationContract, os atributos adicionais devem ser declarados no método assíncrono OperationContract baseado em tarefa. Nesse caso, o método assíncrono OperationContract '{2}' tem um ou mais atributos do tipo '{5}'. Para corrigir isso, remova o atributo ou os atributos '{5}' do método '{2}'. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{4}' işlem adına sahip olduklarından '{1}' türü içindeki görev tabanlı asenkron OperationContract metodu '{0}' ile asenkron OperationContract metotları '{2}' ve '{3}' eşleştirildi. Görev tabanlı asenkron bir OperationContract metodu asenkron bir çift OperationContract metoduyla eşleştirildiğinde, görev tabanlı asenkron OperationContract metodunda varsa ek özniteliklerin bildirimi yapılmalıdır. Bu durumda, asenkron OperationContract metodu '{2}', '{5}' türünde bir veya daha fazla özniteliğe sahiptir. Bunu düzeltmek için, '{2}' metodundan '{5}' özniteliğini veya özniteliklerini kaldırın. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中基于任务的异步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当基于任务的异步 OperationContract 方法与一对异步 OperationContract 方法匹配时，必须在基于任务的异步 OperationContract 方法上定义任何其他特性。在本例中，异步 OperationContract 方法“{2}”具有一个或多个类型为“{5}”的特性。若要修复此问题，请从方法“{2}”中移除“{5}”特性。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 以工作為基礎的非同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當以工作為基礎的非同步 OperationContract 方法符合一對非同步 OperationContract 方法時，其他任何屬性皆必須在以工作為基礎的非同步 OperationContract 方法上宣告。在此例中，非同步 OperationContract 方法 '{2}' 具有一或多個類型 '{5}' 的屬性。若要修正此問題，請移除 '{5}' 屬性，或移除方法 '{2}' 的屬性。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# TaskAsyncMatchConsistency_Parameters5
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
cs: Úlohově orientovaná asynchronní metoda OperationContract {0} typu {1} se shoduje s asynchronními metodami OperationContract {2} a {3}, protože mají shodný název operace {4}. Pokud se úlohově orientovaná asynchronní metoda OperationContract shoduje s párem asynchronních metod OperationContract, musejí obě tyto metody OperationContract definovat shodný počet a typ parametrů. V tomto případě jsou některé z argumentů odlišné. Tento problém je možné odstranit tak, že obě metody OperationContract budou definovat stejný počet a typ argumentů a také ve stejném pořadí. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die aufgabenbasierte asynchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine aufgabenbasierte asynchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts die gleiche Anzahl und die gleichen Typen von Parametern definieren. In diesem Fall unterscheiden sich einige der Argumente. Stellen Sie zum Beheben dieses Problems sicher, dass die OperationContracts die gleiche Anzahl und die gleichen Typen von Argumenten in der gleichen Reihenfolge definieren. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract asincrónico basado en tareas en el tipo "{1}" coincide con los métodos "{2}" y "{3}" OperationContract asincrónicos porque tiene el mismo nombre de operación "{4}". Cuando un método OperationContract asincrónico basado en tareas coincide con un par de métodos OperationContract asincrónicos, los dos métodos OperationContracts deben definir el mismo número y tipos de parámetros. En este caso, algunos de los argumentos son diferentes. Para solucionarlo, asegúrese de que OperationContracts define el mismo número y tipos de argumentos y en el mismo orden. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract asynchrone basée sur les tâches '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract asynchrone basée sur les tâches est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent définir le même nombre et les mêmes types de paramètre. Dans ce cas, certains arguments sont différents. Pour corriger le problème, vérifiez que les OperationContracts définissent le même nombre et les mêmes types d'argument, dans un ordre identique. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' asincrono basato su attività nel tipo '{1}' è stato abbinato ai metodi OperationContract asincroni '{2}' e '{3}' perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract asincrono basato su attività viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono definire lo stesso numero e gli stessi tipi di parametri. In questo caso, alcuni degli argomenti sono diversi. Per risolvere il problema, verificare che i metodi OperationContract definiscano lo stesso numero e gli stessi tipi di parametri nello stesso ordine. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' のタスクベースの非同期 OperationContract メソッド '{0}' が非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。タスクベースの非同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract では同じ数と型のパラメーターを定義する必要があります。このケースでは、一部の引数が異なります。この問題を修正するには、これらの OperationContract で同じ数と型の引数を同じ順序で定義します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: 두 메서드가 동일한 작업 이름 '{4}'을(를) 포함하기 때문에 '{1}' 형식의 작업 기반 비동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 일치했습니다. 작업 기반 비동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하는 경우 두 OperationContract 모두 동일한 숫자와 형식의 매개 변수를 정의해야 합니다. 이 경우 일부 인수가 달라집니다. 이를 해결하려면 두 OperationContract가 동일한 숫자와 형식의 인수를 동일한 순서로 정의하는지 확인해야 합니다. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Oparta na zadaniach asynchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do asynchronicznych metod klasy OperationContract „{2}” i „{3}”, ponieważ zawierają one operację o takiej samej nazwie „{4}”. Gdy oparta na zadaniach asynchroniczna metoda klasy OperationContract jest dopasowywana do pary asynchronicznych metod klasy OperationContract, obie klasy OperationContract muszą definiować taką samą liczbę i typy parametrów. W tym przypadku niektóre argumenty są różne. Aby rozwiązać ten problem, upewnij się, że klasy OperationContract definiują taką samą liczbę i typy argumentów (i w tej samej kolejności). Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método assíncrono OperationContract baseado em tarefa '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método assíncrono OperationContract baseado em tarefa coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem definir o mesmo número e tipos de parâmetros. Nesse caso, alguns dos argumentos são diferentes. Para corrigir isso, verifique se os OperationContracts definem o mesmo número e tipos de argumentos, na mesma ordem. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{4}' işlem adına sahip olduklarından '{1}' türü içindeki görev tabanlı asenkron OperationContract metodu '{0}' ile asenkron OperationContract metotları '{2}' ve '{3}' eşleştirildi. Görev tabanlı asenkron bir OperationContract metodu asenkron iki OperationContract metoduyla eşleştirildiğinde, iki OperationContract tarafından aynı sayıda ve türde parametreler tanımlanmalıdır. Bu durumda, bağımsız değişkenleri bazıları farklıdır. Bunu düzeltmek için, OperationContract metotlarının bağımsız değişkenleri aynı sayıda, aynı türde ve aynı sırada tanımladığından emin olun. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中基于任务的异步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当基于任务的异步 OperationContract 方法与一对异步 OperationContract 方法匹配时，两个 OperationContract 必须定义相同数量和类型的形式参数。在本例中，某些实际参数不同。若要修复此问题，请确保 OperationContract 按相同顺序定义相同数量和类型的实际参数。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 以工作為基礎的非同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當以工作為基礎的非同步 OperationContract 方法符合一對非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同數量與類型的參數。在此例中，部分引數不同。若要修正此問題，請確認 OperationContract 定義相同數量與類型的引數，且順序也相同。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# TaskAsyncMatchConsistency_Property6
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must have the same value for the '{5}' property. In this case, the values are different. To fix it, change the '{5} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
cs: Úlohově orientovaná asynchronní metoda OperationContract {0} typu {1} se shoduje s asynchronními metodami OperationContract {2} a {3}, protože mají shodný název operace {4}. Pokud se úlohově orientovaná asynchronní metoda OperationContract shoduje s párem asynchronních metod OperationContract, musejí mít obě tyto metody OperationContract shodnou hodnotu vlastnosti {5}. V tomto případě jsou tyto hodnoty odlišné. Tento problém je možné odstranit tak, že změníte hodnotu vlastnosti {5} jedné z metod OperationContract tak, aby se obě shodovaly. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die aufgabenbasierte asynchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine aufgabenbasierte asynchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts den gleichen Wert für die {5}-Eigenschaft aufweisen. In diesem Fall unterscheiden sich die Werte. Ändern Sie zum Korrigieren dieses Problems die {5}-Eigenschaft eines der OperationContracts, sodass er mit dem anderen Vertrag übereinstimmt. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract asincrónico basado en tareas en el tipo "{1}" coincide con los métodos "{2}" y "{3}" OperationContract asincrónicos porque tienen el mismo nombre de operación "{4}". Cuando un método OperationContract asincrónico basado en tareas coincide con un par de métodos OperationContract asincrónicos, los dos métodos OperationContracts deben tener el mismo valor para la propiedad "{5}". En este caso, los valores son diferentes. Para solucionarlo, cambien la propiedad "{5}" de uno de los métodos OperationContracts para que coincida con el otro. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract asynchrone basée sur les tâches '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract asynchrone basée sur les tâches est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent contenir la même valeur pour la propriété '{5}'. Dans ce cas, les valeurs sont différentes. Pour corriger le problème, modifiez la propriété '{5}' de l'une des méthodes OperationContracts pour les faire correspondre. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' asincrono basato su attività nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract asincrono basato su attività viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono avere lo stesso valore per la proprietà '{5}'. In questo caso, i valori sono diversi. Per risolvere il problema, modificare la proprietà '{5} di uno dei metodi OperationContract in modo tale che i valori corrispondano. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' のタスクベースの非同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。タスクベースの非同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract は同じ値の '{5}' プロパティを持つ必要があります。このケースでは、これらの値が異なります。この問題を修正するには、いずれかの OperationContract の '{5}' プロパティを変更して、他の '{5}' プロパティと一致させます。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: 두 메서드가 동일한 작업 이름 '{4}'을(를) 포함하기 때문에 '{1}' 형식의 작업 기반 비동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 일치했습니다. 작업 기반 비동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하는 경우 두 OperationContract 모두 '{5}' 속성에 대해 동일한 값을 가져야 합니다. 이 경우 값이 달라집니다. 이를 해결하려면 두 OperationContract 중 하나의 '{5}' 속성을 다른 속성과 일치하도록 변경하세요. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Oparta na zadaniach asynchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do asynchronicznych metod klasy OperationContract „{2}” i „{3}”, ponieważ zawierają one operację o takiej samej nazwie „{4}”. Gdy oparta na zadaniach asynchroniczna metoda klasy OperationContract jest dopasowywana do pary asynchronicznych metod klasy OperationContract, obie klasy OperationContract muszą mieć taką samą wartość właściwości „{5}”. W tym przypadku te wartości są różne. Aby rozwiązać ten problem, zmień wartość właściwości „{5}” w jednej z klas OperationContract, tak aby pasowała do drugiej. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método assíncrono OperationContract baseado em tarefa '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método assíncrono OperationContract baseado em tarefa coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem ter o mesmo valor para a propriedade '{5}'. Nesse caso, os valores são diferentes. Para corrigir isso, altere a propriedade '{5} de um dos OperationContracts coincidir com a outra. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{4}' işlem adına sahip olduklarından '{1}' türü içindeki görev tabanlı asenkron OperationContract metodu '{0}' ile asenkron OperationContract metotları '{2}' ve '{3}' eşleştirildi. Görev tabanlı asenkron bir OperationContract metodu asenkron iki OperationContract metoduyla eşleştirildiğinde, iki OperationContract metodunun '{5}' özelliği aynı değere sahip olmalıdır. Bu durumda, değerler farklıdır. Düzeltmek için, bir OperationContract'in '{5}' özelliğini diğeriyle eşleşecek şekilde değiştirin. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中基于任务的异步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当基于任务的异步 OperationContract 方法与一对异步 OperationContract 方法匹配时，两个 OperationContract 必须具有相同的“{5}”属性值。在本例中，这些值不同。若要修复此问题，请更改其中一个 OperationContract 的“{5}”属性以匹配另一个。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 以工作為基礎的非同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當以工作為基礎的非同步 OperationContract 方法符合一對非同步 OperationContract 方法時，兩個 OperationContract 的 '{5}' 屬性值就會相同。在這種狀況下，兩個值是不同的。若要修正此問題，請變更其中一個 OperationContract 的 '{5} 屬性，使其彼此相符。或者也可以變更其中一個方法的名稱，即可避免發生相符狀況。
