Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# FramingError
source: Error while reading message framing format at position {0} of stream (state: {1})
cs: Při čtení formátu rámce zprávy na pozici {0} datového streamu (stav: {1}) došlo k chybě.
de: Fehler beim Lesen des Nachrichtenrahmenformats an Position {0} des Datenstroms (Zustand: {1})
es: Error al leer el formato de tramas de mensajes en la posición {0} de la secuencia (estado: {1})
fr: Erreur durant la lecture du format de tramage du message à la position {0} du flux (état : {1})
it: Si è verificato un errore durante la lettura del formato di framing del messaggio alla posizione {0} del flusso (stato: {1})
ja: ストリームの {0} の位置でメッセージ フレーム形式を読み取っているときにエラーが発生しました (状態: {1})
ko: 스트림의 위치 {0}에서 메시지 프레이밍 형식을 읽는 동안 오류가 발생했습니다(상태: {1}).
pl: Błąd podczas odczytu formatu ramek komunikatu w pozycji {0} strumienia (stan: {1})
pt_br: Erro ao ler o formato de enquadramento de mensagens na posição {0} do fluxo (estado: {1})
tr: Akışın {0} konumunda ileti çerçeve biçimi okunurken hata oluştu (durum: {1})
zh_hans: 在流的位置 {0} 处读取消息组帧格式时出错(状态: {1})
zh_hant: 讀取資料流位置 {0} 的訊息框架處理格式時發生錯誤 (狀態: {1})

# FramingFaultTooLong
source: The framing fault size ({0}) exceeds the quota.
cs: Velikost chyby rámce ({0}) přesahuje kvótu.
de: Die Rahmenfehlergröße ({0}) überschreitet das Kontingent.
es: El tamaño del error de tramas ({0}) supera la cuota.
fr: La taille d'anomalie de tramage ({0}) dépasse le quota.
it: Le dimensioni dell'errore di framing ({0}) superano la quota.
ja: フレーム フォールトのサイズ ({0}) がクォータを超えています。
ko: 프레이밍 오류 크기({0})가 할당량을 초과합니다.
pl: Rozmiar błędu ramki ({0}) przekracza limit przydziału.
pt_br: O tamanho da falha de enquadramento ({0}) excede a cota.
tr: Çerçeveleme hata boyutu ({0}) kotayı aşıyor.
zh_hans: 组帧错误大小({0})超过配额。
zh_hant: 框架處理錯誤大小 ({0}) 超出配額。

# FramingFaultUnrecognized
source: Server faulted with code '{0}'.
cs: Server selhal s kódem {0}.
de: Fehler beim Server. Code: "{0}".
es: El servidor generó un error con el código "{0}".
fr: Erreur sur le serveur avec le code '{0}'.
it: Errore del server con codice '{0}'.
ja: コード '{0}' のサーバー エラーが発生しました。
ko: '{0}' 코드로 서버에 오류가 발생했습니다.
pl: Serwer zwrócił błąd o kodzie „{0}”.
pt_br: Falha de servidor com o código '{0}'.
tr: Sunucu '{0}' koduyla hatalı sonlandırıldı.
zh_hans: 服务器错误，代码“{0}”。
zh_hant: 伺服器發生錯誤，代碼 '{0}'。

# FramingMaxMessageSizeExceeded
source: The maximum message size quota for incoming messages has been exceeded for the remote channel. See the server logs for more details.
cs: Maximální kvóta velikosti zprávy pro příchozí zprávy byla u vzdáleného kanálu překročena. Další informace naleznete v protokolech serveru.
de: Das Kontingent für die maximale Nachrichtengröße für eingehende Nachrichten wurde für den Remotekanal überschritten. Weitere Details finden Sie in den Serverprotokollen.
es: Se superó la cuota máxima de tamaño para los mensajes entrantes en el canal remoto. Consulte los registros del servidor para obtener más información.
fr: Le quota de taille maximale des messages entrants a été dépassé pour le canal distant. Pour plus d'informations, consultez les journaux du serveur.
it: La quota massima delle dimensioni per i messaggi in arrivo è stata superata per il canale remoto. Per maggiori dettagli, vedere i log del server.
ja: リモート チャネルに対する、受信メッセージの最大メッセージ サイズ クォータを超えました。詳細については、サーバー ログを参照してください。
ko: 원격 채널에 대해 들어오는 메시지의 최대 메시지 크기 할당량을 초과했습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Maksymalny przydział rozmiaru komunikatu dla komunikatów przychodzących został przekroczony dla kanału zdalnego. Aby uzyskać więcej informacji, zobacz dzienniki serwera.
pt_br: A cota de tamanho máximo para mensagens de entrada foi excedida para o canal remoto. Consulte os logs do servidor para obter mais detalhes.
tr: Gelen iletiler için en büyük ileti boyutu kotası, uzak kanal için aşıldı. Daha fazla ayrıntı için sunucu günlüklerine bakın.
zh_hans: 传入消息的最大消息大小配额已超出远程通道的相应配额。有关详细信息，请参见服务器日志。
zh_hant: 已超出遠端通道內送郵件的訊息大小配額上限。如需詳細資訊，請參閱伺服器記錄檔。

# FramingModeNotSupported
source: Framing mode {0} is not supported.
cs: Režim rámců {0} není podporován.
de: Der Rahmenmodus {0} wird nicht unterstützt.
es: No se admite el modo de tramas {0}.
fr: Le mode de tramage {0} n'est pas pris en charge.
it: La modalità di framing {0} non è supportata.
ja: フレーム モード {0} はサポートされていません。
ko: {0} 프레이밍 모드는 지원되지 않습니다.
pl: Tryb ramek {0} nie jest obsługiwany.
pt_br: Não há suporte para o modo de enquadramento {0}.
tr: Çerçeveleme modu {0} desteklenmiyor.
zh_hans: 不支持组帧模式 {0}。
zh_hant: 不支援框架處理模式 {0}。

# FramingModeNotSupportedFault
source: The .Net Framing mode being used is not supported by '{0}'. See the server logs for more details.
cs: Použitý režim rámců systému .Net {0} nepodporuje. Další informace naleznete v protokolech serveru.
de: Der verwendete .NET Framework-Modus wird nicht von "{0}" unterstützt. Weitere Details finden Sie in den Serverprotokollen.
es: El modo de tramas .Net que se está usando no es compatible con "{0}". Consulte los registros del servidor para obtener más información.
fr: Le mode de tramage .Net utilisé n'est pas pris en charge par '{0}'. Pour plus d'informations, consultez les journaux du serveur.
it: La modalità di .NET Framing usata non è supportata da '{0}'. Per maggiori dettagli, vedere i log del server.
ja: 使用中の .NET Framing モードは、'{0}' ではサポートされていません。詳細については、サーバー ログを参照してください。
ko: 사용 중인 .NET 프레이밍 모드가 '{0}'에서 지원되지 않습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Używany tryb .Net Framing nie jest obsługiwany przez element „{0}”. Aby uzyskać więcej informacji, zobacz dzienniki serwera.
pt_br: O modo do .Net Framing em uso não tem suporte do '{0}'. Consulte os logs do servidor para obter mais detalhes.
tr: Kullanılan .Net Framing modu '{0}' tarafından desteklenmiyor. Daha fazla ayrıntı için sunucu günlüklerine bakın.
zh_hans: “{0}”不支持正在使用的 .Net Framing 模式。有关详细信息，请参见服务器日志。
zh_hant: '{0}' 不支援目前正使用的 .Net Framing 模式。請參閱伺服器記錄檔，以取得詳細資料。

# FramingPrematureEOF
source: More data was expected, but EOF was reached.
cs: Byla očekávána další data, ale došlo k dosažení konce souboru.
de: Es wurden weitere Daten erwartet, jedoch wurde das Dateiende (EOF) erreicht.
es: Se esperaban más datos pero se llegó al final del archivo.
fr: Davantage de données étaient attendues, mais la fin du fichier (EOF) a été atteinte.
it: Erano previsti più dati, ma è stata raggiunta la fine del file.
ja: さらに多くのデータが予期されていましたが、EOF が検出されました。
ko: 추가 데이터가 필요하지만 EOF에 도달했습니다.
pl: Oczekiwano większej ilości danych, ale napotkano znacznik końca pliku.
pt_br: Mais dados eram esperados, mas o EOF foi atingido.
tr: Daha fazla veri bekleniyordu, ancak dosya sonuna gelindi.
zh_hans: 需要更多数据，但已到达文件结尾。
zh_hant: 應要要有更多資料，但已達到 EOF。

# FramingRecordTypeMismatch
source: Expected record type '{0}', found '{1}'.
cs: Byl očekáván typ záznamu {0}, nalezen byl {1}.
de: Der Datensatztyp "{0}" wurde erwartet, gefunden wurde "{1}".
es: Se esperaba el tipo de registro "{0}", pero se encontró "{1}".
fr: Type d'enregistrement attendu '{0}', type trouvé '{1}'.
it: È previsto il tipo di record '{0}', ma è stato trovato '{1}'.
ja: 予期されたレコードの種類は '{0}' ですが、検出された種類は '{1}' でした。
ko: 레코드 형식 '{0}'이 필요하지만 '{1}'을(를) 찾았습니다.
pl: Oczekiwano rekordu typu „{0}”, a znaleziono typ „{1}”.
pt_br: Tipo de registro esperado '{0}', encontrado '{1}'.
tr: Beklenen kayıt türü: '{0}', bulunan: '{1}'.
zh_hans: 需要记录类型“{0}”，找到“{1}”。
zh_hant: 記錄類型應為 '{0}'，但找到 '{1}'。

# FramingSizeTooLarge
source: Specified size is too large for this implementation.
cs: Určený rozměr je pro tuto implementaci příliš veliký.
de: Die angegebene Größe ist zu groß für diese Implementierung.
es: El tamaño especificado es demasiado grande para esta implementación.
fr: La taille spécifiée est trop grande pour cette implémentation.
it: Le dimensioni specificate sono eccessive per questa implementazione.
ja: 指定されたサイズはこの実装には大きすぎます。
ko: 지정한 크기가 너무 커서 이 구현에 맞지 않습니다.
pl: Określony rozmiar jest za duży dla tej implementacji.
pt_br: O tamanho especificado é muito grande para esta implementação.
tr: Belirtilen boyut bu uygulama için çok büyük.
zh_hans: 为该实现指定的大小过大。
zh_hant: 指定大小對此實作而言太大。

# FramingUpgradeInvalid
source: The requested upgrade is not supported by '{0}'. This could be due to mismatched bindings (for example security enabled on the client and not on the server).
cs: Požadovaný upgrade {0} nepodporuje. Příčinou je pravděpodobně neshoda vazeb (například v klientu je zabezpečení povoleno, na serveru nikoli ).
de: Das angeforderte Upgrade wird von "{0}" nicht unterstützt. Dies kann auf nicht übereinstimmende Bindungen zurückzuführen sein (wenn beispielsweise die Sicherheit auf dem Client und nicht auf dem Server aktiviert ist).
es: La actualización solicitada no es compatible con "{0}". Puede deberse a enlaces no coincidentes (por ejemplo, que la seguridad esté habilitada en el cliente pero no en el servidor).
fr: La mise à jour demandée n'est pas prise en charge par '{0}'. Ceci peut être dû à des liaisons non correspondantes (par exemple à sécurité activée sur le client, mais pas sur le serveur).
it: L'aggiornamento richiesto non è supportato da '{0}'. I binding potrebbero non corrispondere, ad esempio la sicurezza potrebbe essere abilitata nel client ma non nel server.
ja: 要求されたアップグレードは '{0}' ではサポートされていません。これは、バインドの不一致が原因である可能性があります。たとえば、セキュリティがクライアント側では有効になっていても、サーバー側では無効になっている場合などにこの問題が発生します。
ko: 요청한 업그레이드가 '{0}'에서 지원되지 않습니다. 이것은 일치하지 않는 바인딩 때문일 수 있습니다(예를 들어, 클라이언트에서 보안이 사용되지만 서버에서는 사용되지 않은 경우).
pl: Żądane uaktualnienie nie jest obsługiwane przez element „{0}”. Może to być spowodowane niezgodnymi powiązaniami (na przykład zabezpieczenia są włączone tylko po stronie klienta, a nie na serwerze).
pt_br: A atualização solicitada não tem suporte de '{0}'. Isso pode ter ocorrido devido a associações incompatíveis (por exemplo, segurança habilitada no cliente e não habilitada no servidor).
tr: İstenen sürüm yükseltme '{0}' tarafından desteklenmiyor. Bunun nedeni eşleşmeyen bağlamalar olabilir (örneğin, istemcide etkinleştirilen güvenlik, sunucuda etkinleştirilmemiş olabilir).
zh_hans: “{0}”不支持请求的升级。这可能是由于绑定不匹配(例如，在客户端上启用了安全设置，而在服务器上未启用)造成的。
zh_hant: '{0}' 不支援要求的升級。這可能是因為繫結不相符所造成 (例如，用戶端有啟用安全性，但伺服器則否)。

# FramingValueNotAvailable
source: The value cannot be accessed because it has not yet been fully decoded.
cs: K hodnotě není přístup, protože dosud nebyla plně dekódována.
de: Auf den Wert kann nicht zugegriffen werden, weil er noch nicht vollständig decodiert wurde.
es: No se puede tener acceso al valor porque todavía no se descodificó completamente.
fr: Impossible d'accéder à la valeur, car elle n'a pas encore été entièrement décodée.
it: Non è possibile accedere al valore perché non è stato ancora decodificato completamente.
ja: 完全にデコードされていないため、値にアクセスできません。
ko: 아직 완전히 디코딩되지 않았기 때문에 값에 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do wartości, ponieważ nie została ona jeszcze w całości zdekodowana.
pt_br: Não é possível acessar o valor porque ele não foi totalmente decodificado.
tr: Henüz tam olarak kodu çözülmemiş olduğundan, değer erişilemez durumda.
zh_hans: 无法访问该值，因为它尚未完全解码。
zh_hant: 無法存取值，因為尚未完全解碼。

# FramingVersionNotSupported
source: Framing major version {0} is not supported.
cs: Hlavní verze rámců {0} není podporována.
de: Die Rahmenhauptversion {0} wird nicht unterstützt.
es: No se admite la versión principal de tramas {0}.
fr: La version principale du tramage {0} n'est pas prise en charge.
it: La versione principale {0} di Framing non è supportata.
ja: フレームのメジャー バージョン {0} はサポートされていません。
ko: 프레이밍 주 버전 {0}이(가) 지원되지 않습니다.
pl: Wersja główna {0} ramek nie jest obsługiwana.
pt_br: Não há suporte para a versão principal de enquadramento {0}.
tr: {0} çerçeve ana sürümü desteklenmiyor.
zh_hans: 不支持组帧主版本 {0}。
zh_hant: 不支援框架處理主要版本 {0}。

# FramingVersionNotSupportedFault
source: The .Net Framing version being used is not supported by '{0}'. See the server logs for more details.
cs: Použitou verzi rámců systému .Net {0} nepodporuje. Další informace naleznete v protokolech serveru.
de: Die verwendete .NET Framework-Version wird nicht von "{0}" unterstützt. Weitere Details finden Sie in den Serverprotokollen.
es: La versión de tramas .Net que se está usando no es compatible con "{0}". Consulte los registros del servidor para obtener más información.
fr: La version du tramage .Net utilisée n'est pas prise en charge par '{0}'. Pour plus d'informations, consultez les journaux du serveur.
it: La versione di .NET Framing in uso non è supportata da '{0}'. Per maggiori dettagli, vedere i log del server.
ja: 使用中の .NET Framing のバージョンは '{0}' ではサポートされていません。詳細については、サーバー ログを参照してください。
ko: 사용 중인 .NET 프레이밍 버전이 '{0}'에서 지원되지 않습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Używana wersja programu .Net Framing nie jest obsługiwana przez element „{0}”. Aby uzyskać więcej informacji, zobacz dzienniki serwera.
pt_br: A versão do .Net Framing em uso não tem suporte do '{0}'. Consulte os logs do servidor para obter mais detalhes.
tr: Kullanılan .Net Framing sürümü '{0}' tarafından desteklenmiyor. Daha fazla ayrıntı için sunucu günlüklerine bakın.
zh_hans: “{0}”不支持正在使用的 .Net Framing 版本。有关详细信息，请参见服务器日志。
zh_hant: '{0}' 不支援目前正在使用的 .Net Framing 版本。請參閱伺服器記錄檔，以取得詳細資料。

# FramingViaNotUri
source: The framing via ({0}) is not a valid URI.
cs: Rámce při ({0}) nejsou platným identifikátorem URI.
de: Der Umleitungswert des Rahmens ({0}) ist kein gültiger URI.
es: La vía de tramas ({0}) no es un identificador URI válido.
fr: Le via de tramage ({0}) n'est pas un URI valide.
it: L'elemento via di framing ({0}) non è un URI valido.
ja: フレーム VIA ({0}) は有効な URI ではありません。
ko: 프레이밍 via({0})가 유효한 URI가 아닙니다.
pl: Ramka przechodząca przez punkt pośredni ({0}) nie jest prawidłowym identyfikatorem URI.
pt_br: O enquadramento via ({0}) não é um URI válido.
tr: ({0}) çerçeveleme geçerli bir URI değil.
zh_hans: 组帧中转({0})不是有效的 URI。
zh_hant: 框架處理 via ({0}) 不是有效的 URI。

# FramingViaTooLong
source: The framing via size ({0}) exceeds the quota.
cs: Rámce při ({0}) přesahují kvótu.
de: Die Umleitungsröße des Rahmens ({0}) überschreitet das Kontingent.
es: El tamaño de vía de tramas ({0}) supera la cuota.
fr: La taille de via de tramage ({0}) dépasse le quota.
it: Le dimensioni dell'elemento via di framing ({0}) superano la quota.
ja: フレーム VIA のサイズ ({0}) がクォータを超えています。
ko: 프레이밍 via 크기({0})가 할당량을 초과합니다.
pl: Rozmiar ramki przechodzącej przez punkt pośredni ({0}) przekracza limit przydział.
pt_br: O tamanho da rota de enquadramento ({0}) excede a cota.
tr: Boyut ({0}) ile çerçevelemede kota aşılıyor.
zh_hans: 组帧中转大小({0})超过配额。
zh_hant: 框架處理 via 大小 ({0}) 超出配額。

# FramingViaTooLongFault
source: Via '{0}' is too long to be processed by the remote host. See the server logs for more details.
cs: Cesta {0} je pro zpracování vzdáleným hostitelem příliš dlouhá. Další informace naleznete v protokolech serveru.
de: Die Umleitung "{0}" kann vom Remotehost nicht verarbeitet werden, da sie zu lang ist. Weitere Details finden Sie in den Serverprotokollen.
es: La vía "{0}" es demasiado larga para que la procese el host remoto. Consulte los registros del servidor para obtener más información.
fr: Le via '{0}' est trop long pour être traité par l'hôte distant. Pour plus d'informations, consultez les journaux du serveur.
it: L'elemento Via '{0}' è eccessivo per essere elaborato dall'host remoto. Per maggiori dettagli, vedere i log del server.
ja: 経由 '{0}' は長すぎるため、リモート ホストで処理することができません。詳細については、サーバー ログを参照してください。
ko: Via '{0}'이(가)가 너무 길어서 원격 호스트가 처리할 수 없습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Punkt pośredni „{0}” jest za długi do przetworzenia przez hosta zdalnego. Aby uzyskać więcej informacji, zobacz dzienniki serwera.
pt_br: A rota '{0}' é muito longa para ser processada pelo host remoto. Consulte os logs do servidor para obter mais detalhes.
tr: '{0}' yolu, uzak konak tarafından işlenemeyecek kadar uzun. Daha fazla ayrıntı için sunucu günlüklerine bakın.
zh_hans: 中转“{0}”过长，远程主机无法处理。有关详细信息，请参见服务器日志。
zh_hant: via '{0}' 太長，遠端主機無法處理。如需詳細資訊，請參閱伺服器記錄檔。

# GenericCallbackException
source: A user callback threw an exception. Check the exception stack and inner exception to determine the callback that failed.
cs: Při zpětném volání uživatele došlo k výjimce. Podle zásobníku výjimky a informací o vnitřní výjimce určete, které zpětné volání selhalo.
de: Ein Benutzerrückruf hat eine Ausnahme ausgelöst. Prüfen Sie den Ausnahmestapel und die innere Ausnahme, um den Rückruf zu ermitteln, bei dem ein Fehler aufgetreten ist.
es: La devolución de llamada de un usuario inició una excepción. Compruebe la pila de la excepción y la excepción interna para averiguar la devolución de llamada donde se produjo el error.
fr: Un rappel d'utilisateur a généré une exception. Vérifiez la pile d'exception et l'exception interne pour identifier le rappel non réussi.
it: Un callback utente ha generato un'eccezione. Controllare lo stack dell'eccezione e l'eccezione interna per determinare il callback interessato dal problema.
ja: ユーザー コールバックが例外をスローしました。例外スタックや内部例外を確認して、失敗したコールバックを特定してください。
ko: 사용자 콜백에서 예외가 발생했습니다. 예외 스택 및 내부 예외를 점검하여 오류가 있는 콜백을 확인하세요.
pl: Wywołanie zwrotne użytkownika zgłosiło wyjątek. Sprawdź stos wyjątków i wewnętrzny wyjątek w celu określenia wywołania zwrotnego, które zakończyło się niepowodzeniem.
pt_br: O retorno de chamada de usuário gerou uma exceção. Verifique a pilha de exceção e a exceção interna para determinar o retorno de chamada com falha.
tr: Kullanıcı geri çağırması özel bir durum oluşturdu. Özel durum yığınını ve iç özel durumu denetleyerek başarısız olan geri çağırmayı belirleyin.
zh_hans: 用户回调引发异常。请检查异常堆栈和内部异常，以确定失败的回调。
zh_hant: 使用者回呼擲回例外狀況。請檢查例外狀況堆疊及內部例外狀況，以判斷失敗的回呼。

# HeaderAlreadyNotUnderstood
source: The message header with name '{0}' and namespace '{1}' is not present in the set of understood headers.
cs: Záhlaví zprávy s názvem {0} a oborem názvů {1} se v sadě srozumitelných záhlaví nenachází.
de: Der Nachrichtenheader mit dem Namen "{0}" und dem Namespace "{1}" ist nicht im Satz der bekannten Header vorhanden.
es: El encabezado de mensaje con el nombre "{0}" y el espacio de nombres "{1}" no está presente en el conjunto de encabezados entendidos.
fr: L'en-tête de message dont le nom est '{0}' et l'espace de noms '{1}' n'est pas présent dans l'ensemble des en-têtes compris.
it: L'intestazione del messaggio denominato '{0}' con spazio dei nomi '{1}' non è presente nel set di intestazioni riconosciute.
ja: 名前が '{0}'、名前空間が '{1}' のメッセージ ヘッダーが、一連の解読されたヘッダーにありません。
ko: 이름 '{0}' 및 네임스페이스 '{1}'을(를) 가진 메시지 헤더가 인식된 헤더 집합에 없습니다.
pl: Nagłówek komunikatu z nazwą „{0}” i przestrzenią nazw „{1}” nie należy do zbioru rozpoznawanych nagłówków.
pt_br: O cabeçalho da mensagem com nome '{0}' e namespace '{1}' não está presente no conjunto de cabeçalhos compreendidos.
tr: '{0}' adlı ve '{1}' ad alanına sahip ileti üst bilgisi, anlaşılan üst bilgi kümesinde yok.
zh_hans: 具有名称“{0}”和命名空间“{1}”的消息标头未位于已识别的标头集中。
zh_hant: 在已知的標頭集中沒有名稱為 '{0}' 且命名空間為 '{1}' 的訊息標頭。

# HeaderAlreadyUnderstood
source: The message header with name '{0}' and namespace '{1}' is already present in the set of understood headers.
cs: Záhlaví zprávy s názvem {0} a oborem názvů {1} se již v sadě srozumitelných záhlaví vyskytuje.
de: Der Nachrichtenheader mit dem Namen "{0}" und dem Namespace "{1}" ist bereits im Satz der bekannten Header vorhanden.
es: El encabezado de mensaje con el nombre "{0}" y el espacio de nombres "{1}" ya está presente en el conjunto de encabezados entendidos.
fr: L'en-tête de message dont le nom est '{0}' et l'espace de noms '{1}' est déjà présent dans l'ensemble des en-têtes compris.
it: L'intestazione del messaggio denominato '{0}' con spazio dei nomi '{1}' è già presente nel set di intestazioni riconosciute.
ja: 名前が '{0}'、名前空間が '{1}' のメッセージ ヘッダーが、一連の解読されたヘッダーに既にあります。
ko: 이름 '{0}' 및 네임스페이스 '{1}'을(를) 가진 메시지 헤더가 인식된 헤더 집합에 이미 있습니다.
pl: Nagłówek komunikatu z nazwą „{0}” i przestrzenią nazw „{1}” znajduje się już w zbiorze rozpoznawanych nagłówków.
pt_br: O cabeçalho da mensagem com nome '{0}' e namespace '{1}' já está presente no conjunto de cabeçalhos compreendidos.
tr: '{0}' adlı ve '{1}' ad alanına sahip ileti üst bilgisi, zaten anlaşılan üst bilgi kümesinde bulunuyor.
zh_hans: 具有名称“{0}”和命名空间“{1}”的消息标头已位于已识别的标头集中。
zh_hant: 在已知的標頭集中已經有名稱為 '{0}' 且命名空間為 '{1}' 的訊息標頭。

# HeaderNotFound
source: There is not a header with name {0} and namespace {1} in the message.
cs: Záhlaví s názvem {0} a oborem názvů {1} se ve zprávě nevyskytuje.
de: In der Nachricht ist kein Header mit dem Namen "{0}" und dem Namespace "{1}" vorhanden.
es: No hay un encabezado con el nombre {0} y el espacio de nombres {1} en el mensaje.
fr: Il n'existe aucun en-tête dont le nom est {0} et l'espace de noms {1} dans le message.
it: Nel messaggio non è presente alcuna intestazione denominata {0} con spazio dei nomi {1}.
ja: 名前が {0}、名前空間が {1} のヘッダーがメッセージにありません。
ko: 이름 {0} 및 네임스페이스 {1}을(를) 가진 헤더가 메시지에 없습니다.
pl: W komunikacie nie występuje nagłówek o nazwie „{0}” i przestrzeni nazw „{1}”.
pt_br: Não há cabeçalho com nome {0} e namespace {1} na mensagem.
tr: İletide {0} adlı ve {1} ad alanına sahip bir üst bilgi yok.
zh_hans: 消息中不存在具有名称 {0} 和命名空间 {1} 的标头。
zh_hant: 訊息中沒有名稱為 {0} 且命名空間為 {1} 的標頭。

# HeadersCannotBeAddedToEnvelopeVersion
source: Envelope Version '{0}' does not support adding Message Headers.
cs: Verze obálky {0} nepodporuje přidávání záhlaví zpráv.
de: Die Umschlagversion "{0}" unterstützt das Hinzufügen von Nachrichtenheadern nicht.
es: La versión de sobre "{0}" no admite la posibilidad de agregar encabezados de mensaje.
fr: La version d'enveloppe '{0}' ne prend pas en charge l'ajout d'en-têtes de message.
it: La versione '{0}' di Envelope non supporta l'aggiunta di intestazioni dei messaggi.
ja: エンベロープ バージョン '{0}' はメッセージ ヘッダーの追加をサポートしていません。
ko: 봉투 버전 '{0}'이(가) 메시지 헤더 추가를 지원하지 않습니다.
pl: Wersja „{0}” schematu Envelope nie obsługuje dodawania nagłówków komunikatów.
pt_br: A Versão de Envelope '{0}' não dá suporte à adição de Cabeçalhos de Mensagem.
tr: '{0}' Zarf Sürümü, Message Headers eklemeyi desteklemiyor.
zh_hans: 信封版本“{0}”不支持添加消息标头。
zh_hant: 信封版本 '{0}' 不支援新增訊息標頭。

# Hosting_ServiceActivationFailed
source: The requested service, '{0}' could not be activated. See the server's diagnostic trace logs for more information.
cs: Požadovanou službu {0} nebylo možné aktivovat. Další informace naleznete v protokolech trasování diagnostiky serveru.
de: Der angeforderte Dienst "{0}" konnte nicht aktiviert werden. Weitere Informationen finden Sie in den Diagnose-Ablaufverfolgungsprotokollen des Servers.
es: No se pudo activar el servicio solicitado, "{0}". Consulte los registros de seguimiento de diagnóstico del servidor para obtener más información.
fr: Le service demandé '{0}' n'a pas pu être activé. Pour plus d'informations, consultez les journaux de trace de diagnostic du serveur.
it: Non è stato possibile attivare il servizio richiesto '{0}'. Per altre informazioni, vedere i log di traccia di diagnostica del server.
ja: 要求されたサービス '{0}' をアクティブ化できませんでした。詳細については、サーバーの診断トレース ログを参照してください。
ko: 요청된 서비스 '{0}'을(를) 활성화할 수 없습니다. 자세한 내용은 서버의 진단 추적 로그를 참조하세요.
pl: Nie można aktywować żądanej usługi „{0}”. Więcej informacji można znaleźć w dziennikach śledzenia serwera.
pt_br: Não foi possível ativar o serviço solicitado, '{0}'. Consulte os logs de rastreamento de diagnóstico do servidor para obter mais informações.
tr: '{0}' istenen hizmeti etkinleştirilemedi. Daha fazla bilgi için sunucunun tanı koyma izleme günlüklerine bakın.
zh_hans: 无法激活请求的服务“{0}”。有关详细信息，请参见服务器的诊断跟踪日志。
zh_hant: 無法啟動要求的服務 '{0}'。如需詳細資訊，請參閱伺服器的診斷追蹤記錄檔。
