Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# MessageHeaderIsNull0
source: The value of the addressHeaders argument is invalid because the collection contains null values. Null is not a valid value for the AddressHeaderCollection.
cs: Hodnota argumentu třídy addressHeaders je neplatná, protože kolekce obsahuje hodnoty NULL. NULL není platná hodnota pro třídu AddressHeaderCollection.
de: Der Wert des addressHeaders-Arguments ist ungültig, da die Sammlung NULL-Werte enthält. NULL ist kein gültiger Wert für die AddressHeaderCollection.
es: El valor del argumento addressHeaders no es válido porque la colección contiene valores nulos. Los valores nulos no son válidos para AddressHeaderCollection.
fr: La valeur de l'argument addressHeaders est non valide, car la collection contient des valeurs null. Une valeur null est une valeur non valide pour la collection AddressHeaderCollection.
it: Il valore dell'argomento addressHeaders non è valido perché la raccolta contiene valori Null. Null non è un valore valido per l'elemento AddressHeaderCollection.
ja: コレクションに null 値が含まれているため、addressHeaders 引数の値は無効です。null は、AddressHeaderCollection の有効な値ではありません。
ko: 컬렉션에 null 값이 포함되어 있기 때문에 addressHeaders 인수의 값이 잘못되었습니다. Null은 AddressHeaderCollection에 대해 유효한 값이 아닙니다.
pl: Wartość argumentu addressHeaders jest nieprawidłowa, ponieważ kolekcja zawiera wartości null. Wartość null nie jest prawidłowa w przypadku elementu AddressHeaderCollection.
pt_br: O valor do argumento addressHeaders é inválido porque a coleção contém valores nulos. Nulo não é um valor válido para AddressHeaderCollection.
tr: Koleksiyonda boş değerler olduğundan addressHeaders bağımsız değişkeninin değeri geçersiz. Null, AddressHeaderCollection için geçerli bir değer değildir.
zh_hans: AddressHeader 参数的值无效，因为该集合包含空值。空值不是 AddressHeaderCollection 的有效值。
zh_hant: addressHeaders 引數的值無效，因為集合包含 null 值。Null 不是 AddressHeaderCollection 的有效值。

# MessageHeaderVersionMismatch
source: The version of the header(s) ({0}) differs from the version of the message ({1}).
cs: Verze záhlaví ({0}) se liší od verze zprávy ({1}).
de: Diese Version des Headers/der Header ({0}) unterscheidet sich von der Version der Nachricht ({1}).
es: La versión de los encabezados ({0}) difiere de la versión del mensaje ({1}).
fr: La version de l'en-tête ou des en-têtes ({0}) diffère de la version du message ({1}).
it: La versione dell'intestazione o delle intestazioni ({0}) è diversa da quella del messaggio ({1}).
ja: ヘッダーのバージョン ({0}) とメッセージのバージョン ({1}) が異なっています。
ko: 헤더 버전({0})이 메시지 버전({1})과 다릅니다.
pl: Wersja nagłówków ({0}) różni się od wersji wiadomości ({1}).
pt_br: A versão dos cabeçalhos ({0}) difere da versão da mensagem ({1}).
tr: Üst bilgi sürümü ({0}), ileti sürümünden ({1}) farklıdır.
zh_hans: 标头的版本({0})与消息的版本({1})不同。
zh_hant: 標頭 ({0}) 的版本與訊息 ({1}) 的版本不同。

# MessageHeaderVersionNotSupported
source: The '{0}' header cannot be added because it does not support the specified message version '{1}'.
cs: Záhlaví {0} nelze přidat, protože nepodporuje určenou verzi zprávy {1}.
de: Der Header "{0}" kann nicht hinzugefügt werden, weil er die angegebene Nachrichtenversion "{1}" nicht unterstützt.
es: El encabezado "{0}" no se puede agregar porque no admite la versión de mensaje especificada "{1}".
fr: L'en-tête '{0}' ne peut pas être ajouté, car il ne prend pas en charge la version '{1}' spécifiée pour le message.
it: Non è possibile aggiungere l'intestazione '{0}' perché non supporta la versione del messaggio specificata '{1}'.
ja: '{0}' ヘッダーは指定されたメッセージ エンベロープのバージョン '{1}' をサポートしていないため、このヘッダーを追加することはできません。
ko: '{0}' 헤더는 지정한 메시지 버전 '{1}'을(를) 지원하지 않기 때문에 추가할 수 없습니다.
pl: Nie można dodać nagłówka „{0}”, ponieważ nie obsługuje on określonej wersji wiadomości „{1}”.
pt_br: Não é possível adicionar o cabeçalho '{0}' porque ele não dá suporte à versão de mensagem especificada '{1}'.
tr: Belirtilen '{1}' ileti sürümünü desteklemediğinden '{0}' üst bilgisi eklenemiyor.
zh_hans: 无法添加“{0}”标头，因为它不支持指定的消息版本“{1}”。
zh_hant: 無法新增 '{0}' 標頭，因為其不支援指定的訊息版本 '{1}'。

# MessageIsEmpty
source: The body of the message cannot be read because it is empty.
cs: Text zprávy nelze přečíst, protože je prázdný.
de: Der Textkörper der Nachricht kann nicht gelesen werden, da er leer ist.
es: El cuerpo del mensaje no se puede leer porque está vacío.
fr: Le corps du message ne peut pas être lu, car il est vide.
it: Non è possibile leggere il corpo del messaggio perché è vuoto.
ja: メッセージの本文が空のため、読み取れません。
ko: 메시지 본문이 비어 있기 때문에 읽을 수 없습니다.
pl: Nie można odczytać treści wiadomości, ponieważ jest pusta.
pt_br: Não é possível ler o corpo da mensagem porque ele está vazio.
tr: Boş olduğundan ileti gövdesi okunamıyor.
zh_hans: 无法读取消息正文，因为该消息为空。
zh_hant: 訊息的內文空白，因此無法讀取。

# MessageNumberRollover
source: The maximum message number for this sequence has been exceeded. The reliable session was faulted.
cs: Maximální počet zpráv pro toto pořadí byl překročen. Ve stabilní relaci došlo k chybě.
de: Die maximale Nachrichtenanzahl für diese Sequenz wurde überschritten. Die zuverlässige Sitzung war nicht erfolgreich.
es: Se superó el número máximo de mensajes para esta secuencia. Se generó un error en la sesión confiable.
fr: Le nombre maximal de messages pour cette séquence a été dépassé. La session fiable a généré une erreur.
it: È stato superato il numero massimo di messaggi per questa sequenza. La sessione affidabile non è riuscita.
ja: このシーケンスの最大メッセージ番号を超えました。信頼できるセッションは途中終了されました。
ko: 이 시퀀스의 최대 메시지 수를 초과했습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Maksymalna liczba wiadomości w tej sekwencji została przekroczona. Wystąpił błąd niezawodnej sesji.
pt_br: O número máximo de mensagens para esta sequência foi excedido. Falha na sessão confiável.
tr: Bu sıradaki ileti sayısı üst sınırı aşıldı. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 已超过此序列的最大消息数。可靠会话出错。
zh_hant: 已超出此序列的訊息數目上限。可靠工作階段發生錯誤。

# MessageNumberRolloverFaultReason
source: The maximum value for wsrm:MessageNumber has been exceeded.
cs: Maximální hodnota pro třídu wsrm:MessageNumber byla překročena.
de: Der maximale Wert für "wsrm:MessageNumber" wurde überschritten.
es: Se superó el valor máximo para wsrm:MessageNumber.
fr: La valeur maximale pour wsrm:MessageNumber a été dépassée.
it: Superato il valore massimo per wsrm:MessageNumber.
ja: wsrm:MessageNumber の最大値を超えました。
ko: wsrm:MessageNumber의 최대값을 초과했습니다.
pl: Maksymalna wartość elementu wsrm:MessageNumber została przekroczona.
pt_br: O valor máximo para wsrm:MessageNumber foi excedido.
tr: wsrm:MessageNumber en büyük değeri aşıldı.
zh_hans: 已超过 wsrm:MessageNumber 的最大值。
zh_hant: 已超出 wsrm:MessageNumber 的最大值。

# MessagePropertiesArraySize0
source: The array passed does not have enough space to hold all the properties contained by this collection.
cs: Předané pole nemá dostatek prostoru k udržení všech vlastností obsažených v této kolekci.
de: Das übergebene Array verfügt nicht über genug Platz, um alle in dieser Sammlung enthaltenen Eigenschaften aufzunehmen.
es: La matriz pasada no tiene suficiente espacio para todas las propiedades que contiene esta colección.
fr: Le tableau passé n'a pas suffisamment d'espace pour contenir toutes les propriétés contenues dans cette collection.
it: La matrice passata non contiene spazio sufficiente per tutte le proprietà incluse in questa raccolta.
ja: 渡された配列には、このコレクションに含まれるすべてのプロパティを保持するだけの容量がありません。
ko: 전달된 배열이 이 컬렉션에 포함된 모든 속성을 보유할 수 있는 충분한 공간이 없습니다.
pl: W przekazanej tablicy nie ma wystarczającej ilości miejsca na właściwości zawarte w tej kolekcji.
pt_br: A matriz passada não tem espaço suficiente para conter todas as propriedades incluídas na coleção.
tr: Geçirilen dizide bu koleksiyonda bulunan özelliklerin tümünü tutacak yeterli yer yok.
zh_hans: 传递的数组空间不足，无法容纳此集合包含的全部属性。
zh_hant: 傳送的陣列空間不足，無法保留此集合所包含的所有屬性。

# MessagePropertyNotFound
source: A property with the name '{0}' is not present.
cs: Vlastnost s názvem {0} není přítomna.
de: Eine Eigenschaft mit dem Namen "{0}" ist nicht vorhanden.
es: No hay una propiedad con el nombre "{0}".
fr: Une propriété nommée '{0}' est absente.
it: Non è presente alcuna proprietà denominata '{0}'.
ja: 名前が '{0}' のプロパティが指定されていません。
ko: 이름이 '{0}'인 속성이 없습니다.
pl: Nie istnieje właściwość o nazwie „{0}”.
pt_br: Uma propriedade denominada '{0}' não está presente.
tr: '{0}' adlı bir özellik yok.
zh_hans: 名为“{0}”的属性不存在。
zh_hant: 沒有名為 '{0}' 的屬性。

# MessagePropertyReturnedNullCopy
source: The IMessageProperty could not be copied. CreateCopy returned null.
cs: Třídu IMessageProperty nebylo možné zkopírovat. Třída CreateCopy vrátila hodnotu NULL.
de: Die IMessageProperty kann nicht kopiert werden. CreateCopy hat NULL zurückgegeben.
es: No se pudo copiar IMessageProperty. CreateCopy devolvió un valor nulo.
fr: Impossible de copier la propriété IMessageProperty. CreateCopy a retourné une valeur null.
it: Non è stato possibile copiare l'elemento IMessageProperty. CreateCopy ha restituito Null.
ja: IMessageProperty をコピーできませんでした。CreateCopy から null が返されました。
ko: IMessageProperty를 복사할 수 없습니다. CreateCopy가 null을 반환했습니다.
pl: Nie można skopiować elementu IMessageProperty. Element CreateCopy zwrócił wartość null.
pt_br: Não foi possível copiar IMessageProperty. O método CreateCopy retornou um valor nulo.
tr: IMessageProperty kopyalanamadı. CreateCopy null döndürdü.
zh_hans: 无法复制 IMessageProperty。CreateCopy 返回 null。
zh_hant: 無法複製 IMessageProperty。CreateCopy 已傳回 null。

# MessageProtectionOrderMismatch
source: The received message does not meet the required message protection order '{0}'.
cs: Přijatá zpráva neodpovídá požadovanému pořadí ochrany zprávy {0}.
de: Die empfangene Nachricht entspricht nicht der erforderlichen Nachrichten-Schutzreihenfolge "{0}".
es: El mensaje recibido no cumple la orden de protección de mensajes requerida '{0}'.
fr: Le message reçu ne satisfait pas à l'ordre de protection des messages requis '{0}'.
it: Il messaggio ricevuto non soddisfa l'ordine di protezione messaggi richiesto '{0}'.
ja: 受信したメッセージが、必要なメッセージ保護命令 '{0}' に準拠していません。
ko: 수신한 메시지가 필수 메시지 보호 순서 '{0}'을(를) 충족하지 않습니다.
pl: Odebrana wiadomość nie spełnia wymaganego porządku ochrony wiadomości „{0}”.
pt_br: A mensagem recebida não atende à ordem de proteção de mensagens necessária '{0}'.
tr: Alınan ileti, gerekli '{0}' ileti koruma sırasını karşılamıyor.
zh_hans: 接收的消息不符合所需消息保护顺序“{0}”。
zh_hant: 收到的訊息不符合必要的訊息保護順序 '{0}'。

source: Message security verification failed.
cs: Ověření zabezpečení zprávy se nezdařilo.
de: Fehler bei der Nachrichtensicherheitsüberprüfung.
es: Error de comprobación de seguridad de mensajes.
fr: La vérification de la sécurité du message a échoué.
it: Verifica sicurezza dei messaggi non riuscita.
ja: メッセージ セキュリティの検証が失敗しました。
ko: 메시지 보안을 확인하지 못했습니다.
pl: Nie można zweryfikować zabezpieczeń wiadomości.
pt_br: Falha na verificação de segurança da mensagem.
tr: İleti güvenliği doğrulaması başarısız oldu.
zh_hans: 消息安全验证失败。
zh_hant: 訊息安全性驗證失敗。

# MessageSecurityVersionOutOfRange
source: SecurityVersion must be WsSecurity10 or WsSecurity11.
cs: Třída SecurityVersion musí být WsSecurity10 nebo WsSecurity11.
de: SecurityVersion muss WsSecurity10 oder WsSecurity11 sein.
es: SecurityVersion debe ser WsSecurity10 o WsSecurity11.
fr: SecurityVersion doit être WsSecurity10 ou WsSecurity11.
it: Il valore di SecurityVersion deve essere WsSecurity10 o WsSecurity11.
ja: SecurityVersion は WsSecurity10 または WsSecurity11 である必要があります。
ko: SecurityVersion이 WsSecurity10 또는 WsSecurity11이어야 합니다.
pl: Element SecurityVersion musi być elementem WsSecurity10 lub WsSecurity11.
pt_br: SecurityVersion deve ser WsSecurity10 ou WsSecurity11.
tr: SecurityVersion, WsSecurity10 ya da WsSecurity11 olmalıdır.
zh_hans: SecurityVersion 必须为 WsSecurity10 或 WsSecurity11。
zh_hant: SecurityVersion 必須是 WsSecurity10 或 WsSecurity11。

# MessageTextEncodingNotSupported
source: The text encoding '{0}' used in the text message format is not supported.
cs: Kódování textu {0} použité ve formátu textové zprávy není podporováno.
de: Die im Textnachrichtenformat verwendete Textcodierung "{0}" wird nicht unterstützt.
es: No se admite la codificación de texto "{0}" usada en el formato de mensaje de texto.
fr: L'encodage de texte '{0}' utilisé dans le format du message texte n'est pas pris en charge.
it: La codifica di testo '{0}' usata nel formato del messaggio di testo non è supportata.
ja: テキスト メッセージ形式に使用されているテキスト エンコード '{0}' はサポートされていません。
ko: 텍스트 메시지 형식에 사용되는 텍스트 인코딩 '{0}'이(가) 지원되지 않습니다.
pl: Kodowanie tekstu „{0}” użyte w formacie wiadomości tekstowej nie jest obsługiwane.
pt_br: Não há suporte para a codificação de texto '{0}' usada no formato da mensagem de texto.
tr: Metin iletisi biçiminde kullanılan '{0}' metin kodlaması biçimi desteklenmiyor.
zh_hans: 文本消息格式中使用的文本编码“{0}”不受支持。
zh_hant: 不支援文字訊息格式中使用的文字編碼 '{0}'。

# MessageVersionMissingFromBinding
source: None of the binding elements in binding '{0}' define a message version. At least one binding element must define a message version and return it from the GetProperty<MessageVersion> method.
cs: Žádný z elementů vazby ve vazbě {0} nedefinuje verzi zprávy. Alespoň jeden element vazby musí určovat verzi zprávy a vrátit ji z metody třídy GetProperty<MessageVersion>.
de: Keines der Bindungselemente in der Bindung "{0}" definiert eine Nachrichtenversion. Mindestens ein Bindungselement muss eine Nachrichtenversion definieren und diese von der GetProperty<MessageVersion>-Methode zurückgeben.
es: Ninguno de los elementos de enlace en el enlace "{0}" define una versión de mensaje. Al menos un elemento de enlace debe definir una versión de mensaje y devolverla desde el método GetProperty<MessageVersion>.
fr: Aucun des éléments de liaison de la liaison '{0}' ne définit une version de message. Au moins un élément de liaison doit définir une version de message et la retourner depuis la méthode GetProperty<MessageVersion>.
it: Nessuno degli elementi di binding nel binding '{0}' definisce una versione di messaggio. Almeno un elemento di binding deve definire una versione di messaggio e restituirla dal metodo GetProperty<MessageVersion>.
ja: バインド '{0}' には、メッセージ バージョンを定義しているバインド要素がありません。少なくとも 1 つのバインド要素がメッセージ バージョンを定義して、GetProperty<MessageVersion> メソッドから戻す必要があります。
ko: 바인딩 '{0}'의 바인딩 요소가 메시지 버전을 정의하지 않습니다. 최소한 하나 이상의 바인딩 요소가 메시지 버전을 정의하고 해당 버전을 GetProperty<MessageVersion> 메서드에서 반환해야 합니다.
pl: Żaden z elementów wiążących w powiązaniu „{0}” nie definiuje wersji wiadomości. Co najmniej jeden element powiązania musi definiować wersję wiadomości i zwracać ją w metodzie GetProperty<MessageVersion>.
pt_br: Nenhum dos elementos de associação na associação '{0}' define uma versão de mensagem. Pelo menos um elemento de associação deve definir uma versão de mensagem e retorná-la com base no método GetProperty<MessageVersion>.
tr: '{0}' bağlamasındaki bağlama öğelerinde ileti sürümü tanımlanmıyor. En az bir bağlama öğesi bir ileti sürümü tanımlamalıdır ve bunu GetProperty<MessageVersion> metodundan döndürmelidir.
zh_hans: 绑定“{0}”中没有用于定义消息版本的绑定元素。必须至少有一个绑定元素定义消息版本并从 GetProperty<MessageVersion> 方法返回消息版本。
zh_hant: 繫結 '{0}' 中沒有任何繫結元素定義了訊息版本。至少要有一個繫結元素定義訊息版本，並從 GetProperty<MessageVersion> 方法傳回該版本。

# MessageVersionUnknown
source: Unrecognized message version.
cs: Nerozpoznaná verze zprávy
de: Unbekannte Nachrichtenversion.
es: Versión de mensaje no reconocida.
fr: Version de message non reconnue.
it: Versione di messaggio non riconosciuta.
ja: メッセージのバージョンが不明です。
ko: 인식할 수 없는 메시지 버전입니다.
pl: Nierozpoznana wersja wiadomości.
pt_br: Versão de mensagem não reconhecida.
tr: Tanınmayan ileti sürümü.
zh_hans: 消息版本无法识别。
zh_hant: 無法辨識的訊息版本。

# MessageXmlProtocolError
source: There is a problem with the XML that was received from the network. See inner exception for more details.
cs: Došlo k potížím s formátem XML, který byl přijat ze sítě. Další informace naleznete v popisu vnitřní výjimky.
de: Es ist ein Problem mit dem vom Netzwerk empfangenen XML aufgetreten. Weitere Informationen finden Sie in der inneren Ausnahme.
es: Hay un problema con el XML que se recibió de la red. Consulte la excepción interna para obtener más información.
fr: Un problème s'est produit avec le code XML qui a été reçu du réseau. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un problema con il codice XML ricevuto dalla rete. Per maggiori dettagli, vedere l'eccezione interna.
ja: ネットワークから受信した XML に問題があります。詳細については、内部例外を参照してください。
ko: 네트워크에서 수신한 XML에 문제가 있습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił problem z plikiem XML odebranym z sieci. Aby uzyskać szczegółowe informacje, zobacz wyjątek wewnętrzny.
pt_br: Há um problema com o XML recebido da rede. Consulte a exceção interna para obter mais detalhes.
tr: Ağdan alınan XML ile ilgili bir sorun var. Daha fazla ayrıntı için iç özel duruma bakın.
zh_hans: 从网络接收的 XML 存在问题。有关详细信息，请参见内部异常。
zh_hant: 從網路接收的 XML 發生問題。如需詳細資訊，請參閱內部例外狀況。

# MimeContentTypeHeaderInvalid
source: Invalid MIME content-type header encountered on read.
cs: Při čtení se vyskytla neplatná hlavička MIME pro typ obsahu.
de: Ungültiger MIME-Inhaltstyp-Header beim Lesen gefunden.
es: Se encontró un encabezado Content-Type de MIME no válido al leer.
fr: En-tête content-type MIME détecté à la lecture.
it: Trovata intestazione MIME content-type non valida durante la lettura.
ja: 読み込みの際に、無効な MIME content-type ヘッダーが検出されました。
ko: 읽는 동안 잘못된 MIME content-type 헤더를 발견했습니다.
pl: Podczas odczytu napotkano nieprawidłowy nagłówek MIME Content-Type.
pt_br: Cabeçalho tipo conteúdo MIME inválido encontrado na leitura.
tr: Okumada geçersiz MIME içerik türü üst bilgiyle karşılaşıldı.
zh_hans: 读取时遇到的 MIME Content-type 标头无效。
zh_hant: 讀取時遇到無效的 MIME Content-Type 標頭。

# MimeHeaderInvalidCharacter
source: Character '{0}' (hexadecimal value 0x{1}) not valid in MIME header.
cs: Znak {0} (hodnota v šestnáctkové soustavě 0x{1}) není v hlavičce MIME platný.
de: Zeichen "{0}" (Hexadezimalwert 0x{1}) ist im MIME-Header ungültig.
es: El carácter '{0}' (valor hexadecimal 0x{1}) no es válido en un encabezado MIME.
fr: Caractère '{0}' (valeur hexadécimale 0x{1}) non valide dans l'en-tête MIME.
it: Carattere '{0}' (valore esadecimale 0x{1}) non valido nell'intestazione MIME.
ja: 文字 '{0}' (16 進数の 0x{1}) は、MIME ヘッダーでは無効です。
ko: '{0}' 문자(16진수 값 0x{1})가 MIME 헤더에서 유효하지 않습니다.
pl: Znak „{0}” (wartość szesnastkowa 0x{1}) jest nieprawidłowy w nagłówku MIME.
pt_br: Caractere '{0}' (valor hexadecimal 0x{1}) inválido no cabeçalho MIME.
tr: '{0}' karakteri (altılı sistem değeri 0x{1}) MIME üst bilgisinde geçerli değil.
zh_hans: 字符“{0}”(十六进制值 0x{1})在 MIME 标头中无效。
zh_hant: MIME 標頭中的字元 '{0}' (十六進位值 0x{1}) 無效。

# MimeMessageGetContentStreamCalledAlready
source: Content stream can be retrieved from MIME message only once.
cs: Stream obsahu se dá ze zprávy MIME načíst jenom jednou.
de: Der Inhaltsdatenstrom kann nur einmal aus der MIME-Nachricht abgerufen werden.
es: La secuencia de contenido solo se puede recuperar el mensaje MIME una vez.
fr: Le flux de contenu n'est récupérable qu'une seule fois du message MIME.
it: Il flusso di contenuto può essere recuperato dal messaggio MIME una sola volta.
ja: コンテンツ ストリームは、MIME メッセージから 1 度だけ取得できます。
ko: 콘텐츠 스트림을 MIME 메시지에서 한 번만 검색할 수 있습니다.
pl: Strumień zawartości można pobrać z komunikatu MIME tylko raz.
pt_br: O fluxo de conteúdo pode ser recuperado da mensagem MIME apenas uma vez.
tr: İçerik akışı MIME iletisinden yalnızca bir kez alınabilir.
zh_hans: 只能从 MIME 消息检索一次内容流。
zh_hant: 只能從 MIME 訊息擷取內容資料流一次。

# MimeReaderHeaderAlreadyExists
source: '{0}' MIME header is specified multiple times.
cs: Hlavička MIME {0} je zadaná víckrát.
de: Ein {0}-MIME-Header wurde mehrmals angegeben.
es: El encabezado MIME '{0}' se especificó varias veces.
fr: L'en-tête MIME '{0}' est spécifié plusieurs fois.
it: Intestazione MIME '{0}' specificata più volte.
ja: '{0}' MIME ヘッダーが複数回指定されています。
ko: '{0}' MIME 헤더가 여러 번 지정되었습니다.
pl: Nagłówek MIME „{0}” jest określony wielokrotnie.
pt_br: Cabeçalho '{0}' MIME está especificado várias vezes.
tr: '{0}' MIME üst bilgisi birkaç kez belirtilmiş.
zh_hans: 已多次指定“{0}”MIME 标头。
zh_hant: '{0}' MIME 標頭被指定多次。

# MimeReaderMalformedHeader
source: Malformed header.
cs: Chybně vytvořená hlavička
de: Fehlerhaft formatierter Header.
es: Encabezado mal formado.
fr: En-tête mal formé
it: Intestazione non valida.
ja: ヘッダーの形式が正しくありません。
ko: 헤더의 형식이 잘못되었습니다.
pl: Źle sformułowany nagłówek.
pt_br: Cabeçalho malformado.
tr: Hatalı biçimlendirilmiş üst bilgi.
zh_hans: 标头格式不正确。
zh_hant: 標頭的格式不正確。

# MimeReaderResetCalledBeforeEOF
source: Reset called on MIME header reader before end of file.
cs: U čtecí funkce hlavičky MIME se volal reset před koncem souboru.
de: MIME-Reader wurde beim Lesen eines Headers vor dem Erreichen des Dateiendes zurückgesetzt.
es: Se llamó al método Reset del lector del encabezado MIME antes del final del archivo.
fr: Appel de Reset sur le lecteur de l'en-tête MIME avant la fin du fichier.
it: Reimpostazione richiesta dal lettore dell'intestazione MIME prima della fine del file.
ja: ファイルの終わりの前に、MIME ヘッダー リーダー上で Reset が呼び出されました。
ko: 파일의 끝에 도달하기 전에 MIME 헤더 판독기에서 Reset이 호출되었습니다.
pl: Wywołano zresetowanie czytnika nagłówka MIME przed końcem pliku.
pt_br: Redefinir chamada na leitora de cabeçalho MIME antes do fim de arquivo.
tr: Dosya sonundan önce MIME üst bilgisi okuyucusunda Reset işlevi çağrıldı.
zh_hans: 文件结束之前，在 MIME 标头读取器上调用重置。
zh_hant: 在檔案結束之前便在 MIME 標頭上呼叫重設。

# MimeReaderTruncated
source: Unexpected end of file.
cs: Neočekávaný konec souboru
de: Unerwartetes Dateiende.
es: Final de archivo inesperado.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりです。
ko: 예기치 않은 파일의 끝입니다.
pl: Nieoczekiwany koniec pliku.
pt_br: Final de arquivo inesperado.
tr: Beklenmeyen dosya sonu.
zh_hans: 意外的文件尾。
zh_hant: 未預期的檔案結尾。

# MimeVersionHeaderInvalid
source: Invalid mime-version header encountered on read.
cs: Při čtení se vyskytla neplatná hlavička mime-version.
de: Beim Lesen wurde ein Header mit ungültiger MIME-Version gefunden.
es: Durante la lectura, se encontró un encabezado de versión MIME no válido.
fr: En-tête avec version MIME non valide détecté durant la lecture.
it: Trovata intestazione mime-version non valida durante la lettura.
ja: 読み取りの際に、無効な Mime-Version ヘッダーが検出されました。
ko: 읽는 동안 잘못된 mime-version 헤더를 발견했습니다.
pl: Podczas odczytu napotkano nieprawidłowy nagłówek wersji MIME.
pt_br: Cabeçalho versão mime inválido encontrado na leitora.
tr: Okumada geçersiz mime sürümü üst bilgi ile karşılaşıldı.
zh_hans: 读取时遇到的 MIME 版本的标头无效。
zh_hant: 讀取時遇到無效的 MIME-Version 標頭。

# MimeWriterInvalidStateForClose
source: Cannot call Close on MIME writer in state '{0}'.
cs: U zapisovače MIME ve stavu {0} nejde volat Close.
de: "Close" kann für MIME-Writer im Zustand "{0}" nicht aufgerufen werden.
es: No se puede realizar la llamada al método Close en un escritor MIME con el estado '{0}'.
fr: Impossible d'appeler Close sur l'enregistreur MIME dans l'état '{0}'.
it: Impossibile chiamare Close sul writer MIME nello stato '{0}'.
ja: 状態が '{0}' のときは、MIME ライター上で Close を呼び出すことはできません。
ko: '{0}' 상태에서 MIME 작성기에 Close를 호출할 수 없습니다.
pl: Nie można wywołać zamknięcia modułu zapisującego MIME w stanie „{0}”.
pt_br: Não é possível chamar Fechar no gravador MIME no estado '{0}'.
tr: '{0}' durumunda MIME yazarında Close çağrılamaz.
zh_hans: 无法在“{0}”状态下调用 MIME 编写器上的 Close。
zh_hant: 處於狀態 '{0}' 時無法在 MIME 寫入器上呼叫 Close。
