Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxContractInheritanceRequiresInterfaces2
source: The service class of type {0} both defines a ServiceContract and inherits a ServiceContract from type {1}. Contract inheritance can only be used among interface types. If a class is marked with ServiceContractAttribute, then another service class cannot derive from it.
cs: Třída služby typu {0} definuje třídu ServiceContract a dědí třídu ServiceContract z typu {1}. Dědičnost kontraktů lze použít pouze mezi typy rozhraní. Pokud má třída označení ServiceContractAttribute, nemůže se od ní odvozovat jiná třída služby.
de: Die Dienstklasse vom Typ {0} definiert einen ServiceContract und erbt einen ServiceContract vom Typ {1}. Die Vertragsvererbung kann nur unter Schnittstellentypen verwendet werden. Wenn eine Klasse mit ServiceContractAttribute markiert ist, kann ein anderer Dienst nicht von ihr abgeleitet werden.
es: La clase de servicio de tipo {0} define ServiceContract y hereda ServiceContract a partir del tipo {1}. La herencia de contratos solo se puede usar entre tipos de interfaz. Si una clase está marcada con el atributo ServiceContractAttribute, no se puede derivar de ella otra clase de servicio.
fr: La classe de service de type {0} définit un ServiceContract et hérite d'un ServiceContract du type {1}. L'héritage de contrat est utilisable uniquement parmi les types d'interface. Si une classe est marquée avec ServiceContractAttribute, alors une autre classe de service ne peut pas en dériver.
it: La classe del servizio di tipo {0} definisce ed eredita allo stesso tempo un elemento ServiceContract dal tipo {1}. L'ereditarietà del contratto può essere usata solo tra i tipi di interfaccia. Se una classe è contrassegnata con ServiceContractAttribute, un'altra classe del servizio non può derivare da esso.
ja: 型 {0} のサービス クラスは ServiceContract を定義していると共に、型 {1} から ServiceContract を継承しています。コントラクトの継承は、インターフェイスの型の間でのみ使用できます。クラスに ServiceContractAttribute が設定されている場合は、別のサービス クラスはこのクラスから派生できません。
ko: {0} 형식의 서비스 클래스는 ServiceContract를 정의함과 동시에 {1} 형식에서 ServiceContract를 상속합니다. 인터페이스 형식 간에만 계약 상속을 사용할 수 있습니다. 클래스가 ServiceContractAttribute로 표시되어 있으면 이 클래스에서 다른 서비스 클래스가 파생될 수 없습니다.
pl: Klasa usług typu {0} jednocześnie definiuje obiekt ServiceContract i dziedziczy go z typu {1}. Dziedziczenie kontraktów jest możliwe tylko między typami interfejsów. Jeśli klasa jest oznaczona przy użyciu atrybutu ServiceContractAttribute, inne klasy usług nie mogą od niej pochodzić.
pt_br: A classe de serviço do tipo {0} define um ServiceContract e herda um ServiceContract do tipo {1}. A herança de contrato só pode ser usada entre tipos de interface. Se uma classe está marcada com ServiceContractAttribute, então, outra classe de serviço não pode derivar dela.
tr: {0} türü hizmet sınıfı, hem bir ServiceContract tanımlar hem de {1} türünden bir ServiceContract devralır. Anlaşma devralma yalnızca arabirim türleri arasında kullanılabilir. Bir sınıf ServiceContractAttribute ile işaretlenmişse, bundan başka bir hizmet sınıfı türetilemez.
zh_hans: 类型 {0} 的服务类定义 ServiceContract 并从类型 {1} 中继承 ServiceContract。协定继承只能在接口类型之间使用。如果使用 ServiceContractAttribute 标记某个类，则另一服务类无法从该类继承。
zh_hant: 類型 {0} 的服務類別同時定義 ServiceContract 並繼承類型 {1} 的 ServiceContract。合約繼承只能用於介面類型。若類別標示有 ServiceContractAttribute，便無法自該類別衍生其他服務類別。

# SFxCopyToRequiresICollection
source: SynchronizedReadOnlyCollection's CopyTo only works if the underlying list implements ICollection.
cs: Třída CopyTo třídy SynchronizedReadOnlyCollection funguje pouze tehdy, pokud nadřazený seznam implementuje třídu ICollection.
de: CopyTo von SynchronizedReadOnlyCollection funktioniert nur, wenn die zugrunde liegende Liste lCollection implementiert.
es: CopyTo de SynchronizedReadOnlyCollection solo funciona si la lista subyacente implementa ICollection.
fr: CopyTo de SynchronizedReadOnlyCollection fonctionne uniquement si la liste sous-jacente implémente ICollection.
it: L'elemento CopyTo di SynchronizedReadOnlyCollection funziona solo se l'elenco sottostante implementa ICollection.
ja: SynchronizedReadOnlyCollection の CopyTo は、基になる一覧によって ICollection が実装されている場合のみ機能します。
ko: SynchronizedReadOnlyCollection의 CopyTo는 기본 목록이 ICollection을 구현하는 경우에만 작동합니다.
pl: Metoda CopyTo klasy SynchronizedReadOnlyCollection działa jedynie, gdy podstawowa lista implementuje interfejs ICollection.
pt_br: O método CopyTo da classe SynchronizedReadOnlyCollection só funciona se a lista subjacente implementa ICollection.
tr: SynchronizedReadOnlyCollection CopyTo işlevi, yalnızca arka plandaki liste ICollection öğesini uygularsa çalışır.
zh_hans: SynchronizedReadOnlyCollection 的 CopyTo 仅在基础列表实现 Icollection 时才工作。
zh_hant: SynchronizedReadOnlyCollection 的 CopyTo 只有在其下的清單實作 ICollection 時，才有作用。

# SFxCreateDuplexChannel1
source: The callback contract of contract {0} either does not exist or does not define any operations. If this is not a duplex contract, consider using ChannelFactory instead of DuplexChannelFactory.
cs: Kontrakt zpětného volání kontraktu {0} neexistuje nebo nedefinuje žádné operace. Pokud se nejedná o duplexní kontrakt, zvažte použití třídy ChannelFactory namísto třídy DuplexChannelFactory.
de: Der Rückrufvertrag des Vertrags {0} ist entweder nicht vorhanden oder definiert keine Vorgänge. Wenn es sich nicht um einen Duplexvertrag handelt, können Sie ggf. ChannelFactory anstelle von DuplexChannelFactory verwenden.
es: El contrato de devolución de llamada del contrato {0} no existe o no define ninguna operación. Si no se trata de un contrato dúplex, considere la posibilidad de usar ChannelFactory en lugar de DuplexChannelFactory.
fr: Le contrat de rappel du contrat {0} n'existe pas ou ne définit aucune opération. S'il ne s'agit pas d'un contrat duplex, utilisez ChannelFactory au lieu de DuplexChannelFactory.
it: Il contratto di callback del contratto {0} non esiste o non definisce operazioni. Se non si tratta di un contratto duplex, provare a usare ChannelFactory invece di DuplexChannelFactory.
ja: コントラクト {0} のコールバック コントラクトは存在していないか、またはどの操作も定義していません。これが二重のコントラクトでない場合は、DuplexChannelFactory の代わりに ChannelFactory を使用してください。
ko: {0} 계약의 콜백 계약이 존재하지 않거나 작업을 정의하지 않습니다. 이 계약이 이중 계약이 아니면, DuplexChannelFactory 대신 ChannelFactory를 사용해 보세요.
pl: Kontrakt wywołania zwrotnego kontraktu {0} albo nie istnieje, albo nie definiuje żadnych operacji. Jeśli nie jest to kontrakt dupleksowy, spróbuj użyć elementu ChannelFactory zamiast elementu DuplexChannelFactory.
pt_br: O contrato do retorno de chamada do contrato {0} não existe ou não define nenhuma operação. Se esse não for um contrato duplex, considere usar a ChannelFactory em vez da DuplexChannelFactory.
tr: {0} anlaşması geri çağrı anlaşması, mevcut değil ya da herhangi bir işlem tanımlamıyor. Bu çift yönlü bir anlaşma değilse, DuplexChannelFactory yerine ChannelFactory kullanmayı deneyin.
zh_hans: 协定 {0} 的回拨协定不存在，或者未定义任何操作。如果这不是双工协定，请考虑使用 ChannelFactory 而不是 DuplexChannelFactory。
zh_hant: 合約 {0} 的回呼合約不存在或未定義任何作業。若此非雙工合約，請考慮使用 ChannelFactory 來取代 DuplexChannelFactory。

# SFxCreateDuplexChannelBadCallbackUserObject
source: The InstanceContext provided to the ChannelFactory contains a UserObject that does not implement the CallbackContractType '{0}'.
cs: Třída InstanceContext poskytnutá třídě ChannelFactory obsahuje třídu UserObject, která neimplementuje třídu CallbackContractType {0}.
de: Der für die ChannelFactory bereitgestellte InstanceContext enthält ein UserObject, das nicht den CallbackContractType "{0}" implementiert.
es: El elemento InstanceContext proporcionado a ChannelFactory contiene UserObject que no implementa CallbackContractType "{0}".
fr: InstanceContext fourni à ChannelFactory contient un UserObject qui n'implémente pas CallbackContractType '{0}'.
it: L'elemento InstanceContext fornito a ChannelFactory contiene un elemento UserObject che non implementa l'elemento CallbackContractType '{0}'.
ja: ChannelFactory に提供された InstanceContext には、CallbackContractType '{0}' を実装しない UserObject が含まれています。
ko: ChannelFactory에 제공된 InstanceContext에 CallbackContractType '{0}'을(를) 구현하지 않는 UserObject가 포함되어 있습니다.
pl: Obiekt InstanceContext przekazany do elementu ChannelFactory zawiera element UserObject, który nie implementuje właściwości CallbackContractType „{0}”.
pt_br: A InstanceContext fornecida para a ChannelFactory contém um UserObject que não implementa a propriedade CallbackContractType '{0}'.
tr: ChannelFactory öğesine sağlanan InstanceContext, CallbackContractType '{0}' öğesini uygulamayan bir UserObject içeriyor.
zh_hans: 向 ChannelFactory 提供的 InstanceContext 包含未实现 CallbackContractType“{0}”的 UserObject。
zh_hant: 提供給 ChannelFactory 的 InstanceContext 包含未實作 CallbackContractType '{0}' 的 UserObject。

# SFxCreateDuplexChannelNoCallback
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the DuplexChannelFactory was not initialized with an InstanceContext. Please call the CreateChannel overload that takes an InstanceContext.
cs: Přetížení CreateChannel nelze vyvolat v této instanci třídy DuplexChannelFactory, protože třída DuplexChannelFactory nebyla inicializována s třídou InstanceContext. Vyvolejte přetížení CreateChannel, které převezme třídu InstanceContext.
de: Diese CreateChannel-Überladung kann nicht für diese Instanz von DuplexChannelFactory aufgerufen werden, da die DuplexChannelFactory nicht mit einem InstanceContext initialisiert wurde. Rufen Sie die CreateChannel-Überladung auf, die einen InstanceContext akzeptiert.
es: No se puede llamar a esta sobrecarga CreateChannel en esta instancia de DuplexChannelFactory, ya que DuplexChannelFactory no se inicializó con InstanceContext. Llame a la sobrecarga CreateChannel que toma InstanceContext.
fr: Cette surcharge CreateChannel ne peut pas être appelée sur cette instance de DuplexChannelFactory, car DuplexChannelFactory n'a pas été initialisé avec InstanceContext. Appelez la surcharge CreateChannel qui accepte un InstanceContext.
it: Non è possibile chiamare questo overload di CreateChannel su questa istanza di DuplexChannelFactory perché DuplexChannelFactory non è stato inizializzato con un elemento InstanceContext. Chiamare l'overload di CreateChannel che accetta un elemento InstanceContext.
ja: DuplexChannelFactory が InstanceContext を使用して初期化されなかったため、この CreateChannel オーバーロードをこの DuplexChannelFactory インスタンスで呼び出せません。InstanceContext を受け取る CreateChannel オーバーロードを呼び出してください。
ko: DuplexChannelFactory가 InstanceContext로 초기화되지 않았으므로 DuplexChannelFactory의 이 인스턴스에서 이 CreateChannel 오버로드를 호출할 수 없습니다. InstanceContext를 가져오는 CreateChannel 오버로드를 호출하세요.
pl: Nie można wywołać tego przeciążenia metody CreateChannel dla tego wystąpienia obiektu DuplexChannelFactory, ponieważ obiekt DuplexChannelFactory nie został zainicjowany przy użyciu typu InstanceContext. Użyj takiego wywołania przeciążenia metody CreateChannel, które przyjmuje argument typu InstanceContext.
pt_br: Esta sobrecarga do CreateChannel não pode ser chamada na instância de DuplexChannelFactory, porque a DuplexChannelFactory foi inicializada como um InstanceContext. Chame a sobrecarga de CreateChannel que recebe um InstanceContext.
tr: Bu CreateChannel aşırı yükü, DuplexChannelFactory bir InstanceContext ile başlatılmadığından, DuplexChannelFactory öğesinin bu örneğinde çağrılamıyor. Bir InstanceContext alan CreateChannel yükünü çağırın.
zh_hans: 无法在此 DuplexChannelFactory 实例上调用此 CreateChannel 重载，因为未使用 InstanceContext 初始化 DuplexChannelFactory。请调用使用 InstanceContext 的 CreateChannel 重载。
zh_hant: 未以 InstanceContext 初始化 DuplexChannelFactory，因此無法在此 DuplexChannelFactory 執行個體呼叫 CreateChannel 多載。請呼叫接受 InstanceContext 的 CreateChannel 多載。

# SFxCreateDuplexChannelNoCallback1
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the DuplexChannelFactory was initialized with a Type and no valid InstanceContext was provided. Please call the CreateChannel overload that takes an InstanceContext.
cs: Přetížení CreateChannel nelze vyvolat v této instanci třídy DuplexChannelFactory, protože třída DuplexChannelFactory nebyla inicializována typem a nebyla poskytnuta platná třída InstanceContext. Vyvolejte přetížení CreateChannel, které převezme třídu InstanceContext.
de: Diese CreateChannel-Überladung kann nicht für diese DuplexChannelFactory-Instanz aufgerufen werden, da die DuplexChannelFactory mit einem Typ initialisiert wurde und kein gültiger InstanceContext bereitgestellt wurde. Rufen Sie die CreateChannel-Überladung auf, die einen InstanceContext akzeptiert.
es: No se puede llamar a esta sobrecarga CreateChannel en esta instancia de DuplexChannelFactory, ya que DuplexChannelFactory se inicializó con Type y no se proporcionó ningún InstanceContext válido. Llame a la sobrecarga CreateChannel que toma InstanceContext.
fr: Cette surcharge CreateChannel ne peut pas être appelée sur cette instance de DuplexChannelFactory, car DuplexChannelFactory a été initialisé avec un Type et aucun InstanceContext valide n'a été fourni. Appelez la surcharge CreateChannel qui accepte un InstanceContext.
it: Non è possibile chiamare questo overload di CreateChannel su questa istanza di DuplexChannelFactory perché DuplexChannelFactory è stato inizializzato con un tipo e non è stato fornito un elemento InstanceContext valido. Chiamare l'overload di CreateChannel che accetta un elemento InstanceContext.
ja: この CreateChannel オーバーロードをこの DuplexChannelFactory インスタンスで呼び出せません。原因は、Type を使用して DuplexChannelFactory が初期化されて、有効な InstanceContext が指定されなかったためです。InstanceContext を受け取る CreateChannel オーバーロードを呼び出してください。
ko: DuplexChannelFactory가 Type으로 초기화되고 유효한 InstanceContext가 제공되지 않았으므로 DuplexChannelFactory의 이 인스턴스에서 이 CreateChannel 오버로드를 호출할 수 없습니다. InstanceContext를 가져오는 CreateChannel 오버로드를 호출하세요.
pl: Nie można wywołać tego przeciążenia metody CreateChannel dla tego wystąpienia obiektu DuplexChannelFactory, ponieważ obiekt DuplexChannelFactory został zainicjowany typem, a nie podano poprawnego obiektu InstanceContext. Użyj takiego wywołania przeciążenia metody CreateChannel, które przyjmuje argument typu InstanceContext.
pt_br: Esta sobrecarga do CreateChannel não pode ser chamada na instância de DuplexChannelFactory, porque a DuplexChannelFactory foi inicializada com um Tipo e nenhum InstanceContext válido foi fornecido. Chame a sobrecarga de CreateChannel que recebe um InstanceContext.
tr: Bu CreateChannel aşırı yükü, DuplexChannelFactory bir Type ile başlatıldığından ve geçerli InstanceContext sağlanmadığından, DuplexChannelFactory öğesinin bu örneğinde çağrılamıyor. Bir InstanceContext alan CreateChannel yükünü çağırın.
zh_hans: 无法在此 DuplexChannelFactory 实例上调用此 CreateChannel 重载，因为未使用类型初始化 DuplexChannelFactory，而且未提供有效的 InstanceContext。请调用使用 InstanceContext 的 CreateChannel 重载。
zh_hant: 以 Type 初始化 DuplexChannelFactory 且未提供有效的 InstanceContext，因此無法在此 DuplexChannelFactory 執行個體呼叫 CreateChannel 多載。請呼叫接受 InstanceContext 的 CreateChannel 多載。

# SFxCreateDuplexChannelNoCallbackUserObject
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the InstanceContext provided to the DuplexChannelFactory does not contain a valid UserObject.
cs: Přetížení CreateChannel nelze vyvolat v této instanci třídy DuplexChannelFactory, protože třída InstanceContext poskytnutá třídě DuplexChannelFactory neobsahuje platnou třídu UserObject.
de: Diese CreateChannel-Überladung kann nicht für diese Instanz von DuplexChannelFactory aufgerufen werden, da der für die DuplexChannelFactory bereitgestellte InstanceContext kein gültiges UserObject enthält.
es: No se puede llamar a esta sobrecarga CreateChannel en esta instancia de DuplexChannelFactory, ya que el valor InstanceContext proporcionado a DuplexChannelFactory no contiene un elemento UserObject válido.
fr: Cette surcharge CreateChannel ne peut pas être appelée sur cette instance de DuplexChannelFactory, car le InstanceContext fourni à DuplexChannelFactory ne contient pas de UserObject valide.
it: Non è possibile chiamare questo overload di CreateChannel su quest'istanza di DuplexChannelFactory perché l'elemento InstanceContext fornito per DuplexChannelFactory non contiene un elemento UserObject valido.
ja: DuplexChannelFactory に渡された InstanceContext に有効な UserObject が含まれていないため、この CreateChannel オーバーロードをこの DuplexChannelFactory インスタンスで呼び出せません。
ko: DuplexChannelFactory에 제공된 InstanceContext에 유효한 UserObject가 없으므로 DuplexChannelFactory의 이 인스턴스에서 이 CreateChannel 오버로드를 호출할 수 없습니다.
pl: Nie można wywołać tego przeciążenia metody CreateChannel dla tego wystąpienia obiektu DuplexChannelFactory, ponieważ obiekt InstanceContext przekazany do obiektu DuplexChannelFactory nie zawiera poprawnego obiektu UserObject.
pt_br: Esta sobrecarga do CreateChannel não pode ser chamada na instância de DuplexChannelFactory, porque o InstanceContext fornecido para a DuplexChannelFactory não contém um UserObject válido.
tr: Bu CreateChannel aşırı yükü, DuplexChannelFactory öğesine sağlanan InstanceContext geçerli bir UserObject içermediğinden, DuplexChannelFactory öğesinin bu örneğinde çağrılamıyor.
zh_hans: 无法在此 DuplexChannelFactory 实例上调用此 CreateChannel 重载，因为向 DuplexChannelFactory 提供的 InstanceContext 不包含有效的 UserObject。
zh_hant: 提供給 DuplexChannelFactory 的 InstanceContext 未包含有效的 UserObject，因此無法在此 DuplexChannelFactory 執行個體呼叫 CreateChannel 多載。

# SFxCreateNonDuplexChannel1
source: ChannelFactory does not support the contract {0} as it defines a callback contract with one or more operations. Please consider using DuplexChannelFactory instead of ChannelFactory.
cs: Třída ChannelFactory nepodporuje kontrakt {0}, protože definuje kontrakt zpětného volání s jednou nebo více operacemi. Zvažte prosím použití třídy DuplexChannelFactory namísto třídy ChannelFactory.
de: ChannelFactory unterstützt den Vertrag {0} nicht, da er einen Rückrufvertrag mit mindestens einem Vorgang definiert. Verwenden Sie ggf. DuplexChannelFactory anstelle von ChannelFactory.
es: ChannelFactory no admite el contrato {0} porque define un contrato de devolución de llamada con una o varias operaciones. Considere la posibilidad de usar DuplexChannelFactory en lugar de ChannelFactory.
fr: ChannelFactory ne prend pas en charge le contrat {0}, car il contient un contrat de rappel avec une ou plusieurs opérations. Utilisez DuplexChannelFactory au lieu de ChannelFactory.
it: ChannelFactory non supporta il contratto {0} perché definisce un contratto di callback con una o più operazioni. Provare a usare DuplexChannelFactory invece di ChannelFactory.
ja: コントラクト {0} は 1 つ以上の操作が含まれたコールバック コントラクトを定義しているため、ChannelFactory はこのコントラクトをサポートしていません。ChannelFactory の代わりに DuplexChannelFactory を使用してください。
ko: ChannelFactory는 작업이 둘 이상인 콜백 계약을 정의하므로 {0} 계약을 지원하지 않습니다. ChannelFactory 대신 DuplexChannelFactory를 사용해 보세요.
pl: Obiekt ChannelFactory nie obsługuje kontraktu {0}, ponieważ definiuje on kontrakt wywołania zwrotnego z jedną lub wieloma operacjami. Spróbuj użyć obiektu DuplexChannelFactory zamiast obiektu ChannelFactory.
pt_br: Não há suporte para o contrato {0} em ChannelFactory porque ele define um contrato do retorno de chamada com uma ou mais operações. Considere usar DuplexChannelFactory em vez de ChannelFactory.
tr: Bir veya birkaç işlemli geri çağırma anlaşması tanımladığından, ChannelFactory {0} anlaşmasını desteklemiyor. ChannelFactory yerine DuplexChannelFactory kullanmayı deneyin.
zh_hans: ChannelFactory 不支持协定 {0}，因为它使用一个或多个操作定义回拨协定。请考虑使用 DuplexChannelFactory 而不是 ChannelFactory。
zh_hant: ChannelFactory 不支援合約 {0}，因為其定義的回呼合約具有一或多項作業。請考慮使用 DuplexChannelFactory 來取代 ChannelFactory。

# SFxCustomBindingNeedsTransport1
source: The CustomBinding on the ServiceEndpoint with contract '{0}' lacks a TransportBindingElement. Every binding must have at least one binding element that derives from TransportBindingElement.
cs: Třída CustomBinding na třídě ServiceEndpoint se smlouvou {0} postrádá třídu TransportBindingElement. Každá vazba musí mít alespoň jeden element vazby, který se odvozuje od třídy TransportBindingElement.
de: In der CustomBinding für den ServiceEndpoint mit dem Vertrag "{0}" fehlt ein TransportBindingElement. Jede Bindung muss über mindestens ein Bindungselement verfügen, das von TransportBindingElement abgeleitet wird.
es: El elemento CustomBinding en ServiceEndpoint con el contrato "{0}" carece de TransportBindingElement. Todos los enlaces deben tener al menos un elemento de enlace que se derive de TransportBindingElement.
fr: CustomBinding sur le ServiceEndpoint avec le contrat '{0}' ne contient pas de TransportBindingElement. Chaque liaison doit contenir au moins un élément de liaison qui dérive de TransportBindingElement.
it: L'elemento CustomBinding nell'elemento ServiceEndpoint con contratto '{0}' non contiene un elemento TransportBindingElement. Ogni binding deve contenere almeno un elemento di binding che deriva da TransportBindingElement.
ja: コントラクト '{0}' を持つ ServiceEndpoint の CustomBinding には、TransportBindingElement がありません。すべてのバインドには、TransportBindingElement から派生した少なくとも 1 つのバインド要素が必要です。
ko: '{0}' 계약의 ServiceEndpoint에서 CustomBinding에 TransportBindingElement가 없습니다. 모든 바인딩에는 TransportBindingElement에서 파생된 바인딩 요소가 최소한 하나 이상 있어야 합니다.
pl: W elemencie CustomBinding w obiekcie ServiceEndpoint z kontraktem „{0}” brakuje elementu TransportBindingElement. Każde powiązanie musi zawierać co najmniej jeden element powiązania pochodzący z klasy TransportBindingElement.
pt_br: A CustomBinding no ServiceEndpoint com contrato '{0}' não tem um TransportBindingElement. Todas as associações devem ter pelo menos um elemento de associação derivado de TransportBindingElement.
tr: '{0}' anlaşmasına sahip ServiceEndpoint üstündeki CustomBinding içinde bir TransportBindingElement yok. Her bağlamanın, TransportBindingElement öğesinden türetilen en az bir bağlama öğesi bulunmalıdır.
zh_hans: 具有协定“{0}”的 ServiceEndpoint 上的 CustomBinding 缺少 TransportBindingElement。每个绑定都必须至少具有一个从 TransportBindingElement 派生的绑定元素。
zh_hant: 具有合約 '{0}' 的 ServiceEndpoint 上 CustomBinding 遺漏 TransportBindingElement。每一繫結至少必須要有一項衍生自 TransportBindingElement 的繫結元素。

# SFxDeserializationFailed1
source: The formatter threw an exception while trying to deserialize the message: {0}
cs: Formátovací modul vyvolal výjimku při pokusu o deserializaci zprávy: {0}
de: Der Formatierer hat beim Deserialisieren der Nachricht eine Ausnahme ausgelöst: {0}.
es: El formateador inició una excepción al intentar deserializar el mensaje: {0}
fr: Le formateur a généré une exception en tentant de désérialiser le message : {0}
it: Il formattatore ha generato un'eccezione durante il tentativo di deserializzare il messaggio: {0}
ja: メッセージ {0} のシリアル化を解除しようとしているときに、フォーマッタから例外がスローされました
ko: 메시지를 deserialize하는 동안 포맷터에서 예외가 발생했습니다. {0}
pl: Program formatujący zgłosił wyjątek podczas próby deserializacji komunikatu: {0}.
pt_br: O formatador gerou uma exceção ao tentar desserializar a mensagem: {0}
tr: İleti seri durumdan çıkarılmaya çalışılırken biçimlendirici bir özel durum oluşturdu: {0}
zh_hans: 格式化程序尝试对消息反序列化时引发异常: {0}
zh_hant: 嘗試還原序列化訊息時，格式器擲回例外狀況: {0}
