Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# UseDefaultWebProxyCantBeUsedWithExplicitProxyAddress
source: You cannot specify an explicit Proxy Address as well as UseDefaultWebProxy=true in your HTTP Transport Binding Element.
cs: V prvku vazby přenosu HTTP nemůže být zadána explicitní adresa proxy a hodnota UseDefaultWebProxy=pravda.
de: Es kann nicht zugleich eine explizite Proxyadresse als auch UseDefaultWebProxy=true im HTTP-Transportbindungselement angegeben werden.
es: No se puede especificar al mismo tiempo una dirección de proxy explícita y UseDefaultWebProxy=true en el elemento de enlace de transporte HTTP.
fr: Vous ne pouvez pas spécifier une adresse de proxy explicite ainsi qu'un UseDefaultWebProxy=True dans votre élément de liaison de transport HTTP.
it: Impossibile specificare un indirizzo proxy esplicito insieme a UseDefaultWebProxy=true nell'elemento associazione del trasporto HTTP.
ja: HTTP トランスポート バインド要素では、明示的な Proxy Address だけでなく、UseDefaultWebProxy=true も指定できません。
ko: HTTP 전송 바인딩 요소에서는 명시적 프록시 주소는 물론 UseDefaultWebProxy=true를 지정할 수 없습니다.
pl: Nie można określić jednocześnie jawnego adresu proxy oraz warunku UseDefaultWebProxy=true w elemencie powiązania transportu HTTP.
pt_br: Não é possível especificar um Endereço Proxy explícito nem um UseDefaultWebProxy=true em seu Elemento de Associação de Transporte HTTP.
tr: Açık bir Proxy Address öğesi yanı sıra, HTTP Transport Binding Element içinde UseDefaultWebProxy=true değerini de belirtemezsiniz.
zh_hans: 在 HTTP 传输绑定元素中，不能将显式代理地址也指定为与 UseDefaultWebProxy=true。
zh_hant: 您無法在 HTTP Transport Binding Element 中，指定明確的 Proxy Address，也無法指定 UseDefaultWebProxy=true。

# UserNameCannotBeEmpty
source: The username cannot be empty.
cs: Uživatelské jméno nemůže být prázdné.
de: Der Benutzername darf nicht leer sein.
es: El nombre de usuario no puede estar vacío.
fr: Le nom d'utilisateur ne peut pas être vide.
it: Il nome utente non può essere vuoto.
ja: ユーザー名を空にすることはできません。
ko: 사용자 이름은 비워 둘 수 없습니다.
pl: Nazwa użytkownika nie może być pusta.
pt_br: O nome de usuário não pode estar vazio.
tr: Kullanıcı adı boş olamaz.
zh_hans: 用户名不能为空。
zh_hant: 使用者名稱不可為空白。

# UserNamePasswordNotProvidedOnClientCredentials
source: The username is not provided. Specify username in ClientCredentials.
cs: Není zadáno uživatelské jméno. Zadejte uživatelské jméno v části ClientCredentials.
de: Der Benutzername wurde nicht angegeben. Geben Sie den Benutzernamen in ClientCredentials an.
es: No se proporciona el nombre de usuario. Especifique el nombre de usuario en ClientCredentials.
fr: Le nom d'utilisateur n'est pas fourni. Spécifiez un nom d'utilisateur dans ClientCredentials.
it: Non è stato specificato alcun nome utente non specificato. Specificare un nome utente in ClientCredentials.
ja: ユーザー名が指定されていません。ClientCredentials でユーザー名を指定してください。
ko: 사용자 이름이 제공되지 않았습니다. ClientCredentials에 사용자 이름을 지정하세요.
pl: Nie określono nazwy użytkownika. Określ nazwę użytkownika w polu ClientCredentials.
pt_br: O nome de usuário não foi fornecido. Especifique o nome de usuário em ClientCredentials.
tr: Kullanıcı adı sağlanmamış. ClientCredentials içinde kullanıcı adını belirtin.
zh_hans: 未提供用户名。请在 ClientCredential 中指定用户名。
zh_hant: 未提供使用者名稱。請在 ClientCredentials 中指定使用者名稱。

# ValueMustBeGreaterThanZero
source: The value of this argument must be greater than 0.
cs: Hodnota tohoto argumentu musí být větší než 0.
de: Der Wert dieses Arguments muss größer als 0 sein.
es: El valor de este argumento debe ser mayor que 0.
fr: La valeur de cet argument doit être supérieure à 0.
it: Il valore di questo argomento deve essere maggiore di 0.
ja: この引数の値は、正の値である必要があります。
ko: 이 인수의 값은 0보다 커야 합니다.
pl: Wartość tego argumentu musi być większa niż 0.
pt_br: O valor deste argumento deve ser maior que 0.
tr: Bu bağımsız değişkenin değeri 0'dan büyük olmalıdır.
zh_hans: 此参数的值必须大于 0。
zh_hant: 此引數的值必須大於 0。

# ValueMustBeInRange
source: The value of this argument must fall within the range {0} to {1}.
cs: Hodnota tohoto argumentu musí být v rozsahu od {0} do {1}.
de: Der Wert dieses Arguments muss zwischen {0} und {1} liegen.
es: El valor de este argumento debe estar comprendido entre {0} y {1}.
fr: La valeur de cet argument doit être comprise entre {0} et {1}.
it: Il valore di questo argomento deve essere compreso tra {0} e {1}.
ja: この引数の値は、{0} から {1} の範囲内である必要があります。
ko: 이 인수의 값은 {0} - {1} 범위에 속해야 합니다.
pl: Wartość tego argumentu musi należeć do zakresu od {0} do {1}.
pt_br: O valor deste argumento deve estar no intervalo de {0} a {1}.
tr: Bu bağımsız değişkenin değeri {0} - {1} aralığında olmalıdır.
zh_hans: 此参数的值必须介于 {0} 至 {1} 的范围内。
zh_hant: 此引數的值必須介於 {0} 到 {1} 之間。

# ValueMustBeNonNegative
source: The value of this argument must be non-negative.
cs: Hodnota tohoto argumentu nesmí být záporná.
de: Der Wert dieses Arguments darf keine negative Zahl sein.
es: El valor de este argumento no puede ser negativo.
fr: La valeur de cet argument doit être non négative.
it: Il valore di questo argomento non deve essere negativo.
ja: この引数の値は、負ではない値である必要があります。
ko: 이 인수의 값은 음수가 아니어야 합니다.
pl: Wartość tego argumentu nie może być ujemna.
pt_br: O valor deste argumento não deve ser negativo.
tr: Bu bağımsız değişkenin değeri negatif olmamalıdır.
zh_hans: 此参数的值必须为非负。
zh_hant: 此引數的值必須是非負數。

# ValueMustBePositive
source: The value of this argument must be positive.
cs: Hodnota tohoto argumentu musí být kladná.
de: Der Wert dieses Arguments muss positiv sein.
es: El valor de este argumento debe ser positivo.
fr: La valeur de cet argument doit être positive.
it: Il valore di questo argomento deve essere positivo.
ja: この引数の値は、正の値である必要があります。
ko: 이 인수의 값은 양수여야 합니다.
pl: Wartość tego argumentu musi być dodatnia.
pt_br: O valor deste argumento deve ser positivo.
tr: Bu bağımsız değişkenin değeri pozitif olmalıdır.
zh_hans: 此参数的值必须为正。
zh_hant: 此引數值必須是正數。

# WaitForMessageTimedOut
source: WaitForMessage timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit WaitForMessage vypršel po {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Bei WaitForMessage ist nach {0} ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: El elemento WaitForMessage agotó el tiempo de espera después de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Expiration du délai de WaitForMessage après {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di WaitForMessage dopo {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: {0} 後に WaitForMessage がタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: WaitForMessage가 {0} 이후에 시간 제한을 초과했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Upłynął limit czasu oczekiwania operacji WaitForMessage po {0}. Limit czasu przypisany tej operacji mógł być częścią dłuższego czasu oczekiwania.
pt_br: WaitForMessage atingiu o tempo limite após {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: WaitForMessage {0} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: WaitForMessage 在 {0} 之后超时。分配给此操作的时间可能比超时长。
zh_hant: WaitForMessage 在 {0} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# WebSocketCannotCreateRequestClientChannelWithCertainWebSocketTransportUsage
source: HttpChannelFactory cannot create the channel with shape '{0}' when the {1} of {2} was set as '{3}'.
cs: Objekt HttpChannelFactory nemůže vytvořit kanál s tvarem {0}, pokud vlastnost {1} pro {2} byla nastavena na hodnotu {3}.
de: HttpChannelFactory kann den Kanal mit der Form "{0}" nicht erstellen, wenn {1} von {2} auf "{3}" festgelegt wurde.
es: El elemento HttpChannelFactory no puede crear el canal con la forma "{0}" cuando el {1} de {2} está establecido en "{3}".
fr: HttpChannelFactory ne peut pas créer le canal avec la forme '{0}' quand le {1} de {2} a la valeur '{3}'.
it: HttpChannelFactory non può creare il canale con la forma '{0}' quando l'elemento {1} di {2} è impostato come '{3}'.
ja: HttpChannelFactory では、{2} の {1} が '{3}' として設定されている場合、形状 '{0}' のチャネルを作成できません。
ko: {2}의 {1}이(가) '{3}'(으)로 설정된 경우 HttpChannelFactory에서 '{0}' 셰이프로 채널을 만들 수 없습니다.
pl: Obiekt HttpChannelFactory nie może utworzyć kanału o kształcie „{0}”, gdy właściwość {1} obiektu {2} ma wartość „{3}”.
pt_br: HttpChannelFactory não pode criar o canal com a forma '{0}' quando o {1} de {2} foi definido como '{3}'.
tr: {2} öğesinin {1} değeri '{3}' olarak ayarlandığında, HttpChannelFactory '{0}' şekliyle kanal oluşturamaz.
zh_hans: 在已将 {2} 的 {1} 设置为“{3}”的情况下，HttpChannelFactory 无法使用形状“{0}”来创建通道。
zh_hant: 當 {2} 的 {1} 設定為 '{3}' 時，HttpChannelFactory 無法建立含有圖案 '{0}' 的通道。

# WebSocketInvalidProtocolContainsMultipleSubProtocolString
source: The value specified ('{0}') contains more than one subprotocol which is not supported.
cs: Zadaná hodnota ({0}) obsahuje více než jeden dílčí protokol, což není podporováno.
de: Der angegebene Wert ("{0}") enthält mehrere Unterprotokolle. Dies wird nicht unterstützt.
es: El valor especificado ("{0}") contiene más de un subprotocolo que no es compatible.
fr: La valeur spécifiée ('{0}') contient plus d'un sous-protocole, ce qui n'est pas pris en charge.
it: Il valore specificato ('{0}') contiene più di un protocollo secondario e questa condizione non è supportata.
ja: 指定された値 ('{0}') に複数のサブプロトコルが含まれています。これはサポートされていません。
ko: 지정한 값('{0}')에 지원되지 않는 하위 프로토콜이 둘 이상 포함되어 있습니다.
pl: Określona wartość („{0}”) zawiera co najmniej dwa podprotokoły, które są nieobsługiwane.
pt_br: O valor especificado ('{0}') contém mais de um subprotocolo sem suporte.
tr: Belirtilen değer ('{0}') desteklenmeyen birden fazla alt protokol içeriyor.
zh_hans: 指定的值(“{0}”)包含多个不受支持的子协议。
zh_hant: 指定的值 ('{0}') 包含多個不支援的子通訊協定。

# WebSocketInvalidProtocolEmptySubprotocolString
source: Empty string is not a valid subprotocol value. Please use "null" to specify no value.
cs: Prázdný řetězec není platná hodnota dílčího protokolu. Pokud nechcete určit žádnou hodnotu, použijte hodnotu null.
de: Eine leere Zeichenfolge ist kein gültiger Unterprotokollwert. Verwenden Sie NULL, um keinen Wert anzugeben.
es: La cadena vacía no es un valor de subprotocolo válido. Use "null" para no especificar ningún valor.
fr: Une chaîne vide n’est pas une valeur de sous-protocole valide. Utilisez « null » pour ne spécifier aucune valeur.
it: La stringa vuota non è un valore di protocollo secondario valido. Usare "null" per non specificare alcun valore.
ja: 空の文字列は、有効な subprotocol 値ではありません。値を指定しない場合は、"null" を使用してください。
ko: 빈 문자열은 유효한 하위 프로토콜 값이 아닙니다. 값을 지정하지 않으려면 "Null"을 사용하세요.
pl: Ciąg pusty nie jest prawidłową wartością protokołu podrzędnego. Aby nie określać żadnej wartości, użyj wartości „null”.
pt_br: A cadeia de caracteres vazia não é um valor de subprotocolo válido. Use "nulo" para não especificar nenhum valor.
tr: Boş dize geçerli bir alt protokol değeri değildir. Değer belirtmemek için "null" değerini kullanın.
zh_hans: 空字符串不是有效的子协议值。请使用“null”指定空值。
zh_hant: 空白字串不是有效的 subprotocol 值。請使用 "null" 來指定沒有值。

# WebSocketInvalidProtocolInvalidCharInProtocolString
source: The subprotocol '{0}' is invalid because it contains the invalid character '{1}'.
cs: Dílčí protokol {0} je neplatný, protože obsahuje neplatný znak {1}.
de: Das Unterprotokoll "{0}" ist ungültig, da es das ungültige Zeichen "{1}" enthält.
es: El subprotocolo "{0}" no es válido porque contiene el carácter no válido "{1}".
fr: Le sous-protocole '{0}' est non valide, car il contient le caractère non valide '{1}'.
it: Il protocollo secondario '{0}' non è valido perché contiene il carattere non valido '{1}'.
ja: サブプロトコル '{0}' は、無効な文字 '{1}' が含まれているため無効です。
ko: 하위 프로토콜 '{0}'은(는) 잘못된 문자 '{1}'을(를) 포함하므로 유효하지 않습니다.
pl: Podprotokół „{0}” jest nieprawidłowy, ponieważ zawiera nieprawidłowy znak „{1}”.
pt_br: O subprotocolo '{0}' é inválido porque contém o caractere inválido '{1}'.
tr: '{0}' alt protokolü geçersiz olan '{1}' karakterini içerdiğinden geçersizdir.
zh_hans: 子协议“{0}”无效，因为其包含无效字符“{1}”。
zh_hant: 子通訊協定 '{0}' 無效，因為它包含無效的字元 '{1}'。

# WebSocketOperationTimedOut
source: The '{0}' operation timed out after '{1}'. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit operace {0} vypršel po {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim {0}-Vorgang ist nach "{1}" ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de la operación "{0}" después de "{1}". El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération '{0}' a expiré après '{1}'. Le temps alloué à cette opération est peut-être une partie d'un délai d'expiration plus long.
it: Timeout dell'operazione '{0}' dopo '{1}'. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: '{0}' 操作が '{1}' 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: '{0}' 작업이 '{1}' 이후에 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Po „{1}” upłynął limit czasu oczekiwania na operację „{0}”. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação '{0}' atingiu o tempo limite após '{1}'. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: '{0}' işlemi '{1}' sonunda zaman aşımına uğradı. Bu işleme ayrılan süre, daha uzun bir zaman aşımının parçası olabilir.
zh_hans: “{0}”操作在“{1}”后超时。分配给此操作的时间可能比超时长。
zh_hant: '{0}' 作業於 '{1}' 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# WebSocketReceiveTimedOut
source: The Receive operation timed out after '{0}'. For duplex sessionful channels, the receive timeout is also the idle timeout for the channel, so consider setting a suitably large value for the ReceiveTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit operace Receive vypršel po {0}. V případě duplexních kanálů s relacemi je časový limit přijetí pro kanál zároveň časovým limitem nečinnosti. Zvažte tedy nastavení dostatečně velké hodnoty ReceiveTimeout v rámci vazby. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Empfangsvorgang ist nach "{0}" ein Timeout aufgetreten. Bei sitzungsbasierten Duplexkanälen entspricht das Empfangszeitlimit gleichzeitig dem Leerlaufzeitlimit für den Kanal. Aus diesem Grund sollte der ReceiveTimeout-Wert der Bindung auf einen geeigneten höheren Wert festgelegt werden. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de la operación Receive después de "{0}". En canales con sesión dúplex, el tiempo de espera de recepción es también el tiempo de espera de inactividad para el canal, por lo que se debe considerar la posibilidad de establecer un valor mayor para el valor ReceiveTimeout en Binding. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération Receive a expiré après '{0}'. Pour les canaux de session duplex, le délai d'expiration de réception est aussi le délai d'inactivité du canal. Vous devez donc définir une valeur suffisamment grande pour la valeur ReceiveTimeout sur la liaison. Le temps alloué à cette opération est peut-être une partie d'un délai d'expiration plus long.
it: Timeout dell'operazione Receive dopo '{0}'. Per i canali con sessioni duplex, il timeout di ricezione corrisponde al timeout di inattività per il canale. Provare a impostare un valore adeguato di grandi dimensioni per il valore di ReceiveTimeout nell'elemento Binding. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 受信操作が '{0}' 後にタイムアウトしました。二重セッションフル チャネルでは、受信タイムアウトはチャネルのアイドル タイムアウトでもあるため、バインドの ReceiveTimeout 値に適切な大きさの値を設定することを検討します。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 받기 작업이 '{0}' 이후에 시간 초과되었습니다. 이중 세션 채널의 경우 수신 시간 제한도 채널의 유휴 시간 제한이므로 바인딩에서 ReceiveTimeout 값을 충분히 큰 값으로 설정해 보세요. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Po {0} upłynął limit czasu odbierania. W przypadku dupleksowego kanału sesji limit czasu odbierania odpowiada limitowi czasu bezczynności. W związku z tym weź pod uwagę ustawienie odpowiednio dużej wartości dla właściwości ReceiveTimeout w obiekcie Binding. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação de Recebimento atingiu o tempo limite após '{0}'. Para canais dúplex de sessão, o tempo limite de recebimento também é o tempo limite ocioso do canal. Por isso, considere configurar um valor adequado maior para o valor ReceiveTimeout na Associação. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Alma işlemi '{0}' sonunda zaman aşımına uğradı. Alma zaman aşımı çift yönlü oturumdaki kanallar için ayrıca bekleme zaman aşımıdır, bu nedenle Bağlama üzerinde ReceiveTimeout değeri için uygun şekilde büyük bir değer ayarlamayı deneyin. Bu işleme ayrılan süre, daha uzun bir zaman aşımının parçası olabilir.
zh_hans: “接收”操作在“{0}”后超时。对于双工会话通道，接收超时也是通道的空闲超时，所以请考虑在 Binding 上为 ReceiveTimeout 值设置一个适当的大值。分配给此操作的时间可能比超时长。
zh_hant: 接收作業於 '{0}' 之後逾時。使用雙工工作階段通道時，接收逾時也是通道的閒置逾時，因此，請考慮為繫結上的 ReceiveTimeout 值適當地設定較大的值。分配給此作業的時間可能是較長逾時的一部分。

# WebSocketSendTimedOut
source: The Send operation timed out after '{0}'. Increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit operace Send vypršel po {0}. Zvyšte hodnotu SendTimeout v rámci vazby. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Sendevorgang ist nach "{0}" ein Timeout aufgetreten. Erhöhen Sie den SendTimeout-Wert der Bindung. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: Se agotó el tiempo de espera de la operación Send después de "{0}". Aumente el valor SendTimeout en Binding. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération Send a expiré après '{0}'. Augmentez la valeur SendTimeout sur la liaison. Le temps alloué à cette opération est peut-être une partie d'un délai d'expiration plus long.
it: Timeout dell'operazione Send dopo '{0}'. Aumentare il valore di SendTimeout nell'elemento Binding. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 送信操作が '{0}' 後にタイムアウトしました。バインドの SendTimeout 値を大きくしてください。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 보내기 작업이 '{0}' 이후에 시간 초과되었습니다. 바인딩에서 SendTimeout 값을 늘리세요. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Po {0} upłynął limit czasu wysyłania. Zwiększ wartość właściwości SendTimeout w obiekcie Binding. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação de Envio atingiu o limite após '{0}'. Aumente o valor de SendTimeout na Associação. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Gönderme işlemi '{0}' sonunda zaman aşımına uğradı. Bağlama üzerinde SendTimeout değerini artırın. Bu işleme ayrılan süre, daha uzun bir zaman aşımının parçası olabilir.
zh_hans: “发送”操作在“{0}”后超时。请考虑在 Binding 上增加 SendTimeout 值。分配给此操作的时间可能比超时长。
zh_hant: 傳送作業於 '{0}' 之後逾時。請增加繫結上的 SendTimeout 值。分配給此作業的時間可能是較長逾時的一部分。

# WebSocketStreamWriteCalledAfterEOMSent
source: Cannot write to the stream because the end of the stream marker was already written.
cs: Nelze zapisovat do datového proudu, protože již byla zapsána značka konce datového proudu.
de: In den Datenstrom kann nicht geschrieben werden, da das Ende des Datenstrommarkers bereits geschrieben wurde.
es: No se puede escribir en el flujo porque el punto de conexión del marcador de flujo ya estaba escrito.
fr: Impossible d'écrire dans le flux, car la fin du marqueur de flux était déjà écrite.
it: Non è possibile scrivere nel flusso perché è già stata scritta la fine del marcatore del flusso.
ja: ストリームの最後を示すマーカーが既に書き込まれているため、ストリームに書き込むことができません。
ko: 스트림의 끝 표식을 이미 썼으므로 스트림에 쓸 수 없습니다.
pl: Nie można zapisać w strumieniu, ponieważ został już zapisany znacznik końca strumienia.
pt_br: Não é possível gravar no fluxo porque a extremidade do marcador do fluxo já foi gravada.
tr: Akışın sonu işareti zaten yazıldığından akışı yazılamıyor.
zh_hans: 无法写入流，因为已写入流标记的结尾。
zh_hant: 因為已寫入了資料流標記結尾，所以無法寫入資料流。

# WebSocketSubProtocolMismatchFromServer
source: The server didn't accept the connection request. It is possible that the WebSocket subprotocol sent by your client is not supported by the server. Protocol(s) supported by the server are '{0}'.
cs: Server nepřijal žádost o připojení. Dílčí protokol WebSocket odeslaný vaším klientem pravděpodobně není serverem podporován. Protokoly podporované serverem jsou {0}.
de: Der Server hat die Verbindungsanforderung nicht akzeptiert. Möglicherweise wird das vom Client gesendete WebSocket-Unterprotokoll vom Server nicht unterstützt. Folgende Protokolle werden vom Server unterstützt: "{0}".
es: El servidor no aceptó la solicitud de conexión. Es posible que el subprotocolo WebSocket enviado por su cliente no es compatible con el servidor. Los protocolos compatibles con el servidor son "{0}".
fr: Le serveur a refusé la demande de connexion. Il est possible que le sous-protocole WebSocket envoyé par votre client ne soit pas pris en charge par le serveur. Les protocoles pris en charge par le serveur sont '{0}'.
it: Il server non ha accettato la richiesta di connessione. È possibile che il protocollo secondario WebSocket inviato dal client non sia supportato dal server. I protocolli supportati dal server sono '{0}'.
ja: サーバーが接続要求を受け入れませんでした。クライアントによって送信された WebSocket サブプロトコルを、サーバーがサポートしていない可能性があります。サーバーがサポートしているプロトコルは '{0}' です。
ko: 서버에서 연결 요청을 수락하지 않았습니다. 클라이언트에서 보낸 WebSocket 하위 프로토콜이 서버에서 지원되지 않을 수 있습니다. 서버에서 지원되는 프로토콜은 '{0}'입니다.
pl: Serwer nie zaakceptował żądania połączenia. Być może serwer nie obsługuje podprotokołu WebSocket wysłanego przez klienta. Serwer obsługuje następujące protokoły: „{0}”.
pt_br: O servidor não aceitou a solicitação de conexão. É possível que o subprotocolo WebSocket enviado pelo cliente não tenha suporte do servidor. Os protocolos com suporte do servidor são '{0}'.
tr: Sunucu, bağlantı isteğini kabul etmedi. İstemciniz tarafından gönderilen WebSocket alt protokolü sunucu tarafından desteklenmiyor olabilir. Sunucu tarafından desteklenen protokoller: '{0}'.
zh_hans: 服务器不接受连接请求。有可能是因为服务器不支持客户端发送的 WebSocket 子协议。服务器支持的协议是“{0}”。
zh_hant: 伺服器未接受連線要求。可能是伺服器不支援您的用戶端所傳送的 WebSocket 子通訊協定。伺服器支援的通訊協定為 '{0}'。

# WebSocketUnexpectedCloseMessageError
source: Unexpected WebSocket close message received when receiving a message.
cs: Při přijímání zprávy byla neočekávaně přijata ukončovací zpráva WebSocket.
de: Beim Empfangen einer Nachricht wurde eine unerwartete Schließen-Nachricht für den WebSocket empfangen.
es: Se recibió un mensaje de cierre de WebSocket inesperado al recibir el mensaje.
fr: Message de fermeture WebSocket inattendu reçu à la réception d'un message.
it: Durante la ricezione di un messaggio è stato ricevuto un messaggio di chiusura WebSocket imprevisto.
ja: メッセージの受信中に WebSocket の予期しない終了メッセージを受信しました。
ko: 메시지를 받을 때 예기치 않은 WebSocket 닫기 메시지를 받았습니다.
pl: Podczas odbierania komunikatu odebrano nieoczekiwany komunikat zamknięcia obiektu WebSocket.
pt_br: Mensagem de fechamento do WebSocket inesperada recebida durante o recebimento de uma mensagem.
tr: Bir ileti alınırken beklenmeyen WebSocket kapatma iletisi alındı.
zh_hans: 在接收消息时收到异常 WebSocket 关闭消息。
zh_hant: 接收訊息時，收到未預期的 WebSocket 關閉訊息。
