Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# AttemptedToGetContractTypeForButThatTypeIs1
source: Attempted to get contract type for {0}, but that type is not a ServiceContract, nor does it inherit a ServiceContract.
cs: Došlo k pokusu o získání typu kontraktu pro {0}, tímto typem však není třída ServiceContract, ani třídu ServiceContract nedědí.
de: Es wurde versucht, den Vertragstyp für {0} abzurufen, dieser Typ ist jedoch weder ein ServiceContract noch erbt er einen ServiceContract.
es: Se intentó obtener el tipo de contrato para {0}, pero el tipo no es ServiceContract ni hereda ServiceContract.
fr: Tentative d'obtention du type de contrat pour {0}, mais ce type n'est pas un ServiceContract et n'hérite pas de ServiceContract.
it: Si è provato a ottenere il tipo di contratto per {0}, ma il tipo non è un elemento ServiceContract né eredita tale elemento.
ja: {0} のコントラクトの型の取得を試みましたが、この型は ServiceContract ではありません。また、ServiceContract を継承してもいません。
ko: {0}에 대한 계약 형식을 가져오려고 했지만 해당 형식이 ServiceContract가 아니거나 ServiceContract를 상속하지 않습니다.
pl: Próbowano uzyskać typ kontraktu dla {0}, ale ten typ nie jest typu ServiceContract ani nie dziedziczy z klasy ServiceContract.
pt_br: Foi feita uma tentativa de obter o tipo de contrato para {0}, mas esse tipo não é ServiceContract ou não tem herança de ServiceContract.
tr: {0} için anlaşma türü alınmaya çalışıldı, ancak bu tür bir ServiceContract değil ya da ServiceContract devralmıyor.
zh_hans: 试图获取 {0} 的协定类型，但该类型不是 ServiceContract，或其未继承 ServiceContract。
zh_hant: 嘗試取得 {0} 的合約類型，但該類型既非 ServiceContract，也不是繼承自 ServiceContract。

# BadCloseTarget
source: The CloseTarget specified '{0}' does not identify the security token that signed the message.
cs: Třída CloseTarget určená {0} neidentifikuje token zabezpečení, který podepsal zprávu.
de: Das angegebene CloseTarget "{0}" identifiziert nicht das Sicherheitstoken, von dem die Nachricht signiert wurde.
es: El elemento CloseTarget especificado '{0}' no identifica el token de seguridad que firmó el mensaje.
fr: L'élément CloseTarget spécifié '{0}' n'identifie pas le jeton de sécurité qui a signé le message.
it: CloseTarget specificato '{0}' non identifica il token di sicurezza che ha firmato il messaggio.
ja: '{0}' が指定されている CloseTarget は、メッセージに署名したセキュリティ トークンを識別することができません。
ko: 지정된 CloseTarget '{0}'이(가) 메시지에 서명한 보안 토큰을 식별하지 않습니다.
pl: Określony przez CloseTarget element „{0}” nie identyfikuje tokenu zabezpieczającego, który podpisał komunikat.
pt_br: O parâmetro CloseTarget especificado '{0}' não identifica o token de segurança que assinou a mensagem.
tr: Belirtilen '{0}' CloseTarget değeri, iletiyi imzalayan güvenlik belirtecini tanımlamıyor.
zh_hans: CloseTarget 指定的“{0}”没有标识对消息进行签名的安全令牌。
zh_hant: 指定 CloseTarget 的 '{0}' 未識別簽署訊息的安全性權杖。

# BadIssuedTokenType
source: The issued token is of unexpected type '{0}'. Expected token type '{1}'.
cs: Vydaný token má neočekávaný typ {0}. Očekávaný typ tokenu je {1}.
de: Das ausgestellte Token weist den unerwarteten Typ "{0}" auf. Der Tokentyp "{1}" wurde erwartet.
es: El token emitido es del tipo inesperado "{0}". Se espera el tipo de token "{1}".
fr: Le jeton émis est d'un type inattendu '{0}'. Type de jeton attendu '{1}'.
it: Il tipo '{0}' del token rilasciato non è previsto. Il tipo previsto è '{1}'.
ja: 発行されたトークンの型が予期しない型 '{0}' です。このトークンの型は '{1}' である必要があります。
ko: 발급된 토큰이 예기치 않은 '{0}' 형식입니다. '{1}' 토큰 형식이어야 합니다.
pl: Wystawiony token jest nieoczekiwanego typu „{0}”. Spodziewany typ tokenu „{1}”.
pt_br: O tipo do token emitido é inesperado '{0}'. Tipo de token esperado '{1}'.
tr: Verilen belirteç beklenmeyen '{0}' türünde. Beklenen belirteç türü: '{1}'.
zh_hans: 颁发的令牌属于意外的类型“{0}”。令牌类型应为“{1}”。
zh_hant: 發行的權杖類型 '{0}' 不是預期的類型。預期的權杖類型 '{1}'。

# BadSecurityNegotiationContext
source: Security negotiation failure because an incorrect Context attribute specified in RequestSecurityToken/RequestSecurityTokenResponse from the other party.
cs: Vyjednávání zabezpečení se nezdařilo, protože druhá strana určila ve třídě RequestSecurityToken nebo RequestSecurityTokenResponse nesprávný atribut kontextu.
de: Fehler bei der Sicherheitsaushandlung aufgrund eines falschen angegebenen Kontextattributs in RequestSecurityToken"/"RequestSecurityTokenResponse von der anderen Partei.
es: Error de negociación de seguridad al especificar la otra parte un atributo de contexto incorrecto en RequestSecurityToken/RequestSecurityTokenResponse.
fr: Échec de la négociation de sécurité en raison d'un attribut Context incorrect qui est spécifié dans RequestSecurityToken/RequestSecurityTokenResponse à partir de l'autre correspondant.
it: Errore di negoziazione di sicurezza a causa di un attributo Context non valido specificato in RequestSecurityToken/RequestSecurityTokenResponse dall'altra parte.
ja: 相手側の RequestSecurityToken または RequestSecurityTokenResponse に指定された Context 属性が正しくないため、セキュリティ ネゴシエーションが失敗しました。
ko: 상대방의 RequestSecurityToken/RequestSecurityTokenResponse에 잘못된 컨텍스트 특성이 지정되었기 때문에 보안 협상 오류가 발생했습니다.
pl: Niepowodzenie negocjacji zabezpieczeń z powodu niepoprawnego atrybutu Context określonego w elemencie RequestSecurityToken/RequestSecurityTokenResponse z drugiej strony.
pt_br: Falha na negociação de segurança devido a um atributo Context incorreto especificado em RequestSecurityToken/RequestSecurityTokenResponse a partir da outra entidade.
tr: RequestSecurityToken/RequestSecurityTokenResponse içinde diğer tarafın belirttiği hatalı bir Context özniteliği nedeniyle, güvenlik anlaşması başarısız oldu.
zh_hans: 由于另一方的 RequestSecurityToken/RequestSecurityTokenResponse 中指定的 Context 特性不正确，安全协商失败。
zh_hant: 安全性交涉失敗，因為另一方的 RequestSecurityToken/RequestSecurityTokenResponse 中指定了不正確的 Context 屬性。

# BaseAddressCannotHaveFragment
source: A base address cannot contain a Uri fragment.
cs: Základní adresa nesmí obsahovat fragment identifikátoru URI.
de: Eine Basisadresse darf kein URI-Fragment enthalten.
es: Una dirección base no puede contener un fragmento de URI.
fr: Une adresse de base ne peut pas contenir un fragment d'URI.
it: Un indirizzo di base non può contenere un frammento URI.
ja: ベース アドレスに URI フラグメントを含めることはできません。
ko: 기준 주소는 URI 조각을 포함할 수 없습니다.
pl: Adres podstawowy nie może zawierać fragmentu identyfikatora URI.
pt_br: Um endereço básico não pode conter um fragmento de URI.
tr: Temel adres bir Uri parçası bulunduramaz.
zh_hans: 基址中不能包含 URI 片段。
zh_hant: 基底位址不可包含 Uri 片段。

# BaseAddressCannotHaveQuery
source: A base address cannot contain a Uri query string.
cs: Základní adresa nesmí obsahovat řetězec dotazu identifikátoru URI.
de: Eine Basisadresse darf keine URI-Abfragezeichenfolge enthalten.
es: Una dirección base no puede contener una cadena de consulta de URI.
fr: Une adresse de base ne peut pas contenir une chaîne de requête URI.
it: Un indirizzo di base non può contenere una stringa di query URI.
ja: ベース アドレスに URI クエリ文字列を含めることはできません。
ko: 기준 주소는 URI 쿼리 문자열을 포함할 수 없습니다.
pl: Adres podstawowy nie może zawierać ciągu zapytania identyfikatora URI.
pt_br: Um endereço básico não pode conter uma cadeia de caracteres de consulta de URI.
tr: Temel adres bir Uri sorgu dizesi bulunduramaz.
zh_hans: 基址中不能包含 URI 查询字符串。
zh_hant: 基底位址不可包含 Uri 查詢字串。

# BaseAddressCannotHaveUserInfo
source: A base address cannot contain a Uri user info section.
cs: Základní adresa nesmí obsahovat část s informacemi o uživateli identifikátoru URI.
de: Eine Basisadresse darf keinen URI-Benutzerinformationsabschnitt enthalten.
es: Una dirección base no puede contener una sección de información de usuario de URI.
fr: Une adresse de base ne peut pas contenir une section infos utilisateur URI.
it: Un indirizzo di base non può contenere una sezione di informazioni utente URI.
ja: ベース アドレスに URI ユーザー情報セクションを含めることはできません。
ko: 기준 주소는 URI 사용자 정보 섹션을 포함할 수 없습니다.
pl: Adres podstawowy nie może zawierać sekcji informacji o użytkowniku identyfikatora URI.
pt_br: Um endereço básico não pode conter uma sessão de informações sobre usuários de URI.
tr: Temel adres bir Uri kullanıcı bilgileri bölümü bulunduramaz.
zh_hans: 基址中不能包含 URI 用户信息节。
zh_hant: 基底位址不可包含 Uri 使用者資訊區段。

# BaseAddressDuplicateScheme
source: This collection already contains an address with scheme {0}. There can be at most one address per scheme in this collection. If your service is being hosted in IIS you can fix the problem by setting 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' to true or specifying 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'.
cs: Tato kolekce již obsahuje adresu se schématem {0}. V této kolekci se pro jedno schéma může vyskytovat nejvýše jedna adresa. Pokud je vaše služba hostována prostřednictvím služby IIS, můžete tento problém vyřešit nastavením parametru system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled na hodnotu true nebo určením parametrů system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters.
de: Diese Sammlung enthält bereits eine Adresse mit dem Schema {0}. Die Sammlung kann maximal eine Adresse pro Schema enthalten. Wenn der Dienst in IIS gehostet wird, kann das Problem durch Festlegen von "system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled" auf "true" oder durch Angeben von "system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters" behoben werden.
es: Esta colección ya contiene una dirección con el esquema {0}. Solo puede haber una dirección por esquema en esta colección. Si el servicio se hospeda en IIS, puede corregir el problema si establece "system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled" en true o especifica "system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters".
fr: Cette collection contient déjà une adresse avec le schéma {0}. Une adresse tout au plus par schéma est possible dans cette collection. Si votre service est hébergé dans IIS, vous pouvez corriger le problème en affectant la valeur true à 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' ou en spécifiant 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'.
it: Questa raccolta contiene già un indirizzo con schema {0}. La raccolta può contenere al massimo un indirizzo per schema. Se il servizio viene ospitato in IIS, è possibile risolvere il problema impostando 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' su true o specificando 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'.
ja: このコレクションには、スキーマ {0} を持つアドレスが既に含まれています。このコレクションでは、スキーマあたりのアドレスは 1 つ以下である必要があります。サービスが IIS でホストされている場合は、'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' を true に設定するか、'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters' を指定することにより、この問題を解決できます。
ko: 이 컬렉션에는 스키마가 {0}인 주소가 이미 있습니다. 이 컬렉션에서 스키마당 주소는 하나만 존재할 수 있습니다. IIS에서 서비스가 호스트되는 경우 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled'를 true로 설정하거나 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'를 지정하여 문제를 해결할 수 있습니다.
pl: Ta kolekcja zawiera już adres ze schematem {0}. W tej kolekcji może występować tylko jeden adres dla każdego schematu. Jeśli usługa jest obsługiwana w usługach IIS, można rozwiązać ten problem, określając dla ustawienia „system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled” wartość true lub określając ustawienie „system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters”.
pt_br: Esta coleção já contém um endereço com o esquema {0}. Pode haver no máximo um endereço por esquema nesta coleção. Se seu serviço estiver sendo hospedado no IIS, você poderá corrigir o problema definindo 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' como true ou especificando 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'.
tr: Bu koleksiyonda {0} düzenine sahip bir adres zaten var. Bu koleksiyonda her düzen için en fazla bir adres olabilir. Hizmetiniz IIS'de barındırılıyorsa, 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' değerini true olarak ayarlayarak veya 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters' belirterek bu sorunu giderebilirsiniz.
zh_hans: 此集合已经采用方案 {0} 的地址。此集合中每个方案最多只能包含一个地址。如果服务在 IIS 中进行托管，则可以通过将 "system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled" 设置为 true，或指定 "system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters" 来修复此问题。
zh_hant: 此集合已包含具有配置 {0} 的位址。此集合中，每一配置最多只能有一個位址。此集合中，每一配置最多只能有一個位址。如果您的服務將裝載於 IIS，您可以設定 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' 為 true 或指定 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'，修正此問題。

# BaseAddressMustBeAbsolute
source: Only an absolute Uri can be used as a base address.
cs: Jako základní adresu lze použít pouze absolutní identifikátor URI.
de: Nur ein absoluter URI kann als Basisadresse verwendet werden.
es: Solo se puede usar un URI absoluto como dirección base.
fr: Seul un URI absolu est utilisable comme adresse de base.
it: Come indirizzo di base è possibile usare un solo URI assoluto.
ja: ベース アドレスとして使用できる絶対 URI は 1 つのみです。
ko: 절대 URI만 기준 주소로 사용할 수 있습니다.
pl: Jako adres podstawowy może być używany tylko bezwzględny identyfikator URI.
pt_br: Apenas um URI absoluto pode ser usado como endereço básico.
tr: Yalnızca bir mutlak Uri, temel adres olarak kullanılabilir.
zh_hans: 只有绝对 URI 才能用作基址。
zh_hant: 只有絕對 Uri 可用來作為基底位址。

# BasicHttpMessageSecurityRequiresCertificate
source: BasicHttp binding requires that BasicHttpBinding.Security.Message.ClientCredentialType be equivalent to the BasicHttpMessageCredentialType.Certificate credential type for secure messages. Select Transport or TransportWithMessageCredential security for UserName credentials.
cs: Vazba BasicHttp vyžaduje, aby se třída BasicHttpBinding.Security.Message.ClientCredentialType shodovala s typem přihlašovacích údajů BasicHttpMessageCredentialType.Certificate pro zabezpečené zprávy. Pro přihlašovacích údajích uživatelských jmen vyberte zabezpečení Transport nebo TransportWithMessageCredential.
de: Die BasicHttp-Bindung erfordert, dass BasicHttpBinding.Security.Message.ClientCredentialType dem Anmeldeinformationstyp BasicHttpMessageCredentialType.Certificate für sichere Nachrichten entspricht. Wählen Sie die Transport- oder TransportWithMessageCredential-Sicherheit für UserName-Anmeldeinformationen aus.
es: El enlace BasicHttp requiere que BasicHttpBinding.Security.Message.ClientCredentialType sea equivalente al tipo de credencial BasicHttpMessageCredentialType.Certificate para proteger los mensajes. Seleccione la seguridad Transport o TransportWithMessageCredential para las credenciales UserName.
fr: Avec une liaison BasicHttp, le type BasicHttpBinding.Security.Message.ClientCredentialType doit être équivalent à celui des informations d'identification BasicHttpMessageCredentialType.Certificate pour les messages sécurisés. Sélectionnez la sécurité TransportWithMessageCredential ou Transport pour les informations d'identification UserName.
it: Con il binding BasicHttp l'elemento BasicHttpBinding.Security.Message.ClientCredentialType deve essere equivalente al tipo di credenziali BasicHttpMessageCredentialType.Certificate per i messaggi protetti. Selezionare la sicurezza Transport o TransportWithMessageCredential per le credenziali UserName.
ja: BasicHttp のバインドでは、メッセージをセキュリティで保護するために BasicHttpBinding.Security.Message.ClientCredentialType が BasicHttpMessageCredentialType.Certificate 資格情報型と等しいことが要求されています。UserName 資格情報には、Transport または TransportWithMessageCredential セキュリティを選択してください。
ko: BasicHttp 바인딩에서는 BasicHttpBinding.Security.Message.ClientCredentialType이 보안 메시지에 대한 BasicHttpMessageCredentialType.Certificate 자격 증명 형식과 동일해야 합니다. UserName 자격 증명에 대해 Transport 또는 TransportWithMessageCredential 보안을 선택하세요.
pl: Powiązanie BasicHttp wymaga, aby typ BasicHttpBinding.Security.Message.ClientCredentialType odpowiadał typowi poświadczeń BasicHttpMessageCredentialType.Certificate dla bezpiecznych komunikatów. Wybierz zabezpieczenie Transport lub TransportWithMessageCredential dla poświadczeń UserName.
pt_br: A associação BasicHttp requer que BasicHttpBinding.Security.Message.ClientCredentialType seja equivalente ao tipo de credencial BasicHttpMessageCredentialType.Certificate para mensagens seguras. Selecione a segurança de Transport ou de TransportWithMessageCredential para credenciais UserName.
tr: BasicHttp bağlaması, güvenli iletiler için BasicHttpBinding.Security.Message.ClientCredentialType öğesinin BasicHttpMessageCredentialType.Certificate kimlik bilgisi türüne eşdeğer olmasını gerektirir. UserName kimlik bilgileri için Transport ya da TransportWithMessageCredential güvenliğini seçin.
zh_hans: BasicHttp 绑定要求 BasicHttpBinding.Security.Message.ClientCredentialType 等效于安全消息的 BasicHttpMessageCredentialType.Certificate 凭据类型。为 UserName 凭据选择 Transport 或 TransportWithMessageCredential 安全性。
zh_hant: BasicHttp 繫結要求安全訊息的 BasicHttpBinding.Security.Message.ClientCredentialType 與 BasicHttpMessageCredentialType.Certificate 之認證類型必須相等。請為 UserName 認證選取 Transport 或 TransportWithMessageCredential 安全性。

# BasicTokenNotExpected
source: A basic token is not expected in the security header in this context.
cs: V tomto kontextu není v záhlaví zabezpečení očekáván základní token.
de: Im Sicherheitsheader wird in diesem Kontext kein Basistoken erwartet.
es: No se espera un token básico en el encabezado de seguridad en este contexto.
fr: Dans ce contexte, un jeton de base n'est pas attendu dans l'en-tête de sécurité.
it: Non è previsto un token di base nell'intestazione di sicurezza in questo contesto.
ja: このコンテキストのセキュリティ ヘッダーには、基本トークンを指定できません。
ko: 기본 토큰은 이 컨텍스트의 보안 헤더에 사용할 수 없습니다.
pl: Token podstawowy nie jest oczekiwany w nagłówku zabezpieczeń w tym kontekście.
pt_br: Um token básico não é esperado no cabeçalho de segurança deste contexto.
tr: Bu bağlamda güvenlik üst bilgisinde bir temel belirteç beklenmiyor.
zh_hans: 在此上下文中，安全标题中不应存在基本令牌。
zh_hant: 此內容的安全標頭中不應該有基礎權杖。

# BearerKeyTypeCannotHaveProofKey
source: A Proof Token was found in the response that was returned by the Security Token Service for a Bearer Key Type token request. Note that Proof Tokens should not be generated when a Bearer Key Type request is made.
cs: V odpovědi vrácené službou tokenu zabezpečení pro požadavek na token typu klíče nosiče byl nalezen token důkazu. Při požadavku na typ klíče nosiče by neměly být generovány tokeny důkazu.
de: In der vom Sicherheitstokendienst zurückgegebenen Antwort auf eine Trägerschlüsseltyp-Tokenanforderungen wurde ein Prüftoken gefunden. Beachten Sie, dass bei einer Trägerschlüsseltyp-Anforderung keine Prüftoken generiert werden dürfen.
es: En la respuesta se encontró un token de prueba que había devuelto el servicio de token de seguridad en una solicitud del token Bearer Key Type. Tenga en cuenta que no se deben generar tokens de prueba cuando se realiza una solicitud de Bearer Key Type.
fr: Un jeton de preuve a été trouvé dans la réponse retournée par le service d'émission de jeton de sécurité pour une demande de jeton de type de clé du porteur. Des jetons de preuve ne doivent pas être générés quand une demande de type de clé de support est effectuée.
it: Nella risposta restituita dal servizio token di sicurezza è stato trovato un token di prova per una richiesta di token di tipo chiave bearer token. Si noti che i token di prova non devono essere generati quando si effettua una richiesta di un tipo di chiave bearer token.
ja: セキュリティ トークン サービスによって Bearer Key Type トークン要求に対して返された応答内に、証明トークンが見つかりました。Bearer Key Type 要求が行われた場合、証明トークンは生成できません。
ko: Bearer 키 형식 토큰 요청에 대해 보안 토큰 서비스에서 반환된 응답에 증명 토큰이 있습니다. Bearer 키 형식 요청이 만들어질 때 증명 토큰을 생성할 수 없습니다.
pl: Token potwierdzający został znaleziony w odpowiedzi zwróconej przez usługę tokenu zabezpieczającego, która dotyczyła żądania tokenu typu klucza elementu nośnego. Należy zauważyć, że tokeny potwierdzające nie powinny być generowane, gdy jest wykonywane żądanie typu klucza elementu nośnego.
pt_br: Um Token de Prova foi encontrado na resposta retornada pelo Serviço de Token de Segurança para a solicitação de token de Tipo de Chave de Portador. Observe que Tokens de Prova não devem ser gerados quando uma solicitação de Tipo de Chave de Portador é feita.
tr: Güvenlik Belirteci Hizmeti tarafından bir Taşıyıcı Anahtar Türü belirteç isteği için döndürülen yanıtta bir Düzeltme Belirteci bulundu. Bir Taşıyıcı Anahtar Türü isteği yapıldığında Düzeltme Belirteçlerinin oluşturulmaması gerektiğini unutmayın.
zh_hans: 在安全令牌服务为持有者密钥类型令牌请求返回的响应中发现了证明令牌。请注意，进行持有者密钥类型请求时不应生成证明令牌。
zh_hant: 在 Security Token Service 為持有人金鑰類型權杖要求所傳回的回應中，發現了證明權杖。請注意，提出持有人金鑰類型要求時，不應產生證明權杖。

# BinaryEncoderSessionInvalid
source: The binary encoder session is not valid. There was an error decoding a previous message.
cs: Relace binárního kodéru je neplatná. Při dekódování předchozí zprávy došlo k chybě.
de: Die binäre Encodersitzung ist ungültig. Beim Decodieren einer früheren Nachricht ist ein Fehler aufgetreten.
es: La sesión del codificador binario no es válida. Se produjo un error al descodificar un mensaje anterior.
fr: La session de l'encodeur binaire est non valide. Une erreur s'est produite durant le décodage d'un précédent message.
it: La sessione del codificatore binario non è valida. Si è verificato un errore durante la decodifica di un messaggio precedente.
ja: バイナリ エンコーダーのセッションが無効です。前のメッセージのデコードでエラーが発生しました。
ko: 이진 인코더 세션이 잘못되었습니다. 이전 메시지를 디코딩하는 동안 오류가 발생했습니다.
pl: Sesja kodera binarnego jest niepoprawna. Wystąpił błąd dekodowania poprzedniego komunikatu.
pt_br: A sessão do codificador binário é inválida. Erro ao decodificar uma mensagem anterior.
tr: İkili kodlama oturumu geçerli değil. Geçmiş bir iletinin şifrelemesini kaldırmada hata var.
zh_hans: 二进制编码器会话无效。解码前一条消息时发生错误。
zh_hant: 二進位編碼器工作階段無效。解碼先前的訊息時發生錯誤。

# BinaryEncoderSessionMalformed
source: The binary encoder session information is not properly formed.
cs: Informace o relaci binárního kodéru jsou vytvořeny nesprávně.
de: Die Sitzungsinformationen für den binären Encoder sind nicht korrekt formatiert.
es: La información de la sesión del codificador binario no tiene el formato correcto.
fr: Les informations de session de l'encodeur binaire ne sont pas correctement formées.
it: Le informazioni sulla sessione del codificatore binario non sono formulate correttamente.
ja: バイナリ エンコーダーのセッション情報が適切な形式ではありません。
ko: 이진 인코더 세션 정보의 형식이 올바르지 않습니다.
pl: Informacje sesji kodera binarnego są niepoprawnie sformułowane.
pt_br: As informações da sessão do codificador binário não estão corretamente formadas.
tr: İkili kodlama oturumu bilgileri düzgün biçimlendirilmemiş.
zh_hans: 二进制编码器会话信息格式不正确。
zh_hant: 二進位編碼器工作階段資訊的格式不正確。
