Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SinceTheBindingForDoesnTSupportIBindingCapabilities2_1
source: The DeliveryRequirementsAttribute on contract '{0}' specifies a QueuedDeliveryRequirements constraint. This condition could not be verified because the configured binding does not implement IBindingDeliveryCapabilities. The DeliveryRequirementsAttribute may only be used with bindings that implement the IBindingDeliveryCapabilities interface.
cs: Atribut DeliveryRequirementsAttribute u kontraktu {0} udává vazbu QueuedDeliveryRequirements. Tato podmínka nemohla být ověřena, protože nakonfigurovaná vazba neimplementuje rozhraní IBindingDeliveryCapabilities. Atribut DeliveryRequirementsAttribute může být použit jen s vazbami, které implementují rozhraní IBindingDeliveryCapabilities.
de: Das DeliveryRequirementsAttribute für Vertrag "{0}" gibt eine QueuedDeliveryRequirements-Einschränkung an. Diese Bedingung konnte nicht überprüft werden, da die konfigurierte Bindung keine IBindingDeliveryCapabilities implementiert. Das DeliveryRequirementsAttribute darf nur mit Bindungen verwendet werden, die die IBindingDeliveryCapabilities-Schnittstelle implementieren.
es: El atributo DeliveryRequirementsAttribute del contrato '{0}' especifica una restricción QueuedDeliveryRequirements. Esta condición no se pudo comprobar porque el enlace configurado no implementa IBindingDeliveryCapabilities. El atributo DeliveryRequirementsAttribute sólo se puede usar con enlaces que implementen la interfaz IBindingDeliveryCapabilities.
fr: DeliveryRequirementsAttribute sur le contrat '{0}' spécifie une contrainte QueuedDeliveryRequirements. Cette condition ne peut plus être vérifiée car la liaison configurée n'implémente pas IBindingDeliveryCapabilities. DeliveryRequirementsAttribute peut être utilisé uniquement avec des liaisons qui implémentent l'interface IBindingDeliveryCapabilities.
it: DeliveryRequirementsAttribute nel contratto '{0}' specifica un vincolo QueuedDeliveryRequirements. Impossibile verificare la condizione perché il binding configurato non implementa IBindingDeliveryCapabilities. DeliveryRequirementsAttribute può essere utilizzato solo con i binding che implementano l'interfaccia IBindingDeliveryCapabilities.
ja: コントラクト '{0}' の DeliveryRequirementsAttribute では、QueuedDeliveryRequirements 制約が指定されています。構成されたバインドには IBindingDeliveryCapabilities が実装されていないため、この条件を確認できませんでした。DeliveryRequirementsAttribute は、IBindingDeliveryCapabilities インターフェイスを実装しているバインドでのみ使用できます。
ko: '{0}' 계약의 DeliveryRequirementsAttribute는 QueuedDeliveryRequirements 제약 조건을 지정합니다. 구성된 바인딩이 IBindingDeliveryCapabilities를 구현하지 않으므로 이 조건은 확인할 수 없습니다. DeliveryRequirementsAttribute는 IBindingDeliveryCapabilities 인터페이스를 구현하는 바인딩에만 사용할 수 있습니다.
pl: W atrybucie DeliveryRequirementsAttribute kontraktu „{0}” określono ograniczenie QueuedDeliveryRequirements. Tego warunku nie można zweryfikować, ponieważ skonfigurowane powiązanie nie ma zaimplementowanego interfejsu IBindingDeliveryCapabilities. Atrybutu DeliveryRequirementsAttribute można używać tylko z powiązaniami, które mają zaimplementowany interfejs IBindingDeliveryCapabilities.
pt_br: O DeliveryRequirementsAttribute no contrato '{0}' especifica uma restrição QueuedDeliveryRequirements. Essa condição não pôde ser verificada porque a associação configurada não implementa IBindingDeliveryCapabilities. O DeliveryRequirementsAttribute só pode ser usado com associações que implementam a interface IBindingDeliveryCapabilities.
tr: '{0}' sözleşmesindeki DeliveryRequirementsAttribute, bir QueuedDeliveryRequirements kısıtlaması belirtiyor. Yapılandırılan bağlama IBindingDeliveryCapabilities öğelerini uygulamadığından bu koşul doğrulanamadı. DeliveryRequirementsAttribute, yalnızca IBindingDeliveryCapabilities arabirimini uygulayan bağlamalarla kullanılabilir.
zh_hans: 协定“{0}”上的 DeliveryRequirementsAttribute 指定了 QueuedDeliveryRequirements 约束。无法验证此条件，因为配置的绑定未实现IBindingDeliveryCapabilities。DeliveryRequirementsAttribute 只能与实现 IBindingDeliveryCapabilities 接口的绑定共同使用。
zh_hant: 合約 '{0}' 上的 DeliveryRequirementsAttribute 指定了 QueuedDeliveryRequirements 條件約束。由於設定的繫結未實作 IBindingDeliveryCapabilities，因此無法驗證此條件。DeliveryRequirementsAttribute 可能只用於實作 IBindingDeliveryCapabilities 介面的繫結。

# SizeExceedsRemainingBufferSpace
source: The specified size exceeds the remaining buffer space ({0} bytes).
cs: Zadaná velikost překračuje zbývající místo ve vyrovnávací paměti (počet bajtů: {0}).
de: Die angegebene Größe überschreitet den verbleibenden Pufferspeicher ({0} Bytes).
es: El tamaño especificado supera el espacio restante del búfer ({0} bytes).
fr: La taille spécifiée est supérieure à l'espace restant de la mémoire tampon ({0} octets).
it: Le dimensioni specificate superano lo spazio buffer rimanente ({0} byte).
ja: 指定したサイズは、残りのバッファー容量 ({0} バイト) を超えています。
ko: 지정된 크기가 여유 버퍼 공간({0}바이트)을 초과합니다.
pl: Określony rozmiar przekracza ilość wolnego miejsca w buforze ({0} B).
pt_br: O tamanho especificado excede o espaço de buffer restante ({0} bytes).
tr: Belirtilen boyut kalan ara bellek alanını ({0} bayt) aşıyor.
zh_hans: 指定的大小超出了剩余缓冲区空间({0} 个字节)。
zh_hant: 指定的大小超過剩餘的緩衝區空間 ({0} 個位元組)。

# SmallLastMsgNumberExceptionString
source: The remote endpoint specified a last message number that is smaller than a sequence number that has already been seen. The reliable session is in an inconsistent state since it cannot determine the actual last message. The reliable session was faulted.
cs: Vzdálený koncový bod určil číslo poslední zprávy, které je menší než pořadové číslo, které již bylo zobrazeno. Stabilní relace se nachází v nekonzistentním stavu, protože nemůže určit skutečnou poslední zprávu. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat eine letzte Nachrichtennummer angegeben, die kleiner als eine bereits aufgetretene Sequenznummer ist. Die zuverlässige Sitzung befindet sich in einem inkonsistenten Status und kann die tatsächliche letzte Nachricht nicht bestimmen. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto especificó un número de último mensaje menor que un número de secuencia que ya se ha visto. La sesión confiable está en estado inconsistente, ya que no puede determinar cuál es el último mensaje real. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a spécifié un dernier numéro de message inférieur à un numéro de séquence déjà rencontré. La session fiable est dans un état incohérent car elle ne peut pas déterminer le dernier message réel. La session fiable a généré une erreur.
it: L'endpoint remoto ha specificato un numero dell'ultimo messaggio inferiore rispetto al numero di sequenza già inviato. La sessione affidabile è in uno stato incoerente perché non può determinare l'ultimo messaggio corrente. Sessione affidabile non riuscita.
ja: リモートエンドポイントは、既に確認されているシーケンス番号より小さい、最後のメッセージ番号を指定しました。信頼できるセッションは、実際の最後のメッセージを決定できないため、整合性がない状態になっています。信頼できるセッションは途中終了されました。
ko: 원격 끝점에서 이미 확인된 시퀀스 번호보다 작은 마지막 메시지 번호를 지정했습니다. 실제 마지막 메시지를 확인할 수 없으므로 신뢰할 수 있는 세션의 상태가 일관되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy określił numer ostatniego komunikatu, który jest mniejszy niż już użyty numer sekwencji. Niezawodna sesja jest w stanie niespójnym, ponieważ nie można określić rzeczywistego ostatniego komunikatu. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto especificou um número de última mensagem menor que um número de sequência que já foi visto. A sessão confiável está em estado inconsistente já que não tem como determinar a última mensagem real. Falha na sessão confiável.
tr: Uzak bitiş noktası, önceden karşılaşılmış olan bir sıra numarasından daha küçük bir son ileti numarası belirtti. Gerçek son iletiyi belirleyemediğinden güvenilir oturum tutarsız bir durumda. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点指定的上条消息编号小于已看到的序列号。可靠会话所处状态不一致，因为它无法确定实际的上条消息。可靠会话已出错。
zh_hant: 遠端端點指定的最後訊息編號小於目前已記錄的序號。可靠工作階段處於不一致的狀態，因為它無法判斷實際的最後訊息。可靠工作階段發生錯誤。

# SoapSecurityNegotiationFailed
source: SOAP security negotiation failed. See inner exception for more details.
cs: Vyjednávání zabezpečení SOAP se nezdařilo. Další informace naleznete v popisu vnitřní výjimky.
de: Fehler bei der SOAP-Sicherheitsaushandlung. Weitere Informationen finden Sie in der inneren Ausnahme.
es: Error de negociación de seguridad SOAP. Consulte la excepción interna para obtener más información.
fr: Échec de la négociation de sécurité SOAP. Pour plus d'informations, consultez l'exception interne.
it: Negoziazione di sicurezza SOAP non riuscita. Per ulteriori dettagli, vedere l'eccezione interna.
ja: SOAP セキュリティ ネゴシエーションに失敗しました。詳細については、内部例外を参照してください。
ko: SOAP 보안 협상을 실행하지 못했습니다. 자세한 내용은 내부 예외를 참조하십시오.
pl: Nie można wynegocjować zabezpieczeń SOAP. Aby uzyskać więcej szczegółów, zobacz wyjątek wewnętrzny.
pt_br: Falha na negociação de segurança SOAP. Consulte a exceção interna para obter mais detalhes.
tr: SOAP güvenlik anlaşması başarısız oldu. Daha fazla ayrıntı için iç özel duruma bakın.
zh_hans: SOAP 安全协商失败。有关详细信息，请参见内部异常。
zh_hant: SOAP 安全性交涉失敗。如需詳細資訊，請參閱內部例外狀況。

# SoapSecurityNegotiationFailedForIssuerAndTarget
source: SOAP security negotiation with '{0}' for target '{1}' failed. See inner exception for more details.
cs: Vyjednávání zabezpečení SOAP s {0} pro cíl {1} se nezdařilo. Další informace naleznete v popisu vnitřní výjimky.
de: Fehler bei der SOAP-Sicherheitsaushandlung mit "{0}" für Ziel "{1}". Weitere Informationen finden Sie in der inneren Ausnahme.
es: Error de negociación de seguridad SOAP con '{0}' para el destino '{1}'. Consulte la excepción interna para obtener más información.
fr: Échec de la négociation de sécurité SOAP avec '{0}' pour la cible '{1}'. Pour plus d'informations, consultez l'exception interne.
it: Negoziazione di sicurezza SOAP con '{0}' per la destinazione '{1}' non riuscita. Per ulteriori dettagli, vedere l'eccezione interna.
ja: ターゲット '{1}' のための '{0}' との SOAP セキュリティ ネゴシエーションに失敗しました。詳細については、内部例外を参照してください。
ko: '{1}' 대상에 대한 '{0}'과(와)의 SOAP 보안 협상을 실행하지 못했습니다. 자세한 내용은 내부 예외를 참조하십시오.
pl: Nie można wynegocjować zabezpieczeń SOAP z „{0}” dla celu „{1}”. Aby uzyskać więcej szczegółów, zobacz wyjątek wewnętrzny.
pt_br: Falha na negociação de segurança SOAP com '{0}' para o destino '{1}'. Consulte a exceção interna para obter mais detalhes.
tr: '{1}' hedefi için '{0}' SOAP güvenlik anlaşması başarısız oldu. Daha fazla ayrıntı için iç özel duruma bakın.
zh_hans: 目标“{1}”的“{0}”与 SOAP 的安全协商失败。有关详细信息，请参见内部异常。
zh_hant: 與目標 '{1}' 的 '{0}' 進行 SOAP 安全性交涉失敗。如需詳細資訊，請參閱內部例外狀況。

# SpaceNeededExceedsMessageFrameOffset
source: The space needed for encoding ({0} bytes) exceeds the message frame offset.
cs: Prostor nutný pro kódování ({0} bajtů) překračuje odsazení rámce zprávy.
de: Der zur Codierung erforderliche Speicherplatz ({0} Bytes) überschreitet den Nachrichtenrahmenoffset.
es: El espacio necesario para codificar ({0} bytes) sobrepasa el desplazamiento de trama del mensaje.
fr: L'espace nécessaire à l'encodage ({0} octets) dépasse le décalage de trame du message.
it: Lo spazio necessario per la codifica ({0} byte) supera l'offset di frame del messaggio.
ja: エンコード ({0} バイト) に必要な領域が、メッセージのフレーム オフセットを超えています。
ko: 인코딩에 필요한 공간({0}바이트)이 메시지 프레임 오프셋을 초과합니다.
pl: Miejsce wymagane do kodowania ({0} B) przekracza przesunięcie ramki komunikatu.
pt_br: O espaço necessário para codificação ({0} bytes) excede o deslocamento do quadro de mensagem.
tr: Kodlama için gereken alan ({0} bayt) ileti çerçevesi uzaklığını aşıyor.
zh_hans: 编码所需的空间({0} 字节)超过了消息帧偏移量。
zh_hant: 編碼所需的空間 ({0} 個位元組) 超過訊息框架位移。

# StandardsManagerCannotWriteObject
source: The token Serializer cannot serialize '{0}'. If this is a custom type you must supply a custom serializer.
cs: Serializátor tokenů nemůže serializovat {0}. Pokud je to vlastní typ, je nutné poskytnout vlastní serializátor.
de: Das Tokenserialisierungsmodul kann "{0}" nicht serialisieren. Falls es sich hierbei um einen benutzerdefinierten Typ handelt, müssen Sie ein benutzerdefiniertes Serialisierungsmodul bereitstellen.
es: El serializador de tokens no puede serializar "{0}". Si se trata de un tipo personalizado, deberá suministrar un serializador personalizado.
fr: Le sérialiseur de jetons ne peut pas sérialiser '{0}'. S'il s'agit d'un type personnalisé, vous devez fournir un sérialiseur personnalisé.
it: Il serializzatore di token non può serializzare '{0}'. Se si tratta di un tipo personalizzato, è necessario fornire un serializzatore personalizzato.
ja: トークン シリアライザーは '{0}' をシリアル化できません。これがカスタム型である場合は、カスタム シリアライザーを提供する必要があります。
ko: 토큰 직렬 변환기가 '{0}'을(를) 직렬화할 수 없습니다. 사용자 지정 형식인 경우에는 사용자 지정 직렬 변환기를 제공해야 합니다.
pl: Serializator tokenów nie może zserializować elementu „{0}”. Jeśli jest to typ niestandardowy, należy użyć serializatora niestandardowego.
pt_br: O Serializador de token não pode serializar '{0}'. Se for um tipo personalizado, você deverá fornecer um serializador personalizado.
tr: Belirteç Serializer özelliği, '{0}' öğesini serileştiremiyor. Bu özel bir türse, özel bir serileştirici sağlamalısınız.
zh_hans: 令牌序列化程序无法序列化“{0}”。如果这是自定义类型，则必须提供自定义序列化程序。
zh_hant: 權杖序列化程式無法將 '{0}' 序列化。若這是自訂類型，必須提供自訂序列化程式。

# StreamDoesNotSupportTimeout
source: TimeoutStream requires an inner Stream that supports timeouts; its CanTimeout property must be true.
cs: Proud TimeoutStream vyžaduje vnitřní Proud, který podporuje časové limity; jeho vlastnost CanTimeout musí mít hodnotu true.
de: TimeoutStream erfordert einen inneren Datenstrom, der Zeitlimits unterstützt. Die CanTimeout-Eigenschaft muss "true" sein.
es: TimeoutStream requiere una secuencia interna que admita tiempos de espera; su propiedad CanTimeout debe ser true.
fr: TimeoutStream nécessite un Stream interne qui prend en charge les délais d'expiration ; sa propriété CanTimeout doit avoir la valeur true.
it: Con TimeoutStream è richiesto un elemento Stream interno in grado di supportare i timeout. La relativa proprietà CanTimeout deve essere true.
ja: TimeoutStream では、タイムアウトをサポートする内部ストリームが必要です。その CanTimeout プロパティは true である必要があります。
ko: TimeoutStream에는 시간 제한을 지원하는 내부 스트림이 필요합니다. CanTimeout 속성은 true여야 합니다.
pl: Obiekt TimeoutStream wymaga obiektu Stream, który obsługuje limity czasu; jego właściwość CanTimeout musi mieć wartość true.
pt_br: TimeoutStream requer um Fluxo interno que dê suporte ao tempo limite; sua propriedade CanTimeout deve ser true.
tr: TimeoutStream, zaman aşımı değerlerini destekleyen bir iç Stream öğesi gerektirir; CanTimeout özelliği de true olmalıdır.
zh_hans: TimeoutStream 需要一个支持超时的内部 Stream；其 CanTimeout 属性必须为 True。
zh_hant: TimeoutStream 需要可支援逾時的內部資料流; 它的 CanTimeout 屬性必須為 true。

# StreamError
source: An error occurred while transmitting data.
cs: Při vysílání dat došlo k chybě.
de: Beim Übertragen von Daten ist ein Fehler aufgetreten.
es: Error al transmitir datos.
fr: Une erreur s'est produite durant la transmission des données.
it: Si è verificato un errore durante la trasmissione dei dati.
ja: データの転送中にエラーが発生しました。
ko: 데이터를 전송하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas transmisji danych.
pt_br: Ocorreu um erro ao transmitir dados.
tr: Veri aktarımı sırasında bir hata oluştu.
zh_hans: 传输数据时出错。
zh_hant: 傳輸資料時發生錯誤。

# StreamMutualAuthNotSatisfied
source: The remote server did not satisfy the mutual authentication requirement.
cs: Vzdálený server nesplnil požadavek vzájemného ověření.
de: Der Remoteserver hat die gegenseitige Authentifizierungsanforderung nicht erfüllt.
es: El servidor remoto no cumplió el requisito de autenticación mutua.
fr: Le serveur distant n'a pas satisfait à l'exigence d'authentification mutuelle.
it: Il server remoto non ha soddisfatto il requisito di autenticazione reciproca.
ja: リモート サーバーが相互認証の要件を満たしませんでした。
ko: 원격 서버가 상호 인증 요구 사항을 충족하지 않습니다.
pl: Zdalny serwer nie spełnił wymogu uwierzytelniania wzajemnego.
pt_br: O servidor remoto não atendeu ao requisito de autenticação mútua.
tr: Uzak sunucu, karşılıklı kimlik doğrulama koşulunu karşılamadı.
zh_hans: 远程服务器不满足相互身份验证要求。
zh_hant: 遠端伺服器無法滿足交互驗證需求。

# StreamUpgradeUnsupportedChannelBindingKind
source: The StreamUpgradeProvider {0} does not support the specified ChannelBindingKind ({1}).
cs: Poskytovatel StreamUpgradeProvider {0} nepodporuje určenou vazbu ChannelBindingKind ({1}).
de: Die angegebene ChannelBindingKind ({1}) wird vom StreamUpgradeProvider {0} nicht unterstützt.
es: StreamUpgradeProvider {0} no admite el valor de ChannelBindingKind especificado ({1}).
fr: Le StreamUpgradeProvider {0} ne prend pas en charge le ChannelBindingKind ({1}) spécifié.
it: StreamUpgradeProvider {0} non supporta l'elemento ChannelBindingKind specificato ({1}).
ja: 指定された ChannelBindingKind ({1}) は、StreamUpgradeProvider {0} でサポートされていません。
ko: StreamUpgradeProvider {0}이(가) 지정된 ChannelBindingKind({1})를 지원하지 않습니다.
pl: Obiekt StreamUpgradeProvider {0} nie obsługuje określonej właściwości ChannelBindingKind ({1}).
pt_br: O StreamUpgradeProvider {0} não dá suporte ao ChannelBindingKind ({1}) especificado.
tr: StreamUpgradeProvider {0} belirtilen ChannelBindingKind'ı ({1}) desteklemiyor.
zh_hans: StreamUpgradeProvider {0} 不支持指定的 ChannelBindingKind ({1})。
zh_hant: StreamUpgradeProvider {0} 不支援指定的 ChannelBindingKind ({1})。

# StringNullOrEmpty
source: The input string parameter is either null or empty.
cs: Parametr vstupního řetězce má buď hodnotu null, nebo je prázdný.
de: Der Zeichenfolgen-Eingabeparameter ist null oder leer.
es: El parámetro de cadena de entrada es nulo o está vacío.
fr: Le paramètre de chaîne d’entrée est vide ou a la valeur null.
it: Il parametro della stringa di input è Null o vuoto.
ja: 入力文字列パラメーターが null または空です。
ko: 입력 문자열 매개 변수가 Null이거나 비어 있습니다.
pl: Wejściowy parametr ciągu ma wartość null lub jest pusty.
pt_br: O parâmetro da cadeia de entrada é nulo ou está vazio.
tr: Giriş dizisi parametresi null veya boş.
zh_hans: 输入字符串参数为 null 或为空。
zh_hant: 輸入字串參數為 Null 或空白。

# SuiteDoesNotAcceptAlgorithm
source: The algorithm '{0}' is not accepted for operation '{1}' by algorithm suite {2}.
cs: Algoritmus {0} není přijat pro operaci {1} sadou algoritmů {2}.
de: Der Algorithmus "{0}" wird für den Vorgang "{1}" von der Algorithmussammlung {2} nicht akzeptiert.
es: El conjunto de algoritmos {2} no acepta el algoritmo "{0}" para la operación "{1}".
fr: L'algorithme '{0}' n'est pas accepté pour l'opération '{1}' par la suite algorithmique {2}.
it: L'algoritmo '{0}' non è accettato per l'operazione '{1}' del gruppo di algoritmi {2}.
ja: アルゴリズム '{0}' は、アルゴリズム スイート {2} による操作 '{1}' には使用できません。
ko: 알고리즘 모음 {2}에서 '{1}' 작업에 대해 '{0}' 알고리즘을 허용하지 않습니다.
pl: Algorytm „{0}” nie jest akceptowany dla operacji „{1}” przez pakiet algorytmów {2}.
pt_br: O algoritmo '{0}' não é aceito para a operação '{1}' pelo pacote de algoritmos {2}.
tr: '{0}' algoritması, '{1}' işlemi için {2} algoritma paketi tarafından kabul edilmedi.
zh_hans: 算法套件 {2} 不接受操作“{1}”的算法“{0}”。
zh_hant: 演算法套件 {2} 所進行的作業 '{1}' 不接受演算法 '{0}'。

# SuppliedMessageIsNotAReplyItHasNoRelatesTo0
source: A reply message was received without a valid RelatesTo header. This may have been caused by a missing RelatesTo header or a RelatesTo header with an invalid WS-Addressing Relationship type.
cs: Byla přijata zpráva s odpovědí bez platného záhlaví RelatesTo. To může být způsobena chybějícím záhlavím RelatesTo nebo záhlavím RelatesTo s neplatným typem elementu WS-Addressing Relationship.
de: Es wurde eine Antwortnachricht ohne gültigen RelatesTo-Header empfangen. Dies kann auf einen fehlenden RelatesTo-Header oder einen RelatesTo-Header mit einem ungültigen WS-Addressing-Beziehungstyp zurückzuführen sein.
es: Se recibió un mensaje de respuesta sin un encabezado RelatesTo válido. La causa puede haber sido que falta un encabezado RelatesTo o que un encabezado RelatesTo tiene un tipo Relationship de WS-Addressing no válido.
fr: Un message de réponse a été reçu sans en-tête RelatesTo valide. Ceci peut être dû à un en-tête RelatesTo absent ou un en-tête RelatesTo dont le type de relation WS-Addressing est non valide.
it: È stato ricevuto un messaggio di risposta senza un'intestazione RelatesTo valida. L'intestazione RelatesTo manca o contiene un tipo WS-Addressing Relationship non valido.
ja: 有効な RelatesTo ヘッダーが含まれていない応答メッセージを受信しました。この原因としては、RelatesTo ヘッダーが欠落していること、または無効な WS-Addressing Relationship 型を持つ RelatesTo ヘッダーが含まれていることが考えられます。
ko: 유효한 RelatesTo 헤더가 없는 회신 메시지를 받았습니다. 잘못된 WS-Addressing 관계 형식이 지정된 RelatesTo 헤더 또는 RelatesTo 헤더가 없기 때문일 수 있습니다.
pl: Odebrano komunikat odpowiedzi bez poprawnego nagłówka RelatesTo. Mogło to być spowodowane brakiem nagłówka RelatesTo lub nagłówkiem RelatesTo z niepoprawnym typem związku WS-Addressing.
pt_br: Foi recebida uma mensagem de resposta sem um cabeçalho RelatesTo válido. Isso pode ter sido causado por um cabeçalho RelatesTo ausente ou um cabeçalho RelatesTo com um tipo inválido de Relacionamento WS-Addressing.
tr: Geçerli bir RelatesTo üst bilgisi olmayan bir yanıt iletisi alındı. Bunun nedeni, eksik bir RelatesTo üst bilgisi ya da geçersiz bir WS-Addressing Relationship türüne sahip RelatesTo üst bilgisi olabilir.
zh_hans: 接收到没有有效 RelatesTo 标头的回复消息。这可能是由于缺少 RelatesTo 标头或 RelatesTo 标头具有无效的 WS-Addressing Relationship 类型。
zh_hant: 已收到的回覆訊息未具備有效的 RelatesTo 標頭。可能是因為遺漏 RelatesTo 標頭，或是 RelatesTo 標頭的 WS-Addressing Relationship 類型無效所導致。

source: Supporting token signatures not expected.
cs: Podpisy tokenů podpory nejsou očekávány.
de: Es wurde keine Signaturen für unterstützende Token erwartet.
es: Signaturas de token auxiliar no esperadas.
fr: Les signatures de jeton de prise en charge ne sont pas attendues.
it: Firme token di supporto non previste.
ja: サポート トークンの署名は使用できません。
ko: 지원 토큰 서명을 사용할 수 없습니다.
pl: Podpisy tokenu pomocniczego nie są oczekiwane.
pt_br: Assinaturas de token de suporte não esperadas.
tr: Destekleme belirteci imzaları beklenmiyordu.
zh_hans: 意外的支持标记签名。
zh_hant: 不需要支援權杖簽章。

# SymmetricKeyLengthTooShort
source: The length of the symmetric key specified is too short ({0} bytes).
cs: Zadaný symetrický klíč je příliš krátký (počet bajtů: {0}).
de: Die angegebene Länge des symmetrischen Schlüssels ist zu kurz ({0} Bytes).
es: La longitud de la clave simétrica especificada es demasiado corta ({0} bytes).
fr: La longueur de la clé symétrique spécifiée est trop courte ({0} octets).
it: La chiave simmetrica specificata è troppo breve ({0} byte).
ja: 指定された対称キーの長さが短すぎます ({0} バイト)。
ko: 지정한 대칭 키의 길이가 너무 짧습니다({0}바이트).
pl: Długość określonego klucza symetrycznego jest za mała ({0} B).
pt_br: O comprimento da chave simétrica especificada é muito curto ({0} bytes).
tr: Belirtilen simetrik anahtarın uzunluğu ({0} bayt) çok kısa.
zh_hans: 指定的对称密钥的长度太短({0} 个字节).
zh_hant: 指定的對稱金鑰長度太短 ({0} 個位元組)。
