Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# InvalidEnumArgument
source: The value of argument '{0}' ({1}) is invalid for Enum type '{2}'.
cs: Hodnota argumentu {0} ({1}) není platná pro typ výčtu {2}.
de: Der Wert des Arguments "{0}" ({1}) ist für den Enumerationstyp "{2}" ungültig.
es: El valor del argumento "{0}" ({1}) no es válido para el tipo de enumeración "{2}".
fr: La valeur de l'argument '{0}' ({1}) est non valide pour le type Enum '{2}'.
it: Il valore dell'argomento '{0}' ({1}) non è valido per il tipo enumerazione '{2}'.
ja: 引数 '{0}' ({1}) の値は列挙型 '{2}' に対して無効です。
ko: 인수 '{0}'의 값({1})이 열거형 형식 '{2}'에 적합하지 않습니다.
pl: Wartość argumentu „{0}” ({1}) jest nieprawidłowa dla typu wyliczeniowego „{2}”.
pt_br: O valor do argumento '{0}' ({1}) é inválido para o tipo de Enumeração '{2}'.
tr: '{0}' bağımsız değişkeninin değeri ({1}) Sabit Listesi türü '{2}' için geçersiz.
zh_hans: 参数 "{0}"({1})的值对 Enum 类型“{2}”无效。
zh_hant: 列舉類型 '{2}' 的引數 '{0}' 值 ({1}) 無效。

# InvalidEnumValue
source: Unexpected internal enum value: {0}.
cs: Neočekávaná hodnota vnitřního vyčíslení: {0}.
de: Unerwarteter interner Enumerationswert: {0}.
es: Valor de enumeración interno inesperado: {0}.
fr: Valeur enum interne inattendue : {0}.
it: Valore di enumerazione interno imprevisto: {0}.
ja: {0} は予期しない内部列挙値です。
ko: 예기치 않은 내부 열거형 값입니다. {0}.
pl: Nieoczekiwana wewnętrzna wartość wyliczenia: {0}.
pt_br: Valor de enumeração interna inesperado: {0}.
tr: Beklenmeyen iç sabit listesi değeri: {0}.
zh_hans: 意外的内部枚举值: {0}。
zh_hant: 未預期的內部列舉值: {0}。

# InvalidIdentityElement
source: Cannot read the Identity element. The Identity type is not supported or the Identity element is empty.
cs: Nelze přečíst element identity. Typ identity není podporován nebo je element identity prázdný.
de: Das Identity-Element kann nicht gelesen werden. Der Identity-Typ wird nicht unterstützt, oder das Identity-Element ist leer.
es: No se puede leer el elemento Identity. No se admite el tipo de Identity o el elemento Identity está vacío.
fr: Impossible de lire l'élément Identity. Le type Identity n'est pas pris en charge ou l'élément Identity est vide.
it: Non è possibile leggere l'elemento Identity. Il tipo Identity non è supportato o l'elemento Identity è vuoto.
ja: Identity 要素を読み取れません。Identity の型がサポートされていないか、Identity 要素が空です。
ko: Identity 요소를 읽을 수 없습니다. Identity 형식이 지원되지 않거나 Identity 요소가 비어 있습니다.
pl: Nie można odczytać elementu Identity. Typ Identity nie jest obsługiwany lub element Identity jest pusty.
pt_br: Não é possível ler o elemento Identity. Não há suporte para o tipo Identity ou o elemento Identity está vazio.
tr: Identity öğesi okunamıyor. Identity türü desteklenmiyor ya da Identity öğesi boş.
zh_hans: 无法读取 Identity 元素。不支持 Identity 类型或 Identity 元素为空。
zh_hant: 無法讀取 Identity 元素。不支援 Identity 類型，或 Identity 元素空白。

# InvalidIssuedTokenKeySize
source: The issued token has an invalid key size '{0}'.
cs: Vystavený token má neplatnou velikost klíče {0}.
de: Das ausgestellte Token weist eine ungültige Schlüsselgröße "{0}" auf.
es: El token emitido tiene un tamaño de clave no válido '{0}'.
fr: Le jeton émis a une taille de clé '{0}' non valide.
it: Le dimensioni di chiave '{0}' del token rilasciato non sono valide.
ja: 発行されたトークンに、無効なキー サイズ '{0}' が含まれています。
ko: 발급된 토큰의 키 크기 '{0}'이(가) 잘못되었습니다.
pl: Wystawiony token ma nieprawidłowy rozmiar klucza „{0}”.
pt_br: O token emitido tem um tamanho de chave inválido '{0}'.
tr: Verilen belirteç, '{0}' geçersiz anahtar boyutuna sahip.
zh_hans: 颁发的令牌具有无效的密钥大小“{0}”。
zh_hant: 發行的權杖具有無效的金鑰大小 '{0}'。

# InvalidKeyLengthRequested
source: The key length '{0}' requested is invalid.
cs: Požadovaná délka klíče {0} je neplatná.
de: Die angeforderte Schlüssellänge "{0}" ist ungültig.
es: La longitud de clave solicitada "{0}" no es válida.
fr: La longueur de clé '{0}' demandée est non valide.
it: La lunghezza di chiave '{0}' richiesta non è valida.
ja: 要求されたキーの長さ '{0}' は無効です。
ko: 요청된 키 길이 '{0}'이(가) 잘못되었습니다.
pl: Żądana długość klucza „{0}” jest nieprawidłowa.
pt_br: O comprimento da chave '{0}' solicitado é inválido.
tr: İstenen '{0}' anahtar uzunluğu geçersiz.
zh_hans: 请求的密钥长度“{0}”无效。
zh_hant: 要求的金鑰長度 '{0}' 無效。

# InvalidKeySizeSpecifiedInNegotiation
source: The specified key size {0} is invalid. The key size must be between {1} and {2}.
cs: Určená velikost klíče {0} je neplatná. Velikost klíče musí být mezi {1} a {2}.
de: Die angegebene Schlüsselgröße {0} ist ungültig. Die Schlüsselgröße muss zwischen {1} und {2} liegen.
es: El tamaño de clave especificado {0} no es válido. El tamaño de clave debe estar comprendido entre {1} y {2}.
fr: La taille de clé spécifiée {0} n'est pas valide. La taille de clé doit être comprise entre {1} et {2}.
it: Le dimensioni di chiave specificate {0} non sono valide. Le dimensioni devono essere comprese tra {1} e {2}.
ja: 指定したキーのサイズ {0} は無効です。キーのサイズは {1} ～ {2} の間である必要があります。
ko: 지정된 키 크기 '{0}'이(가) 잘못되었습니다. 키 크기는 {1}과(와) {2} 사이어야 합니다.
pl: Określony rozmiar klucza {0} jest nieprawidłowy. Rozmiar klucza musi być z zakresu między {1} i {2}.
pt_br: O tamanho da chave especificado {0} é inválido. O tamanho da chave deve estar entre {1} e {2}.
tr: Belirtilen anahtar boyutu {0} geçersiz. Anahtar boyutu {1} ve {2} arasında olmalıdır.
zh_hans: 指定的密钥大小 {0} 无效。密钥大小必须介于 {1} 和 {2} 之间。
zh_hant: 指定的金鑰大小 {0} 無效。金鑰大小必須介於 {1} 與 {2} 之間。

# InvalidMessageState
source: An internal error has occurred. Invalid MessageState.
cs: Došlo k vnitřní chybě. Neplatná třída MessageState.
de: Ein interner Fehler ist aufgetreten. Ungültiger MessageState.
es: Error interno. MessageState no válido.
fr: Une erreur interne s'est produite. MessageState non valide.
it: Si è verificato un errore interno. L'elemento MessageState non è valido.
ja: 内部エラーが発生しました。無効な MessageState です。
ko: 내부 오류가 발생했습니다. 잘못된 MessageState입니다.
pl: Wystąpił błąd wewnętrzny. Nieprawidłowy element MessageState.
pt_br: Erro interno. MessageState inválido.
tr: Bir iç hata oluştu. Geçersiz MessageState.
zh_hans: 发生内部错误。MessageState 无效。
zh_hant: 發生內部錯誤。MessageState 無效。

# InvalidQName
source: The QName is invalid.
cs: Třída QName je neplatná.
de: Der QName ist ungültig.
es: QName no es válido.
fr: QName est non valide.
it: L'elemento QName non è valido.
ja: この QName は無効です。
ko: QName이 잘못되었습니다.
pl: Nieprawidłowy element QName.
pt_br: O QName é inválido.
tr: QName geçersiz.
zh_hans: QName 无效。
zh_hant: QName 無效。

# InvalidReaderPositionOnCreateMessage
source: The XmlReader used for the body of the message must be positioned on an element.
cs: Třída XmlReader použitá pro text zprávy musí být umístěna na elementu.
de: Der für den Textkörper der Nachricht verwendete XmlReader muss auf einem Element positioniert sein.
es: El XmlReader usado para el cuerpo del mensaje debe colocarse en un elemento.
fr: Le lecteur XmlReader utilisé pour le corps du message doit être positionné sur un élément.
it: L'elemento XmlReader usato per il corpo del messaggio deve essere posizionato su un elemento.
ja: メッセージ本文に使用する XmlReader は、要素上に置かれている必要があります。
ko: 메시지 본문에 사용된 XmlReader는 요소에 위치해야 합니다.
pl: Element XmlReader użyty w treści wiadomości musi być umieszczony w elemencie.
pt_br: A classe XmlReader usada para o corpo da mensagem deve estar posicionada em um elemento.
tr: İleti gövdesinde kullanılan XmlReader bir öğe üstüne yerleştirilmelidir.
zh_hans: 用于消息正文的 XmlReader 必须位于元素上。
zh_hant: 用於訊息內文的 XmlReader 必須位於元素中。

# InvalidRenewResponseAction
source: A security session renew response was received with an invalid action '{0}'.
cs: Odpověď na obnovení relace zabezpečení byla přijata s neplatnou akcí {0}.
de: Erneuern-Antwort von Sicherheitssitzung mit einer ungültigen Aktion "{0}" empfangen.
es: Se recibió una respuesta de renovación de sesión de seguridad con la acción no válida '{0}'.
fr: Une réponse de renouvellement de session de sécurité a été reçue avec une action non valide '{0}'.
it: È stata ricevuta una risposta di rinnovo della sessione di sicurezza con un'azione non valida '{0}'.
ja: 無効なアクション '{0}' が含まれたセキュリティ セッション更新応答を受信しました。
ko: 보안 세션 갱신 응답이 잘못된 '{0}' 동작과 함께 수신되었습니다.
pl: Odebrano odnowioną odpowiedź sesji zabezpieczeń z nieprawidłową akcją „{0}”.
pt_br: Uma resposta de renovação de sessão de segurança foi recebida com uma ação inválida '{0}'.
tr: '{0}' geçersiz eylemiyle bir güvenlik oturumu yenileme yanıtı alındı.
zh_hans: 收到带有无效操作“{0}”的安全会话续订响应。
zh_hant: 收到含有無效動作 '{0}' 的安全性工作階段更新回應。

# InvalidRstRequestType
source: The RequestSecurityToken has an invalid or unspecified RequestType '{0}'.
cs: Token třídy RequestSecurityToken má neplatnou nebo neurčenou třídu RequestType {0}.
de: Das RequestSecurityToken weist einen ungültigen oder nicht angegebenen RequestType "{0}" auf.
es: RequestSecurityToken tiene RequestType '{0}' no válido o no especificado.
fr: Le jeton RequestSecurityToken a un type RequestType '{0}' non valide ou non spécifié.
it: RequestSecurityToken contiene un RequestType '{0}' non valido o non specificato.
ja: RequestSecurityToken の RequestType '{0}' は無効であるか指定されていません。
ko: RequestSecurityToken에 잘못되었거나 지정되지 않은 RequestType '{0}'이(가) 있습니다.
pl: Nieprawidłowy lub nieokreślony element RequestType „{0}” w elemencie RequestSecurityToken.
pt_br: RequestSecurityToken tem um valor de RequestType inválido ou não especificado '{0}'.
tr: RequestSecurityToken geçersiz ya da belirtilmeyen bir RequestType '{0}' öğesine sahip.
zh_hans: RequestSecurityToken 具有无效或未指定的 RequestType“{0}”。
zh_hant: RequestSecurityToken 包含無效或未指定的 RequestType '{0}'。

# InvalidSequenceNumber
source: A message was received with a sequence number of {0}. Sequence numbers cannot be less than 1. The reliable session was faulted.
cs: Byla přijata zpráva s pořadovým číslem {0}. Pořadová čísla nesmějí být menší než 1. Ve stabilní relaci došlo k chybě.
de: Es wurde eine Nachricht mit der Sequenznummer {0} empfangen. Sequenznummern können nicht kleiner als 1 sein. Die zuverlässige Sitzung war nicht erfolgreich.
es: Se recibió un mensaje con un número de secuencia de {0}. Los números de secuencia no pueden ser inferiores a 1. Se generó un error en la sesión confiable.
fr: Un message a été reçu avec le numéro de séquence {0}. Les numéros de séquence ne doivent pas être inférieurs à 1. La session fiable a généré une erreur.
it: Ricevuto un messaggio con numero di sequenza {0}. I numeri di sequenza non possono essere inferiori a 1. Sessione affidabile non riuscita.
ja: シーケンス番号が {0} のメッセージを受信しました。シーケンス番号は 1 以上である必要があります。信頼できるセッションは途中終了されました。
ko: 메시지가 시퀀스 번호 {0}과(와) 함께 수신되었습니다. 시퀀스 번호는 1보다 작을 수 없습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Odebrano wiadomość z liczbą sekwencji wynoszącą {0}. Liczba sekwencji nie może być mniejsza od 1. Wystąpił błąd sesji uwierzytelnionej.
pt_br: Foi recebida uma mensagem com um número de sequência de {0}. Números de sequência não podem ser menores que 1. Falha na sessão confiável.
tr: {0} sıra numarasına sahip bir ileti alındı. Sıra numaraları 1'den küçük olamaz. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 收到序列号为 {0} 的消息。序列号不能小于 1。该可靠的会话出错。
zh_hant: 收到序號為 {0} 的訊息。序號不可小於 1。可靠工作階段發生錯誤。

# InvalidSequenceRange
source: An acknowledgement range starting at {0} and ending at {1} was received. This is an invalid acknowledgement range. The reliable session was faulted.
cs: Byl přijat rozsah začínající v {0} a končící v {1}. To je neplatný rozsah potvrzení. Ve stabilní relaci došlo k chybě.
de: Es wurde ein Bestätigungsbereich empfangen, der bei "{0}" beginnt und bei "{1}" endet. Dies ist ein ungültiger Bestätigungsbereich. Die zuverlässige Sitzung war nicht erfolgreich.
es: Se recibió un intervalo de confirmación que comienza por {0} y termina por {1}. Este intervalo de confirmación no es válido. Se generó un error en la sesión confiable.
fr: Une plage d'accusés de réception commençant à {0} et se terminant à {1} a été reçue. Il s'agit d'une plage d'accusés de réception non valide. La session fiable a généré une erreur.
it: È stato ricevuto un intervallo di acknowledgement con inizio {0} e fine {1}. Intervallo di acknowledgement non valido. Sessione affidabile non riuscita.
ja: {0} で開始し {1} で終了する受信確認範囲を受信しました。これは無効な受信確認範囲です。信頼できるセッションは途中終了されました。
ko: {0}에서 시작하고 {1}에서 끝나는 승인 범위를 수신했습니다. 이것은 잘못된 승인 범위입니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Odebrano zakres potwierdzeń rozpoczynający się od {0} i kończący się na {1}. Jest to nieprawidłowy zakres potwierdzeń. Wystąpił błąd sesji uwierzytelnionej.
pt_br: Foi recebido um intervalo de confirmação com início em {0} e final em {1}. Esse intervalo de confirmação é inválido. Falha na sessão confiável.
tr: {0} değerinde başlayan ve {1} değerinde biten bir bildirim aralığı alındı. Bu, geçersiz bir bildirim aralığıdır. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 收到开始于 {0} 以及结束于 {1} 的确认范围。这是无效的确认范围。该可靠的会话出错。
zh_hant: 收到開始為 {0} 結束為 {1} 的通知範圍。此為無效的通知範圍。可靠工作階段發生錯誤。

# InvalidTokenProvided
source: The token provider of type '{0}' did not return a token of type '{1}'. Check the credential configuration.
cs: Poskytovatel tokenu typu {0} nevrátil token typu {1}. Zkontrolujte konfiguraci přihlašovacích údajů.
de: Der Tokenanbieter vom Typ "{0}" hat kein Token vom Typ "{1}" zurückgegeben. Überprüfen Sie die Konfiguration der Anmeldeinformationen.
es: El proveedor de tokens del tipo "{0}" no devolvió un token de tipo "{1}". Compruebe la configuración de las credenciales.
fr: Le fournisseur de jetons de type '{0}' n'a pas retourné un jeton de type '{1}'. Vérifiez la configuration des informations d'identification.
it: Il provider di token di tipo '{0}' non ha restituito un token di tipo '{1}'. Controllare la configurazione delle credenziali.
ja: '{0}' 型のトークン プロバイダーが、'{1}' 型のトークンを返しませんでした。資格情報の構成を確認してください。
ko: 형식 '{0}'의 토큰 공급자가 형식 '{1}'의 토큰을 반환하지 않았습니다. 자격 증명 구성을 확인하세요.
pl: Dostawca tokenu typu „{0}” nie zwrócił tokenu typu „{1}”. Sprawdź konfigurację poświadczeń.
pt_br: O provedor de token do tipo '{0}' não retornou um token do tipo '{1}'. Verifique a configuração das credenciais.
tr: '{0}' türündeki belirteç sağlayıcısı, '{1}' türünde bir belirteç döndürmedi. Kimlik bilgisi yapılandırmasını denetleyin.
zh_hans: 类型为“{0}”的令牌提供程序未返回类型为“{1}”的令牌。请检查凭据配置。
zh_hant: 類型 '{0}' 的權杖提供者未傳回類型為 '{1}' 的權杖。請檢查認證組態。

# InvalidTypedProxyMethodHandle
source: The specified method handle is incorrect for the proxy of type '{0}'
cs: Zadaný popisovač metody není pro proxy typu {0} správný.
de: Das angegebene Methodenhandle ist falsch für den Proxy vom Typ "{0}".
es: El identificador de método especificado es incorrrecto para el proxy de tipo "{0}"
fr: Le handle de méthode spécifié est incorrect pour le proxy de type '{0}'
it: L'handle del metodo specificato non è corretto per il proxy di tipo '{0}'
ja: 型 '{0}' のプロキシに対して指定されたメソッド ハンドルは正しくありません。
ko: 지정한 메서드 핸들은 '{0}' 형식의 프록시에 올바르지 않습니다.
pl: Określony uchwyt metody jest niepoprawny dla serwera proxy typu „{0}”
pt_br: A alça do método especificado está incorreto para o proxy de tipo '{0}'
tr: Belirtilen metot tanıtıcısı '{0}' türündeki proxy için yanlış
zh_hans: 对于类型为“{0}”的代理，指定的方法句柄不正确
zh_hant: 為類型 '{0}' 的 Proxy 指定的方法控制代碼不正確

# InvalidUriScheme
source: The provided URI scheme '{0}' is invalid; expected '{1}'.
cs: Zadané schéma identifikátoru URI {0} je neplatné; bylo očekáváno {1}.
de: Das bereitgestellte URI-Schema "{0}" ist ungültig. Erwartet wurde "{1}".
es: El esquema de URI proporcionado "{0}" no es válido; se esperaba "{1}".
fr: Le schéma d'URI '{0}' fourni est non valide ; le schéma '{1}' était attendu.
it: Lo schema URI fornito '{0}' non è valido. È previsto '{1}'.
ja: 指定された URI 形式 '{0}' は無効です。有効な URI は '{1}' です。
ko: 제공한 URI 구성표 '{0}'이(가) 잘못되었습니다. '{1}'이(가) 필요합니다.
pl: Dostarczony schemat identyfikatora URI „{0}” jest nieprawidłowy; oczekiwano schematu „{1}”.
pt_br: O esquema de URI do provedor '{0}' é inválido; esperado '{1}'.
tr: Sağlanan URI düzeni '{0}' geçersiz; beklenen: '{1}'.
zh_hans: 提供的 URI 方案“{0}”无效，应为“{1}”。
zh_hant: 提供的 URI 配置 '{0}' 無效; 預期 '{1}'。

# InvalidUriValue
source: Value '{0}' provided for '{1}' from namespace '{2}' is an invalid absolute URI.
cs: Hodnotou {0} zadanou pro {1} z oboru názvů {2} je neplatný absolutní identifikátor URI.
de: Der für "{1}" aus dem Namespace "{2}" bereitgestellte Wert "{0}" ist ein ungültiger absoluter URI.
es: El valor "{0}" proporcionado para "{1}" desde el espacio de nombres "{2}" es un URI absoluto no válido.
fr: La valeur '{0}' fournie pour '{1}' de l'espace de noms '{2}' est un URI absolu non valide.
it: Il valore '{0}' fornito per '{1}' dello spazio dei nomi '{2}' è un URI assoluto non valido.
ja: 名前空間 '{2}' の '{1}' に指定された値 '{0}' は無効な絶対 URI です。
ko: 네임스페이스 '{2}'의 '{1}'에 대해 제공된 '{0}' 값이 잘못된 절대 URI입니다.
pl: Wartość „{0}” podana dla elementu „{1}” z przestrzeni nazw „{2}” jest nieprawidłowym bezwzględnym identyfikatorem URI.
pt_br: O valor '{0}' fornecido para '{1}' do namespace '{2}' é um URI absoluto inválido.
tr: '{2}' ad alanından '{1}' için sağlanan '{0}' değeri, geçersiz bir mutlak URI.
zh_hans: 为来自命名空间“{2}”的“{1}”提供的值“{0}”是无效的绝对 URI。
zh_hant: 從命名空間 '{2}' 提供給 '{1}' 的值 '{0}' 為無效的絕對 URI。

# InvalidWsrmResponseChannelNotOpened
source: The remote endpoint responded to the {0} request with a response with action {1}. The response must be a {0}Response with action {2}. The channel could not be opened.
cs: Vzdálený koncový bod odpověděl na požadavek {0} odpovědí s akcí {1}. Odpověď musí být {0}Response s akcí {2}. Kanál nelze otevřít.
de: Der Remoteendpunkt hat auf die {0}-Anforderung mit einer Antwort mit der Aktion {1} geantwortet. Die Antwort muss eine {0}Response mit der Aktion {2} sein. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto respondió a la solicitud {0} con una respuesta con una acción {1}. La respuesta debe ser una {0}Response con una acción {2}. El canal no se pudo abrir.
fr: Le point de terminaison distant a répondu à la demande {0} par une réponse avec l'action {1}. La réponse doit être une {0}Response avec l'action {2}. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha risposto alla richiesta {0} con una risposta con azione {1}. La risposta deve essere una {0}risposta con azione {2}. Impossibile aprire il canale.
ja: リモート エンドポイントは {0} 要求に対して、アクション {1} を含む応答を返しました。応答は、アクション {2} を含む {0}Response である必要があります。チャネルを開くことができませんでした。
ko: 원격 끝점이 {1} 동작이 있는 응답으로 {0} 요청에 응답했습니다. 응답은 {2} 동작이 있는 {0}Response여야 합니다. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy odpowiedział na żądanie {0} za pomocą odpowiedzi z akcją {1}. Odpowiedź musi być odpowiedzią {0}Response z akcją {2}. Nie można otworzyć kanału.
pt_br: Um pondo de extremidade remoto respondeu à solicitação {0} em uma resposta com ação {1}. A resposta deve ser uma Resposta {0} com ação {2}. Não foi possível abrir o canal.
tr: Uzak bitiş noktası {0} isteğine {1} eylemi bulunan bir yanıt verdi. Yanıtın, {2} eylemine sahip bir {0}Response olması gerekiyor. Kanal açılamadı.
zh_hans: 远程终结点对 {0} 请求作出具有操作 {1} 的响应。该响应必须为具有操作 {2} 的 {0}Response。无法打开通道。
zh_hant: 遠端端點對 {0} 要求的回應包含動作 {1}。回應必須是具有動作 {2} 的 {0}Response。無法開啟通道。

# InvalidWsrmResponseSessionFaultedExceptionString
source: The remote endpoint responded to the {0} request with a response with action {1}. The response must be a {0}Response with action {2}. The channel was faulted.
cs: Vzdálený koncový bod odpověděl na požadavek {0} odpovědí s akcí {1}. Odpověď musí být {0}Response s akcí {2}. V kanálu došlo k chybě.
de: Der Remoteendpunkt hat auf die {0}-Anforderung mit einer Antwort mit der Aktion {1} geantwortet. Die Antwort muss eine {0}Response mit der Aktion {2} sein. Der Kanal war nicht erfolgreich.
es: El extremo remoto respondió a la solicitud {0} con una respuesta con la acción {1}. La respuesta debe ser una {0}Response con una acción {2}. Se generó un error en el canal.
fr: Le point de terminaison distant a répondu à la demande {0} par une réponse avec l'action {1}. La réponse doit être une {0}Response avec l'action {2}. Le canal a généré une erreur.
it: L'endpoint remoto ha risposto alla richiesta {0} con una risposta con azione {1}. La risposta deve essere una {0}risposta con azione {2}. Canale non riuscito.
ja: リモート エンドポイントは {0} 要求に対して、アクション {1} を含む応答を返しました。応答は、アクション {2} を含む {0}Response である必要があります。チャネルは途中終了されました。
ko: 원격 끝점이 {1} 동작이 있는 응답으로 {0} 요청에 응답했습니다. 응답은 {2} 동작이 있는 {0}Response여야 합니다. 채널에 오류가 발생했습니다.
pl: Zdalny punkt końcowy odpowiedział na żądanie {0} za pomocą odpowiedzi z akcją {1}. Odpowiedź musi być odpowiedzią {0}Response z akcją {2}. Wystąpił błąd kanału.
pt_br: Um pondo de extremidade remoto respondeu à solicitação {0} em uma resposta com ação {1}. A resposta deve ser uma Resposta {0} com ação {2}. Ocorreu erro no canal.
tr: Uzak bitiş noktası {0} isteğine {1} eylemi bulunan bir yanıt verdi. Yanıtın, {2} eylemine sahip bir {0}Response olması gerekiyor. Kanal hatalı durumda.
zh_hans: 远程终结点对 {0} 请求作出具有操作 {1} 的响应。该响应必须为具有操作 {2} 的 {0}Response。通道出错。
zh_hant: 遠端端點對 {0} 要求的回應包含動作 {1}。回應必須是具有動作 {2} 的 {0}Response。通道發生錯誤。

# InvalidWsrmResponseSessionFaultedFaultString
source: The {0} request's response was a message with action {1}. The response must be a {0}Response with action {2}. The reliable session cannot continue.
cs: Odpověď na požadavek {0} byla zpráva s akcí {1}. Odpověď musí být {0}Response s akcí {2}. Stabilní relace nemůže pokračovat.
de: Die Antwort der {0}-Anforderung war eine Nachricht mit der Aktion {1}. Die Antwort muss eine {0}Response mit der Aktion {2} sein. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: La respuesta a la solicitud {0} fue un mensaje con una {1}. La respuesta debe ser una {0}Response con una acción {2}. La sesión confiable no puede continuar.
fr: La réponse à la demande {0} était un message avec l'action {1}. La réponse doit être une {0}Response avec l'action {2}. La session fiable ne peut pas continuer.
it: La risposta alla richiesta {0} è stata un messaggio con azione {1}. La risposta deve essere una {0}risposta con azione {2}. Impossibile continuare la sessione affidabile.
ja: {0} 要求に対する応答は、アクション {1} を含むメッセージでした。応答は、アクション {2} を含む {0}Response である必要があります。信頼できるセッションは続行できません。
ko: {0} 요청의 응답이 {1} 동작이 있는 메시지입니다. 응답은 {2} 동작이 있는 {0}Response여야 합니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Odpowiedź na żądanie {0} była komunikatem z akcją {1}. Odpowiedź musi być odpowiedzią {0}Response z akcją {2}. Nie można kontynuować działania niezawodnej sesji.
pt_br: A resposta da solicitação de {0} foi uma mensagem com ação {1}. A resposta deve ser uma Resposta {0} com ação {2}. A sessão confiável não pode continuar.
tr: {0} isteğinin yanıtı {1} eylemine sahip bir iletiydi. Yanıtın, {2} eylemine sahip bir {0}Response olması gerekiyor. Güvenilir oturum devam edemiyor.
zh_hans: 对 {0} 请求的响应是具有操作 {1} 的消息。该响应必须为具有操作 {2} 的 {0}Response。可靠会话无法继续。
zh_hant: {0} 要求的回應是具有動作 {1} 的訊息。回應必須是具有動作 {2} 的 {0}Response。可靠工作階段無法繼續。

# InvalidX509RawData
source: Invalid binary representation of an X.509 certificate.
cs: Neplatná binární reprezentace certifikátu X.509
de: Ungültige binäre Darstellung eines X.509-Zertifikats.
es: Representación binaria no válida de un certificado X.509.
fr: Représentation binaire non valide d'un certificat X.509.
it: La rappresentazione binaria di un certificato X.509 non è valida.
ja: X.509 証明書の無効なバイナリ表記です。
ko: X.509 인증서의 잘못된 이진 표시입니다.
pl: Nieprawidłowa reprezentacja binarna certyfikatu X.509.
pt_br: Representação binária inválida de um certificado X.509.
tr: X.509 sertifikasının geçersiz ikili gösterimi.
zh_hans: X.509 证书的无效二进制表示。
zh_hant: X.509 憑證的二進位表示法無效。
