Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxTypedOrUntypedMessageCannotBeMixedWithParameters
source: The operation '{0}' could not be loaded because it has a parameter or return type of type System.ServiceModel.Channels.Message or a type that has MessageContractAttribute and other parameters of different types. When using System.ServiceModel.Channels.Message or types with MessageContractAttribute, the method must not use any other types of parameters.
cs: Operace {0} nemohla být načtena, protože má parametr nebo návratový typ typu System.ServiceModel.Channels.Message nebo typ, který má atribut MessageContractAttribute a jiné parametry různých typů. Při používání parametru System.ServiceModel.Channels.Message nebo typů s atributem MessageContractAttribute nesmí metoda používat žádné jiné typy parametrů.
de: Der Vorgang "{0}" konnte nicht geladen werden, da er einen Parameter oder Rückgabetyp vom Typ System.ServiceModel.Channels.Message oder einen Typ mit MessageContractAttribute und anderen Parametern unterschiedlicher Typen aufweist. Bei der Verwendung von System.ServiceModel.Channels.Message oder Typen mit MessageContractAttribute darf die Methode keine anderen Parametertypen verwenden.
es: No se pudo cargar la operación "{0}" porque tiene un parámetro o tipo de valor devuelto de tipo System.ServiceModel.Channels.Message, o un tipo que tiene MessageContractAttribute y otros parámetros de tipos diferentes. Cuando se usa System.ServiceModel.Channels.Message o tipos con MessageContractAttribute, el método no debe usar ningún otro tipo de parámetros.
fr: Chargement de l'opération '{0}' impossible, car elle contient un paramètre ou type de retour de type System.ServiceModel.Channels.Message ou un type contenant un MessageContractAttribute et d'autres paramètres de types distincts. Durant l'utilisation de System.ServiceModel.Channels.Message ou de types contenant MessageContractAttribute, la méthode ne doit pas utiliser d'autres types de paramètre.
it: Non è stato possibile caricare l'operazione '{0}' perché contiene un parametro o un tipo restituito di tipo System.ServiceModel.Channels.Message oppure un tipo che con MessageContractAttribute e altri parametri di tipi diversi. Quando si usano System.ServiceModel.Channels.Message o tipi con MessageContractAttribute, il metodo non deve usare altri tipi di parametri.
ja: 操作 '{0}' を読み込めませんでした。原因は、この操作に System.ServiceModel.Channels.Message 型のパラメーターまたは戻り値の型が含まれているか、MessageContractAttribute および異なる型の他のパラメーターを持つ型が含まれているためです。MessageContractAttribute を持つ型や System.ServiceModel.Channels.Message を使用する場合は、メソッドでは他の型のパラメーターを使用できません。
ko: System.ServiceModel.Channels.Message 형식의 매개 변수 또는 반환 형식이 포함되어 있거나 MessageContractAttribute 및 여러 다른 형식의 기타 매개 변수가 있는 형식이 포함되어 있으므로 '{0}' 작업을 로드할 수 없습니다. System.ServiceModel.Channels.Message 또는 MessageContractAttribute가 있는 형식을 사용하는 경우에는 메서드가 다른 형식의 매개 변수를 사용할 수 없습니다.
pl: Operacja „{0}” nie mogła być załadowana, ponieważ ma parametr lub zwracany typ typu System.ServiceModel.Channels.Message lub typ mający MessageContractAttribute lub inne parametry różnych typów. Podczas korzystania z typu System.ServiceModel.Channels.Message lub typów z MessageContractAttribute metoda nie może korzystać z żadnych innych typów lub parametrów.
pt_br: A operação '{0}' não pôde ser carregada porque tem um parâmetro ou um tipo de retorno do tipo System.ServiceModel.Channels.Message ou um tipo que tem MessageContractAttribute e outros parâmetros de tipos diferentes. Ao usar System.ServiceModel.Channels.Message ou tipos com MessageContractAttribute, o método não deve usar nenhum outro tipo de parâmetro.
tr: System.ServiceModel.Channels.Message türünde bir dönüş türüne ya da parametresine veya MessageContractAttribute ve başka farklı türde parametreler içeren bir türe sahip olduğundan '{0}' işlemi yüklenemedi. System.ServiceModel.Channels.Message ya da MessageContractAttribute içeren türleri kullanırken, metot başka bir parametre türü kullanmamalıdır.
zh_hans: 无法加载操作“{0}”，因为它具有类型为 System.ServiceModel.Channels.Message 的参数或返回类型，或具有一个带有 MessageContractAttribute 及其他不同类型参数的类型。当使用 System.ServiceModel.Channels.Message 或具有 MessageContractAttribute 的类型时，方法不应使用任何其他参数类型。
zh_hant: 無法載入作業 '{0}'，因為其參數或傳回型別為 System.ServiceModel.Channels.Message 類型，或是其類型具有 MessageContractAttribute 與其他不同類型參數的類型。使用 System.ServiceModel.Channels.Message 或具有 MessageContractAttribute 的類型時，方法不得使用任何其他參數類型。

# SFxTypedOrUntypedMessageCannotBeMixedWithVoidInRpc
source: When using the rpc-encoded style, message contract types or the System.ServiceModel.Channels.Message type cannot be used if the operation has no parameters or has a void return value. Add a blank message contract type as a parameter or return type to operation '{0}'.
cs: Při používání stylu s kódováním rpc nelze používat typy kontraktů zpráv nebo typ System.ServiceModel.Channels.Message, pokud nemá operace žádné parametry nebo má návratovou hodnotu typu void. Přidejte do operace {0} prázdný typ kontraktu zprávy jako parametr nebo návratový typ.
de: Wenn der rpc-encoded-Stil verwendet wird, können Nachrichtenvertragstypen oder der System.ServiceModel.Channels.Message-Typ nicht verwendet werden, sofern der Vorgang keine Parameter oder einen ungültigen Rückgabewert aufweist. Fügen Sie dem Vorgang "{0}" einen leeren Nachrichtenvertragstyp als Parameter oder Rückgabetyp hinzu.
es: Cuando se usa el estilo rpc-encoded, no se pueden usar tipos de contrato de mensaje o el tipo System.ServiceModel.Channels.Message si la operación no tiene parámetros o tiene un valor devuelto nulo. Agregue un tipo de contrato de mensaje en blanco como un parámetro o un tipo de valor devuelto a la operación "{0}".
fr: Durant l'utilisation du style rpc-encoded style, les types de contrat de message ou le type System.ServiceModel.Channels.Message ne peuvent pas être utilisés si l'opération ne contient aucun paramètre ou contient une valeur retournée inapplicable. Ajoutez un type de contrat de message vierge en tant que paramètre ou type de retour à l'opération '{0}'.
it: Quando si usa lo stile codificato rpc, non è possibile usare i tipi di contratto di messaggio o il tipo System.ServiceModel.Channels.Message se l'operazione non contiene parametri o il valore restituito è vuoto. Aggiungere un tipo di contratto di messaggio vuoto come parametro o tipo restituito all'operazione '{0}'.
ja: RPC エンコード スタイルを使用しているときに、操作にパラメーターがない場合や void の戻り値がある場合は、メッセージ コントラクト型や System.ServiceModel.Channels.Message 型を使用できません。ブランク メッセージ コントラクト型をパラメーターまたは戻り値の型として操作 '{0}' に追加してください。
ko: RPC 인코딩된 스타일을 사용하는 경우, 작업에 매개 변수가 없거나 void 반환 값이 있으면 메시지 계약 형식 또는 System.ServiceModel.Channels.Message 형식을 사용할 수 없습니다. 빈 메시지 계약 형식을 매개 변수 또는 반환 형식으로 '{0}' 작업에 추가하세요.
pl: Podczas korzystania ze stylu rpc-encoded typy kontraktu komunikatu lub typ System.ServiceModel.Channels.Message nie mogą zostać użyte, jeśli operacja nie ma parametrów lub ma pustą wartość zwracaną. Dodaj pusty typ kontraktu komunikatu jako parametr lub zwracany typ do operacji „{0}”.
pt_br: Ao usar o estilo de codificação rpc, os tipos de contrato de mensagem ou o tipo System.ServiceModel.Channels.Message não poderão ser usados se a operação não tiver parâmetros ou tiver um valor retornado nulo. Adicione um tipo de contrato de mensagem em branco como parâmetro ou tipo de retorno à operação '{0}'.
tr: Rpc kodlamalı stil kullanırken, işlemde parametre yoksa ya da boş bir dönüş değeri varsa, ileti anlaşması türleri ya da System.ServiceModel.Channels.Message türü kullanılamaz. Parametre ya da dönüş türü olarak '{0}' işlemine bir boş ileti anlaşması türü ekleyin.
zh_hans: 当使用 RPC 编码样式时，如果操作没有参数或有一个空返回值，则不能使用消息协定类型或 System.ServiceModel.Channels.Message 类型。将空消息协定类型作为参数或一个返回类型添加到操作“{0}”。
zh_hant: 使用 rpc-encoded 樣式時，若作業沒有參數或具有 void 傳回值，則無法使用訊息合約類型或 System.ServiceModel.Channels.Message 類型。請新增空白訊息合約類型作為作業 '{0}' 的參數或傳回型別。

# SFxUnknownFaultNoMatchingTranslation1
source: This fault did not provide a matching translation: {0}
cs: Tato porucha neposkytla odpovídající překlad: {0}
de: Für diesen Fehler ist keine entsprechende Übersetzung angegeben: {0}.
es: Este error no proporcionó una traslación coincidente: {0}
fr: Cette erreur n'a pas fourni une traduction correspondante : {0}
it: Questo errore non ha fornito una traduzione corrispondente: {0}
ja: このフォールトでは、一致する翻訳が提供されませんでした。{0}
ko: 이 오류의 설명이 일치하지 않습니다. {0}
pl: Ten błąd nie udostępnił pasującego tłumaczenia: {0}
pt_br: Essa falha não forneceu uma tradução correspondente: {0}
tr: Bu hata, eşleşen bir çeviri sağlamadı: {0}
zh_hans: 此错误未提供匹配转换: {0}
zh_hant: 此錯誤未提供符合的翻譯: {0}

# SFxUnknownFaultNullReason0
source: This fault did not provide a reason (MessageFault.Reason was null).
cs: Tato porucha neposkytla důvod (parametr MessageFault.Reason byl prázdný).
de: Für diesen Fehler ist keine Ursache angegeben (MessageFault.Reason war NULL).
es: Este error no proporcionó una razón (el elemento MessageFault.Reason era nulo).
fr: Cette erreur n'a pas fourni de raison (MessageFault.Reason avait une valeur null).
it: Questo errore non ha fornito un motivo (MessageFault.Reason era Null).
ja: このフォールトでは、理由が示されませんでした (MessageFault.Reason が null でした)。
ko: 이 오류의 원인이 밝혀지지 않았습니다(MessageFault.Reason이 null임).
pl: Brak podanej przyczyny tego błędu (wartość MessageFault.Reason była równa null).
pt_br: Essa falha não forneceu um motivo (MessageFault.Reason era nulo).
tr: Bu hata bir neden sağlamadı (MessageFault.Reason null değere sahip).
zh_hans: 此错误未提供原因(MessageFault.Reason 为 null)。
zh_hant: 此錯誤未提供理由 (MessageFault.Reason 為 null)。

# SFxUnknownFaultZeroReasons0
source: This fault did not provide a reason (MessageFault.Reason.Translations.Count was 0).
cs: Tato porucha neposkytla důvod (parametr MessageFault.Reason.Translations.Count byl 0).
de: Für diesen Fehler ist keine Ursache angegeben (MessageFault.Reason.Translations.Count war 0).
es: Este error no proporcionó una razón (el elemento MessageFault.Reason.Translations.Count fue 0).
fr: Cette erreur n'a pas fourni de raison (MessageFault.Reason.Translations.Count était 0).
it: Questo errore non ha fornito un motivo (MessageFault.Reason.Translations.Count era 0).
ja: このフォールトでは、理由が示されませんでした (MessageFault.Reason.Translations.Count が 0 でした)。
ko: 이 오류의 원인이 밝혀지지 않았습니다(MessageFault.Reason.Translations.Count가 0임).
pl: Brak podanej przyczyny tego błędu (wartość MessageFault.Reason.Translations.Count była równa 0).
pt_br: Essa falha não forneceu um motivo (MessageFault.Reason.Translations.Count era 0).
tr: Bu hata bir neden sağlamadı (MessageFault.Reason.Translations.Count: 0).
zh_hans: 此错误未提供原因(MessageFault.Reason.Translations.Count 为 0)。
zh_hant: 此錯誤未提供理由 (MessageFault.Reason.Translations.Count 為 0)。

# SFxVersionMismatchInOperationContextAndMessage2
source: Cannot add outgoing headers to message as MessageVersion in OperationContext.Current '{0}' does not match with the header version of message being processed '{1}'.
cs: Nelze přidat odchozí záhlaví ke zprávě, protože se verze MessageVersion v parametru OperationContext.Current {0} neshoduje s verzí záhlaví zpracovávané zprávy {1}.
de: Der Nachricht können keine ausgehenden Header hinzugefügt werden, da MessageVersion in OperationContext.Current "{0}" nicht mit der Headerversion der verarbeiteten Nachricht "{1}" übereinstimmt.
es: No se pueden agregar encabezados salientes al mensaje porque MessageVersion en OperationContext.Current "{0}" no coincide con la versión del encabezado del mensaje que se está procesando "{1}".
fr: Impossible d'ajouter des en-têtes sortants au message, car MessageVersion dans OperationContext.Current '{0}' ne correspond pas à la version d'en-tête du message traité '{1}'.
it: Non è possibile aggiungere intestazioni in uscita al messaggio perché MessageVersion in OperationContext.Current '{0}' non corrisponde alla versione dell'intestazione del messaggio in fase di elaborazione '{1}'.
ja: OperationContext.Current '{0}' の MessageVersion が、処理されているメッセージのヘッダー バージョン '{1}' と一致しないため、送信ヘッダーをメッセージに追加できません。
ko: OperationContext.Current '{0}'의 MessageVersion이 처리 중인 메시지의 헤더 버전 '{1}'과(와) 일치하지 않으므로 보내는 헤더를 메시지에 추가할 수 없습니다.
pl: Nie można dodać nagłówków wychodzących do komunikatu, ponieważ element MessageVersion w elemencie perationContext.Current „{0}” nie odpowiada wersji nagłówka przetwarzanego komunikatu „{1}”.
pt_br: Não é possível adicionar cabeçalhos de saída à mensagem, pois MessageVersion em OperationContext.Current '{0}' não corresponde à versão de cabeçalho da mensagem que está sendo processada '{1}'.
tr: OperationContext.Current '{0}' içindeki MessageVersion işlenen '{1}' iletisinin üst bilgi sürümüyle eşleşmediğinden, giden üst bilgiler iletiye eklenemiyor.
zh_hans: 无法将传出标头添加到消息，因为 OperationContext.Current“{0}”中的 MessageVersion 与被处理的“{1}”的消息的标头版本不匹配。
zh_hant: 無法將傳出標頭新增至訊息，因為 OperationContext.Current '{0}' 中的 MessageVersion 不符合正在處理訊息 '{1}' 的標頭版本。

# SFxWrapperNameCannotBeEmpty
source: Wrapper element name cannot be empty.
cs: Název prvku obálky nemůže být prázdný.
de: Der Wrapper-Elementname darf nicht leer sein.
es: El nombre de elemento del contenedor no puede estar vacío.
fr: L'élément wrapper ne peut pas être vide.
it: Il nome dell'elemento wrapper non può essere vuoto.
ja: ラッパー要素名を空にはできません。
ko: 래퍼 요소 이름은 비어 있을 수 없습니다.
pl: Element otoki nie może być pusty.
pt_br: O nome do elemento wrapper não pode ficar vazio.
tr: Sarmalayıcı öğe adı boş olamaz.
zh_hans: 包装器元素名称不能为空。
zh_hant: 包裝函式元素名稱不可為空白。

# SFxXmlArrayNotAllowedForMultiple
source: XmlArrayAttribute cannot be used in repeating part {1}:{0}.
cs: Atribut XmlArrayAttribute nelze použít v opakující se části {1}:{0}.
de: Das XmlArrayAttribute kann nicht im wiederholten Teil {1}:{0} verwendet werden.
es: XmlArrayAttribute no se puede usar en la parte extensible {1}:{0}.
fr: XmlArrayAttribute ne peut pas être utilisé dans la répétition de la partie {1}:{0}.
it: Non è possibile usare XmlArrayAttribute nella parte ripetuta {1}:{0}.
ja: XmlArrayAttribute は、繰り返しの部分 {1}:{0} では使用できません。
ko: XmlArrayAttribute를 반복 파트 {1}:{0}에서 사용할 수 없습니다.
pl: Atrybut XmlArrayAttribute nie może zostać użyty w powtarzającej się części {1}:{0}.
pt_br: XmlArrayAttribute não pode ser usado em uma parte com repetição {1}:{0}.
tr: XmlArrayAttribute {1}:{0} yinelenen bölümünde kullanılamaz.
zh_hans: XmlArrayAttribute 不能用于重复部分 {1}: {0}。
zh_hant: XmlArrayAttribute 無法用於重複組件 {1}:{0}。

# SFxXmlSerializerIsNotFound
source: Could not find XmlSerializer for type {0}.
cs: Nebylo možné najít XmlSerializer pro typ {0}.
de: Der XmlSerializer für den Typ {0} wurde nicht gefunden.
es: No se pudo encontrar XmlSerializer para el tipo {0}.
fr: XmlSerializer est introuvable pour le type {0}.
it: L'elemento XmlSerializer per il tipo {0} non è stato trovato.
ja: 型 {0} の XmlSerializer が見つかりませんでした。
ko: {0} 형식에 대한 XmlSerializer를 찾을 수 없습니다.
pl: Nie można odnaleźć elementu XmlSerializer dla typu {0}.
pt_br: Não foi possível encontrar o XmlSerializer do tipo {0}.
tr: {0} türü için XmlSerializer bulunamadı.
zh_hans: 找不到类型 {0} 的 XmlSerializer。
zh_hant: 找不到類型 {0} 的 XmlSerializer。

# SPS_InvalidAsyncResult
source: The asynchronous result object used to end this operation was not the object that was returned when the operation was initiated.
cs: Asynchronní objekt výsledku použitý k ukončení této operace nebyl objektem vráceným při inicializaci operace.
de: Das zum Beenden dieses Vorgangs verwendete asynchrone Ergebnisobjekt war nicht mit dem Objekt identisch, das beim Initiieren des Vorgangs zurückgegeben wurde.
es: El objeto de resultado asincrónico usado para finalizar esta operación no era el objeto devuelto cuando se inició la operación.
fr: L'objet de résultat asynchrone utilisé pour terminer cette opération n'était pas l'objet retourné quand l'opération a démarré.
it: L'oggetto del risultato asincrono usato per terminare questa operazione non è l'oggetto restituito all'avvio dell'operazione.
ja: この操作を終了させるために使用された非同期結果オブジェクトは、この操作が開始されたときに返されたオブジェクトではありませんでした。
ko: 이 작업을 끝내는 데 사용된 비동기 결과 개체가 작업을 시작할 때 반환된 개체가 아닙니다.
pl: Asynchroniczny obiekt wyniku użyty do zakończenia tej operacji nie był obiektem, który został zwrócony w momencie zainicjowania tej operacji.
pt_br: O objeto de resultado assíncrono usado para encerrar essa operação não era o objeto retornado quando a operação foi iniciada.
tr: Bu işlemi bitirmek için kullanılan asenkron sonuç nesnesi, işlem başlatıldığında döndürülen nesne değil.
zh_hans: 用于结束此操作的异步结果对象不是启动该操作时返回的对象。
zh_hant: 用於結束此作業的非同步結果物件，並非作業初始化時所傳回的物件。

# SPS_SeekNotSupported
source: Seek is not supported on this stream.
cs: V tomto datovém proudu není hledání podporováno.
de: Suchen wird für diesen Datenstrom nicht unterstützt.
es: No se admite la búsqueda en esta secuencia.
fr: Seek n'est pas pris en charge sur ce flux.
it: L'elemento Seek non è supportato su questo flusso.
ja: シークはこのストリームでサポートされていません。
ko: 이 스트림에서 찾기가 지원되지 않습니다.
pl: W tym strumieniu wyszukiwanie nie jest obsługiwane.
pt_br: Não há suporte para busca neste fluxo.
tr: Bu akışta Seek desteklenmez.
zh_hans: 此流上不支持查找。
zh_hant: 此資料流不支援搜尋。

# SSLProtocolNegotiationFailed
source: SSL protocol negotiation failed. Requested '{0}' but was offered '{1}'.
cs: Vyjednávání protokolu SSL se nezdařilo. Bylo požadováno klíčové slovo {0}, ale bylo nabídnuto {1}.
de: Fehler bei der SSL-Protokollaushandlung. "{0}" angefordert, aber "{1}" angeboten.
es: La negociación del protocolo SSL ha fallado. Se ha solicitado "{0}" pero se ofreció "{1}".
fr: Échec de la négociation du protocole SSL. « {0} » demandé mais « {1} » proposé.
it: La negoziazione del protocollo SSL non è riuscita. È stato richiesto '{0}' ma è stato offerto ' {1}'.
ja: SSL プロトコル ネゴシエーションに失敗しました。'{0}' が要求されましたが、'{1}' が提供されました。
ko: SSL 프로토콜 협상이 실패했습니다. '{0}'을(를) 요청했지만 '{1}'이(가) 제공되었습니다.
pl: Negocjowanie protokołu SSL nie powiodło się. Zażądano "{0}", ale zostało zaproponowane "{1}".
pt_br: A negociação do protocolo SSL falhou. Solicitou '{0}', mas foi oferecido '{1}'.
tr: SSL protokolü anlaşması başarısız oldu. '{0}' istendi ancak '{1}' sunuldu.
zh_hans: SSL 协议协商失败。已请求“{0}”，但提供了“{1}”。
zh_hant: SSL 通訊協定交涉失敗。要求的是 '{0}'，但提供的是 '{1}'。

# SecureConversationDriverVersionDoesNotSupportSession
source: The configured SecureConversation version does not support sessions. Use WSSecureConversationFeb2005 or above.
cs: Konfigurovaná verze SecureConversation nepodporuje relace. Použijte třídu WSSecureConversationFeb2005 nebo vyšší.
de: Die konfigurierte SecureConversation-Version unterstützt keine Sitzungen. Verwenden Sie WsSecureConversationFeb2005 oder höher.
es: La versión configurada de SecureConversation no admite sesiones. Use WSSecureConversationFeb2005 o una versión posterior.
fr: La version configurée de SecureConversation ne prend pas en charge les sessions. Utilisez WSSecureConversationFeb2005 ou une version ultérieure.
it: La versione configurata di SecureConversation non supporta le sessioni. Usare WSSecureConversationFeb2005 o versione successiva.
ja: 構成された SecureConversation バージョンはセッションをサポートしていません。WsSecureConversationFeb2005 以上を使用してください。
ko: 구성된 SecureConversation 버전이 세션을 지원하지 않습니다. WSSecureConversationFeb2005 이상을 사용하세요.
pl: Skonfigurowana wersja mechanizmu SecureConversation nie obsługuje sesji. Użyj wersji WSSecureConversationFeb2005 lub nowszej.
pt_br: A versão configurada de SecureConversation não dá suporte a sessões. Use WSSecureConversationFeb2005 ou mais recente.
tr: Yapılandırılan SecureConversation sürümü, oturumları desteklemiyor. WSSecureConversationFeb2005 ya da üstünü kullanın.
zh_hans: 配置的 SecureConversation 版本不支持会话。请使用 WSSecureConversationFeb2005 或更高版本。
zh_hant: 設定的 SecureConversation 版本不支援工作階段。請使用 WSSecureConversationFeb2005 或更新的版本。

# SecureConversationRequiredByReliableSession
source: Cannot establish a reliable session without secure conversation. Enable secure conversation.
cs: Nelze vytvořit stabilní relaci bez zabezpečené konverzace. Povolte zabezpečenou konverzaci.
de: Es kann keine zuverlässige Sitzung ohne sichere Konversation eingerichtet werden. Aktivieren Sie die sichere Konversation.
es: No se puede establecer una sesión confiable sin conversación segura. Habilite la conversación segura.
fr: Impossible d'établir une session fiable sans conversation sécurisée. Activez la conversation sécurisée.
it: Non è possibile stabilire una sessione affidabile senza la conversazione protetta. Abilitare la conversazione protetta.
ja: セキュリティで保護された通信を使用せずに信頼できるセッションを確立することはできません。セキュリティで保護された通信を有効にしてください。
ko: 보안 대화 없이 신뢰할 수 있는 세션을 설정할 수 없습니다. 보안 대화를 사용하도록 설정하세요.
pl: Nie można utworzyć niezawodnej sesji bez bezpiecznej konwersacji. Włącz obsługę bezpiecznej konwersacji.
pt_br: Não é possível estabelecer uma sessão confiável sem uma conversa segura. Habilite a conversa segura.
tr: Güvenli konuşma olmadan güvenilir bir oturum kurulamıyor. Güvenli konuşmayı etkinleştirin.
zh_hans: 无法创建没有安全对话的可靠会话。请启用安全对话。
zh_hant: 無安全對話，無法建立可靠工作階段。請啟用安全對話。

# SecureConversationSecurityTokenParametersRequireBootstrapBinding
source: Security channel or listener factory creation failed. Secure conversation security token parameters do not specify the bootstrap security binding element.
cs: Vytvoření kanálu zabezpečení nebo objektu pro vytváření modulu pro naslouchání se nezdařilo. Parametry tokenu zabezpečení zabezpečené konverzace neurčují element vazby zabezpečení samozavádění.
de: Fehler bei der Erstellung des Sicherheitskanals oder der Listenerfactory. In den Sicherheitstokenparametern der sicheren Konversation ist das Bootstrap-Sicherheitsbindungselement nicht angegeben.
es: Error de creación del generador de escuchas o canales de seguridad. Los parámetros de token de seguridad de conversación segura no especifican el elemento de enlace de seguridad de arranque.
fr: Échec de la création de la fabrique d'écouteurs ou du canal de sécurité. Les paramètres du jeton de sécurité de conversation sécurisée ne spécifient pas les éléments de liaison de sécurité du démarrage.
it: Non è stato possibile creare la factory listener o la factory canale di sicurezza. I parametri del token di sicurezza della conversazione protetta non specificano l'elemento di binding della sicurezza bootstrap.
ja: セキュリティ チャネルまたはリスナー ファクトリの作成に失敗しました。セキュリティで保護された通信のセキュリティ トークン パラメーターで、ブートストラップ セキュリティ バインド要素が指定されていません。
ko: 보안 채널 또는 수신기 팩터리를 만들지 못했습니다. 보안 대화 보안 토큰 매개 변수가 부트스트랩 보안 바인딩 요소를 지정하지 않습니다.
pl: Nie można utworzyć kanału zabezpieczeń lub fabryki odbiorników. Parametry tokenu zabezpieczającego bezpiecznej konwersacji nie określają elementu powiązania zabezpieczeń dla uruchamiania.
pt_br: Falha na criação do canal de segurança ou na fábrica de ouvintes. Os parâmetros do token de segurança da conversa segura não especificam o elemento de associação de segurança de inicialização.
tr: Güvenlik kanalı ya da dinleyici fabrikası oluşturma başarısız oldu. Güvenli konuşma güvenlik belirteci parametreleri, önyükleme güvenliği bağlama öğesini belirtmiyor.
zh_hans: 安全通道或侦听器工厂创建失败。安全对话安全令牌参数未指定启动安全绑定元素。
zh_hant: 安全性通道或接聽程式處理站建立失敗。安全對話安全性權杖參數未指定啟動程序安全性繫結元素。

# SecurityAlgorithmSuiteNotSet
source: The security algorithm suite was not specified on '{0}'.
cs: Sada algoritmů zabezpečení nebyla určena v {0}.
de: Die Sicherheitsalgorithmusfolge wurde nicht auf "{0}" angegeben.
es: No se especificó el conjunto de algoritmos de seguridad en '{0}'.
fr: La suite algorithmique de sécurité n'a pas été spécifiée sur '{0}'.
it: Suite di algoritmi di sicurezza non specificata su '{0}'.
ja: セキュリティ アルゴリズム スイートが '{0}' で指定されませんでした。
ko: 보안 알고리즘 모음이 '{0}'에서 지정되지 않았습니다.
pl: W „{0}” nie określono pakietu algorytmów zabezpieczeń.
pt_br: O pacote de algoritmos de segurança não foi especificado em '{0}'.
tr: Güvenlik algoritması paketi '{0}' üstünde belirtilmemiş.
zh_hans: “{0}”上未指定安全算法组。
zh_hant: '{0}' 上未指定安全性演算法組合。
