Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxInputParametersToServiceInvalid
source: Service implementation object invoked with wrong number of input parameters, operation expects {0} parameters but was called with {1} parameters.
cs: Objekt implementace služby byl vyvolán nesprávným počtem vstupních parametrů. Operace očekává parametry {0}, ale byla vyvolána parametry {1}.
de: Das Dienstimplementierungsobjekt wurde mit einer falschen Anzahl von Eingabeparametern aufgerufen. Der Vorgang erwartet {0} Parameter, wurde jedoch mit {1} Parametern aufgerufen.
es: Se invocó a un objeto de implementación de servicio con un número erróneo de parámetros de entrada. La operación espera {0} parámetros, pero se llamó con {1} parámetros.
fr: L'objet d'implémentation de service a été appelé avec un nombre de paramètres d'entrée incorrect ; l'opération attend {0} paramètres mais a été appelée avec {1} paramètres.
it: L'oggetto di implementazione del servizio è stato richiamato con un numero errato di parametri di input. L'operazione prevede {0} parametri, ma è stata chiamata con {1} parametri.
ja: 正しくない数の入力パラメーターでサービス実装オブジェクトが呼び出されました。操作には {0} 個のパラメーターが必要ですが、{1} 個のパラメーターを使用して呼び出されました。
ko: 잘못된 수의 입력 매개 변수로 서비스 구현 개체를 호출했으며 작업에 {0} 매개 변수가 필요하지만 {1} 매개 변수로 호출되었습니다.
pl: Obiekt implementacji usługi wywołany z nieprawidłową liczbą parametrów wejściowych, operacja wymaga {0} parametrów, a liczba parametrów przekazanych w wywołaniu to {1}.
pt_br: Objeto de implementação de serviço invocado com número errado de parâmetros de entrada, a operação espera parâmetros {0}, mas foi chamada com parâmetros {1}.
tr: Hizmet uygulama nesnesi hatalı sayıda giriş parametresiyle çağrıldı. İşlem {0} parametre beklerken {1} parametreyle çağrıldı.
zh_hans: 调用服务实现对象所用的输入参数个数不正确，操作需要 {0} 个参数，但调用使用了 {1} 个参数。
zh_hant: 叫用服務實作物件的輸入參數數目有誤，作業應要有 {0} 個參數，但呼叫時用了 {1} 個參數。

# SFxInputParametersToServiceNull
source: Service implementation object invoked with null input parameters, but operation expects {0} parameters.
cs: Objekt implementace služby byl vyvolán vstupními parametry s hodnotou NULL, ale operace očekává parametry {0}.
de: Das Dienstimplementierungsobjekt wurde mit Null Eingabeparametern aufgerufen, der Vorgang erwartet jedoch {0} Parameter.
es: Se llamó a un objeto de implementación de servicio con parámetros de entrada nulos, pero la operación espera parámetros {0}.
fr: L'objet d'implémentation de service a été appelé avec des paramètres d'entrée ayant une valeur null, mais l'opération attend {0} paramètres.
it: L'oggetto di implementazione del servizio è stato richiamato con parametri di input Null, ma l'operazione prevede {0} parametri.
ja: null 入力パラメーターでサービス実装オブジェクトが呼び出されました。操作には {0} パラメーターが必要です。
ko: null 입력 매개 변수로 서비스 구현 개체를 호출했지만, 작업에는 {0} 매개 변수가 필요합니다.
pl: Obiekt implementacji usługi został wywołany z parametrami wejściowymi równymi null, gdy operacja oczekuje {0} parametrów.
pt_br: Objeto de implementação de serviço invocado com parâmetros de entrada nulos, mas a operação espera parâmetros {0}.
tr: Hizmet uygulama nesnesi null giriş parametreleriyle çağrıldı, ancak işlem {0} parametre bekliyordu.
zh_hans: 调用服务实现对象使用的输入参数为 Null，但操作需要 {0} 个参数。
zh_hant: 叫用服務實作物件的輸入參數為 null，但作業應要有 {0} 個參數。

# SFxInstanceNotInitialized
source: The InstanceContext has no provider for creating Service implementation objects.
cs: Třída InstanceContext nemá zprostředkovatele pro vytváření objektů implementace služby.
de: Der InstanceContext enthält keinen Anbieter für das Erstellen von Dienstimplementierungsobjekten.
es: InstanceContext no tiene ningún proveedor para crear objetos de implementación de servicio.
fr: InstanceContext ne contient pas de fournisseur pour créer les objets d'implémentation du service.
it: L'elemento InstanceContext non contiene provider per la creazione di oggetti di implementazione del servizio.
ja: InstanceContext に、サービス実装オブジェクトを作成するためのプロバイダーがありません。
ko: InstanceContext has에 서비스 구현 개체를 만들기 위한 공급자가 없습니다.
pl: Obiekt InstanceContext nie ma dostawcy do utworzenia implementacji obiektu usługi.
pt_br: O InstanceContext não tem provedor para criar objetos de implementação de Serviço.
tr: InstanceContext, Service uygulama nesneleri oluşturmak için sağlayıcıya sahip değil.
zh_hans: InstanceContext 不具有创建服务实现对象的提供程序。
zh_hant: InstanceContext 不具有建立 Service 實作物件的提供者。

# SFxInterleavedContextScopes0
source: This OperationContextScope is being disposed out of order.
cs: Třída OperationContextScope je vyřazována mimo pořadí.
de: Dieser OperationContextScope wird außerhalb der Reihenfolge gelöscht.
es: El elemento OperationContextScope se está desechando fuera de secuencia.
fr: OperationContextScope est supprimé dans le désordre.
it: Questo elemento OperationContextScope è stato eliminato in modo non corretto.
ja: この OperationContextScope が正しくない順序で破棄されています。
ko: 이 OperationContextScope가 잘못되어 삭제됩니다.
pl: Obiekt OperationContextScope jest usuwany poza kolejnością.
pt_br: Este OperationContextScope está sendo descartado fora de ordem.
tr: Bu OperationContextScope, bozuk olduğu için atıldı.
zh_hans: 此 OperationContextScope 正在按无序顺序释放。
zh_hant: 未按順序處置此 OperationContextScope。

# SFxInternalCallbackError
source: The client was unable to process the callback request due to an internal error. For more information about the error, either turn on IncludeExceptionDetailInFaults (either from CallbackBehaviorAttribute or from the <clientDebug> configuration behavior) on the client in order to send the exception information back to the server, or turn on tracing as per the Microsoft .NET Framework SDK documentation and inspect the client trace logs.
cs: Klient nemohl zpracovat požadavek zpětného volání, protože došlo k vnitřní chybě. Další informace o chybě získáte, pokud v klientovi zapnete třídu IncludeExceptionDetailInFaults (z třídy CallbackBehaviorAttribute nebo z chování konfigurace <clientDebug>), aby byly odeslány informace o výjimce zpět na server, nebo pokud zapnete trasování podle pokynů v dokumentaci sady Microsoft .NET Framework SDK a zkontrolujete protokoly trasování klienta.
de: Der Client konnte die Rückrufanforderung aufgrund eines internen Fehlers nicht verarbeiten. Wenn Sie weitere Informationen zum Fehler erhalten möchten, aktivieren Sie entweder IncludeExceptionDetailInFaults (über das CallbackBehaviorAttribute oder das <clientDebug>-Konfigurationsverhalten) für den Client, um die Ausnahmeinformationen zurück an den Server zu senden, oder aktivieren Sie die Ablaufverfolgung gemäß der Microsoft .NET Framework SDK-Dokumentation, und überprüfen Sie die Clientablaufprotokolle.
es: El cliente no pudo procesar la solicitud de devolución de llamada debido a un error interno. Para obtener más información acerca del error, active IncludeExceptionDetailInFaults (desde CallbackBehaviorAttribute o desde el comportamiento de configuración de <clientDebug>) en el cliente para enviar la información de la excepción al servidor, o active la traza según las instrucciones de la documentación de Microsoft .NET Framework SDK y consulte los registros de seguimiento del cliente.
fr: Le client n'a pas pu traiter la demande de rappel en raison d'une erreur interne. Pour plus d'informations sur l'erreur, activez IncludeExceptionDetailInFaults (depuis CallbackBehaviorAttribute ou depuis le comportement de configuration <clientDebug>) sur le client pour renvoyer les informations de l'exception au serveur, ou activez le traçage conformément à la documentation du SDK Microsoft .NET Framework et examinez les journaux des traces du client.
it: Il client non è riuscito a elaborare la richiesta di callback a causa di un errore interno. Per altre informazioni sull'errore, attivare IncludeExceptionDetailInFaults (da CallbackBehaviorAttribute o dal comportamento di configurazione <clientDebug>) nel client in modo da restituire le informazioni sull'eccezione al server oppure attivare la traccia come descritto nella documentazione di Microsoft .NET Framework SDK e analizzare i log di traccia del client.
ja: 内部エラーのため、クライアントはコールバック要求を処理できませんでした。このエラーの詳細については、例外情報をサーバーに返信するためにクライアントで IncludeExceptionDetailInFaults を有効にするか (CallbackBehaviorAttribute または <clientDebug> 構成動作を通じて)、Microsoft .NET Framework SDK ドキュメントに従ってトレースを有効にして、クライアントのトレース ログを調べてください。
ko: 내부 오류로 인해 클라이언트에서 콜백 요청을 처리할 수 없습니다. 오류에 대한 자세한 내용을 보려면 서버에 예외 정보를 다시 보낼 수 있도록 클라이언트에서 CallbackBehaviorAttribute 또는 <clientDebug> 구성 동작의 IncludeExceptionDetailInFaults를 설정하거나, Microsoft .NET Framework SDK 설명서마다 추적 기능을 설정하고 클라이언트 추적 로그를 확인하세요.
pl: Klient nie mógł przetworzyć żądania wywołania zwrotnego z powodu błędu wewnętrznego. Aby uzyskać więcej informacji dotyczących tego błędu, włącz parametr IncludeExceptionDetailInFaults (w atrybucie CallbackBehaviorAttribute lub zachowaniu konfiguracji <clientDebug>) na kliencie w celu odsyłania informacji o wyjątkach na serwer albo włącz śledzenie, tak jak opisano w dokumentacji zestawu Microsoft .NET Framework SDK i przejrzyj dzienniki śledzenia klienta.
pt_br: O cliente não pôde processar a solicitação de retorno de chamada devido a um erro interno. Para obter mais informações sobre o erro, ative IncludeExceptionDetailInFaults (na classe CallbackBehaviorAttribute ou no comportamento de configuração <clientDebug>) no cliente para enviar as informações de exceção de volta para o servidor ou ative o rastreamento de acordo com a documentação do SDK do Microsoft .NET Framework e examine os logs de rastreamento do cliente.
tr: İstemci, bir iç hataya nedeniyle geri çağrı isteğini işleyemedi. Hata hakkında daha fazla bilgi için, istemcideki özel durum bilgilerini sunucuya geri göndermek üzere IncludeExceptionDetailInFaults işlevini etkinleştirin (CallbackBehaviorAttribute içinden ya da <clientDebug> yapılandırma davranışından) veya izlemeyi Microsoft .NET Framework SDK belgelendirmesi olarak açın ve istemci izleme günlüklerini inceleyin.
zh_hans: 由于内部错误，客户端无法处理回调请求。有关该错误的详细信息，请打开客户端上的 IncludeExceptionDetailInFaults (从 CallbackBehaviorAttribute 或从 <clientDebug> 配置行为)以便将异常信息发送回服务器，或打开对每个 Microsoft .NET Framework SDK 文档的跟踪并检查客户端跟踪日志。
zh_hant: 因為內部錯誤，所以用戶端無法處理回呼要求。如需有關錯誤的詳細資訊，請在用戶端開啟 IncludeExceptionDetailInFaults (從 CallbackBehaviorAttribute 或從 <clientDebug> 組態行為)，以將例外狀況資訊傳回伺服器，或是依照 Microsoft .NET Framework SDK 文件開啟追蹤並檢查用戶端追蹤記錄檔。

# SFxInternalServerError
source: The server was unable to process the request due to an internal error. For more information about the error, either turn on IncludeExceptionDetailInFaults (either from ServiceBehaviorAttribute or from the <serviceDebug> configuration behavior) on the server in order to send the exception information back to the client, or turn on tracing as per the Microsoft .NET Framework SDK documentation and inspect the server trace logs.
cs: Server nemohl zpracovat požadavek, protože došlo k vnitřní chybě. Další informace o chybě získáte, pokud na serveru zapnete třídu IncludeExceptionDetailInFaults (z třídy ServiceBehaviorAttribute nebo z chování konfigurace <serviceDebug>), aby byly odeslány informace o výjimce zpět klientovi, nebo pokud zapnete trasování podle pokynů v dokumentaci sady Microsoft .NET Framework SDK a zkontrolujete protokoly trasování serveru.
de: Der Server konnte die Anforderung aufgrund eines internen Fehlers nicht verarbeiten. Wenn Sie weitere Informationen zum Fehler erhalten möchten, aktivieren Sie entweder IncludeExceptionDetailInFaults (über das ServiceBehaviorAttribute oder das <serviceDebug>-Konfigurationsverhalten) für den Client, um die Ausnahmeinformationen zurück an den Server zu senden, oder aktivieren Sie die Ablaufverfolgung gemäß der Microsoft .NET Framework SDK-Dokumentation, und überprüfen Sie die Serverablaufprotokolle.
es: El servidor no pudo procesar la solicitud debido a un error interno. Para obtener más información acerca del error, active IncludeExceptionDetailInFaults (desde ServiceBehaviorAttribute o desde el comportamiento de configuración de <serviceDebug>) en el servidor para enviar la información de la excepción al cliente, o active la traza según las instrucciones de la documentación de Microsoft .NET Framework SDK y consulte los registros de seguimiento del servidor.
fr: Le serveur n'a pas pu traiter la requête en raison d'une erreur interne. Pour plus d'informations sur l'erreur, activez IncludeExceptionDetailInFaults (depuis ServiceBehaviorAttribute ou depuis le comportement de configuration <serviceDebug>) sur le serveur pour renvoyer les informations de l'exception au client, ou activez le traçage conformément à la documentation du SDK Microsoft .NET Framework et examinez les journaux des traces du serveur.
it: Il server non è riuscito a elaborare la richiesta a causa di un errore interno. Per altre informazioni sull'errore, attivare IncludeExceptionDetailInFaults (da ServiceBehaviorAttribute o dal comportamento di configurazione <serviceDebug>) nel server in modo da restituire le informazioni sull'eccezione al client oppure attivare la traccia come descritto nella documentazione Microsoft .NET Framework SDK ed esaminare i log di traccia del server.
ja: 内部エラーのため、クライアントは要求を処理できませんでした。このエラーの詳細については、例外情報をクライアントに返信するためにサーバーで IncludeExceptionDetailInFaults を有効にするか (ServiceBehaviorAttribute または <serviceDebug> 構成動作を通じて)、Microsoft .NET Framework SDK ドキュメントに従ってトレースを有効にして、サーバーのトレース ログを調べてください。
ko: 내부 오류로 인해 서버에서 요청을 처리할 수 없습니다. 오류에 대한 자세한 내용을 보려면 클라이언트에 예외 정보를 다시 보낼 수 있도록 서버에서 ServiceBehaviorAttribute 또는 <serviceDebug> 구성 동작의 IncludeExceptionDetailInFaults를 설정하거나, Microsoft .NET Framework SDK 설명서마다 추적 기능을 설정하여 서버 추적 로그를 확인하세요.
pl: Serwer nie mógł przetworzyć żądania z powodu błędu wewnętrznego. Aby uzyskać więcej informacji dotyczących tego błędu, włącz parametr IncludeExceptionDetailInFaults (w atrybucie ServiceBehaviorAttribute lub zachowaniu konfiguracji <serviceDebug>) na serwerze w celu odsyłania informacji o wyjątkach do klienta albo włącz śledzenie, tak jak opisano w dokumentacji zestawu Microsoft .NET Framework SDK i przejrzyj dzienniki śledzenia serwera.
pt_br: O servidor não pôde processar a solicitação devido a um erro interno. Para obter mais informações sobre o erro, ative IncludeExceptionDetailInFaults (do ServiceBehaviorAttribute ou do comportamento de configuração <serviceDebug>) no servidor para enviar as informações de exceção de volta para o cliente ou ative o rastreamento de acordo com a documentação do SDK do Microsoft .NET Framework e examine os logs de rastreamento do servidor.
tr: İstemci, bir iç hataya nedeniyle isteği işleyemedi. Hata hakkında daha fazla bilgi için, sunucudaki özel durum bilgilerini istemciye geri göndermek üzere IncludeExceptionDetailInFaults işlevini etkinleştirin (ServiceBehaviorAttribute içinden ya da <serviceDebug> yapılandırma davranışından) veya izlemeyi Microsoft .NET Framework SDK belgelerine uygun olarak açın ve istemci izleme günlüklerini inceleyin.
zh_hans: 由于内部错误，服务器无法处理该请求。有关该错误的详细信息，请打开服务器上的 IncludeExceptionDetailInFaults (从 ServiceBehaviorAttribute 或从 <serviceDebug> 配置行为)以便将异常信息发送回客户端，或打开对每个 Microsoft .NET Framework SDK 文档的跟踪并检查服务器跟踪日志。
zh_hant: 由於內部錯誤，因此伺服器無法處理要求。若需有關錯誤的詳細資訊，請在伺服器端開啟 IncludeExceptionDetailInFaults (從 ServiceBehaviorAttribute 或從 <serviceDebug> 組態行為) 以便將例外狀況資訊傳回用戶端，或是依照 Microsoft .NET Framework SDK 文件開啟追蹤並檢查伺服器追蹤記錄檔。

# SFxInvalidAsyncResultState0
source: IAsyncResult's State must be the state argument passed to your Begin call.
cs: Stav třídy IAsyncResult musí být stavem, který argument předal volání zahájení.
de: Der Zustand von IAsyncResult muss das Zustandsargument sein, das an den Begin-Aufruf übergeben wird.
es: State en IAsyncResult debe ser el argumento de estado pasado a la llamada Begin.
fr: State de IAsyncResult peut-être l'argument d'état passé à votre appel Begin.
it: L'elemento State di IAsyncResult deve corrispondere all'argomento di stato passato alla chiamata Begin.
ja: IAsyncResult の State は、Begin 呼び出しに渡される、状態の引数であることが必要です。
ko: IAsyncResult의 상태는 Begin 호출에 전달된 상태 인수여야 합니다.
pl: Stan parametru IAsyncResult musi być argumentem stanu przekazywanym w wywołaniu Begin.
pt_br: O Estado da IAsyncResult deve ser o argumento de estado passado para sua chamada Begin.
tr: IAsyncResult özniteliğinin State değeri, Begin çağrınıza geçirilen bağımsız değişkenin durumu olmalıdır.
zh_hans: IAsyncResult 的状态必须是传递到 Begin 调用的状态参数。
zh_hant: IAsyncResult 的 State 必須是傳入 Begin 呼叫的狀態引數。

# SFxInvalidCallbackContractType
source: The CallbackContract {0} is invalid because it is not an interface type.
cs: Třída CallbackContract {0} je neplatná, protože není typem rozhraní.
de: Der CallbackContract {0} ist ungültig, da es sich nicht um einen gültigen Schnittstellentyp handelt.
es: CallbackContract {0} no es válido porque no es un tipo de interfaz.
fr: CallbackContract {0} est non valide, car ne s'agit pas d'un type d'interface.
it: L'elemento CallbackContract {0} non è valido perché non è un tipo di interfaccia.
ja: CallbackContract {0} はインターフェイス型ではないため無効です。
ko: 인터페이스 형식이 아니므로 CallbackContract {0}이(가) 잘못되었습니다.
pl: Obiekt CallbackContract {0} jest nieprawidłowy, ponieważ nie jest typem interfejsu.
pt_br: CallbackContract {0} é inválido porque não é um tipo interface.
tr: Arabirim türü olmadığından CallbackContract {0} geçersiz.
zh_hans: CallbackContract {0} 无效，因为它不是接口类型。
zh_hant: 因為 CallbackContract {0} 並非介面類型，所以無效。

# SFxInvalidCallbackIAsyncResult
source: IAsyncResult not provided or of wrong type.
cs: Třída IAsyncResult není poskytována nebo je nesprávného typu.
de: IAsyncResult wurde nicht angegeben oder hat den falschen Typ.
es: No se proporcionó un valor IAsyncResult o es de un tipo erróneo.
fr: IAsyncResult non fourni ou de type incorrect.
it: L'elemento IAsyncResult non è stato specificato o è di tipo errato.
ja: IAsyncResult が指定されていないか、型が正しくありません。
ko: IAsyncResult가 제공되지 않았거나 형식이 잘못되었습니다.
pl: Parametr IAsyncResult nie został przekazany lub jest nieprawidłowego typu.
pt_br: IAsyncResult não fornecido ou de tipo incorreto.
tr: IAsyncResult sağlanmadı ya da hatalı türde.
zh_hans: 未提供 IAsyncResult 或 IAsyncResult 类型错误。
zh_hant: 未提供 IAsyncResult 或是類型錯誤。

# SFxInvalidChannelToOperationContext
source: Invalid IContextChannel passed to OperationContext. Must be either a server dispatching channel or a client proxy channel.
cs: Neplatná třída IContextChannel byla předána třídě OperationContext. Musí to být server odesílající kanál nebo kanál proxy klienta.
de: An OperationContext wurde ein ungültiger IContextChannel übergeben. Es muss entweder ein Serververteilungskanal oder ein Clientproxykanal übergeben werden.
es: Se pasó un valor IContextChannel no válido a OperationContext. Debe ser un canal de distribución de servidor o un canal de proxy de cliente.
fr: IContextChannel non valide passé à OperationContext. Il doit être un canal de distribution de serveur ou un canal proxy de client.
it: L'elemento IContextChannel passato a OperationContext non è valido. Deve essere un canale di invio server o un canale proxy client.
ja: 無効な IContextChannel が OperationContext に渡されました。サーバー ディスパッチ チャネルか、クライアント プロキシ チャネルのいずれかである必要があります。
ko: 잘못된 IContextChannel이 OperationContext에 전달되었습니다. 서버 발송 채널이거나 클라이언트 프록시 채널이어야 합니다.
pl: Obiektowi OperationContext przekazano nieprawidłowy parametr IContextChannel. Parametr musi być kanałem wysyłania serwera lub kanałem serwera proxy klienta.
pt_br: IContextChannel inválido passado para OperationContext. Deve ser um canal de expedição de servidor ou um canal de proxy de cliente.
tr: OperationContext öğesine Geçersiz IContextChannel geçirildi. Sunucu dağıtma kanalı ya da istemci proxy kanalı olmalı.
zh_hans: 传递给 OperationContext 的 IContextChannel 无效。必须是派发服务器通道或客户端代理服务器通道。
zh_hant: 傳入至 OperationContext 的 IContextChannel 無效。必須是伺服器發送通道，或用戶端 Proxy 通道。

# SFxInvalidMessageBody
source: OperationFormatter encountered an invalid Message body. Expected to find node type 'Element' with name '{0}' and namespace '{1}'. Found node type '{2}' with name '{3}' and namespace '{4}'
cs: Formátovací modul OperationFormatter zjistil neplatné tělo zprávy. Očekávala nalezení typu uzlu Element s názvem {0} a oborem názvů {1}. Byl nalezen typ uzlu {2} s názvem {3} a oborem názvů {4}
de: OperationFormatter hat einen ungültigen Nachrichtentext gefunden. Es wurde erwartet, den Knotentyp "Element" mit dem Namen "{0}" und dem Namespace "{1}" zu finden. Gefunden wurde der Knotentyp "{2}" mit dem Namen "{3}" und dem Namespace "{4}".
es: El elemento OperationFormatter encontró un cuerpo de mensaje no válido. Se esperaba encontrar el tipo de nodo "Element" con el nombre "{0}" y el espacio de nombres "{1}". Se encontró el tipo de nodo "{2}" con el nombre "{3}" y el espacio de nombres "{4}"
fr: OperationFormatter a rencontré un corps de Message non valide. Type de nœud 'Element' attendu pour le nom '{0}' et l'espace de noms '{1}'. Type de nœud '{2}' trouvé comportant le nom '{3}' et l'espace de noms '{4}'
it: L'elemento OperationFormatter ha rilevato un corpo del messaggio non valido. È previsto un nodo di tipo 'Element' denominato '{0}' con spazio dei nomi '{1}'. È stato trovato un nodo di tipo '{2}' denominato '{3}' con spazio dei nomi '{4}'
ja: OperationFormatter で、無効なメッセージ本文が検出されました。名前が '{0}' で名前空間が '{1}' のノード型 'Element' が検出される必要がありますが、名前が '{3}' で名前空間が '{4}' のノード型 '{2}' が検出されました。
ko: OperationFormatter가 잘못된 Message 본문을 발견했습니다. 이름이 '{0}'이고 네임스페이스가 '{1}'인 노드 형식 'Element'가 필요하지만 이름이 '{3}'이고 네임스페이스가 '{4}'인 노드 형식 '{2}'을(를) 찾았습니다.
pl: Obiekt OperationFormatter napotkał nieprawidłową treść komunikatu. Oczekiwano węzła typu „Element” o nazwie „{0}” z przestrzenią nazw „{1}”. Odnaleziono węzeł typu „{2}” o nazwie „{3}” z przestrzenią nazw „{4}”
pt_br: O OperationFormatter encontrou um corpo de Mensagem inválido. Esperava-se encontrar o tipo de nó 'Element' com nome '{0}' e namespace '{1}'. Encontrado tipo de nó '{2}' com nome '{3}' e namespace '{4}'
tr: OperationFormatter, geçersiz bir Message gövdesiyle karşılaştı. '{0}' adlı ve '{1}' ad alanlı düğüm türü 'Element' bekleniyordu. {3}' adlı ve '{4}' ad alanlı '{2}' düğüm türü bulundu
zh_hans: OperationFormatter 遇到无效的消息正文。需要查找名称为“{0}”、命名空间为“{1}”的节点类型 "Element"。找到名称为“{3}”、命名空间为“{4}”的节点类型“{2}”
zh_hant: OperationFormatter 出現無效的 Message 內文。應要有名稱為 '{0}' 且命名空間為 '{1}' 的節點類型 'Element'，但找到名稱為 '{3}' 且命名空間為 '{4}' 的節點類型 '{2}'

# SFxInvalidMessageBodyEmptyMessage
source: The OperationFormatter could not deserialize any information from the Message because the Message is empty (IsEmpty = true).
cs: Třída OperationFormatter nemůže rekonstruovat informace ze zprávy, protože zpráva je prázdná (IsEmpty = true).
de: Der OperationFormatter konnte keine Informationen aus der Nachricht deserialisieren, da die Nachricht leer ist (IsEmpty = true).
es: El elemento OperationFormatter no pudo deserializar la información del mensaje porque el mensaje está vacío (IsEmpty = true).
fr: OperationFormatter n'a pas pu désérialiser d'informations du Message, car ce dernier est vide (IsEmpty = true).
it: L'elemento OperationFormatter non è riuscito a deserializzare informazioni da Message perché Message è vuoto (IsEmpty = true).
ja: OperationFormatter は、Message が空 (IsEmpty = true) のため、Message から情報をシリアル化解除できませんでした。
ko: 메시지가 비어 있으므로(IsEmpty = true) OperationFormatter가메시지의 정보를 deserialize할 수 없습니다.
pl: Obiekt OperationFormatter nie mógł zdeserializować żadnej informacji z komunikatu, ponieważ komunikat jest pusty (IsEmpty = true).
pt_br: O OperationFormatter não pôde desserializar nenhuma informação da Mensagem porque a Mensagem está vazia (IsEmpty = true).
tr: OperationFormatter, Message boş olduğundan (IsEmpty = true), Message içindeki bilgileri seri durumdan çıkaramadı.
zh_hans: OperationFormatter 无法反序列化消息中的任何信息，因为消息为空(IsEmpty = true)。
zh_hant: 由於 Message 為空白 (IsEmpty = true)，因此 OperationFormatter 無法還原序列化 Message 中的任何資訊。
