Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# MtomBufferQuotaExceeded
source: The maximum buffer size ({0}) has been exceeded while reading MTOM data. This quota may be increased by changing the maxBufferSize setting used when creating the MTOM reader.
cs: Při čtení dat MTOM se překročila maximální velikost vyrovnávací paměti ({0}). Tuto kvótu jde zvýšit změnou nastavení maxBufferSize, které se používá při vytváření čtecí funkce MTOM.
de: Die maximale Puffergröße ({0}) wurde beim Lesen von MTOM-Daten überschritten. Dieses Kontingent kann durch Ändern der beim Erstellen des MTOM-Lesers verwendeten Einstellung "maxBufferSize" erhöht werden.
es: Se superó el tamaño de búfer máximo ({0}) al leer los datos MTOM. Esta cuota se puede aumentar cambiando la opción maxBufferSize empleada para crear el lector MTOM.
fr: La taille maximale de la mémoire tampon ({0}) a été dépassée durant la lecture des données MTOM. Ce quota peut être augmenté en changeant le paramètre maxBufferSize utilisé au moment de la création du lecteur MTOM.
it: Dimensioni massime del buffer ({0}) superate durante la lettura di dati MTOM. Questa quota può essere incrementata modificando l'impostazione maxBufferSize utilizzata durante la creazione del lettore MTOM.
ja: MTOM データの読み取り中に最大バッファサイズ ({0}) を超えました。このクォータを増やすには、MTOM リーダーの作成中に使用される maxBufferSize 設定を変更してください。
ko: MTOM 데이터를 읽는 동안 최대 버퍼 크기({0})를 초과했습니다. MTOM 판독기를 만들 때 사용되는 maxBufferSize 설정을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytu danych MTOM został przekroczony maksymalny rozmiar buforu ({0}). Wartość tę można zwiększyć, zmieniając ustawienie maxBufferSize używane podczas tworzenia modułu odczytującego MTOM.
pt_br: O tamanho de buffer máximo ({0}) foi excedido durante a leitura dos dados MTOM. Essa cota pode ser aumentada pela alteração da configuração maxBufferSize usada na criação da leitora de MTOM.
tr: MTOM verileri okunurken en büyük arabellek boyutu ({0}) aşıldı. Bu kota, MTOM okuyucusu oluşturulurken maxBufferSize ayarı değiştirilerek artırılabilir.
zh_hans: 读取 MTOM 数据时超出最大缓冲区大小({0})。可通过更改创建 MTOM 读取器时所使用的 maxBufferSize 设置来增加此配额。
zh_hant: 讀取 MTOM 資料時已經超過最大緩衝區大小 ({0})。在建立 MTOM 讀取器時變更使用的 maxBufferSize 設定，便可以增加此配額。

# MtomContentTransferEncodingNotPresent
source: Content-Transfer-Encoding header with value '{0}' must be present for binary part.
cs: Pro binární část musí být přítomná hlavička Content-Transfer-Encoding s hodnotou {0}.
de: Für einen Abschnitt mit Binärdaten muss ein Content-Transfer-Encoding-Header mit dem Wert "{0}" vorhanden sein.
es: El encabezado Content-Transfer-Encoding con el valor '{0}' debe estar presente para un elemento binario.
fr: L'en-tête Content-Transfer-Encoding avec la valeur '{0}' doit être présent pour la partie binaire.
it: La parte binaria deve presentare l'intestazione Content-Transfer-Encoding con valore '{0}'.
ja: 値 '{0}' の Content-Transfer-Encoding ヘッダーが、バイナリ部に記述されている必要があります。
ko: '{0}' 값을 가지는 Content-Transfer-Encoding 헤더가 이진 부분에 대해 있어야 합니다.
pl: Dla części binarnej musi być obecny nagłówek Content-Transfer-Encoding o wartości „{0}”.
pt_br: O cabeçalho Content-Transfer-Encoding da parte binária com valor '{0}' deve ser apresentado.
tr: '{0}' değerine sahip Content-Transfer-Encoding üst bilgisi ikili bölümde bulunmalı.
zh_hans: 包含值“{0}”的内容传送编码标头必须显示为二进制部分。
zh_hant: 對於二進位部份，值為 '{0}' 的 Content-Transfer-Encoding 標頭必須存在。

# MtomContentTransferEncodingNotSupported
source: '{0}' Content-Transfer-Encoding not supported for infoset. Must be one of '{1}', '{2}', or '{3}'.
cs: Hlavička Content-Transfer-Encoding s hodnotou {0} není pro informační sadu podporovaná. Musí mít hodnotu {1}, {2} nebo {3}.
de: Der Content-Transfer-Encoding-Wert "{0}" wird für das Infoset nicht unterstützt. Gültige Werte sind "{1}", "{2}" oder "{3}".
es: El conjunto de información no admite el elemento Content-Transfer-Encoding '{0}'. Debe ser '{1}', '{2}' o '{3}'.
fr: Pas de prise en charge de Content-Transfer-Encoding '{0}' pour infoset. Doit être '{1}', '{2}' ou '{3}'.
it: Content-Transfer-Encoding di '{0}' non supportata per InfoSet. Deve essere '{1}', '{2}' o '{3}'.
ja: infoset に対する '{0}' Content-Transfer-Encoding はサポートされていません。'{1}'、'{2}'、'{3}' のいずれかである必要があります。
ko: '{0}' Content-Transfer-Encoding이 infoset에 지원되지 않습니다. '{1}', '{2}' 또는 '{3}' 중 하나여야 합니다.
pl: Element Content-Transfer-Encoding o wartości „{0}” nie jest obsługiwany w przypadku obiektów typu infoset. Wymagana jest jedna z następujących wartości: „{1}”, „{2}” lub „{3}”.
pt_br: Não há suporte para '{0}' Content-Transfer-Encoding do infoset. Deve ser um desses '{1}', '{2}' ou '{3}'.
tr: Bilgi kümesi için '{0}' Content-Transfer-Encoding desteklenmiyor. '{1}', '{2}' veya '{3}' değerlerinden biri olmalı.
zh_hans: Infoset 不支持“{0}”内容传送编码。必须为“{1}”、“{2}”或“{3}”之一。
zh_hant: InfoSet 不支援 '{0}' Content-Transfer-Encoding。必須是 '{1}'、'{2}' 或 '{3}'。

# MtomContentTypeInvalid
source: contentType must be non-zero length string.
cs: contentType musí být řetězec nenulové délky.
de: contentType muss eine Zeichenfolge mit einer Länge größer NULL sein.
es: El elemento contentType debe ser una cadena que no tenga una longitud cero.
fr: contentType doit être une chaîne d'une longueur différente de zéro.
it: contentType deve essere una stringa di lunghezza maggiore di zero.
ja: contentType は 0 以外の長さの文字列である必要があります。
ko: contentType은 길이가 0이 아닌 문자열이어야 합니다.
pl: Parametr contentType musi być ciągiem o długości niezerowej.
pt_br: contentType deve ser uma cadeia de caracteres de comprimento diferente de zero.
tr: contentType sıfır uzunluğunda olmayan bir dize olmalıdır.
zh_hans: contentType 必须是长度不为零的字符串。
zh_hant: contentType 必須是非零長度的字串。

# MtomDataMustNotContainXopInclude
source: XML data contained in MTOM messages must not contain element with name '{0}' from namespace '{1}'.
cs: Data XML obsažená ve zprávách MTOM nesmějí obsahovat element s názvem {0} z oboru názvů {1}.
de: Die in der MTOM-Nachricht enthaltenen XML-Daten dürfen kein Element mit dem Namen "{0}" aus Namespace "{1}" enthalten.
es: Los datos XML que contienen los mensajes MTOM no pueden incluir un elemento con el nombre '{0}' del espacio de nombres '{1}'.
fr: Les données XML contenues dans les messages MTOM ne doivent pas contenir d'éléments portant le nom '{0}' provenant de l'espace de noms '{1}'.
it: I dati XML contenuti nei messaggi MTOM non devono contenere elementi con nome '{0}' dallo spazio dei nomi '{1}'.
ja: MTOM メッセージに含まれる XML データは、名前空間 '{1}' の名前 '{0}' を持つ要素を含むことはできません。
ko: MTOM 메시지에 포함된 XML 데이터는 네임스페이스 '{1}'의 '{0}' 이름을 가진 요소를 포함하면 안 됩니다.
pl: Dane XML zawarte w komunikatach MTOM nie mogą zawierać elementu o nazwie „{0}” z przestrzeni nazw „{1}”.
pt_br: Os dados XML contidos nas mensagens MTOM não devem conter elementos com nome '{0}' do namespace '{1}'.
tr: MTOM iletilerinde bulunan XML verilerinde '{1}' ad alanından '{0}' adlı öğe bulunmamalıdır.
zh_hans: MTOM 消息中包含的 XML 数据不能包含命名空间“{1}”中名为“{0}”的元素。
zh_hant: MTOM 訊息內含的 XML 資料不可以包含來自命名空間 '{1}' 名為 '{0}' 的元素。

# MtomEncoderBadMessageVersion
source: MessageVersion '{0}' not supported by MTOM encoder.
cs: Třídu MessageVersion {0} kodér MTOM nepodporuje.
de: Die MessageVersion "{0}" wird vom MTOM-Encoder nicht unterstützt.
es: El codificador MTOM no es compatible con MessageVersion "{0}".
fr: Le MessageVersion '{0}' n'est pas pris en charge par l'encodeur MTOM.
it: L'elemento MessageVersion '{0}' non è supportato dal codificatore MTOM.
ja: MessageVersion '{0}' は MTOM エンコーダーでサポートされていません。
ko: MessageVersion '{0}'이(가) MTOM 인코더에서 지원되지 않습니다.
pl: Element MessageVersion „{0}” nie jest obsługiwany przez koder MTOM.
pt_br: O codificador MTOM não dá suporte para a propriedade MessageVersion '{0}'.
tr: MTOM kodlayıcısı tarafından desteklenmeyen MessageVersion '{0}'.
zh_hans: MTOM 编码器不支持 MessageVersion“{0}”。
zh_hant: MTOM 編碼器不支援 MessageVersion '{0}'。

# MtomExceededMaxSizeInBytes
source: The 'maximum size in bytes' quota ({0}) has been exceeded while writing MTOM data. This quota may be increased by changing the maxSizeInBytes setting used when creating the MTOM writer.
cs: Při zápisu dat MTOM se překročila kvóta maximální velikost v bajtech ({0}). Tuto kvótu jde zvýšit změnou nastavení maxSizeInBytes používaného při vytváření zapisovací funkce MTOM.
de: Das Kontingent für die "maximale Größe in Bytes" ({0}) wurde beim Schreiben von MTOM-Daten überschritten. Dieses Kontingent kann durch Ändern der beim Erstellen des MTOM-Generators verwendeten Einstellung "maxSizeInBytes" erhöht werden.
es: La cuota de 'tamaño máximo en bytes' ({0}) se superó al escribir datos MTOM. Esta cuota se puede aumentar cambiando la configuración maxSizeInBytes usada para crear el escritor MTOM.
fr: Le quota 'taille maximale en octets' ({0}) a été dépassé durant l'écriture de données MTOM. Ce quota peut être augmenté en changeant le paramètre maxSizeInBytes utilisé au moment de la création de l'enregistreur MTOM.
it: Quota per la dimensione massima in byte ({0}) superata durante la scrittura di dati MTOM. Questa quota può essere incrementata modificando l'impostazione maxSizeInBytes utilizzata durante la creazione del writer MTOM.
ja: MTOM データの書き込み中に 'バイト単位の最大サイズ' クォータ ({0}) を超えました。このクォータを増やすには、MTOM ライターの作成時に使用される maxSizeInBytes 設定を変更してください。
ko: MTOM 데이터를 쓰는 동안 '최대 크기(바이트)' 할당량({0})을 초과했습니다. MTOM 판독기를 만들 때 사용되는 maxSizeInBytes 설정을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytu danych MTOM przekroczono maksymalny rozmiar (w bajtach) ({0}). Wartość tę można zwiększyć, zmieniając ustawienie maxSizeInBytes używane podczas tworzenia modułu zapisującego MTOM.
pt_br: A cota de 'tamanho máximo em bytes' ({0}) foi excedida durante a gravação de dados MTOM. Essa cota pode ser aumentada alterando a definição maxSizeInBytes usada na criação do gravador MTOM.
tr: MTOM verileri yazılırken en büyük arabellek boyutu ({0}) aşıldı. Bu kota, MTOM yazıcısı oluşturulurken maxSizeInBytes ayarı değiştirilerek artırılabilir.
zh_hans: 编写 MTOM 数据时，已超出“最大字节数”配额({0})。可通过更改创建 MTOM 读取器时所使用的 maxSizeInBytes 设置来增加此配额。
zh_hant: 寫入 MTOM 資料時已經超過「最大值 (以位元組為單位)」配額 ({0})。在建立 MTOM 寫入變更使用的 maxSizeInBytes 設定，便可以增加此配額。

# MtomInvalidCIDUri
source: Invalid URI '{0}' specified for MIME part Content-ID is not conformant cid URI.
cs: Neplatný identifikátor URI {0} zadaný pro část MIME Content-ID neodpovídá identifikátoru cid URI.
de: Es wurde ein ungültiger URI "{0}" für einen MIME-Abschnitt angegeben. Die Content-ID ist kein MIME-konformer CID-URI.
es: El URI '{0}' especificado para el identificador Content-ID del elemento MIME no es válido, ya que no es un URI de identificador de confirmación (CID) compatible.
fr: L'URI '{0}' non valide spécifié pour la partie MIME Content-ID n'est pas conforme au schéma URI de l'identificateur de connexion.
it: URI '{0}' non valido specificato per la parte MIME Content-ID. URI cid non conforme.
ja: MIME パートの Content-ID に対して指定された無効な URI '{0}' は、整合 cid URI ではありません。
ko: MIME 부분 Content-ID에 지정된 URI '{0}'이(가) 잘못되어 규칙에 맞는 cid URI가 아닙니다.
pl: Nieprawidłowy identyfikator URI „{0}” określony dla identyfikatora zawartości części MIME nie jest identyfikatorem URI zgodnym ze specyfikacją cid.
pt_br: URI '{0}' inválido especificado para a parte Content-ID do MIME não é compatível com cid URI.
tr: MIME bölümü Content-ID için belirtilen geçersiz URI '{0}', cid URI uyumlu değil.
zh_hans: 为 MIME 部分 Content-ID 指定的 URI“{0}”无效，不是一致的 cid URI。
zh_hant: 為 MIME 部份 Content-ID 指定的無效 URI '{0}' 不是一致的 cid URI。

# MtomInvalidEmptyURI
source: URI specified for MIME part Content-ID cannot be empty.
cs: Identifikátor URI zadaný pro část MIME Content-ID nemůže být prázdný.
de: Der für die Inhalts-ID eines MIME-Abschnitts angegebene URI kann nicht leer sein.
es: El URI especificado para el identificador Content-ID del elemento MIME no puede estar vacío.
fr: L'URI spécifié pour la partie MIME Content-ID ne peut pas être vide.
it: L'URI specificato per la parte MIME Content-ID non può essere vuoto.
ja: MIME パートの Content-ID として指定された URI を空にすることはできません。
ko: MIME 부분 Content-ID에 지정된 URI는 비어 있을 수 없습니다.
pl: Identyfikator URI określony dla identyfikatora zawartości części MIME nie może być pusty.
pt_br: URI especificado para a parte Content-ID do MIME não pode ser vazio.
tr: MIME bölümü Content-ID için belirtilen URI boş olamaz.
zh_hans: 为 MIME 部分 Content-ID 指定的 URI 不能为空。
zh_hant: 為 MIME 部份 Content-ID 指定的 URI 不可以空白。

# MtomInvalidStartUri
source: Invalid start URI for infoset '{0}'.
cs: Neplatný počáteční identifikátor URI pro informační sadu {0}.
de: Ungültiger Start-URI für den Infoset "{0}".
es: URI de inicio no válido para el conjunto de información '{0}'.
fr: URI de début non valide pour infoset '{0}'.
it: URI iniziale non valido per InfoSet '{0}'.
ja: infoset '{0}' に対する開始 URI は無効です。
ko: infoset '{0}'에 대한 시작 URI가 잘못되었습니다.
pl: Nieprawidłowy początkowy identyfikator URI dla obiektu typu infoset „{0}”.
pt_br: URI inicial inválido para infoset '{0}'.
tr: '{0}' bilgi kümesi için geçersiz başlatma URI değeri.
zh_hans: Infoset“{0}”的开始 URI 无效。
zh_hant: InfoSet '{0}' 的啟動 URI 無效。

# MtomInvalidTransferEncodingForMimePart
source: Content-Transfer-Encoding '{0}' not supported for binary part. Must be '{1}'.
cs: Hlavička Content-Transfer-Encoding {0} není pro binární část podporovaná. Musí být {1}.
de: Der Content-Transfer-Encoding-Wert "{0}" wird für Abschnitte mit Binärdaten nicht unterstützt. Erforderlich ist der Wert "{1}".
es: El elemento binario no admite el elemento Content-Transfer-Encoding '{0}'. Debe ser '{1}'.
fr: Pas de prise en charge de Content-Transfer-Encoding '{0}' pour la partie binaire. Doit être '{1}'.
it: Content-Transfer-Encoding '{0}' non supportato per la parte binaria. Deve essere '{1}'.
ja: バイナリ部に対する Content-Transfer-Encoding '{0}' はサポートされていません。'{1}' である必要があります。
ko: Content-Transfer-Encoding '{0}'이(가) 이진 부분에 지원되지 않습니다. '{1}'이어야 합니다.
pl: Element Content-Transfer-Encoding o wartości „{0}” nie jest obsługiwany w przypadku części binarnej. Wymagana jest wartość „{1}”.
pt_br: Não há suporte para Content-Transfer-Encoding '{0}' da parte binária. Deve ser '{1}'.
tr: '{0}' Content-Transfer-Encoding, ikili bölüm için desteklenmiyor. Olması gereken değer: '{1}'.
zh_hans: 二进制部分不支持内容传送编码“{0}”。必须为“{1}”。
zh_hant: 二進位部份不支援 Content-Transfer-Encoding '{0}'。必須是 '{1}'。

# MtomMessageContentTypeNotFound
source: Content-Type header for MTOM message not found.
cs: Nenašla se hlavička Content-Type pro zprávu MTOM.
de: Ein Content-Type-Header für eine MTOM-Nachricht konnte nicht gefunden werden.
es: No se encontró el encabezado Content-Type para el mensaje MTOM.
fr: En-tête Content-Type introuvable pour le message MTOM
it: Intestazione Content-Type non trovata per il messaggio MTOM.
ja: MTOM メッセージに対する Content-Type ヘッダーが見つかりません。
ko: MTOM 메시지에 대한 Content-Type 헤더를 찾을 수 없습니다.
pl: Nie znaleziono nagłówka Content-Type w przypadku komunikatu MTOM.
pt_br: Cabeçalho Content-Type da mensagem MTOM não encontrado.
tr: MTOM iletisinin Content-Type üst bilgisi bulunamadı.
zh_hans: 未找到 MTOM 消息的 Content-Type 标头。
zh_hant: 找不到 MTOM 訊息的 Content-Type 標頭。

# MtomMessageInvalidContent
source: MTOM message not valid. Does not contain correctly formatted content following headers.
cs: Zpráva MTOM není platná. Za hlavičkami neobsahuje správně formátovaný obsah.
de: MTOM-Nachricht ist ungültig. Die Nachricht enthält keinen auf Header folgenden, richtig formatierten Inhalt.
es: El mensaje MTOM no es válido: su contenido tiene un formato incorrecto siguiendo a los encabezados.
fr: Message MTOM non valide. La mise en forme du contenu suivant les en-têtes est incorrecte.
it: Messaggio MTOM non valido. Il formato del contenuto che segue le intestazioni non è valido.
ja: MTOM メッセージが無効です。ヘッダー以降、正しくフォーマットされたコンテンツが含まれていません。
ko: MTOM 메시지가 잘못되었습니다. 헤더 뒤에 올바른 형식의 콘텐츠가 없습니다.
pl: Nieprawidłowy komunikat MTOM. Nie zawiera prawidłowo sformatowanej zawartości po części nagłówkowej.
pt_br: Mensagem MTOM inválida. Não contém conteúdo formatado corretamente após cabeçalhos.
tr: MTOM iletisi geçerli değil. Doğru biçimlendirilmiş içerikten sonra gelen üst bilgi içermiyor.
zh_hans: MTOM 消息无效。不包含标头后面正确格式化的内容。
zh_hant: MTOM 訊息無效。標頭後面包含的內容格式不正確。

# MtomMessageInvalidContentInMimePart
source: MTOM message not valid. One or more MIME parts in the message does not contain correctly formatted content and/or boundary string.
cs: Zpráva MTOM není platná. Jedna nebo víc částí MIME ve zprávě neobsahuje správně formátovaný obsah a/nebo řetězec ohraničení.
de: MTOM-Nachricht ist ungültig. Mindestens ein MIME-Abschnitt der Nachricht enthält keinen richtig formatierten Inhalt bzw. keine Trennungszeichenfolge.
es: El mensaje MTOM no es válido. Algunas partes del mensaje MIME tienen un contenido o una cadena delimitadora con un formato incorrecto.
fr: Message MTOM non valide. Une ou plusieurs parties MIME dans le message présentent un contenu dont la mise en forme est incorrecte et/ou contiennent une chaîne limite (boundary).
it: Messaggio MTOM non valido. Il formato di una o più parti MIME del messaggio e/o della stringa limite non è valido.
ja: MTOM メッセージが無効です。メッセージ内の複数の MIME パートに、正しくフォーマットされたコンテンツおよび境界文字列が含まれていません。
ko: MTOM 메시지가 잘못되었습니다. 메시지에 있는 하나 이상의 MIME 부분에 올바른 형식의 콘텐츠 및/또는 경계 문자열이 없습니다.
pl: Nieprawidłowy komunikat MTOM. Co najmniej jedna część MIME komunikatu nie zawiera prawidłowo sformatowanej zawartości i/lub ciągu granicznego.
pt_br: Mensagem MTOM inválida. Uma ou mais partes MIME na mensagem não contém conteúdo formatado corretamente e/ou cadeia de caracteres de limite.
tr: MTOM iletisi geçerli değil. İletideki bir ya da birkaç MIME bölümünde düzgün biçimlendirilmiş içerik ve/veya sınır dizesi bulunmuyor.
zh_hans: MTOM 消息无效。消息中一个或多个 MIME 部分不包含正确格式化的内容和/或二进制字符串。
zh_hant: MTOM 訊息無效。訊息中的一或多個 MIME 部份包含格式不正確的內容及 (或) 界限字串。

# MtomMessageInvalidMimeVersion
source: '{0}' not a valid MIME version. MTOM messages must have MIME version '{1}'.
cs: {0} není platná verze MIME. Zprávy MTOM musejí mít verzi MIME {1}.
de: Ungültige MIME-Version "{0}". MTOM-Nachrichten erfordern MIME-Version "{1}".
es: '{0}' no es una versión MIME válida. Los mensajes MTOM deben tener la versión MIME '{1}'.
fr: '{0}' n'est pas une version MIME valide. Les messages MTOM doivent contenir la version MIME '{1}'.
it: '{0}' non è una versione MIME valida. La versione MIME dei messaggi MTOM deve essere '{1}'.
ja: '{0}' は無効な MIME バージョンです。MTOM メッセージには、MIME バージョン '{1}' が含まれている必要があります。
ko: '{0}'이(가) 올바른 MIME 버전이 아닙니다. MTOM 메시지는 MIME 버전 '{1}'을(를) 가져야 합니다.
pl: „{0}” nie jest prawidłową wersją MIME. Komunikaty MTOM muszą mieć wersję MIME „{1}”.
pt_br: '{0}' não é uma versão MIME válida. As mensagens MTOM devem ter versão MIME '{1}'.
tr: '{0}' geçerli bir MIME sürümü değil. MTOM iletileri, '{1}' MIME sürümüne sahip olmalıdır.
zh_hans: “{0}”不是有效的 MIME 版本。MTOM 消息必须有 MIME 版本“{1}”。
zh_hant: '{0}' 不是有效的 MIME 版本。MTOM 訊息必須要有 MIME 版本 '{1}'。

# MtomMessageNotApplicationXopXml
source: MTOM messages must have type '{0}'.
cs: Zprávy MTOM musejí mít typ {0}.
de: MTOM-Nachrichten erfordern Typ "{0}".
es: Los mensajes MTOM deben tener el tipo '{0}'.
fr: Les messages MTOM doivent avoir le type '{0}'.
it: I messaggi MTOM devono essere di tipo '{0}'.
ja: MTOM メッセージには、型 '{0}' が含まれている必要があります。
ko: MTOM 메시지는 '{0}' 형식을 가져야 합니다.
pl: Komunikaty MTOM muszą być typu „{0}”.
pt_br: As mensagens MTOM devem ter um tipo '{0}'.
tr: MTOM iletileri, '{0}' türünde olmalıdır.
zh_hans: MTOM 消息必须有类型“{0}”。
zh_hant: MTOM 訊息必須要有類型 '{0}'。

# MtomMessageNotMultipart
source: MTOM messages must have media type '{0}' and media subtype '{1}'.
cs: Zprávy MTOM musejí mít typ média {0} a podtyp média {1}.
de: MTOM-Nachrichten erfordern den Medientyp "{0}" und den Medienuntertyp "{1}".
es: Los mensajes MTOM deben tener un tipo de medios '{0}' y un subtipo de medios '{1}'.
fr: Les messages MTOM doivent avoir le type média '{0}' et le sous-type média '{1}'.
it: I messaggi MTOM devono avere tipo di supporto '{0}' e sottotipo di supporto '{1}'.
ja: MTOM メッセージには、メディア型 '{0}' およびメディア サブタイプ '{1}' が含まれている必要があります。
ko: MTOM 메시지는 '{0}' 미디어 유형과 '{1}' 미디어 하위 유형을 가져야 합니다.
pl: Komunikaty mechanizmu MTOM muszą zawierać typ nośnika „{0}” i podtyp nośnika „{1}”.
pt_br: As mensagens MTOM devem ter um tipo de mídia '{0}' e um subtipo de mídia '{1}'.
tr: MTOM iletileri '{0}' medya türüne ve '{1}' medya alt türüne sahip olmalıdır.
zh_hans: MTOM 消息必须有媒体类型“{0}”和媒体子类型“{1}”。
zh_hant: MTOM 訊息必須要有媒體類型 '{0}' 及媒體子類型 '{1}'。

# MtomMessageRequiredParamNotSpecified
source: MTOM messages must have non-zero length '{0}' parameter in Content-Type header.
cs: Zprávy MTOM musejí mít v hlavičce Content-Type parametr {0} s nenulovou délkou.
de: MTOM-Nachrichten erfordern einen {0}-Parameter mit einer Länge ungleich NULL im Content-Type-Header.
es: Los mensajes MTOM deben tener un parámetro '{0}' cuya longitud no sea cero en el encabezado Content-Type.
fr: Les messages MTOM doivent contenir le paramètre '{0}' d'une longueur différente de zéro dans l'en-tête Content-Type.
it: I messaggi MTOM devono avere un parametro '{0}' di lunghezza maggiore di zero nell'intestazione Content-Type.
ja: MTOM メッセージには、長さが 0 以外の '{0}' パラメーターが Content-Type ヘッダー内に含まれている必要があります。
ko: MTOM 메시지는 Content-Type 헤더에 길이가 0이 아닌 '{0}' 매개 변수가 있어야 합니다.
pl: Komunikaty mechanizmu MTOM muszą zawierać parametr o niezerowej długości „{0}” w nagłówku Content-Type.
pt_br: As mensagens MTOM devem ter um parâmetro '{0}' de comprimento diferente de zero no cabeçalho Content-Type.
tr: MTOM iletileri Content-Type üst bilgisinde uzunluğu sıfır olmayan '{0}' parametresine sahip olmalıdır.
zh_hans: MTOM 消息在 Content-Type 标头中必须有非零长度参数“{0}”。
zh_hant: MTOM 訊息在 Content-Type 標頭中必須要有非零長度的 '{0}' 參數。

# MtomMimePartReferencedMoreThanOnce
source: MTOM message not valid. Infoset references MIME part with Content-ID '{0}' more than once.
cs: Zpráva MTOM není platná. Informační sada odkazuje na část MIME s identifikátorem obsahu {0} víckrát než jednou.
de: MTOM-Nachricht ist ungültig. Das Infoset verweist mehr als einmal auf einen MIME-Abschnitt mit der Content-ID "{0}".
es: El mensaje MTOM no es válido. El conjunto de información hace referencia a un elemento MIME con el identificador Content-ID '{0}' más de una vez.
fr: Message MTOM non valide. Infoset référence la partie MIME plus d'une fois avec Content-ID '{0}'.
it: Messaggio MTOM non valido. InfoSet fa riferimento alla parte MIME con Content-ID '{0}' più di una volta.
ja: MTOM メッセージが無効です。Infoset は、Content-ID '{0}' を持つ MIME パートを複数回参照しています。
ko: MTOM 메시지가 잘못되었습니다. Infoset에서 Content-ID '{0}'을(를) 가진 MIME 부분을 두 번 이상 참조합니다.
pl: Komunikat mechanizmu MTOM jest nieprawidłowy. Obiekt typu infoset zawiera więcej niż jedno odwołanie do części MIME o nagłówku Content-ID „{0}”.
pt_br: Mensagem MTOM inválida. O infoset referencia a parte MIME com Content-ID '{0}' mais de uma vez.
tr: MTOM iletisi geçerli değil. Infoset, '{0}' Content-ID olan MIME bölümüne birden fazla başvuru yapıyor.
zh_hans: MTOM 消息无效。Infoset 多次引用使用 Content-ID“{0}”的 MIME 部分。
zh_hant: MTOM 訊息無效。Infoset 參照具有 Content-ID '{0}' 的 MIME 部份超過一次以上。

# MtomPartNotFound
source: MIME part with Content-ID '{0}' not found.
cs: Část MIME s identifikátorem obsahu {0} se nenašla.
de: Ein MIME-Abschnitt mit der Content-ID "{0}" konnte nicht gefunden werden.
es: No se encuentra el elemento MIME con el identificador Content-ID '{0}'.
fr: Partie MIME avec Content-ID '{0}' introuvable.
it: Parte MIME con Content-ID '{0}' non trovata.
ja: Content-ID '{0}' を持つ MIME パートが見つかりません。
ko: Content-ID '{0}'을(를) 가진 MIME 부분을 찾을 수 없습니다.
pl: Nie znaleziono części MIME o identyfikatorze zawartości „{0}”.
pt_br: Parte MIME com Content-ID '{0}' não encontrada.
tr: Content-ID '{0}' olan MIME bölümü bulunamadı.
zh_hans: 未找到使用 Content-ID“{0}”的 MIME 部分。
zh_hant: 找不到具有 Content-ID '{0}' 的 MIME 部份。
