Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# InvalidXmlQualifiedName
source: Expected XML qualified name, found '{0}'.
cs: Byl očekáván plný název XML, nalezeno bylo {0}.
de: Es wurde ein qualifizierter XML-Name erwartet, jedoch "{0}" gefunden.
es: Se esperaba un nombre XML completo pero se encontró "{0}".
fr: Nom qualifié XML attendu. '{0}' trouvé.
it: È previsto un nome qualificato XML, ma è stato trovato '{0}'.
ja: XML 修飾名が必要ですが、'{0}' が見つかりました。
ko: XML 정규화된 이름이 필요한데 '{0}'을(를) 찾았습니다.
pl: Oczekiwano nazwy kwalifikowanej XML, znaleziono „{0}”.
pt_br: Nome qualificado XML esperado, encontrado '{0}'.
tr: Uygun XML adı bekleniyordu, '{0}' bulundu.
zh_hans: 应为 XML 限定名，但却找到“{0}”。
zh_hant: 應為 XML 限定名稱，但找到 '{0}'。

# IssuedSecurityTokenParametersNotSet
source: The security token parameters to use for the issued token are not set on '{0}'.
cs: Parametry tokenu zabezpečení určené k použití pro vydaný token nejsou nastaveny v {0}.
de: Die für das ausgestellte Token zu verwendenden Sicherheitstokenparameter sind auf "{0}" nicht festgelegt.
es: Los parámetros de token de seguridad que se deben usar para el token emitido no están establecidos en '{0}'.
fr: Les paramètres de jeton de sécurité à utiliser pour le jeton émis ne sont pas définis à '{0}'.
it: I parametri del token di sicurezza da utilizzare per il token rilasciato non sono impostati su '{0}'.
ja: 発行されたトークンに使用するセキュリティ トークン パラメーターが '{0}' で設定されていません。
ko: 발급된 토큰에 사용할 보안 토큰 매개 변수가 '{0}'에 설정되지 않았습니다.
pl: Parametry tokenu zabezpieczającego, które mają być używane dla wystawionego tokenu, nie zostały ustawione w elemencie „{0}”.
pt_br: Os parâmetros do token de segurança a serem usados para o token emitido não estão definidos em '{0}'.
tr: Verilen belirteç için kullanılacak güvenlik belirteci parametreleri '{0}' üstünde ayarlanmamış.
zh_hans: “{0}”上未设置用于颁发的令牌的安全令牌参数。
zh_hant: '{0}' 上未設定要用於發行權杖的安全性權杖參數。

# IssuerBindingNotPresentInTokenRequirement
source: The key length '{0}' is not a multiple of 8 for symmetric keys.
cs: Délka klíče {0} není násobkem osmi pro symetrické klíče.
de: Die Schlüssellänge "{0}" ist für symmetrische Schlüssel kein Vielfaches von 8.
es: La longitud de clave '{0}' no es un múltiplo de 8 para las claves simétricas.
fr: La longueur de clé '{0}' n'est pas un multiple de 8 pour des clés symétriques.
it: La lunghezza di chiave '{0}' non è un multiplo di 8 per le chiavi simmetriche.
ja: 対称キーについては、キーの長さ '{0}' は 8 の倍数ではありません。
ko: 키 길이 '{0}'이(가) 대칭 키에 대하여 8의 배수가 아닙니다.
pl: Długość klucza „{0}” dla kluczy symetrycznych nie jest wielokrotnością liczby 8.
pt_br: O comprimento de chave '{0}' não é um múltiplo de 8 para chaves simétricas.
tr: '{0}' anahtar uzunluğu simetrik anahtarlar için 8'in katı değil.
zh_hans: 对称密钥的密钥长度“{0}”不是 8 的倍数。
zh_hant: 對稱式金鑰的金鑰長度 '{0}' 不是 8 的倍數。

# IssuerBuildContextNotSet
source: The context for building the issuer channel was not specified on '{0}'.
cs: Kontext pro vytvoření kanálu vystavitele nebyl určen v {0}.
de: Der Kontext zum Erstellen des Ausstellerkanals wurde auf "{0}" nicht angegeben.
es: No se especificó el contexto para compilar el canal del emisor en '{0}'.
fr: Le contexte pour la génération du canal émetteur n'a pas été spécifié sur '{0}'.
it: Il contesto per la compilazione del canale emittente non è stato specificato in '{0}'.
ja: 発行者のチャネルを構築するコンテキストが '{0}' で指定されませんでした。
ko: 발급자 채널을 작성하기 위한 컨텍스트가 '{0}'에 지정되지 않았습니다.
pl: Kontekst budowania kanału wystawcy nie został określony w elemencie „{0}”.
pt_br: O contexto para construção do canal emissor não foi especificado em '{0}'.
tr: Veren kanal oluşturma kapsamı, '{0}' üstünde belirtilmedi.
zh_hans: “{0}”上未指定用于生成颁发者通道的上下文。
zh_hant: '{0}' 上未指定建立簽發者通道的內容。

# ItemAvailableInDeserializedRSTOnly
source: {0} is only available in a deserialized RequestSecurityToken.
cs: {0} je k dispozici pouze v rekonstruované třídě RequestSecurityToken.
de: {0} ist nur in einem deserialisierten RequestSecurityToken verfügbar.
es: {0} solo está disponible en un RequestSecurityToken deserializado.
fr: {0} est disponible seulement dans un jeton RequestSecurityToken désérialisé.
it: {0} è disponibile solo in un elemento RequestSecurityToken deserializzato.
ja: {0} は、シリアル化を解除された RequestSecurityToken でのみ利用できます。
ko: {0}은(는) deserialize된 RequestSecurityToken에서만 사용할 수 있습니다.
pl: Element {0} jest dostępny tylko w zdeserializowanym elemencie RequestSecurityToken.
pt_br: {0} está disponível apenas em uma solicitação RequestSecurityToken desserializada.
tr: {0}, yalnızca seri durumdan çıkarılan bir RequestSecurityToken içinde kullanılabilir.
zh_hans: {0} 仅在反序列化的 RequestSecurityToken 中可用。
zh_hant: 只能在已還原序列化的 RequestSecurityToken 中使用 {0}。

# ItemAvailableInDeserializedRSTROnly
source: {0} is only available in a deserialized RequestSecurityTokenResponse.
cs: {0} je k dispozici pouze v rekonstruované třídě RequestSecurityTokenResponse.
de: {0} ist nur in einer deserialisierten RequestSecurityTokenResponse verfügbar.
es: {0} solo está disponible en un RequestSecurityTokenResponse deserializado.
fr: {0} est disponible seulement dans une réponse RequestSecurityTokenResponse désérialisée.
it: {0} è disponibile solo in un elemento RequestSecurityTokenResponse deserializzato.
ja: {0} は、シリアル化を解除された RequestSecurityTokenResponse でのみ利用できます。
ko: {0}은(는) deserialize된 RequestSecurityTokenResponse에서만 사용할 수 있습니다.
pl: Element {0} jest dostępny tylko w zdeserializowanym elemencie RequestSecurityTokenResponse.
pt_br: {0} apenas está disponível em uma solicitação RequestSecurityTokenResponse desserializada.
tr: {0}, yalnızca seri durumdan çıkarılan bir RequestSecurityTokenResponse içinde kullanılabilir.
zh_hans: {0} 仅在反序列化的 RequestSecurityTokenResponse 中可用。
zh_hant: 只能在已還原序列化的 RequestSecurityTokenResponse 中使用 {0}。

# ItemDoesNotExistInSynchronizedKeyedCollection0
source: Item does not exist in SynchronizedKeyedCollection.
cs: Ve třídě SynchronizedKeyedCollection položka neexistuje.
de: Das Element ist in SynchronizedKeyedCollection nicht vorhanden.
es: El elemento no existe en SynchronizedKeyedCollection.
fr: L'élément n'existe pas dans la collection SynchronizedKeyedCollection.
it: L'elemento non esiste in SynchronizedKeyedCollection.
ja: SynchronizedKeyedCollection に項目がありません。
ko: SynchronizedKeyedCollection에 항목이 없습니다.
pl: Element nie istnieje w elemencie SynchronizedKeyedCollection.
pt_br: O item não existe em SynchronizedKeyedCollection.
tr: Öğe SynchronizedKeyedCollection içinde yok.
zh_hans: SynchronizedKeyedCollection 中不存在项目。
zh_hant: 項目不存在於 SynchronizedKeyedCollection 中。

# ItemNotAvailableInDeserializedRST
source: {0} is not available in deserialized RequestSecurityToken.
cs: {0} není k dispozici v rekonstruované třídě RequestSecurityToken.
de: {0} ist in einem deserialisierten RequestSecurityToken nicht verfügbar.
es: {0} no está disponible en RequestSecurityToken deserializado.
fr: {0} n'est pas disponible dans un jeton RequestSecurityToken désérialisé.
it: {0} non è disponibile nell'elemento RequestSecurityToken deserializzato.
ja: {0} は、シリアル化を解除された RequestSecurityToken では利用できません。
ko: {0}은(는) deserialize된 RequestSecurityToken에서 사용할 수 없습니다.
pl: Element {0} jest niedostępny w zdeserializowanym elemencie RequestSecurityToken.
pt_br: {0} não está disponível em uma solicitação RequestSecurityToken desserializada.
tr: {0}, seri durumdan çıkarılan RequestSecurityToken içinde kullanılamıyor.
zh_hans: {0} 在反序列化的 RequestSecurityToken 中不可用。
zh_hant: 無法在已還原序列化的 RequestSecurityToken 中使用 {0}。

# ItemNotAvailableInDeserializedRSTR
source: {0} is not available in deserialized RequestSecurityTokenResponse.
cs: {0} není k dispozici v rekonstruované třídě RequestSecurityTokenResponse.
de: {0} ist in einer deserialisierten RequestSecurityTokenResponse nicht verfügbar.
es: {0} no está disponible en RequestSecurityTokenResponse deserializado.
fr: {0} n'est pas disponible dans une réponse RequestSecurityTokenResponse désérialisée.
it: {0} non è disponibile nell'elemento RequestSecurityTokenResponse deserializzato.
ja: {0} は、シリアル化を解除された RequestSecurityTokenResponse では利用できません。
ko: {0}은(는) deserialize된 RequestSecurityTokenResponse에서 사용할 수 없습니다.
pl: Element {0} jest niedostępny w zdeserializowanym elemencie RequestSecurityTokenResponse.
pt_br: {0} não está disponível em uma solicitação RequestSecurityTokenResponse desserializada.
tr: {0}, seri durumdan çıkarılan RequestSecurityTokenResponse içinde kullanılamıyor.
zh_hans: {0} 在反序列化的 RequestSecurityTokenResponse 中不可用。
zh_hant: 無法在已還原序列化的 RequestSecurityTokenResponse 中使用 {0}。

# KeyIdentifierCannotCreateKey
source: This SecurityKeyIdentifier does not have any clause that can create a key.
cs: Tento identifikátor SecurityKeyIdentifier neobsahuje žádnou klauzuli, která by mohla vytvořit klíč.
de: Dieser SecurityKeyIdentifier weist keine Klausel auf, die einen Schlüssel erstellen kann.
es: Esta propiedad SecurityKeyIdentifier no tiene ninguna cláusula que pueda crear una clave.
fr: SecurityKeyIdentifier n'a aucune clause pouvant créer une clé.
it: L'elemento SecurityKeyIdentifier non contiene clausole che consentono la creazione di una chiave.
ja: この SecurityKeyIdentifier には、キーを作成できる句がありません。
ko: 이 SecurityKeyIdentifier에는 키를 만들 수 있는 절이 없습니다.
pl: Ten element SecurityKeyIdentifier nie ma żadnej klauzuli, która może utworzyć klucz.
pt_br: Este SecurityKeyIdentifier não tem nenhuma cláusula que possa criar uma chave.
tr: Bu SecurityKeyIdentifier, anahtar oluşturabilecek bir yan tümceye sahip değil.
zh_hans: 此 SecurityKeyIdentifier 没有可以创建密钥的任何子句。
zh_hant: 此 SecurityKeyIdentifier 沒有任何可建立金鑰的子句。

# KeyIdentifierClauseDoesNotSupportKeyCreation
source: This SecurityKeyIdentifierClause does not support key creation.
cs: Tato klauzule SecurityKeyIdentifierClause nepodporuje vytváření klíčů.
de: Diese SecurityKeyIdentifierClause unterstützt die Schlüsselerstellung nicht.
es: Esta propiedad SecurityKeyIdentifierClause no admite la creación de claves.
fr: SecurityKeyIdentifierClause ne prend pas en charge la création de clé.
it: Questo elemento SecurityKeyIdentifierClause che non supporta la creazione di chiavi.
ja: この SecurityKeyIdentifierClause は、キーの作成をサポートしていません。
ko: 이 SecurityKeyIdentifierClause는 키 생성을 지원하지 않습니다.
pl: Ten element SecurityKeyIdentifierClause nie obsługuje tworzenia klucza.
pt_br: Esta SecurityKeyIdentifierClause não dá suporte à criação de chave.
tr: Bu SecurityKeyIdentifierClause anahtar oluşturmayı desteklemiyor.
zh_hans: 此 SecurityKeyIdentifierClause 不支持密钥创建。
zh_hant: 此 SecurityKeyIdentifierClause 不支援建立金鑰。

# KeyLengthMustBeMultipleOfEight
source: Key length '{0}' is not a multiple of 8 for symmetric keys.
cs: Délka klíče {0} není násobkem čísla 8 pro symetrické klíče.
de: Die Schlüssellänge "{0}" ist für symmetrische Schlüssel kein Vielfaches von 8.
es: La longitud de clave "{0}" no es múltiplo de 8 para las claves simétricas.
fr: La longueur de clé '{0}' n'est pas un multiple de 8 pour des clés symétriques.
it: La lunghezza di chiave '{0}' non è un multiplo di 8 per le chiavi simmetriche.
ja: 対称キーについては、キーの長さ '{0}' は 8 の倍数ではありません。
ko: 키 길이 '{0}'이(가) 대칭 키에 대하여 8의 배수가 아닙니다.
pl: Długość klucza „{0}” dla kluczy symetrycznych nie jest wielokrotnością liczby 8.
pt_br: O comprimento da chave '{0}' não é um múltiplo de 8 para chaves simétricas.
tr: '{0}' anahtar uzunluğu simetrik anahtarlar için 8'in katı değil.
zh_hans: 对称密钥的密钥长度“{0}”不是 8 的倍数。
zh_hant: 對稱金鑰的金鑰長度 '{0}' 不是 8 的倍數。

# KeyLifetimeNotWithinTokenLifetime
source: The key effective and expiration times must be bounded by the token effective and expiration times.
cs: Čas účinnosti a čas vypršení platnosti musí být omezen časem účinnosti a časem vypršení platnosti tokenu.
de: Die Gültigkeits- und Ablaufzeiten des Schlüssels müssen durch die Gültigkeits- und Ablaufzeiten des Tokens begrenzt sein.
es: Las horas de vigencia y de expiración de la clave deben estar limitadas por las horas de vigencia y de expiración del token.
fr: Les moments d'activation et d'expiration de la clé doivent être limités par les moments d'activation et d'expiration du jeton.
it: I periodi di validità e di scadenza della chiave devono essere vincolati dai periodi di validità e di scadenza del token.
ja: キーの有効時間と有効期間は、トークンの有効時間と有効期間により、バインドされる必要があります。
ko: 키 유효 기간 및 만료 시간은 토큰 유효 기간 및 만료 시간으로 제한되어야 합니다.
pl: Czas wejścia w życie i czas wygaśnięcia klucza muszą być ograniczone przez czas wejścia w życie i czas wygaśnięcia tokenu.
pt_br: A hora de efetivação e a hora de expiração da chave devem estar associadas pela hora de efetivação e a hora de expiração do token.
tr: Anahtarın etkinlik ve geçerlilik sonu süreleri, belirtecin etkinlik ve geçerlilik süreleriyle bağlantılı olmalıdır.
zh_hans: 密钥有效时间和过期时间必须受令牌有效时间和过期时间的约束。
zh_hant: 金鑰有效期與過期時間必須與權杖的有效期和過期時間一致。

# KeyRolloverGreaterThanKeyRenewal
source: The key rollover interval cannot be greater than the key renewal interval.
cs: Interval časového přechodu klíče nesmí být větší než interval obnovení klíče.
de: Das Rolloverintervall für Schlüssel kann nicht größer als das Schlüsselerneuerungsintervall sein.
es: El intervalo de sustitución de la clave no puede ser mayor que el intervalo de renovación de la clave.
fr: L'intervalle de substitution de la clé ne peut pas être supérieur à l'intervalle de renouvellement de la clé.
it: L'intervallo di sostituzione della chiave non può essere superiore all'intervallo di rinnovo della chiave.
ja: キーのロールオーバー間隔をキーの更新間隔よりも長くすることはできません。
ko: 키 롤오버 간격은 키 갱신 간격보다 클 수 없습니다.
pl: Interwał przerzucania klucza nie może być większy od interwału odnawiania klucza.
pt_br: O intervalo de substituição de protocolo não pode ser maior que o intervalo de renovação de chave.
tr: Anahtar aktarma aralığı, anahtar yenileme aralığından daha büyük olamaz.
zh_hans: 密钥翻转间隔不能大于密钥续订间隔。
zh_hant: 金鑰變換間隔不可大於金鑰更新間隔。

# LastMessageNumberExceeded
source: A message was received with a sequence number higher than the sequence number of the last message in this sequence. This is a violation of the sequence number protocol. The reliable session was faulted.
cs: Byla přijata zpráva s pořadovým číslem vyšším než je pořadové číslo poslední zprávy v tomto pořadí. To je narušení protokolu pořadových čísel. Ve stabilní relaci došlo k chybě.
de: Es wurde eine Nachricht mit einer Sequenznummer empfangen, die höher als die Sequenznummer der letzten Nachricht in dieser Sequenz ist. Dies ist eine Verletzung des Sequenznummernprotokolls. Die zuverlässige Sitzung war nicht erfolgreich.
es: Se recibió un mensaje con un número de secuencia superior al número de secuencia del último mensaje de esta secuencia. Esto constituye una infracción del protocolo de número de secuencia. Se generó un error en la sesión confiable.
fr: Un message a été reçu avec un numéro de séquence supérieur au numéro de séquence du dernier message de cette séquence. Ceci constitue une violation du protocole de numéro de séquence. La session fiable a généré une erreur.
it: È stato ricevuto un messaggio con un numero di sequenza maggiore del numero di sequenza dell'ultimo messaggio di questa sequenza. Questa costituisce una violazione del protocollo dei numeri di sequenza. La sessione affidabile non è riuscita.
ja: このシーケンス内の最後のメッセージのシーケンス番号より大きいシーケンス番号を持つメッセージを受信しました。これは、シーケンス番号プロトコルに違反しています。信頼できるセッションは途中終了されました。
ko: 메시지가 이 시퀀스에 있는 마지막 메시지의 시퀀스 번호보다 높은 시퀀스 번호와 함께 수신되었습니다. 이것은 시퀀스 번호 프로토콜 위반입니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Wiadomość została odebrana z liczbą sekwencji większą niż liczba sekwencji ostatniej wiadomości w tej sekwencji. Jest to niezgodne z protokołem liczby sekwencji. Wystąpił błąd sesji uwierzytelnionej.
pt_br: Foi recebida uma mensagem com um número de sequência maior que o número de sequência da última mensagem desta sequência. Essa é uma violação do protocolo de número de sequência. Falha na sessão confiável.
tr: Sıra numarası, bu sıradaki son iletinin sıra numarasından daha büyük olan bir ileti alındı. Bu, bir sıra numarası protokolü ihlalidir. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 收到一条消息，其中序列号大于此序列中最后一条消息的序列号。这与序列号协议发生冲突。可靠会话出错。
zh_hant: 收到的訊息之序號，高於此序列中前一訊息的序號。這違反序號通訊協定。可靠工作階段發生錯誤。

# LastMessageNumberExceededFaultReason
source: The value for wsrm:MessageNumber exceeds the value of the MessageNumber accompanying a LastMessage element in this Sequence.
cs: Hodnota třídy wsrm:MessageNumber přesahuje hodnotu třídy MessageNumber provázející element třídy LastMessage v tomto pořadí.
de: Der Wert für "wsrm:MessageNumber" überschreitet den Wert für die MessageNumber, die ein LastMessage-Element in dieser Sequenz begleitet.
es: El valor de wsrm:MessageNumber supera el valor de MessageNumber que acompaña a un elemento LastMessage en esta secuencia.
fr: La valeur de wsrm:MessageNumber est supérieure à la valeur de l'élément MessageNumber accompagnant un élément LastMessage dans cette séquence.
it: Il valore di wsrm:MessageNumber è maggiore del valore MessageNumber che accompagna un elemento LastMessage in questa sequenza.
ja: wsrm:MessageNumber の値が、このシーケンスの LastMessage 要素が指定されている MessageNumber の値よりも大きくなっています。
ko: wsrm:MessageNumber의 값이 이 시퀀스의 LastMessage 요소에 수반하는 MessageNumber의 값을 초과합니다.
pl: Wartość wsrm:MessageNumber przekracza wartość MessageNumber towarzyszącą elementowi LastMessage w tej sekwencji.
pt_br: O valor para wsrm:MessageNumber excede o valor de MessageNumber que acompanha um elemento LastMessage nesta Sequência.
tr: wsrm:MessageNumber değeri, bu Sequence içindeki bir LastMessage öğesine eşlik eden bir MessageNumber değerini aşıyor.
zh_hans: wsrm:MessageNumber 的值超过此序列中随 LastMessage 元素一起提供的 MessageNumber 的值。
zh_hant: wsrm:MessageNumber 的值超出此順序中伴隨 LastMessage 元素的 MessageNumber 值。

# LengthMustBeGreaterThanZero
source: The length of this argument must be greater than 0.
cs: Délka tohoto argumentu musí být větší než 0.
de: Die Länge dieses Arguments muss größer als 0 sein.
es: La longitud de este argumento debe ser mayor que 0.
fr: La longueur de cet argument doit être supérieure à 0.
it: La lunghezza di questo argomento deve essere maggiore di 0.
ja: この引数の長さは、正の値である必要があります。
ko: 이 인수의 길이는 0보다 커야 합니다.
pl: Długość tego argumentu musi być większa niż 0.
pt_br: O comprimento deste argumento deve ser maior que 0.
tr: Bu bağımsız değişkenin uzunluğu 0'dan büyük olmalıdır.
zh_hans: 此参数的长度必须大于 0。
zh_hant: 此引數的長度必須大於 0。

# LocalIdCannotBeEmpty
source: The localId cannot be empty. Specify a valid 'localId'.
cs: Hodnota localId nemůže být prázdná. Zadejte platnou hodnotu localId.
de: Die localId darf nicht leer sein. Geben Sie eine gültige "localId" an.
es: El valor de localId no puede estar vacío. Especifique un "localId" válido.
fr: localId ne peut pas être vide. Spécifiez un 'localId' valide.
it: L'elemento localId non può essere vuoto. Specificare un elemento 'localId' valido.
ja: localId を空にすることはできません。有効な 'localId' を指定してください。
ko: localId는 비워 둘 수 없습니다. 유효한 'localId'를 지정하세요.
pl: Identyfikator localId nie może być pusty. Określ prawidłowy identyfikator „localId”.
pt_br: A localId não pode estar vazia. Especifique uma 'localId' válida.
tr: localId boş olamaz. Geçerli bir 'localId' belirtin.
zh_hans: LocalId 不能为空。请指定有效的 "localId"。
zh_hant: localId 不可為空白。請指定有效的 'localId'。

# LockTimeoutExceptionMessage
source: Cannot claim lock within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Nelze nárokovat zámek ve vyhrazeném časovém limitu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die Sperre konnte nicht innerhalb des zugewiesenen Zeitlimits von {0} angefordert werden. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: No se puede reclamar el bloqueo dentro del tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una porción de un tiempo de espera mayor.
fr: Impossible de revendiquer un verrou dans le délai imparti de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Non è possibile richiedere il blocco entro il timeout allocato pari a {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内にロックを要求できません。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한인 {0} 내에서 잠금을 클레임할 수 없습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Nie można zażądać blokady w wyznaczonym limicie czasu {0}. Być może czas przydzielony dla tej operacji stanowi część większego limitu czasu.
pt_br: Não é possível declarar bloqueio no tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Ayrılan {0} süre sonu içinde kilit talebi yapılamıyor. Bu işlem için ayrılan süre, daha uzun bir süre sonu değerinin bir bölümü olabilir.
zh_hans: 无法在分配的超时 {0} 内获得锁定。分配给此操作的时间可能比超时长。
zh_hant: 無法在分配的逾時 {0} 內宣告鎖定。分配給此作業的時間可能是較長逾時的一部分。
