Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# ResponseContentTypeMismatch
source: The content type {0} of the response message does not match the content type of the binding ({1}). If using a custom encoder, be sure that the IsContentTypeSupported method is implemented properly. The first {2} bytes of the response were: '{3}'.
cs: Typ obsahu {0} zprávy odpovědi neodpovídá typu obsahu vazby ({1}). Pokud používáte vlastní kodér, ujistěte se, že je metoda IsContentTypeSupported správně implementována. První bajty (počet bajtů: {2}) odpovědi byly: {3}.
de: Der Inhaltstyp {0} der Antwortnachricht stimmt nicht mit dem Inhaltstyp der Bindung ({1}) überein. Wenn Sie einen benutzerdefinierten Encoder verwenden, muss die IsContentTypeSupported-Methode korrekt implementiert sein. Die ersten {2} Bytes der Antwort waren: "{3}".
es: El tipo de contenido {0} del mensaje de respuesta no coincide con el tipo de contenido del enlace ({1}). Si usa un codificador personalizado, asegúrese de que el método IsContentTypeSupported se implemente correctamente. Los primeros {2} bytes de la respuesta fueron: "{3}".
fr: Le type de contenu {0} du message de réponse ne correspond pas au type de contenu de la liaison ({1}). Si vous utilisez un encodeur personnalisé, vérifiez que la méthode IsContentTypeSupported est implémentée correctement. Les premiers {2} octets de la réponse étaient : '{3}'.
it: Il tipo di contenuto {0} del messaggio di risposta non corrisponde al tipo di contenuto del binding ({1}). Se si usa un codificatore standard, assicurarsi che il metodo IsContentTypeSupported sia implementato correttamente. I primi {2} byte della risposta erano: '{3}'.
ja: 応答メッセージのコンテンツ型 {0} が、バインディング ({1}) のコンテンツ型と一致しません。カスタム エンコーダーを使用している場合は、IsContentTypeSupported メソッドが正しく実装されていることを確認してください。応答の先頭の {2} バイトは '{3}' でした。
ko: 응답 메시지의 콘텐츠 형식 {0}이(가) 바인딩의 콘텐츠 형식({1})과 일치하지 않습니다. 사용자 지정 인코더를 사용 중인 경우 IsContentTypeSupported 메서드가 올바르게 구현되는지 확인하세요. 응답의 처음 {2}바이트가 '{3}'입니다.
pl: Typ zawartości {0} komunikatu odpowiedzi nie zgadza się z typem zawartości powiązania ({1}). Jeśli używasz niestandardowego kodera, upewnij się, czy metoda IsContentTypeSupported jest zaimplementowana poprawnie. Pierwsze {2} bajtów odpowiedzi to: „{3}”.
pt_br: O tipo de conteúdo {0} da mensagem de resposta não corresponde ao tipo de conteúdo da associação ({1}). Se estiver usando um codificador personalizado, verifique se o método IsContentTypeSupported está implementado corretamente. Os primeiros {2} bytes da resposta foram: '{3}'.
tr: Yanıt iletisinin {0} içerik türü, bağlama içerik türüyle ({1}) eşleşmiyor. Özel bir kodlayıcı kullanılıyorsa, IsContentTypeSupported metodunun düzgün uygulandığından emin olun. Yanıtın ilk {2} baytı: '{3}'.
zh_hans: 响应消息的内容类型 {0} 与绑定({1})的内容类型不匹配。如果使用自定义编码器，请确保正确实现 IsContentTypeSupported 方法。响应的前 {2} 个字节为:“{3}”。
zh_hant: 回應訊息的內容類型 {0} 與繫結 ({1}) 的內容類型不符。若使用自訂編碼器，請確認已正確實作 IsContentTypeSupported 方法。回應的前 {2} 個位元組為: '{3}'。

# RstrHasMultipleIssuedTokens
source: The RequestSecurityTokenResponse has multiple RequestedSecurityToken elements.
cs: Třída RequestSecurityTokenResponse má více elementů RequestedSecurityToken.
de: Die RequestSecurityTokenResponse enthält mehrere RequestedSecurityToken-Elemente.
es: El elemento RequestSecurityTokenResponse tiene varios elementos RequestedSecurityToken.
fr: RequestSecurityTokenResponse contient plusieurs éléments RequestedSecurityToken.
it: L'elemento RequestSecurityTokenResponse contiene più elementi RequestedSecurityToken.
ja: RequestSecurityTokenResponse には、複数の RequestedSecurityToken 要素があります。
ko: RequestSecurityTokenResponse에 여러 RequestedSecurityToken 요소가 있습니다.
pl: Element RequestSecurityTokenResponse ma wiele elementów RequestedSecurityToken.
pt_br: RequestSecurityTokenResponse tem vários elementos RequestedSecurityToken.
tr: RequestSecurityTokenResponse, birden çok RequestedSecurityToken öğesine sahip.
zh_hans: RequestSecurityTokenResponse 具有多个 RequestedSecurityToken 元素。
zh_hant: RequestSecurityTokenResponse 具有多個 RequestedSecurityToken 元素。

# RstrHasMultipleProofTokens
source: The RequestSecurityTokenResponse has multiple RequestedProofToken elements.
cs: Třída RequestSecurityTokenResponse má více elementů RequestedProofToken.
de: Die RequestSecurityTokenResponse enthält mehrere RequestedProofToken-Elemente.
es: El elemento RequestSecurityTokenResponse tiene varios elementos RequestedProofToken.
fr: RequestSecurityTokenResponse contient plusieurs éléments RequestedProofToken.
it: L'elemento RequestSecurityTokenResponse contiene più elementi RequestedProofToken.
ja: RequestSecurityTokenResponse には、複数の RequestedProofToken 要素があります。
ko: RequestSecurityTokenResponse에 여러 RequestedProofToken 요소가 있습니다.
pl: Element RequestSecurityTokenResponse ma wiele elementów RequestedProofToken.
pt_br: RequestSecurityTokenResponse tem vários elementos RequestedProofToken.
tr: RequestSecurityTokenResponse, birden çok RequestedProofToken öğesine sahip.
zh_hans: RequestSecurityTokenResponse 具有多个 RequestedProofToken 元素。
zh_hant: RequestSecurityTokenResponse 具有多個 RequestedProofToken 元素。

# RstrKeySizeNotProvided
source: KeySize element not present in RequestSecurityTokenResponse.
cs: Element KeySize se nenachází ve třídě RequestSecurityTokenResponse.
de: Das KeySize-Element ist nicht in der RequestSecurityTokenResponse vorhanden.
es: El elemento KeySize no está presente en RequestSecurityTokenResponse.
fr: L'élément KeySize est absent de RequestSecurityTokenResponse.
it: L'elemento KeySize non è presente in RequestSecurityTokenResponse.
ja: RequestSecurityTokenResponse に KeySize 要素がありません。
ko: KeySize 요소가 RequestSecurityTokenResponse에 없습니다.
pl: Element KeySize nie jest obecny w elemencie RequestSecurityTokenResponse.
pt_br: O elemento KeySize não está presente em RequestSecurityTokenResponse.
tr: KeySize öğesi RequestSecurityTokenResponse içinde yok.
zh_hans: RequestSecurityTokenResponse 中不存在 KeySize 元素。
zh_hant: RequestSecurityTokenResponse 中沒有 KeySize 元素。

# RuntimeRequiresInvoker0
source: DispatchOperation requires Invoker.
cs: Třída DispatchOperation vyžaduje původce.
de: DispatchOperation erfordert eine aufrufende Instanz.
es: El elemento DispatchOperation requiere un elemento Invoker.
fr: DispatchOperation nécessite Invoker.
it: Per DispatchOperation è richiesto Invoker.
ja: DispatchOperation は呼び出しの起動者が必要です。
ko: DispatchOperation에 호출자가 필요합니다.
pl: Element DispatchOperation wymaga elementu Invoker.
pt_br: A DispatchOperation requer um Invocador.
tr: DispatchOperation, Invoker gerektirir.
zh_hans: DispatchOperation 需要调用程序。
zh_hant: DispatchOperation 需要 Invoker。

# SFXBindingNameCannotBeNullOrEmpty
source: Binding name cannot be null or empty.
cs: Název vazby nesmí mít hodnotu Null a nesmí být prázdný.
de: Der Bindungsname darf nicht NULL oder leer sein.
es: El nombre del enlace no puede ser nulo ni estar vacío.
fr: Le nom de la liaison ne doit pas avoir une valeur null ou être vide.
it: Il nome del binding non può essere Null o vuoto.
ja: バインド名を null または空白にすることはできません。
ko: 바인딩 이름이 null이거나 비어 있을 수 없습니다.
pl: Nazwa powiązania nie może mieć wartości null ani być pusta.
pt_br: O nome da associação não pode ser nulo nem ficar vazio.
tr: Bağlama adı null ya da boş olamaz.
zh_hans: 绑定名称不能为 Null 或为空。
zh_hant: 繫結名稱不可為 null 或空白。

# SFXEndpointBehaviorUsedOnWrongSide
source: The IEndpointBehavior '{0}' cannot be used on the server side; this behavior can only be applied to clients.
cs: Třídu IEndpointBehavior {0} nelze použít na straně serveru; toto chování lze použít pouze pro klienty.
de: Das IEndpointBehavior "{0}" kann auf der Serverseite nicht verwendet werden. Dieses Verhalten kann nur auf Clients angewendet werden.
es: IEndpointBehavior "{0}" no se puede usar en el lado del servidor; este comportamiento solo se puede aplicar a los clientes.
fr: IEndpointBehavior '{0}' ne peut pas être utilisé côté serveur ; ce comportement est applicable uniquement aux clients.
it: Non è possibile usare l'elemento IEndpointBehavior '{0}' sul lato server. Il comportamento può essere applicato solo ai client.
ja: IEndpointBehavior '{0}' はサーバー側で使用できません。この動作はクライアントにのみ適用できます。
ko: IEndpointBehavior '{0}'을(를) 서버 쪽에서 사용할 수 없습니다. 이 동작은 클라이언트에만 적용됩니다.
pl: Po stronie serwera nie można użyć interfejsu IEndpointBehavior „{0}”; to zachowanie może być stosowane jedynie do klientów.
pt_br: O IEndpointBehavior '{0}' não pode ser usado no servidor; esse comportamento só pode ser aplicado aos clientes.
tr: IEndpointBehavior '{0}' sunucu tarafında kullanılamıyor; bu davranış yalnızca istemcilere uygulanabilir.
zh_hans: IEndpointBehavior“{0}”无法用于服务器端；此行为只能应用于客户端。
zh_hant: IEndpointBehavior '{0}' 無法用於伺服器端; 此行為僅適用於用戶端。

# SFXHeaderNameCannotBeNullOrEmpty
source: Header name cannot be null or empty.
cs: Název záhlaví nesmí mít hodnotu Null a nesmí být prázdný.
de: Der Headername darf nicht NULL oder leer sein.
es: El nombre del encabezado no puede ser nulo ni estar vacío.
fr: Le nom de l'en-tête ne doit pas avoir une valeur null ou être vide.
it: Il nome dell'intestazione non può essere Null o vuoto.
ja: ヘッダー名を null や空にはできません。
ko: 헤더 이름은 null이거나 비어 있을 수 없습니다.
pl: Nazwa nagłówka nie może mieć wartości null ani być pusta.
pt_br: O nome do cabeçalho não pode ser nulo nem ficar vazio.
tr: Üst bilgi adı null ya da boş olamaz.
zh_hans: 标头名称不能为 Null 或为空。
zh_hant: 標頭名稱不可為 null 或空白。

# SFXUnvalidNamespaceParam
source: Parameter value '{0}' is an invalid URI.
cs: Hodnota parametru {0} je neplatný identifikátor URI.
de: Der Parameterwert "{0}" ist ein ungültiger URI.
es: El valor de parámetro "{0}" es un URI no válido.
fr: La valeur de paramètre '{0}' est un URI non valide.
it: Il valore di parametro '{0}' non è un URI valido.
ja: パラメーター値 '{0}' は無効な URI です。
ko: 매개 변수 값 '{0}'이(가) 잘못된 URI입니다.
pl: Wartością parametru „{0}” jest nieprawidłowy identyfikator URI.
pt_br: O valor de parâmetro '{0}' é um URI inválido.
tr: Parameter değeri '{0}', geçersiz bir URI.
zh_hans: 参数值 "{0}" 是无效 URI。
zh_hant: 參數值 '{0}' 為無效的 URI。

# SFXUnvalidNamespaceValue
source: Value '{0}' provided for {1} property is an invalid URI.
cs: Hodnota {0} poskytnutá pro vlastnost {1} je neplatný identifikátor URI.
de: Der für die {1}-Eigenschaft angegebene Wert "{0}" ist ein ungültiger URI.
es: El valor "{0}" proporcionado para la propiedad {1} es un URI no válido.
fr: La valeur '{0}' fournie pour la propriété {1} est un URI non valide.
it: Il valore '{0}' specificato per la proprietà {1} non è un URI valido.
ja: {1} プロパティに指定された値 '{0}' は、無効な URI です。
ko: {1} 속성에 대해 제공된 값 '{0}'이(가) 잘못된 URI입니다.
pl: Wartość „{0}” podana dla właściwości {1} jest nieprawidłowym identyfikatorem URI.
pt_br: O valor '{0}' fornecido para a propriedade de {1} é um URI inválido.
tr: '{1}' özelliği için sağlanan {0} değeri, geçersiz bir URI.
zh_hans: 为 {1} 属性提供的值“{0}”是无效 URI。
zh_hant: 提供給 '{1}' 內容的值 {0} 為無效 URI。

# SFxActionDemuxerDuplicate
source: The operations {0} and {1} have the same action ({2}). Every operation must have a unique action value.
cs: Operace {0} a {1} obsahují stejnou akci ({2}). Každá operace musí mít jedinečnou hodnotu akce.
de: Die Vorgänge {0} und {1} weisen die gleiche Aktion ({2}) auf. Jeder Vorgang muss über einen eindeutigen Aktionswert verfügen.
es: Las operaciones {0} y {1} tienen la misma acción ({2}). Cada operación debe tener un valor de acción único.
fr: Les opérations {0} et {1} contiennent la même action ({2}). Chaque opération doit contenir une valeur d'action unique.
it: Le operazioni {0} e {1} contengono la stessa azione ({2}). Ogni operazione deve avere un valore di azione univoco.
ja: 操作 {0} と操作 {1} には、同じアクション ({2}) が割り当てられています。すべての操作には、一意のアクション値が割り当てられている必要があります。
ko: {0} 및 {1} 작업의 동작({2})이 같습니다. 모든 작업에서 동작 값은 고유해야 합니다.
pl: Operacje {0} i {1} mają tę samą akcję ({2}). Każda operacja musi mieć unikatową wartość akcji.
pt_br: As operações {0} e {1} têm a mesma ação ({2}). Cada operação deve ter um valor de ação exclusivo.
tr: {0} ve {1} işlemleri aynı eyleme sahip ({2}). Her işlemin benzersiz bir eylem değeri olmalı.
zh_hans: 操作 {0} 和 {1} 具有相同操作({2})。每个操作都必须有且仅有一个操作值。
zh_hant: 作業 {0} 與 {1} 具有相同的動作 ({2})。每一作業的動作值必須是唯一的。

# SFxActionMismatch
source: Cannot create a typed message due to action mismatch, expecting {0} encountered {1}
cs: Nelze vytvořit zadanou zprávu, protože došlo k neshodě akcí, očekává se {0} zjištěna byla {1}
de: Aufgrund der nicht übereinstimmenden Aktionen kann keine typisierte Nachricht erstellt werden. Es wurde {0} erwartet, jedoch {1} angetroffen.
es: No se puede crear un mensaje con tipo porque las acciones no coinciden. Se esperaba {0} pero se encontró {1}.
fr: Impossible de créer un message typé en raison d'une non-correspondance de l'action ; {0} attendu, {1} rencontré
it: Azione non corrispondente. Impossibile creare un messaggio tipizzato. Azione prevista: {0}, azione riscontrata: {1}
ja: 動作が一致しないため、入力されたメッセージを作成できません。{0} が必要ですが、{1} が見つかりました
ko: 동작이 일치하지 않아서 형식화된 메시지를 만들 수 없습니다. {0}이(가) 필요한데 {1}이(가) 있습니다.
pl: Nie można utworzyć komunikatu mającego określony typ z powodu niezgodności akcji. Wartość oczekiwana: {0}. Wartość napotkana: {1}.
pt_br: Não é possível criar uma mensagem tipada devido à ação não compatível, esperava-se {0} encontrou-se {1}
tr: Eylem uyumsuzluğu nedeniyle yazılı ileti oluşturulamıyor, beklenen: {0}, karşılaşılan: {1}
zh_hans: 由于操作不匹配，无法创建类型化消息，期望 {0} 遇到 {1}
zh_hant: 無法建立具型別的訊息，因為動作不符 (預期為 {0}，但實際為 {1})。

# SFxBadByReferenceParameterMetadata
source: Method '{0}' in class '{1}' has bad parameter metadata: a pass-by-reference parameter is marked with the 'in' but not the 'out' parameter mode.
cs: Metoda {0} ve třídě {1} má nesprávná metadata parametrů: parametr pass-by-reference (předat podle odkazu) je označen jako režim parametru in ale ne out.
de: Die Methode "{0}" in der Klasse "{1}" enthält ungültige Parametermetadaten: Ein als Verweis zu übergebender Parameter ist mit dem Parametermodus "in", jedoch nicht mit "out" markiert.
es: El método "{0}" de la clase "{1}" tiene metadatos de parámetro incorrectos: un parámetro de paso por referencia está marcado con el modo de parámetro "in" pero no "out".
fr: La méthode '{0}' de la classe '{1}' contient des métadonnées de paramètre incorrectes : un paramètre de passage par référence est marqué avec le mode de paramètre 'in' mais pas 'out'.
it: I metadati di parametro del metodo '{0}' nella classe '{1}' non sono validi: un parametro pass-by-reference è contrassegnato con la modalità parametro 'in', ma non con quella 'out'.
ja: クラス '{1}' のメソッド '{0}' に正しくないパラメーターのメタデータがあります。参照渡しのパラメーターのパラメーター モードが、'out' ではなく 'in' でマークされています。
ko: '{1}' 클래스의 '{0}' 메서드에 잘못된 매개 변수 메타데이터가 있습니다. pass-by-reference 매개 변수가 'out' 매개 변수 모드가 아닌 'in' 매개 변수 모드로 표시되어 있습니다.
pl: Metoda „{0}” w klasie „{1}” ma niepoprawne metadane parametrów: parametr przekazywany przez odwołanie jest oznaczony przy użyciu trybu parametru „in”, a nie „out”.
pt_br: O método '{0}' na classe '{1}' tem um parâmetro de metadados incorreto: um parâmetro de passagem por referência é marcado com o 'in', mas não o modo de parâmetro 'out'.
tr: '{1}' sınıfındaki '{0}' metodu bozuk parametre meta verisi bulunduruyor: Bir başvuruyla geçirme parametresi 'out' değil, 'in' parametre moduyla işaretlenmiş.
zh_hans: 类“{1}”中的方法“{0}”具有错误的参数元数据: 按引用传递的参数使用 "in" 进行标记，而不是使用 "out" 参数模式进行标记。
zh_hant: 類別 '{1}' 中方法 '{0}' 的參數中繼資料錯誤: pass-by-reference 參數標示為 'in' 而非 'out' 參數模式。

# SFxBadByValueParameterMetadata
source: Method '{0}' in class '{1}' has bad parameter metadata: a pass-by-value parameter is marked with the 'out' parameter mode.
cs: Metoda {0} ve třídě {1} má nesprávná metadata parametrů: parametr pass-by-reference (předat podle odkazu) je označen jako režim parametru out.
de: Die Methode "{0}" in der Klasse "{1}" enthält ungültige Parametermetadaten: Ein als Wert zu übergebender Parameter ist mit dem Parametermodus "out" markiert.
es: El método "{0}" de la clase "{1}" tiene metadatos de parámetro incorrectos: un parámetro de paso por valor está marcado con el modo de parámetro "out".
fr: La méthode '{0}' de la classe '{1}' contient des métadonnées de paramètre incorrectes : un paramètre de passage par valeur est marqué avec le mode de paramètre 'out'.
it: I metadati di parametro del metodo '{0}' nella classe '{1}' non sono validi: un parametro pass-by-value è contrassegnato con la modalità parametro 'out'.
ja: クラス '{1}' のメソッド '{0}' に正しくないパラメーターのメタデータがあります。参照渡しのパラメーターが、'out' パラメーター モードでマークされています。
ko: '{1}' 클래스의 '{0}' 메서드에 잘못된 매개 변수 메타데이터가 있습니다. pass-by-value 매개 변수가 'out' 매개 변수 모드로 표시되어 있습니다.
pl: Metoda „{0}” w klasie „{1}” ma niepoprawne metadane parametrów: parametr przekazywany przez wartość jest oznaczony przy użyciu trybu parametru „out”.
pt_br: O método '{0}' na classe '{1}' tem um parâmetro de metadados incorreto: um parâmetro passagem por valor é marcado com o modo de parâmetro 'out'.
tr: '{1}' sınıfındaki '{0}' metodu bozuk parametre meta verisi bulunduruyor: Bir başvuruyla geçirme parametresi 'out' parametre moduyla işaretlenmiş.
zh_hans: 类“{1}”中的方法“{0}”具有错误的参数元数据: 按值传递的参数使用 "out" 参数模式进行标记。
zh_hant: 類別 '{1}' 中方法 '{0}' 的參數中繼資料錯誤: pass-by-value 參數標示為 'out' 參數模式。

# SFxBindingMustContainTransport2
source: The binding (Name={0}, Namespace={1}) does not contain a TransportBindingElement.
cs: Vazba (Název={0}, Obor názvů={1}) neobsahuje třídu TransportBindingElement.
de: Die Bindung (Name={0}, Namespace={1}) enthält kein TransportBindingElement.
es: El enlace (Name={0}, Namespace={1}) no contiene un elemento TransportBindingElement.
fr: La liaison (Nom={0}, Espace de noms={1}) ne contient pas de TransportBindingElement.
it: Il binding (Name={0}, Namespace={1}) non contiene un elemento TransportBindingElement.
ja: バインド (名前: {0}、名前空間: {1}) には、TransportBindingElement が含まれていません。
ko: 바인딩(이름={0}, 네임스페이스={1})에 TransportBindingElement가 없습니다.
pl: Powiązanie (Name={0}, Namespace={1}) nie zawiera elementu TransportBindingElement.
pt_br: A associação (Nome={0}, Namespace={1}) não contém um TransportBindingElement.
tr: Bağlama (Name={0}, Namespace={1}) bir TransportBindingElement içermiyor.
zh_hans: 绑定(Name={0}，Namespace={1})未包含 TransportBindingElement。
zh_hant: 繫結 (Name={0}, Namespace={1}) 未包含 TransportBindingElement。

# SFxBodyCannotBeNull
source: Body object cannot be null in message {0}
cs: Objekt textu nesmí mít ve zprávě {0} hodnotu Null.
de: Das Body-Objekt in der Nachricht {0} kann nicht NULL sein.
es: El objeto de cuerpo no puede ser nulo en el mensaje {0}
fr: L'objet corps ne peut pas avoir une valeur null dans le message {0}
it: L'oggetto body non può essere Null nel messaggio {0}
ja: ボディ オブジェクトを、メッセージ {0} で null にすることはできません
ko: 본문 개체가 {0} 메시지에서 null일 수 없습니다.
pl: W komunikacie {0} obiekt treści nie może mieć wartości null
pt_br: O objeto do corpo não pode ser nulo na mensagem {0}
tr: {0} iletisindeki gövde nesnesi null olamaz
zh_hans: 正文对象在消息 {0} 中不能为 Null
zh_hant: 訊息 {0} 中的內文物件不可為 null。

# SFxBodyObjectTypeCannotBeInherited
source: Type {0} cannot inherit from any class other than object to be used as body object in RPC style.
cs: Typ {0} nemůže dědit z jiné třídy, než je objekt, který se má použít jako objekt textu ve stylu RPC.
de: Der {0}-Typ kann von keiner anderen Klasse als der Klasse des Objekts erben, das als Body-Objekt im RPC-Format verwendet wird.
es: El tipo {0} no puede heredar de una clase distinta del objeto que se usará como objeto de cuerpo en el estilo RPC.
fr: Le type {0} ne peut hériter d'aucune classe autre que l'objet à utiliser en tant qu'objet corps dans le style RPC.
it: Il tipo {0} non può ereditare da nessuna classe diversa dall'oggetto da utilizzare come oggetto body nello stile RPC.
ja: RPC スタイルのボディ オブジェクトとして使用されるオブジェクト以外のクラスから、型 {0} を継承することはできません。
ko: RPC 스타일의 본문 개체로 사용되는 개체가 아닌 다른 클래스에서는 {0} 유형을 상속할 수 없습니다.
pl: Typ {0} nie może dziedziczyć po żadnej klasie innej niż obiekt używany jako obiekt treści w stylu wywołania RPC.
pt_br: O tipo {0} não pode ser herdado de nenhuma classe diferente do objeto a ser usado como objeto do corpo no estilo RPC.
tr: {0} türü, RPC stilinde gövde nesnesi olarak kullanılmak üzere nesne dışındaki herhangi bir sınıftan devralamaz.
zh_hans: 除了 RPC 样式中用作正文对象的对象以外，类型 {0} 无法从任何类中继承。
zh_hant: 除了作為 RPC 樣式之本文物件的物件之外，型別 {0} 無法繼承任何類別。

# SFxBodyObjectTypeCannotBeInterface
source: Type {0} implements interface {1} which is not supported for body object in RPC style.
cs: Typ {0} implementuje rozhraní {1}, které se pro objekt textu ve stylu RPC nepodporuje.
de: Der {0}-Typ implementiert die {1}-Schnittstelle, die für das Body-Objekt im RPC-Format nicht unterstützt wird.
es: El tipo {0} implementa la interfaz {1}, que no se admite para el objeto de cuerpo en el estilo RPC.
fr: Le type {0} met en œuvre l'interface {1}, qui n'est pas prise en charge pour l'objet corps dans le style RPC.
it: Il tipo {0} implementa l'interfaccia {1}, non supportata per l'oggetto body nello stile RPC.
ja: 型 {0} は、RPC スタイルのボディ オブジェクトではサポートされないインターフェイス {1} を実装します。
ko: RPC 스타일의 본문 개체에 대해 지원되지 않는 {1} 인터페이스를 {0} 유형에서 구현합니다.
pl: Typ {0} zawiera implementację interfejsu {1}, który nie jest obsługiwany w przypadku obiektu treści w stylu wywołania RPC.
pt_br: O tipo {0} implementa a interface {1} para a qual o objeto do corpo não fornece suporte no estilo RPC.
tr: {0} türü, RPC stilindeki gövde nesnesi için desteklenmeyen {1} arabirimini uygular.
zh_hans: 类型 {0} 实现 RPC 样式中对正文对象不支持的接口 {1}。
zh_hant: RPC 樣式的本文物件不支援型別 {0} 實作的介面 {1}。

# SFxCallbackBehaviorAttributeOnlyOnDuplex
source: CallbackBehaviorAttribute can only be run as a behavior on an endpoint with a duplex contract. Contract '{0}' is not duplex, as it contains no callback operations.
cs: Třídu CallbackBehaviorAttribute lze spustit pouze jako chování v koncovém bodě s duplexní smlouvou. Smlouva {0} není duplexní, protože nezahrnuje žádné operace zpětného volání.
de: CallbackBehaviorAttribute kann nur auf einem Endpunkt mit einem Duplexvertrag als Verhalten ausgeführt werden. Der Vertrag "{0}" ist kein Duplexvertrag, da er keine Rückrufvorgänge enthält.
es: El atributo CallbackBehaviorAttribute solo se puede ejecutar como un comportamiento en un punto de conexión con un contrato dúplex. El contrato "{0}" no es dúplex, ya que no contiene operaciones de devolución de llamada.
fr: CallbackBehaviorAttribute peut être exécuté uniquement en tant que comportement sur un point de terminaison avec un contrat duplex. Le contrat '{0}' n'est pas duplex, car il ne contient aucune opération de rappel.
it: È possibile eseguire CallbackBehaviorAttribute solo come comportamento in un endpoint con un contratto duplex. Il contratto '{0}' non è duplex, perché non contiene operazioni callback.
ja: CallbackBehaviorAttribute は、二重のコントラクトを使用したエンドポイント上のビヘイビアーとしてのみ実行できます。コントラクト '{0}' は、コールバック操作を含んでいないため、二重ではありません。
ko: CallbackBehaviorAttribute는 이중 계약의 엔드포인트에서 동작으로서만 실행될 수 있습니다. 콜백 작업을 포함하고 있지 않으므로 '{0}' 계약은 이중이 아닙니다.
pl: Atrybut CallbackBehaviorAttribute może być uruchamiany jako zachowanie w punkcie końcowym z kontraktem dupleksowym. Kontrakt „{0}” nie jest dupleksowy, ponieważ nie zawiera żadnych operacji wywołania zwrotnego.
pt_br: O CallbackBehaviorAttribute só pode ser executado como um comportamento em um ponto de extremidade com um contrato duplex. O contrato '{0}' não é duplex, porque ele não contém operações de retorno de chamada.
tr: CallbackBehaviorAttribute, yalnızca bir çift yönlü anlaşmayla bir uç nokta davranışı olarak çalıştırılabilir. Herhangi bir geri çağırma işlemi bulundurmadığından '{0}' anlaşması çift yönlü değildir.
zh_hans: CallbackBehaviorAttribute 只可以在具有双工协定的终结点上作为一种行为运行。协定“{0}”不是双工的，因为它不包含回调操作。
zh_hant: CallbackBehaviorAttribute 只能在具有雙工合約的端點上，以行為方式執行。合約 '{0}' 沒有包含任何回呼作業，並非雙工。
