Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# CommunicationObjectBaseClassMethodNotCalled
source: The communication object, {0}, has overridden the virtual function {1} but it does not call version defined in the base class.
cs: Objekt komunikace, {0}, potlačil virtuální funkci {1}, ale nevolá verzi definovanou v základní třídě.
de: Das Kommunikationsobjekt {0} hat die virtuelle Funktion {1} außer Kraft gesetzt, ruft aber keine in der Basisklasse definierte Version auf.
es: El objeto de comunicación, {0}, invalidó la función virtual {1}, pero no llama a la versión definida en la clase base.
fr: L'objet de communication {0} a remplacé la fonction virtuelle {1}, mais il n'appelle pas la version définie dans la classe de base.
it: L'oggetto di comunicazione {0} ha sostituito la funzione virtuale {1}, ma non effettua una chiamata alla versione definita nella classe di base.
ja: 通信オブジェクト {0} は、仮想関数 {1} を上書きしましたが、基本クラスで定義されたバージョンを呼び出しません。
ko: 통신 개체 {0}이(가) 가상 함수 {1}을(를) 다시 정의했지만 기본 클래스에 정의된 버전을 호출하지 않습니다.
pl: Obiekt komunikacyjny {0} przesłonił funkcję wirtualną {1}, ale nie wywołuje wersji zdefiniowanej w klasie bazowej.
pt_br: O objeto de comunicação, {0}, substituiu a função virtual {1}, mas não chama a versão definida na classe base.
tr: {0} iletişim nesnesi {1} sanal işlevini geçersiz kıldı, ancak temel sınıfta tanımlanan sürümü çağırmıyor.
zh_hans: 通信对象 {0} 已经替代虚拟函数 {1}，但是它未调用基类中定义的版本。
zh_hant: 通訊物件 {0} 已覆寫虛擬函式 {1}，但未呼叫基底類別中定義的版本。

# CommunicationObjectCannotBeModifiedInState
source: The communication object, {0}, cannot be modified while it is in the {1} state.
cs: Objekt komunikace, {0}, nelze upravit, dokud je ve stavu {1}.
de: Das Kommunikationsobjekt {0} kann nicht geändert werden, während es sich im {1}-Zustand befindet.
es: El objeto de comunicación, {0}, no se puede modificar mientras se encuentre en el estado {1}.
fr: L'objet de communication {0} ne peut pas être modifié tant que son état est {1}.
it: Non è possibile modificare l'oggetto comunicazione {0} mentre si trova nello stato {1}.
ja: 通信オブジェクト {0} は、状態が {1} である場合は変更できません。
ko: 통신 개체 {0}은(는) {1} 상태일 경우 수정할 수 없습니다.
pl: Obiektu komunikacyjnego {0} nie można modyfikować, jeśli jest w stanie {1}.
pt_br: O objeto de comunicação, {0}, não poderá ser modificado enquanto estiver no estado {1}.
tr: {0} iletişim nesnesi, {1} durumundayken değiştirilemez.
zh_hans: 通信对象 {0} 处于 {1} 状态时无法对其进行修改。
zh_hant: 當通訊物件 {0} 為 {1} 狀態時，無法修改該物件。

# CommunicationObjectCannotBeUsed
source: The communication object, {0}, is in the {1} state. Communication objects cannot be used for communication unless they are in the Opened state.
cs: Objekt komunikace {0} je ve stavu {1}. Pokud objekty komunikace nejsou ve stavu Opened, nelze je použít ke komunikaci.
de: Das Kommunikationsobjekt {0} befindet sich im {1}-Zustand. Die Kommunikationsobjekte können nicht zur Kommunikation verwendet werden, wenn sie sich nicht im Opened-Zustand befinden.
es: El objeto de comunicación, {0}, se encuentra en el estado {1}. Los objetos de comunicación no se pueden usar para la comunicación a menos que se encuentren en el estado Opened.
fr: L'objet de communication {0} est dans l'état {1}. Les objets de communication ne peuvent pas être utilisés à moins d'être dans l'état Opened.
it: L'oggetto comunicazione {0} si trova nello stato {1}. Non è possibile usare oggetti comunicazione per la comunicazione a meno che non siano nello stato Opened.
ja: 通信オブジェクト {0} は {1} 状態です。通信オブジェクトは、Opened 状態でないと通信に使用できません。
ko: 통신 개체 {0}이(가) {1} 상태입니다. 통신 개체는 열림 상태가 아닌 경우 통신에 사용할 수 없습니다.
pl: Obiekt komunikacyjny {0} jest w stanie {1}. Obiektów komunikacyjnych nie można używać do komunikacji, jeśli nie są w stanie Opened.
pt_br: O objeto de comunicação, {0}, está no estado {1}. Objetos de comunicação não poderão ser usados para comunicação, a não ser que estejam no estado Aberto.
tr: {0} iletişim nesnesi {1} durumunda. Opened durumunda olmadıkları sürece, iletişim nesneleri iletişim için kullanılamaz.
zh_hans: 通信对象 {0} 处于 {1} 状态。除非通信对象处于“已打开”状态，否则无法将其用于通信。
zh_hant: 通訊物件 {0} 為 {1} 狀態。除非通訊物件為「已開啟」狀態，否則無法用於通訊。

# CommunicationObjectCloseInterrupted1
source: The communication object, {0}, cannot be used due to an error that occurred during close.
cs: Objekt komunikace {0} nelze použít kvůli chybě, ke které došlo při zavírání.
de: Das Kommunikationsobjekt {0} kann nicht verwendet werden, da beim Schließen ein Fehler aufgetreten ist.
es: El objeto de comunicación, {0}, no se puede usar porque se produjo un error al cerrar.
fr: Impossible d'utiliser l'objet de communication {0} en raison d'une erreur qui s'est produite lors de la fermeture.
it: Impossibile utilizzare l'oggetto di comunicazione {0} a causa di un errore che si è verificato durante la chiusura.
ja: 通信オブジェクト {0} は、終了中にエラーが発生したため、使用できません。
ko: 닫는 동안 오류가 발생했으므로 통신 개체 {0}을(를) 사용할 수 없습니다.
pl: Nie można użyć obiektu komunikacji {0} z powodu błędu, który wystąpił podczas zamykania.
pt_br: O objeto de comunicação, {0}, não pode ser usado devido a um erro durante o fechamento.
tr: {0} iletişim nesnesi kapatma sırasında oluşan bir hata nedeniyle kullanılamıyor.
zh_hans: 由于关闭过程中发生错误，因此无法使用通信对象 {0}。
zh_hant: 無法使用通訊物件 {0}，因為關閉期間發生錯誤。

# CommunicationObjectFaulted1
source: The communication object, {0}, cannot be used for communication because it is in the Faulted state.
cs: Objekt komunikace {0} nelze použít ke komunikaci, protože je ve stavu Faulted.
de: Das Kommunikationsobjekt {0} kann nicht zur Kommunikation verwendet werden, weil es sich im Faulted-Zustand befindet.
es: El objeto de comunicación, {0}, no se puede usar para la comunicación porque se encuentra en el estado Faulted.
fr: L'objet de communication {0} ne peut pas être utilisé pour la communication, car il est dans l'état Faulted.
it: Non è possibile usare l'oggetto comunicazione {0} per la comunicazione perché si trova nello stato Faulted.
ja: 通信オブジェクト {0} は、状態が Faulted であるため通信に使用できません。
ko: 통신 개체 {0}은(는) Faulted 상태이기 때문에 통신에 사용할 수 없습니다.
pl: Obiektu komunikacyjnego {0} nie można używać do komunikacji, ponieważ jest w stanie Faulted.
pt_br: O objeto de comunicação, {0}, não pode ser usado para comunicação porque está no estado Com Falha.
tr: {0} iletişim nesnesi, Faulted durumunda olduğundan iletişim için kullanılamıyor.
zh_hans: 通信对象 {0} 无法用于通信，因为其处于“出错”状态。
zh_hant: 因為通訊物件 {0} 為「出錯」狀態，所以無法用於通訊。

# CommunicationObjectInInvalidState
source: The communication object, {0}, is not part of WCF and is in an unsupported state '{1}'. This indicates an internal error in the implementation of that communication object.
cs: Objekt komunikace, {0}, není součástí WCF a je v nepodporovaném stavu {1}. To určuje vnitřní chybu v implementaci tohoto objektu komunikace.
de: Das Kommunikationsobjekt {0} ist nicht Teil von WCF und befindet sich im Zustand "{1}", der nicht unterstützt wird. Dies weist auf einen internen Fehler in der Implementierung dieses Kommunikationsobjekts hin.
es: El objeto de comunicación, {0}, no forma parte de WCF y se encuentra en un estado incompatible "{1}". Esto indica la existencia de un error interno en la implementación de ese objeto de comunicación.
fr: L'objet de communication {0} ne fait pas partie de WCF et se trouve dans un état non pris en charge '{1}'. Ceci indique une erreur interne dans l'implémentation de cet objet de communication.
it: L'oggetto di comunicazione {0} non fa parte di WCF e si trova in uno stato non supportato '{1}'. Questa condizione indica un errore interno nell'implementazione dell'oggetto di comunicazione.
ja: 通信オブジェクト {0} は WCF の一部ではなく、サポートされていない '{1}' の状態です。これは、この通信オブジェクトの実装において内部エラーが発生していることを示します。
ko: 통신 개체 {0}은(는) WCF의 일부가 아니며 지원되지 않는 '{1}' 상태입니다. 이것은 해당 통신 개체의 구현에 내부 오류가 있다는 것을 나타냅니다.
pl: Obiekt komunikacyjny {0} nie wchodzi w skład WCF i jest w nieobsługiwanym stanie „{1}”. Oznacza to błąd wewnętrzny w implementacji obiektu komunikacji.
pt_br: O objeto de comunicação, {0}, não faz parte do WCF e está em um formato sem suporte '{1}'. Isso indica um erro interno na implementação desse objeto de comunicação.
tr: {0} iletişim nesnesi WCF'nin bir parçası değil ve desteklenmeyen '{1}' durumunda. Bu, ilgili iletişim nesnesinin uygulanmasında bir iç hata olduğunu gösterir.
zh_hans: 通信对象 {0} 不是 WCF 的一部分并且处于不支持的状态“{1}”。这表明通信对象的实现中出现内部错误。
zh_hant: 通訊物件 {0} 不是 WCF 的一部分，且為不受支援的狀態 '{1}'。這表示實作該通訊物件時發生內部錯誤。

# ConfigurationFilesNotSupported
source: Configuration files are not supported.
cs: Konfigurační soubory nejsou podporovány.
de: Konfigurationsdateien werden nicht unterstützt.
es: No se admiten los archivos de configuración.
fr: Les fichiers config ne sont pas pris en charge.
it: I file di configurazione non sono supportati.
ja: 構成ファイルはサポートされていません。
ko: 구성 파일은 지원되지 않습니다.
pl: Pliki konfiguracji nie są obsługiwane.
pt_br: Não há suporte para os arquivos de configuração.
tr: Yapılandırma dosyaları desteklenmiyor.
zh_hans: 不支持配置文件。
zh_hant: 不支援組態檔案。

# ContractIsNotSelfConsistentItHasOneOrMore2
source: The contract '{0}' is not self-consistent -- it has one or more IsTerminating or non-IsInitiating operations, but it does not have the SessionMode property set to SessionMode.Required. The IsInitiating and IsTerminating attributes can only be used in the context of a session.
cs: Kontrakt {0} není celistvý – má jednu nebo více operací IsTerminating nebo non-IsInitiating, ale vlastnost SessionMode nemá nastavenou na hodnotu SessionMode.Required. Atributy IsInitiating a IsTerminating mohou být použity pouze v kontextu relace.
de: Der Vertrag "{0}" ist in sich nicht konsistent: Er weist mindestens einen IsTerminating- oder Nicht-IsInitiating-Vorgang auf, jedoch ist die SessionMode-Eigenschaft nicht auf SessionMode.Required festgelegt. Die Attribute IsInitiating und IsTerminating können nur im Kontext einer Sitzung verwendet werden.
es: El contrato "{0}" no es coherente: tiene una o varias operaciones IsTerminating o no IsInitiating, pero no tiene la propiedad SessionMode establecida en SessionMode.Required. Los atributos IsInitiating e IsTerminating solo se pueden usar en el contexto de una sesión.
fr: Le contrat '{0}' contient des incohérences : il contient une ou plusieurs opérations IsTerminating ou une ou plusieurs opérations autres que IsInitiating, mais sa propriété SessionMode n'est pas définie à SessionMode.Required. Les attributs IsInitiating et IsTerminating peuvent être utilisés seulement dans le contexte d'une session.
it: Il contratto '{0}' non è coerente perché include una o più operazioni IsTerminating o non IsInitiating, ma la proprietà SessionMode non è impostata su SessionMode.Required. È possibile usare gli attributi IsInitiating e IsTerminating solo nel contesto di una sessione.
ja: コントラクト '{0}' の内容が矛盾しています。このコントラクトには、1 つ以上の IsTerminating 操作または IsInitiating 以外の操作がありますが、SessionMode.Required に設定された SessionMode プロパティがありません。IsInitiating および IsTerminating 属性は、セッションのコンテキストでのみ使用できます。
ko: '{0}' 계약 자체에 일관성이 없습니다. 하나 이상의 IsTerminating 작업 또는 IsInitiating 이외 작업이 있지만 SessionMode.Required로 설정된 SessionMode 속성이 없습니다. IsInitiating 및 IsTerminating 특성은 세션의 컨텍스트에서만 사용할 수 있습니다.
pl: Kontrakt „{0}” nie jest spójny — zawiera jedną lub więcej operacji IsTerminating lub non-IsInitiating, ale nie ma właściwości SessionMode ustawionej na SessionMode.Required. Atrybutów IsInitiating i IsTerminating można używać jedynie w kontekście sesji.
pt_br: O contrato '{0}' não é autoconsistente; ele tem uma ou mais operações IsTerminating ou não IsInitiating, mas não tem a propriedade SessionMode definida como SessionMode.Required. Os atributos IsInitiating e IsTerminating apenas podem ser usados no contexto de uma sessão.
tr: '{0}' anlaşması kendisiyle tutarlı değil. Bir ya da birkaç IsTerminating ya da IsInitiating olmayan işleme sahip, ancak SessionMode özelliği SessionMode.Required olarak ayarlanmamış. IsInitiating ve IsTerminating öznitelikleri yalnızca bir oturum bağlamında kullanılabilir.
zh_hans: 协定“{0}”本身不一致。它包含一个或多个 IsTerminating 或者非 IsInitiating 操作，但是它未将 SessionMode 属性设置为 SessionMode.Required。IsInitiating 和 IsTerminating 特性只能在会话的上下文中使用。
zh_hant: 合約 '{0}' 本身並不一致，它具有一或多項 IsTerminating 或 non-IsInitiating 作業，但其 SessionMode 屬性未設為 SessionMode.Required。IsInitiating 與 IsTerminating 屬性只可用於工作階段環境中。

# ContractIsNotSelfConsistentWhenIsSessionOpenNotificationEnabled
source: The operation contract '{0}' is not self-consistent. When the '{1}' is set to '{2}', both '{3}' and '{4}' properties must be true, and the operation must not have any input parameters.
cs: Kontrakt operace {0} není celistvý. Když je vlastnost {1} nastavena na hodnotu {2}, vlastnosti {3} i {4} musí mít hodnotu true a operace nesmí mít žádné vstupní parametry.
de: Der Vorgangsvertrag "{0}" ist in sich nicht konsistent. Wenn "{1}" auf "{2}" festgelegt ist, muss sowohl die {3}-Eigenschaft als auch die {4}-Eigenschaft "true" sein, und der Vorgang darf keine Eingabeparameter aufweisen.
es: El contrato de operación "{0}" no es coherente. Cuando "{1}" se establece en "{2}", tanto la propiedad "{3}" como la propiedad "{4}" deben ser true y la operación no debe tener ningún parámetro de entrada.
fr: Le contrat d'opération '{0}' contient des incohérences. Quand '{1}' a la valeur '{2}', les propriétés '{3}' et '{4}' doivent avoir la valeur true, et l'opération ne doit avoir aucun paramètre d'entrée.
it: Il contratto di operazione '{0}' non è coerente. Quando '{1}' è impostato su '{2}', entrambe le proprietà '{3}' e '{4}' devono essere true e l'operazione non deve contenere parametri di input.
ja: 操作コントラクト '{0}' の内容が矛盾しています。'{1}' が '{2}' に設定されている場合、'{3}' と '{4}' のプロパティの両方が true である必要があり、操作はすべての入力パラメーターを含む必要があります。
ko: 작업 계약 '{0}' 자체에 일관성이 없습니다. '{1}'이(가) '{2}'(으)로 설정되어 있으면 '{3}' 및 '{4}' 속성이 true여야 하고, 작업에 입력 매개 변수가 없어야 합니다.
pl: Kontrakt operacji „{0}” nie jest spójny. Gdy właściwość „{1}” ma wartość „{2}”, właściwości „{3}” i „{4}” muszą mieć wartość true, a operacja nie może mieć parametrów wejściowych.
pt_br: O contrato de operação '{0}' não é autoconsistente. Quando '{1}' está definido como '{2}', as propriedades '{3}' e '{4}' devem ser true e a operação não pode ter parâmetros de entrada.
tr: '{0}' işlem anlaşması tutarlı değil. '{1}' değeri '{2}' olarak ayarlandığında, '{3}' ve '{4}' özelliklerinin her ikisi de true olmalıdır ve işlemde giriş parametresi olmamalıdır.
zh_hans: 操作协定“{0}”本身不一致。当“{1}”设置为“{2}”时，“{3}”和“{4}”属性都必须为 true，且运算不得具有任何输入参数。
zh_hant: 作業合約 '{0}' 本身並不一致。'{1}' 設為 '{2}' 時，'{3}' 及 '{4}' 屬性都必須為 true，而且作業必須不可有任何輸入參數。

# CopyHttpHeaderFailed
source: Failed to copy the HTTP header '{0}' with value '{1}' to '{2}'.
cs: Hlavičku HTTP {0} s hodnotou {1} se nepodařilo zkopírovat do umístění {2}.
de: Fehler beim Kopieren des HTTP-Headers "{0}" mit dem Wert "{1}" nach "{2}".
es: No se pudo copiar el encabezado HTTP "{0}" con el valor "{1}" en "{2}".
fr: Échec de la copie de l'en-tête HTTP '{0}' avec la valeur '{1}' à '{2}'.
it: Non è stato possibile copiare l'intestazione HTTP '{0}' con valore '{1}' in '{2}'.
ja: 値 '{1}' を持つ HTTP ヘッダー '{0}' の '{2}' へのコピーに失敗しました。
ko: '{1}' 값을 가지는 HTTP 헤더 '{0}'을(를) '{2}'에 복사하지 못했습니다.
pl: Nie można skopiować nagłówka HTTP „{0}” o wartości od „{1}” do „{2}”.
pt_br: Falha ao copiar o cabeçalho HTTP '{0}' com valor '{1}' para '{2}'.
tr: '{1}' değerine sahip HTTP üst bilgisi '{0}' '{2}' öğesine kopyalanamadı.
zh_hans: 未能将值为“{1}”的 HTTP 标头“{0}”复制到“{2}”。
zh_hant: 無法將值為 '{1}' 的 HTTP 標頭 '{0}' 複製到 '{2}'。

# CouldNotFindNamespaceForPrefix
source: There is no namespace binding for prefix '{0}' in scope.
cs: V daném rozsahu se vazba oboru názvů pro předponu {0} nevyskytuje.
de: Für das Präfix "{0}" ist keine Namespacebindung im Bereich vorhanden.
es: No hay ningún enlace de espacio de nombres para el prefijo "{0}" en el ámbito.
fr: Il n'existe aucune liaison d'espace de noms pour le préfixe '{0}' dans la portée.
it: Nell'ambito non esiste alcun binding di spazio dei nomi per il prefisso '{0}'.
ja: プレフィックス '{0}' の名前空間バインディングが範囲内にありません。
ko: 범위에 접두사 '{0}'에 대한 네임스페이스 바인딩이 없습니다.
pl: Brak powiązania przestrzeni nazw dla prefiksu „{0}” w zakresie.
pt_br: Não há associação de namespace para o prefixo '{0}' no escopo.
tr: Kapsamdaki '{0}' önek için ad alanı bağlayıcısı yok.
zh_hans: 范围中前缀“{0}”没有任何命名空间绑定。
zh_hant: 範圍中的前置詞 '{0}' 沒有命名空間繫結。

# CouldNotParseWithAction
source: A message with action {0} could not be parsed.
cs: Zprávu s akcí {0} nebylo možné analyzovat.
de: Eine Nachricht mit Aktion {0} konnte nicht analysiert werden.
es: No se pudo analizar un mensaje con la acción {0}.
fr: Un message avec l'action {0} n'a pas pu être analysé.
it: Impossibile analizzare un messaggio con azione {0}.
ja: アクション {0} を含むメッセージを解析できませんでした。
ko: {0} 동작이 있는 메시지를 구문 분석할 수 없습니다.
pl: Nie można przeanalizować komunikatu z akcją {0}.
pt_br: Não foi possível analisar a mensagem com ação {0}.
tr: {0} eylemine sahip bir ileti ayrıştırılamadı.
zh_hans: 无法分析带有操作 {0} 的消息。
zh_hant: 無法剖析具有動作 {0} 的訊息。

# CouldnTCreateChannelForChannelType2
source: Channel type '{1}' was requested, but Binding '{0}' doesn't support it or isn't configured properly to support it.
cs: Byl požadován typ kanálu {1}, ale vazba {0} jej nepodporuje, nebo pro jeho podporu není správně nakonfigurována.
de: Der Kanaltyp "{1}" wurde angefordert, die Bindung "{0}" unterstützt diesen jedoch nicht, oder die Unterstützung wurde nicht korrekt konfiguriert.
es: Se solicitó el tipo de canal "{1}", pero el enlace "{0}" no lo admite o no está configurado correctamente para admitirlo.
fr: Le type de canal '{1}' a été demandé, mais la liaison '{0}' ne le prend pas en charge ou n'est pas configurée correctement pour le prendre en charge.
it: È stato richiesto il tipo di canale '{1}', ma il binding '{0}' non lo supporta o non è configurato correttamente per supportarlo.
ja: チャネルの種類 '{1}' が要求されましたが、バインド '{0}' はそれをサポートしないか、サポートするように正しく構成されていません。
ko: 채널 형식 '{1}'이(가) 요청되었지만 '{0}' 바인딩이 이를 지원하지 않거나 지원하도록 올바르게 구성되지 않았습니다.
pl: Zażądano kanału typu „{1}”, ale powiązanie „{0}” nie obsługuje tego typu albo nie zostało poprawnie skonfigurowane do jego obsługi.
pt_br: O tipo de canal '{1}' foi solicitado, mas a Associação '{0}' não dá suporte a isso ou não está configurada adequadamente para dar suporte a isso.
tr: '{1}' kanal türü istendi, ancak Binding '{0}' bunu desteklemiyor ve bunu destekleyecek biçimde yapılandırılmamış.
zh_hans: 请求通道类型“{1}”，但是绑定“{0}”不支持它或者配置不正确而无法支持它。
zh_hant: 已要求通道類型 '{1}'，但繫結 '{0}' 不支援，或因未正確設定而無法支援。

# CouldnTCreateChannelForType2
source: Channel requirements cannot be met by the ChannelFactory for Binding '{0}' since the contract requires support for one of these channel types '{1}' but the binding doesn't support any of them.
cs: Požadavky kanálu nelze splnit třídou ChannelFactory pro vazbu {0}, protože kontrakt vyžaduje podporu pro některý z těchto typů kanálů {1}, ale vazba žádný z nich nepodporuje.
de: Die Kanalanforderungen können durch die ChannelFactory für die Bindung "{0}" nicht erfüllt werden, weil der Vertrag Unterstützung für einen dieser Kanaltypen "{1}" erfordert, die Bindung jedoch keinen der Typen unterstützt.
es: ChannelFactory no puede cumplir los requisitos de canal para el enlace "{0}", ya que el contrato requiere compatibilidad con uno de estos tipos de canales "{1}" pero el enlace no admite ninguno de ellos.
fr: Les exigences du canal ne peuvent pas être satisfaites par ChannelFactory pour la liaison '{0}', car le contrat nécessite la prise en charge de l'un de ces types de canal '{1}', alors que la liaison ne prend en charge aucun d'entre eux.
it: ChannelFactory non può soddisfare i requisiti del canale per il binding '{0}'. Il contratto richiede il supporto per uno di questi tipi di canale '{1}', ma il binding non li supporta.
ja: バインド '{0}' の ChannelFactory がチャネル要件に合いません。コントラクトはチャネルの種類として '{1}' のいずれか 1 つのサポートを必要としていますが、バインドはいずれの種類のチャネルもサポートしていません。
ko: 이러한 채널 형식 '{1}' 중 하나에 대한 지원이 계약에 필요하지만 바인딩에서 이러한 형식을 지원하지 않기 때문에 바인딩 '{0}'에 대한 ChannelFactory에서 채널 요구 사항을 충족할 수 없습니다.
pl: Obiekt ChannelFactory nie może spełnić wymagań dotyczących kanału dla powiązania „{0}”, ponieważ kontrakt wymaga obsługi jednego z typów kanałów „{1}”, ale powiązanie nie obsługuje żadnego z nich.
pt_br: Os requisitos de canal não podem ser atendidos por ChannelFactory para a Associação '{0}' porque o contrato requer suporte para um desses tipos de canal '{1}', mas a associação não dá suporte para nenhum deles.
tr: Anlaşma bu kanal türlerinden birinin '{1}' desteklenmesini gerektirdiğinden, ancak bağlama bunların hiçbirini desteklemediğinden, kanal gereksinimleri Binding '{0}' ChannelFactory tarafından karşılanamıyor.
zh_hans: 绑定“{0}”的 ChannelFactory 无法满足通道要求，因为协定需要支持这些通道类型“{1}”中的一种，但是此绑定不支持其中任何一种。
zh_hant: 繫結 '{0}' 的 ChannelFactory 無法符合通道需求，因為合約要求支援這些通道類型 '{1}' 中的一種，但是此繫結完全不支援。

# CreationTimeUtcIsAfterExpiryTime
source: Creation time must be before expiration time.
cs: Čas vytvoření musí nastat před časem vypršení platnosti.
de: Der Erstellungszeitpunkt muss vor dem Ablaufzeitpunkt liegen.
es: La hora de creación debe ser anterior a la hora de expiración.
fr: L'heure de la création doit être antérieure à celle de l'expiration.
it: La data di creazione deve essere precedere la data di scadenza.
ja: 作成日時は有効期限の日時より前である必要があります。
ko: 만든 시간은 만료 시간보다 빨라야 합니다.
pl: Czas utworzenia musi poprzedzać czas wygaśnięcia.
pt_br: A hora de criação deve ser anterior à hora de expiração.
tr: Oluşturma zamanı, geçerlilik sonu zamanından önce olmalıdır.
zh_hans: 创建时间必须要早于过期时间。
zh_hant: 建立時間必須在到期時間之前。

# CredentialDisallowsNtlm
source: The NTLM authentication scheme was specified, but the target credential does not allow NTLM.
cs: Bylo zadáno schéma ověření NTLM, ale cílové přihlašovací údaje NTLM nepovolují.
de: Das NTLM-Authentifizierungsschema wurde angegeben, aber die Anmeldeinformationen für das Ziel lassen NTLM nicht zu.
es: Se especificó el esquema de autenticación NTLM, pero la credencial de destino no admite NTLM.
fr: Le schéma d'authentification NTLM a été spécifié, mais les informations d'identification cible n'autorisent pas NTLM.
it: È stato specificato l'ambito di autenticazione NTLM, ma la credenziale di destinazione non consente NTLM.
ja: NTLM 認証方式が指定されましたが、対象の資格情報では NTLM が許可されていません。
ko: NTLM 인증 구성표가 지정되었지만 대상 자격 증명에서 NTLM을 허용하지 않습니다.
pl: Określono schemat uwierzytelnienia NTLM, ale poświadczenie docelowe nie dopuszcza schematu NTLM.
pt_br: O esquema de autenticação NTLM foi especificado, mas a credencial de destino não permite o NTLM.
tr: NTLM kimlik doğrulama düzeni belirtildi, ancak hedef kimlik bilgisi NTLM'ye izin vermiyor.
zh_hans: 已指定 NTLM 身份验证方案，但是目标凭据不允许 NTLM。
zh_hant: 已指定 NTLM 驗證配置，但目標認證不允許 NTLM。
