Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# MimeWriterInvalidStateForContent
source: MIME writer cannot write content in state '{0}'.
cs: Zapisovač MIME ve stavu {0} nemůže zapsat obsah.
de: Ein MIME-Writer kann im Zustand "{0}" keinen Inhalt schreiben.
es: El escritor MIME no puede escribir contenido en el estado '{0}'.
fr: L'enregistreur MIME ne peut écrire aucun contenu dans l'état '{0}'.
it: Writer MIME: impossibile scrivere contenuto nello stato '{0}'.
ja: 状態が '{0}' のときは、MIME ライターはコンテンツを書き込むことができません。
ko: MIME 작성기가 '{0}' 상태에서 콘텐츠를 쓸 수 없습니다.
pl: Moduł zapisujący MIME nie może zapisać zawartości w stanie „{0}”.
pt_br: O gravador MIME não pode gravar conteúdo no estado '{0}'.
tr: MIME yazarı, '{0}' durumunda içerik yazamaz.
zh_hans: MIME 编写器无法在“{0}”状态下编写内容。
zh_hant: MIME 寫入器無法寫入處於狀態 '{0}' 的內容。

# MimeWriterInvalidStateForHeader
source: MIME writer cannot write MIME header in state '{0}'.
cs: Zapisovač MIME ve stavu {0} nemůže zapsat hlavičku MIME.
de: Ein MIME-Writer kann im Zustand "{0}" keinen MIME-Header schreiben.
es: El escritor MIME no puede escribir el encabezado MIME en el estado '{0}'.
fr: L'enregistreur MIME ne peut pas écrire l'en-tête MIME dans l'état '{0}'.
it: Writer MIME: impossibile scrivere l'intestazione MIME nello stato '{0}'.
ja: 状態が '{0}' のときは、MIME ライターは MIME ヘッダーを書き込むことができません。
ko: MIME 작성기가 '{0}' 상태에서 MIME 헤더를 쓸 수 없습니다.
pl: Moduł zapisujący MIME nie może zapisać nagłówka MIME w stanie „{0}”.
pt_br: O gravador MIME não pode gravar cabeçalho MIME no estado '{0}'.
tr: MIME yazarı, '{0}' durumunda MIME üst bilgisi yazamaz.
zh_hans: MIME 编写器无法在“{0}”状态下编写 MIME 标头。
zh_hant: MIME 寫入器無法寫入處於狀態 '{0}' 的 MIME 標頭。

# MimeWriterInvalidStateForStartPart
source: MIME writer cannot start new MIME part in state '{0}'.
cs: Zapisovač MIME ve stavu {0} nemůže začít novou část MIME.
de: Ein MIME-Writer kann im Zustand "{0}" keinen neuen MIME-Abschnitt beginnen.
es: El escritor MIME no puede iniciar un nuevo elemento MIME en el estado '{0}'.
fr: L'enregistreur MIME ne peut pas démarrer la nouvelle partie MIME dans l'état '{0}'.
it: Writer MIME: impossibile iniziare una nuova parte MIME nello stato '{0}'.
ja: 状態が '{0}' のときは、MIME ライターは新しい MIME パートを開始できません。
ko: MIME 작성기가 '{0}' 상태에서 새 MIME 부분을 시작할 수 없습니다.
pl: Moduł zapisujący MIME nie może rozpocząć nowej części MIME w stanie „{0}”.
pt_br: O gravador MIME não pode iniciar a nova parte MIME no estado '{0}'.
tr: MIME yazarı, '{0}' durumunda yeni MIME bölümü başlatamaz.
zh_hans: MIME 编写器无法在“{0}”状态下开始新的 MIME 部分。
zh_hant: MIME 寫入器無法啟動處於狀態 '{0}' 的新 MIME 部份。

# MimeWriterInvalidStateForStartPreface
source: MIME writer cannot start preface in '{0}' state.
cs: Zapisovač MIME ve stavu {0} nemůže začít úvod.
de: Ein MIME-Writer kann im Status "{0}" keinen Vorspann beginnen.
es: El escritor MIME no puede iniciar el prefacio en el estado '{0}'.
fr: L'enregistreur MIME ne peut pas démarrer la préface dans l'état '{0}'.
it: Writer MIME: impossibile iniziare una prefazione nello stato '{0}'.
ja: 状態が '{0}' のときは、MIME ライターは preface を開始できません。
ko: MIME 작성기가 '{0}' 상태에서 서문을 시작할 수 없습니다.
pl: Moduł zapisujący MIME nie może rozpocząć wstępu w stanie „{0}”.
pt_br: O gravador MIME não pode iniciar o prefácio no estado '{0}'.
tr: MIME yazarı, '{0}' durumunda önsöz başlatamaz.
zh_hans: MIME 编写器无法在“{0}”状态下开始引语。
zh_hant: MIME 寫入器無法啟動處於狀態 '{0}' 的前置碼。

# MismatchInSecurityOperationToken
source: The incoming message was signed with a token which was different from what used to encrypt the body. This was not expected.
cs: Příchozí zpráva byla podepsána s tokenem, který se lišil od tokenu použitého k šifrování textu. Tato skutečnost nebyla očekávána.
de: Die eingehende Nachricht wurde mit einem Token signiert, das nicht mit dem Token identisch ist, das zum Verschlüsseln des Texts verwendet wurde. Dies wurde nicht erwartet.
es: El mensaje entrante se firmó con un token que era diferente del que solía cifrar el cuerpo. Esto no se esperaba.
fr: Le message entrant a été signé avec un jeton qui était différent de celui utilisé pour chiffrer le corps. Cette situation est inattendue.
it: Errore imprevisto. Messaggio in ingresso firmato con un token diverso da quello utilizzato per crittografare il corpo.
ja: 受信メッセージは、本文を暗号化するのに使用されたものと異なるトークンを使用して署名されています。これは適切な処理ではありません。
ko: 들어오는 메시지가 본문을 암호화하는 데 사용된 토큰과 다른 토큰으로 서명되었습니다. 이것은 예기치 않은 동작입니다.
pl: Wiadomość przychodząca została podpisana tokenem, który różni się od tokenu użytego do zaszyfrowania treści. Nie oczekiwano takiego zachowania.
pt_br: A mensagem de entrada foi assinada com um token diferente do usado para criptografar o corpo. Isso não era esperado.
tr: Gelen ileti, gövdeyi şifrelemek için kullanılandan farklı bir belirteçle imzalanmıştı. Bu beklenmeyen bir durumdu.
zh_hans: 用于签名传入消息的标记不同于用于加密正文的标记。这是不允许的。
zh_hant: 簽署傳入訊息的權杖與用來加密本文的權杖不同。此為非預期狀況。

# MissingContentType
source: The receiver returned an error indicating that the content type was missing on the request to {0}. See the inner exception for more information.
cs: Příjemce vrátil chybu určující, že v požadavku na {0} chyběl typ obsahu. Další informace naleznete v popisu vnitřní výjimky.
de: Der Empfänger hat einen Fehler zurückgegeben, der anzeigt, dass der Inhaltstyp in der Anforderung an {0} fehlte. Weitere Informationen finden Sie in der inneren Ausnahme.
es: El destinatario devolvió un error que indica que faltaba el tipo de contenido en la solicitud a {0}. Consulte la excepción interna para obtener más información.
fr: Le récepteur a retourné une erreur indiquant que le type de contenu était manquant pour la requête adressée à {0}. Pour plus d'informations, consultez l'exception interne.
it: Il destinatario ha restituito un errore in cui è indicato che nella richiesta a {0} manca il tipo di contenuto. Per altre informazioni, vedere l'eccezione interna.
ja: 受信側は、{0} への要求でコンテンツ型が指定されていないことを示すエラーを返しました。詳細については、内部例外を参照してください。
ko: {0}에 대한 요청에 콘텐츠 형식이 없다는 것을 나타내는 오류를 수신자가 반환했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Odbiorca zwrócił błąd wskazujący, że w żądaniu {0} brak typu zawartości. Aby uzyskać więcej informacji, zobacz wyjątek wewnętrzny.
pt_br: O destinatário retornou um erro indicando que o tipo de conteúdo estava ausente na solicitação para {0}. Consulte a exceção interna para obter mais informações.
tr: Alıcı, {0} öğesine yapılan istekte içerik türünün bulunmadığını belirten bir hata döndürür. Daha fazla bilgi için iç özel duruma bakın.
zh_hans: 接收方返回错误，指出对 {0} 的请求上的内容类型已丢失。有关详细信息，请参见内部异常。
zh_hant: 收件者傳回錯誤，指出在對 {0} 的要求上遺漏內容類型。如需詳細資訊，請參閱內部例外狀況。

# MissingCustomCertificateValidator
source: X509CertificateValidationMode.Custom requires a CustomCertificateValidator. Specify the CustomCertificateValidator property.
cs: Třída X509CertificateValidationMode.Custom vyžaduje třídu CustomCertificateValidator. Určete vlastnost CustomCertificateValidator.
de: X509CertificateValidationMode.Custom erfordert einen CustomCertificateValidator. Geben Sie die CustomCertificateValidator-Eigenschaft an.
es: X509CertificateValidationMode.Custom requiere CustomCertificateValidator. Especifique la propiedad CustomCertificateValidator.
fr: X509CertificateValidationMode.Custom nécessite CustomCertificateValidator. Spécifiez la propriété CustomCertificateValidator.
it: Con l'elemento X509CertificateValidationMode.Custom è richiesta una proprietà CustomCertificateValidator. Specificarla.
ja: X509CertificateValidationMode.Custom では、CustomCertificateValidator が必要です。CustomCertificateValidator プロパティを指定してください。
ko: X509CertificateValidationMode.Custom에는 CustomCertificateValidator가 필요합니다. CustomCertificateValidator 속성을 지정하세요.
pl: Element X509CertificateValidationMode.Custom wymaga elementu CustomCertificateValidator. Określ właściwość CustomCertificateValidator.
pt_br: X509CertificateValidationMode.Custom requer CustomCertificateValidator. Especifique a propriedade CustomCertificateValidator.
tr: X509CertificateValidationMode.Custom, bir CustomCertificateValidator gerektirir. CustomCertificateValidator özelliğini belirtin.
zh_hans: X509CertificateValidationMode.Custom 要求 CustomCertificateValidator。请指定 CustomCertificateValidator 属性。
zh_hant: X509CertificateValidationMode.Custom 需要 CustomCertificateValidator。請指定 CustomCertificateValidator 屬性。

# MissingFinalAckExceptionString
source: The remote endpoint did not include a final acknowledgement in the reply to the close sequence request message. This is a violation of the WS-ReliableMessaging protocol. The reliable session was faulted.
cs: Vzdálený koncový bod nezahrnul závěrečné potvrzení do odpovědi na zprávu požadavku na ukončení sekvence. To je narušení protokolu WS-ReliableMessaging. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat keine abschließende Bestätigung in die Antwort auf die Anforderung zum Schließen der Sequenz aufgenommen. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto no incluía una confirmación final en la respuesta al mensaje de solicitud de una secuencia de cierre. Ésta es una infracción del protocolo WS-ReliableMessaging. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant n'incluait pas d'accusé de réception final dans la réponse au message de demande de séquence fermée. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session fiable a généré une erreur.
it: L'endpoint remoto non ha incluso un acknowledgement finale nella risposta al messaggio di richiesta di chiusura sequenza. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、シーケンス クローズ要求メッセージへの応答に、最終受信確認を含めませんでした。これは WS-ReliableMessaging のプロトコル違反です。信頼できるセッションは途中終了されました。
ko: 원격 끝점에 시퀀스 닫기 요청 메시지에 대한 회신의 최종 승인이 없습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy nie dołączył ostatecznego potwierdzenia do odpowiedzi na komunikat żądania zamknięcia sekwencji. Stanowi to naruszenie protokołu WS-ReliableMessaging. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto não incluiu uma confirmação final na resposta à mensagem de solicitação de fechamento de sequência. Trata-se de uma violação do protocolo WS-ReliableMessaging. Falha na sessão confiável.
tr: Uzak bitiş noktası kapatma sırası isteği iletisinin yanıtında son bir alındı bildirimi içermiyordu. Bu, WS-ReliableMessaging protokolünün ihlalidir. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点未在对关闭序列请求消息的答复中包含最终确认。这违反了 WS-ReliableMessaging 协议。可靠会话出错。
zh_hant: 遠端端點未在回覆中包含用以關閉順序要求訊息的最終確認。這違反 WS-ReliableMessaging 通訊協定。可靠工作階段發生錯誤。

# MissingMessageID
source: Request Message is missing a MessageID header. One is required to correlate a reply.
cs: Ve zprávě požadavku chybí záhlaví třídy MessageID. Pro korelaci odpovědi je vyžadováno jedno záhlaví.
de: In der Anforderungsnachricht fehlt ein MessageID-Header. Ein MessageID-Header ist erforderlich, um eine Antwort zu korrelieren.
es: Falta un encabezado MessageID en el mensaje de solicitud. Es necesario para correlacionar una respuesta.
fr: Un en-tête MessageID est manquant dans un message de requête. Un en-tête est obligatoire pour corréler une réponse.
it: Nel messaggio di richiesta manca un'intestazione MessageID. Per correlare una risposta, è necessario un'intestazione MessageID.
ja: 要求メッセージに MessageID ヘッダーがありません。このヘッダーは応答を相関付けるために必要です。
ko: Request 메시지에 MessageID 헤더가 없습니다. 회신을 상호 연결하려면 이 헤더가 필요합니다.
pl: W żądaniu wiadomości brak nagłówka MessageID, który jest wymagany do dopasowania odpowiedzi.
pt_br: A Mensagem de Solicitação não tem um cabeçalho MessageID. Pelo menos um cabeçalho é necessário para correlacionar uma resposta.
tr: Request Message, MessageID üst bilgisine sahip değil. Bir yanıtla ilişkilendirmek için bir tane gerekir.
zh_hans: 请求消息缺少 MessageID 标头。需要 MessageID 标头以与回复相关。
zh_hant: 要求訊息遺漏 MessageID 標頭。必須有此標頭才能與回覆相互關聯。

# MissingMessageIdOnWsrmRequest
source: The wsa:MessageId header must be present on a wsrm:{0} message.
cs: Ve zprávě wsrm:{0} musí být záhlaví wsa:MessageId.
de: Der wsa:MessageId-Header muss in einer wsrm:{0}-Nachricht vorhanden sein.
es: El encabezado wsa:MessageId debe estar presente en los mensajes wsrm:{0}.
fr: L'en-tête wsa:MessageId doit figurer dans un message wsrm:{0}.
it: L'intestazione wsa:MessageId deve essere contenuta in un messaggio wsrm:{0}.
ja: wsrm:{0} メッセージには wsa:MessageId ヘッダーが存在する必要があります。
ko: wsa:MessageId 헤더가 wsrm:{0} 메시지에 있어야 합니다.
pl: Nagłówek wsa:MessageId musi znajdować się w komunikacie wsrm:{0}.
pt_br: O cabeçalho wsa:MessageId deve estar presente em uma mensagem wsrm:{0}.
tr: wsrm:{0} iletisinde, wsa:MessageId üst bilgisi bulunmalıdır.
zh_hans: wsrm:{0} 消息上必须存在 wsa:MessageId 头。
zh_hant: wsrm:{0} 訊息上必須有 wsa:MessageId 標頭。

# MissingPrivateKey
source: The private key is not present in the X.509 certificate.
cs: V certifikátu X.509 se nenachází privátní klíč.
de: Der private Schlüssel ist nicht im X509-Zertifikat vorhanden.
es: La clave privada no está presente en el certificado X.509.
fr: La clé privée n'est pas présente dans le certificat X.509.
it: La chiave privata non è presente nel certificato X.509.
ja: X.509 証明書に秘密キーがありません。
ko: 개인 키가 X.509 인증서에 없습니다.
pl: Klucz prywatny nie występuje w certyfikacie X.509.
pt_br: A chave privada não está presente no certificado X.509.
tr: X.509 sertifikasında özel anahtar yok.
zh_hans: X.509 证书中不存在私钥。
zh_hant: X.509 憑證中沒有私密金鑰。

# MissingRelatesToOnWsrmResponseReason
source: The returned wsrm:{0}Response message was missing the required wsa:RelatesTo header. This is a violation of the WS-Addressing request reply protocol. The reliable session was faulted.
cs: Vrácená zpráva wsrm:{0}Response neobsahovala požadované záhlaví wsa:RelatesTo. To je narušení protokolu odpovědi na požadavek WS-Adressing. Ve stabilní relaci došlo k chybě.
de: In der zurückgegebenen wsrm:{0}Response-Nachricht fehlte der erforderliche wsa:RelatesTo-Header. Dies ist eine Verletzung des Protokolls für Antworten auf WS-Addressing-Anforderungen. Die zuverlässige Sitzung war nicht erfolgreich.
es: En el mensaje wsrm:{0}Response devuelto faltaba el encabezado wsa:RelatesTo requerido. Ésta es una infracción del protocolo de respuesta a solicitudes WS-Addressing. Se generó un error en la sesión confiable.
fr: L'en-tête wsa:RelatesTo requis ne figurait pas dans le message wsrm:{0}Response renvoyé . Il s'agit d'une violation du protocole de réponse à la demande WS-Addressing. La session fiable a généré une erreur.
it: Intestazione wsa:RelatesTo mancante nel messaggio wsrm:{0}Response restituito. Ciò costituisce una violazione del protocollo di risposta alla richiesta WS-Addressing. Sessione affidabile non riuscita.
ja: 返された wsrm:{0}Response メッセージには、必須の wsa:RelatesTo ヘッダーが欠落していました。これは WS-Addressing 要求応答のプロトコル違反です。信頼できるセッションは途中終了されました。
ko: 반환된 wsrm:{0}Response 메시지에 필수 wsa:RelatesTo 헤더가 없습니다. 이것은 WS-Addressing 요청 회신 프로토콜 위반입니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: W zwróconym komunikacie wsrm:{0}Response brakowało wymaganego nagłówka wsa:RelatesTo. Stanowi to naruszenie protokołu żądań i odpowiedzi WS-Addressing. Wystąpił błąd niezawodnej sesji.
pt_br: A mensagem wsrm:{0}Response retornada estava sem o cabeçalho wsa:RelatesTo necessário. Trata-se de uma violação do protocolo de resposta da solicitação do WS-Addressing. Falha na sessão confiável.
tr: Döndürülen wsrm:{0}Response iletisinde gerekli wsa:RelatesTo üst bilgisi eksikti. Bu, WS-Addressing istek yanıtı protokolünün ihlalidir. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 返回的 wsrm:{0}Response 消息缺少所需的 wsa:RelatesTo 头。这违犯了 WS-Addressing 请求答复协议。可靠会话出错。
zh_hant: 傳回的 wsrm:{0}Response 訊息遺失必要的 wsa:RelatesTo 標頭。這違反 WS-Addressing 要求回覆通訊協定。可靠工作階段發生錯誤。

# MissingReplyToOnWsrmRequest
source: The wsa:ReplyTo header must be present on a wsrm:{0} message.
cs: Ve zprávě wsrm:{0} musí být záhlaví wsa:ReplyTo.
de: Der wsa:ReplyTo-Header muss in einer wsrm:{0}-Nachricht vorhanden sein.
es: El encabezado wsa:ReplyTo debe estar presente en los mensajes wsrm:{0}.
fr: L'en-tête wsa:ReplyTo doit figurer dans un message wsrm:{0}.
it: L'intestazione wsa:ReplyTo deve essere presente in un messaggio wsrm:{0}.
ja: wsrm:{0} メッセージには wsa:ReplyTo ヘッダーが存在する必要があります。
ko: wsa:ReplyTo 헤더가 wsrm:{0} 메시지에 있어야 합니다.
pl: Nagłówek wsa:ReplyTo musi znajdować się w komunikacie wsrm:{0}.
pt_br: O cabeçalho wsa: ReplyTo deve estar presente em uma mensagem wsrm:{0}.
tr: wsrm:{0} iletisinde, wsa:ReplyTo üst bilgisi bulunmalıdır.
zh_hans: wsrm:{0} 消息上必须存在 wsa:ReplyTo 头。
zh_hant: wsrm:{0} 訊息上必須有 wsa:ReplyTo 標頭。

# MoreThanOneEndMethodFoundForAsyncBeginMethod3
source: OperationContract method '{0}' in type '{1}' does not properly implement the async pattern, as more than one corresponding method '{2}' was found. When using the async pattern, exactly one end method must be provided. Either remove or rename one or more of the '{2}' methods such that there is just one, or set the AsyncPattern property on method '{0}' to false.
cs: Metoda OperationContract {0} v typu {1} neimplementuje správně asynchronní vzor, protože bylo nalezeno více odpovídajících metod {2}. Při použití asynchronního vzoru musí být zadána právě jedna koncová metoda. Odeberte nebo přejmenujte jednu nebo více metod {2}, aby existovala pouze jedna, nebo nastavte vlastnost AsyncPattern v metodě {0} na hodnotu false.
de: Die OperationContract-Methode "{0}" im Typ "{1}" implementiert das asynchrone Muster nicht korrekt, da mehr als eine entsprechende {2}-Methode gefunden wurde. Bei Verwendung des asynchronen Musters muss genau eine End-Methode angegeben werden. Entfernen Sie mindestens eine der {2}-Methoden, oder benennen Sie sie um, sodass nur noch eine solche Methode vorhanden ist. Alternativ können Sie auch die AsyncPattern-Eigenschaft für die Methode "{0}" auf "false" setzen.
es: El método OperationContract "{0}" del tipo "{1}" no implementa correctamente el patrón asincrónico, ya que se encontró más de un método "{2}" correspondiente. Al usar el patrón asincrónico, debe proporcionarse un único método. Quite o cambie el nombre de uno o varios de los métodos "{2}" de forma que solo quede uno, o bien establezca la propiedad AsyncPattern del método "{0}" en false.
fr: La méthode '{0}' de OperationContract dans le type '{1}' n'implémente pas correctement le modèle asynchrone, car plusieurs méthodes '{2}' correspondantes ont été trouvées. Durant l'utilisation du modèle asynchrone, une seule méthode End doit être fournie. Supprimez ou renommez une ou plusieurs des méthodes '{2}' pour n'en conserver qu'une seule, ou bien définissez la propriété AsyncPattern sur la méthode '{0}' à false.
it: Il metodo '{0}' di OperationContract nel tipo '{1}' non implementa correttamente il modello asincrono perché è stato trovato più di un metodo '{2}' corrispondente. Quando si usa il modello asincrono, è necessario specificare un solo metodo End. Rimuovere o rinominare uno o più metodi '{2}' in modo da mantenerne solo uno oppure impostare su false la proprietà AsyncPattern nel metodo '{0}'.
ja: 複数の対応するメソッド '{2}' が見つかったため、型 '{1}' の OperationContract メソッド '{0}' は非同期パターンを正しく実装していません。非同期パターンを使用するときは、end メソッドは 1 つだけ指定されなければなりません。'{2}' メソッドが 1 つだけになるように余分な '{2}' メソッドを削除または名前変更するか、メソッド '{0}' の AsyncPattern プロパティを False に設定してください。
ko: 둘 이상의 해당 메서드 '{2}'을(를) 찾았기 때문에 형식 '{1}'의 OperationContract 메서드 '{0}'이(가) 비동기 패턴을 제대로 구현하지 않습니다. 비동기 패턴을 사용할 때는 하나의 end 메서드가 제공되어야 합니다. 메서드가 하나만 존재하도록 '{2}' 메서드 중 하나 이상을 제거하거나 이름을 바꾸세요. 또는 메서드 '{0}'에서 AsyncPattern 속성을 false로 설정하세요.
pl: Metoda OperationContract „{0}” w typie „{1}” nie implementuje prawidłowo wzorca asynchronicznego, ponieważ znaleziono więcej niż jedną odpowiadającą metodę „{2}”. W przypadku korzystania z wzorca asynchronicznego należy dostarczyć dokładnie jedną metodę. Usuń lub zmień nazwę jednej lub większej liczby metod „{2}”, tak aby istniała tylko jedna, lub właściwości AsyncPattern nadaj wartość „false” dla metody „{0}”.
pt_br: O método OperationContract '{0}' no tipo '{1}' não implementa corretamente o padrão assíncrono, pois mais de um método correspondente '{2}' foi encontrado. Ao usar o padrão assíncrono, é necessário fornecer exatamente um método final. Remova ou renomeie um ou mais dos métodos '{2}' de forma que apenas um exista ou defina a propriedade AsyncPattern no método '{0}' como false.
tr: Birden çok karşılık gelen '{2}' metodu bulunduğundan '{1}' türündeki '{0}' OperationContract metodu, asenkron yapıyı düzgün biçimde uygulamıyor. Asenkron yapı kullanılırken, tam olarak bir tane bitiş metodu sağlanmalıdır. Yalnızca bir tane kalacak biçimde bu '{2}' metotlarından birini ya da birkaçını kaldırın veya yeniden adlandırın veya '{0}' metodundaki AsyncPattern özelliğini false olarak ayarlayın.
zh_hans: 类型“{1}”中的 OperationContract 方法“{0}”不能正确实现异步模式，因为找到了多个相应方法“{2}”。使用异步模式时，只能提供一个 end 方法。请删除或重命名一个或多个“{2}”方法，只留下一个即可；或将方法“{0}”上的 AsyncPattern 属性设置为 false。
zh_hant: 找到多個對應的方法 '{2}'，因此類型 '{1}' 中的 OperationContract 方法 '{0}' 未正確實作非同步模式。使用非同步模式時，必須提供單一結束方法。請移除或重新命名一或多個 '{2}' 方法，只留下一個方法，或是將方法 '{0}' 的 AsyncPattern 屬性設為 False。

# MoreThanOneRSTRInRSTRC
source: The RequestSecurityTokenResponseCollection received has more than one RequestSecurityTokenResponse element. Only one RequestSecurityTokenResponse element was expected.
cs: Přijatý token RequestSecurityTokenResponseCollection obsahuje více než jeden element RequestSecurityTokenResponse. Byl očekáván pouze jeden element RequestSecurityTokenResponse.
de: Die RequestSecurityTokenResponseCollection hat mehr als ein RequestSecurityTokenResponse-Element. Es wurde nur ein RequestSecurityTokenResponse-Element erwartet.
es: El RequestSecurityTokenResponseCollection recibido tiene más de un elemento RequestSecurityTokenResponse. Sólo se esperaba un elemento RequestSecurityTokenResponse.
fr: La réponse RequestSecurityTokenResponseCollection reçue comporte plusieurs éléments RequestSecurityTokenResponse. Un seul élément RequestSecurityTokenResponse était attendu.
it: Il valore RequestSecurityTokenResponseCollection ricevuto ha più di un elemento RequestSecurityTokenResponse. Era previsto solo un elemento RequestSecurityTokenResponse.
ja: 受信された RequestSecurityTokenResponseCollection には複数の RequestSecurityTokenResponse 要素があります。想定された RequestSecurityTokenResponse 要素は 1 つだけです。
ko: 받은 RequestSecurityTokenResponseCollection에 둘 이상의 RequestSecurityTokenResponse 요소가 있습니다. RequestSecurityTokenResponse 요소는 하나만 필요합니다.
pl: Odebrany schemat RequestSecurityTokenResponseCollection zawiera więcej niż jeden element RequestSecurityTokenResponse. Oczekiwano tylko jednego elementu RequestSecurityTokenResponse.
pt_br: O RequestSecurityTokenResponseCollection recebido tem mais de um elemento RequestSecurityTokenResponse. Somente um elemento RequestSecurityTokenResponse era esperado.
tr: Alınan RequestSecurityTokenResponseCollection birden fazla RequestSecurityTokenResponse öğesi içeriyor. Yalnızca bir RequestSecurityTokenResponse öğesi bekleniyordu.
zh_hans: 收到的 RequestSecurityTokenResponseCollection 具有多个 RequestSecurityTokenResponse 元素。只需要一个 RequestSecurityTokenResponse 元素。
zh_hant: RequestSecurityTokenResponseCollection 收到多個 RequestSecurityTokenResponse 元素。僅能有一個 RequestSecurityTokenResponse 元素。

# MtomBoundaryInvalid
source: '{0}' not a valid MIME boundary.
cs: {0} není platné ohraničení MIME.
de: "{0}" ist eine ungültige MIME-Grenze.
es: '{0}' no es un límite MIME válido.
fr: '{0}' n'est pas une limite MIME valide.
it: '{0}' non è un limite MIME valido.
ja: '{0}' は、無効な MIME 境界です。
ko: '{0}'이(가) 올바른 MIME 경계가 아닙니다.
pl: „{0}” nie jest prawidłową granicą MIME.
pt_br: '{0}' não é um limite MIME válido.
tr: '{0}' geçerli bir MIME kenarlığı değil.
zh_hans: “{0}”不是有效的 MIME 边界。
zh_hant: '{0}' 不是有效的 MIME 界限。
