Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxErrorSerializingBody
source: There was an error in serializing body of message {0}: '{1}'. Please see InnerException for more details.
cs: Došlo k chybě při serializaci textu zprávy {0}: {1}. Další informace naleznete u třídy InnerException.
de: Beim Serialisieren des Textkörpers der Nachricht {0} ist ein Fehler aufgetreten: "{1}". Weitere Details finden Sie unter InnerException.
es: Error al serializar el cuerpo del mensaje {0}: "{1}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant la désérialisation du corps du message {0} : '{1}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante la serializzazione del corpo del messaggio {0}: '{1}'. Per maggiori dettagli, vedere InnerException.
ja: メッセージ {0} の本文をシリアル化しているときにエラーが発生しました: '{1}'。詳細については、InnerException を参照してください。
ko: {0} 메시지의 본문을 직렬화하는 동안 오류가 발생했습니다. '{1}'. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas serializacji treści komunikatu {0}: „{1}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao serializar o corpo da mensagem {0}: '{1}'. Consulte a InnerException para obter mais detalhes.
tr: {0} işlemi yanıt iletisi gövdesi serileştirilirken hata oluştu: '{1}'. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 对消息 {0} 的正文进行序列化时出错:“{1}”。有关详细信息，请参见 InnerException。
zh_hant: 將訊息 {0} 的內文序列化時發生錯誤: '{1}'。如需詳細資訊，請參閱 InnerException。

# SFxErrorSerializingHeader
source: There was an error in serializing one of the headers in message {0}: '{1}'. Please see InnerException for more details.
cs: Došlo k chybě při serializaci jednoho ze záhlaví ve zprávě {0}: {1}. Další informace naleznete u třídy InnerException.
de: Beim Serialisieren eines der Header in der Nachricht {0} ist ein Fehler aufgetreten: "{1}". Weitere Details finden Sie unter InnerException.
es: Error al serializar uno de los encabezados del mensaje {0}: "{1}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant la sérialisation de l'un des en-têtes du message {0} : '{1}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante la serializzazione di una delle intestazioni nel messaggio {0}: '{1}'. Per maggiori dettagli, vedere InnerException.
ja: メッセージ {0} のいずれかのヘッダーをシリアル化しているときにエラーが発生しました: '{1}'。詳細については、InnerException を参照してください。
ko: {0} 메시지의 헤더 중 하나를 직렬화하는 동안 오류가 발생했습니다. '{1}'. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas serializacji jednego z nagłówków komunikatu {0}: „{1}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao serializar um dos cabeçalhos da mensagem {0}: '{1}'. Consulte a InnerException para obter mais detalhes.
tr: {0} iletisindeki üst bilgilerden biri serileştirilirken hata oluştu: '{1}'. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 对消息 {0} 中其中一个标头进行序列化时出错:“{1}”。有关详细信息，请参见 InnerException。
zh_hant: 將訊息 {0} 的其中一項標頭序列化時發生錯誤: '{1}'。如需詳細資訊，請參閱 InnerException。

# SFxExceptionDetailEndOfInner
source: --- End of inner ExceptionDetail stack trace ---
cs: --- Konec trasování zásobníku pro třídu ExceptionDetail ---
de: --- Ende der internen ExceptionDetail-Stapelüberwachung ---
es: --- Fin del seguimiento de la pila ExceptionDetail interna ---
fr: --- Fin de l'arborescence des appels de procédure de ExceptionDetail interne ---
it: --- Fine dell'analisi dello stack interna di ExceptionDetail ---
ja: --- 内部 ExceptionDetail スタック トレースの最後 ---
ko: --- 내부 ExceptionDetail 스택 추적 끝 ---
pl: --- Koniec śladu stosu wewnętrznego ExceptionDetail ---
pt_br: --- Fim do rastreamento de pilha interno de ExceptionDetail ---
tr: --- İç ExceptionDetail yığın izleme sonu ---
zh_hans: --- 内部 ExceptionDetail 堆栈跟踪结束 ---
zh_hant: --- 內部 ExceptionDetail 堆疊追蹤的結尾 ---

# SFxExceptionDetailFormat
source: An ExceptionDetail, likely created by IncludeExceptionDetailInFaults=true, whose value is:
cs: Třída ExceptionDetail pravděpodobně vytvořená třídou IncludeExceptionDetailInFaults=true, jejíž hodnota je:
de: Ein ExceptionDetail, vermutlich erstellt durch IncludeExceptionDetailInFaults=true, mit dem Wert:
es: ExceptionDetail, probablemente creado por IncludeExceptionDetailInFaults=true, cuyo valor es:
fr: ExceptionDetail, probablement créé par IncludeExceptionDetailInFaults=true, dont la valeur est :
it: Un elemento ExceptionDetail, probabilmente creato da IncludeExceptionDetailInFaults=true, il cui valore è:
ja: IncludeExceptionDetailInFaults=true により作成された可能性のある ExceptionDetail の値:
ko: IncludeExceptionDetailInFaults=true에 의해 만들어졌을 가능성이 있는 ExceptionDetail의 값은 다음과 같습니다:
pl: Element ExceptionDetail utworzony prawdopodobnie w wyniku operacji IncludeExceptionDetailInFaults=true, którego wartość to:
pt_br: ExceptionDetail, provavelmente criado por IncludeExceptionDetailInFaults=true, cujo valor é:
tr: Büyük olasılıkla IncludeExceptionDetailInFaults=true tarafından oluşturulan bir ExceptionDetail değeri:
zh_hans: 很可能由 IncludeExceptionDetailInFaults=true 创建的 ExceptionDetail，其值为:
zh_hant: 可能由 IncludeExceptionDetailInFaults=true 建立的 ExceptionDetail，其值為:

# SFxFaultContractDuplicateDetailType
source: In operation {0}, more than one fault is declared with detail type {1}
cs: V operaci {0} je deklarováno více chyb s detailním typem {1}.
de: Im Vorgang {0} sind mehrere Fehler mit dem Detailtyp {1} deklariert.
es: En la operación {0}, se declara más de un error con el tipo de detalle {1}
fr: Dans l'opération {0}, plusieurs erreurs sont déclarées avec le type de détail {1}
it: Nell'operazione {0} è stato dichiarato più di un errore con dettaglio di tipo {1}
ja: 操作 {0} において、詳細の種類が {1} の複数のフォールトが宣言されています。
ko: {0} 작업에 세부 형식 {1}(으)로 선언된 오류가 두 개 이상 있습니다.
pl: W operacji {0} zadeklarowano więcej niż jeden błąd o typie szczegółu {1}.
pt_br: Na operação {0}, mais de uma falha é declarada com tipo de detalhe {1}
tr: {0} işleminde, {1} ayrıntı türüne sahip birden çok hata bildirildi
zh_hans: 在错误 {0} 中，声明了多个详细信息类型为 {1} 的错误
zh_hant: 在作業 {0} 中，超過一個以上的錯誤利用詳細類型 {1} 加以宣告

# SFxFaultContractDuplicateElement
source: In operation {0}, more than one fault is declared with element name {1} in namespace {2}
cs: V operaci {0} je deklarováno více chyb s názvem elementu {1} v oboru názvů {2}.
de: Im Vorgang {0} sind mehrere Fehler mit dem Elementnamen {1} im Namespace {2} deklariert.
es: En la operación {0}, se declara más de un error con el nombre de elemento {1} en el espacio de nombres {2}
fr: Dans l'opération {0}, plusieurs erreurs sont déclarées pour le nom d'élément {1} dans l'espace de noms {2}
it: Nell'operazione {0} è stato dichiarato più di un errore con nome di elemento {1} nello spazio dei nomi {2}
ja: 操作 {0} において、名前空間が {2} で要素名が {1} の複数のフォールトが宣言されています。
ko: {0} 작업에 {2} 네임스페이스의 {1} 요소 이름으로 선언된 오류가 두 개 이상 있습니다.
pl: W operacji {0} zadeklarowano więcej niż jeden błąd o nazwie elementu {1} w przestrzeni nazw {2}.
pt_br: Na operação {0}, mais de uma falha é declarada com o nome de elemento {1} no namespace {2}
tr: {0} işleminde {2} ad alanı içinde {1} öğe adıyla birden çok hata bildirildi
zh_hans: 在操作 {0} 中，在命名空间 {2} 中声明了多个元素名称为 {1} 的错误
zh_hant: 在作業 {0} 中，超過一個以上的錯誤利用命名空間 {2} 中的元素名稱 {1} 加以宣告

# SFxFaultExceptionToString3
source: {0}: {1} (Fault Detail is equal to {2}).
cs: {0}: {1} (Detail chyby se rovná {2}).
de: {0}: {1} (Fehlerdetail ist gleich {2}).
es: {0}: {1} (El detalle del error es igual a {2}).
fr: {0} : {1} (le détail de l'erreur est égal à {2}).
it: {0}: {1} (Dettaglio errore è uguale a {2}).
ja: {0}: {1} (フォールトの詳細は {2} と同等です)。
ko: {0}: {1}(Fault Detail이 {2}과(와) 같음).
pl: {0}: {1} (Szczegół błędu: {2}).
pt_br: {0}: {1} (O Detalhe da Falha é igual a {2}).
tr: {0}: {1} (Hata Ayrıntısı = {2}).
zh_hans: {0}: {1} (错误详细信息为 {2})。
zh_hant: {0}: {1} (錯誤詳細資料等於 {2})。

# SFxFaultReason
source: The creator of this fault did not specify a Reason.
cs: Tvůrce této chyby neurčil důvod.
de: Der Ersteller dieses Fehlers hat keinen Grund angegeben.
es: El creador de este error no especificó una razón.
fr: Le créateur de cette erreur n'a pas spécifié de raison.
it: Il creatore di questo errore non ha specificato un elemento Reason.
ja: このフォールトの作成者が Reason を指定しませんでした。
ko: 이 오류의 작성자가 원인을 지정하지 않았습니다.
pl: Przyczyna błędu nie została określona przez obiekt tworzący.
pt_br: O criador desta falha não especificou um Motivo.
tr: Bu hata oluşturucusu bir Reason öğesi belirtmedi.
zh_hans: 此错误的创建者未指定“原因”。
zh_hant: 此錯誤的建立者未指定 Reason。

# SFxFaultTypeAnonymous
source: In operation {0}, the schema type corresponding to the fault detail type {1} is anonymous. Please set Fault name explicitly to export anonymous types.
cs: V operaci {0} je typ schématu odpovídající typu detailu chyby {1} anonymní. Nastavte název chyby explicitně na export anonymních typů.
de: Im Vorgang {0} ist der Schematyp, der dem Fehlerdetailtyp {1} entspricht, anonym. Legen Sie Fault-Name explizit zum Exportieren anonymer Typen fest.
es: En la operación {0}, el tipo de esquema correspondiente al tipo de detalle del error {1} es anónimo. Establezca el nombre del error explícitamente para exportar tipos anónimos.
fr: Dans l'opération {0}, le type de schéma correspondant au titre de détail d'erreur {1} est anonyme. Définissez explicitement le nom de l'erreur pour exporter les types anonymes.
it: Nell'operazione {0} il tipo dello schema corrispondente al dettaglio dell'errore di tipo {1} è anonimo. Impostare il nome dell'elemento Fault in modo esplicito per esportare i tipi anonimi.
ja: 操作 {0} において、フォールト詳細の種類 {1} に対応するスキーマの型が匿名です。匿名型をエクスポートするにはフォールト名を明示的に設定してください。
ko: {0} 작업에서 오류 세부 형식 {1}에 해당하는 스키마 형식이 익명입니다. 무명 형식을 내보내려면 오류 이름을 명시적으로 설정하세요.
pl: W operacji {0} typ schematu odpowiadający typowi szczegółu błędu {1} jest anonimowy. Aby wyeksportować typy anonimowe, określ jawnie nazwę błędu.
pt_br: Na operação {0}, o tipo de esquema correspondente ao tipo de detalhe de falha {1} é anônimo. Defina o nome da Falha explicitamente para exportar tipos anônimos.
tr: {0} işleminde, {1} hata ayrıntı türüne karşılık gelen şema türü anonim. Fault adını anonim türleri açıkça dışarı aktaracak biçimde ayarlayın.
zh_hans: 在操作 {0} 中，对应于错误详细信息类型 {1} 的架构类型匿名。请显式设置“错误”名称以导出匿名类型。
zh_hant: 在作業 {0} 中，對應至錯誤詳細類型 {1} 的結構描述類型為匿名。請明確地將 Fault 名稱設定為匯出匿名類型。

# SFxHeaderNameMismatchInMessageContract
source: Header name mismatch in member {1} of type {0}. The header name found in the description is {2}. The element name deduced by the formatter is {3}. This mismatch can happen if the ElementName specified in XmlElementAttribute or XmlArrayAttribute does not match the name specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the member name.
cs: Došlo k neshodě názvů záhlaví v členu {1} typu {0}. Název záhlaví nalezený v popisu je {2}. Název elementu odvozený formátovacím modulem je {3}. K této neshodě může dojít, pokud třída ElementName určená ve třídě XmlElementAttribute nebo XmlArrayAttribute neodpovídá názvu určenému v třídě MessageHeaderAttribute nebo MessageHeaderArrayAttribute nebo názvu členu.
de: Headernamenskonflikt im Member {1} vom Typ {0}. Der in der Beschreibung gefundene Headername ist {2}. Der vom Formatierer hergeleitete Elementname ist {3}. Dieser Konflikt kann auftreten, wenn der im XmlElementAttribute oder XmlArrayAttribute angegebene ElementName nicht dem im MessageHeaderAttribute oder MessageHeaderArrayAttribute angegebenen Namen oder dem Membernamen entspricht.
es: El nombre del encabezado no coincide en el miembro {1} del tipo {0}. El nombre del encabezado que se encontró en la descripción es {2}. El nombre del elemento que dedujo el formateador es {3}. Esta falta de coincidencia puede suceder si el elemento ElementName especificado en XmlElementAttribute o XmlArrayAttribute no coincide con el nombre especificado en MessageHeaderAttribute o MessageHeaderArrayAttribute, o con el nombre del miembro.
fr: Différence de nom d'en-tête dans le membre {1} du type {0}. Le nom de l'en-tête trouvé dans la description est {2}. Le nom de l'élément déduit par le formateur est {3}. Cette différence peut se produire si le nom ElementName spécifié dans XmlElementAttribute ou XmlArrayAttribute ne correspond pas au nom spécifié dans MessageHeaderAttribute ou MessageHeaderArrayAttribute ou au nom du membre.
it: Nomi di intestazione non corrispondenti nel membro {1} di tipo {0}. Il nome di intestazione trovato nella descrizione è {2}. Il nome di elemento dedotto dal formattatore è {3}. Questa situazione può verificarsi se l'elemento ElementName specificato in XmlElementAttribute o XmlArrayAttribute non corrisponde al nome specificato in MessageHeaderAttribute o in MessageHeaderArrayAttribute o al nome del membro.
ja: 型 {0} のメンバー {1} においてヘッダー名が一致しません。説明内に見つかったヘッダー名は {2} です。フォーマッタによって推測された要素名は {3} です。この不一致は、XmlElementAttribute または XmlArrayAttribute で指定された ElementName が MessageHeaderAttribute や MessageHeaderArrayAttribute で指定された名前、またはメンバー名と一致しない場合に起こる可能性があります。
ko: {0} 형식의 {1} 멤버에서 헤더 이름이 일치하지 않습니다. 설명에 있는 헤더 이름은 {2}입니다. 포맷터에 의해 추론된 요소 이름은 {3}입니다. 이러한 불일치는 XmlElementAttribute 또는 XmlArrayAttribute에 지정된 ElementName이 MessageHeaderAttribute 또는 MessageHeaderArrayAttribute에 지정된 이름이나 멤버 이름과 일치하지 않는 경우에 발생합니다.
pl: Niezgodność nazwy nagłówka w składowej {1} typu {0}. Nazwa nagłówka odnaleziona w opisie to {2}. Nazwa elementu ustalona przez program formatujący to {3}. Taka niezgodność może nastąpić, jeśli nazwa elementu ElementName określona w parametrze XmlElementAttribute lub parametrze XmlArrayAttribute nie odpowiada nazwie określonej w parametrze MessageHeaderAttribute, MessageHeaderArrayAttribute lub nazwie składowej.
pt_br: Nome de cabeçalho incompatível no membro {1} do tipo {0}. O nome de cabeçalho encontrado na descrição é {2}. O nome do elemento deduzido pelo formatador é {3}. Essa incompatibilidade pode acontecer se o ElementName especificado em XmlElementAttribute ou em XmlArrayAttribute não corresponder ao nome especificado em MessageHeaderAttribute ou em MessageHeaderArrayAttribute ou ao nome do membro.
tr: {0} türünün {1} üyesinde üst bilgi adı uyumsuzluğu var. Açıklamada bulunan üst bilgi adı: {2}. Biçimlendirici tarafından atanan öğe adı: {3}. XmlElementAttribute içinde belirtilen ElementName ya da XmlArrayAttribute, MessageHeaderAttribute ya da MessageHeaderArrayAttribute içinde belirtilen adla veya üye adıyla eşleşmediğinde bu uyumsuzluk oluşabilir.
zh_hans: 类型 {0} 的成员 {1} 中标头名称不匹配。描述中的标头名称是 {2}。格式化程序推导出的元素名称是 {3}。如果在 XmlElementAttribute 或 XmlArrayAttribute 中指定的 ElementName 与在 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 或成员名称中指定的名称不匹配，就会出现这种情况。
zh_hant: 類型 {0} 的成員 {1} 中之標頭名稱不符。描述中的標頭名稱為 {2}，格式器推算出的元素名稱為 {3}。若 XmlElementAttribute 或 XmlArrayAttribute 中指定的 ElementName，不符合 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 中指定的名稱或成員名稱，便會發生上述不符的情形。

# SFxHeaderNameMismatchInOperation
source: Header name mismatch in operation {0} from contract {1}:{2}. The header name found in the description is {3}. The element name deduced by the formatter is {4}. This mismatch can happen if the ElementName specified in XmlElementAttribute or XmlArrayAttribute does not match the name specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the member name.
cs: Došlo k neshodě názvů záhlaví v operaci {0} z kontraktu {1}:{2}. Název záhlaví nalezený v popisu je {3}. Název elementu odvozený formátovacím modulem je {4}. K této neshodě může dojít, pokud třída ElementName určená ve třídě XmlElementAttribute nebo XmlArrayAttribute neodpovídá názvu určenému v třídě MessageHeaderAttribute nebo MessageHeaderArrayAttribute nebo názvu členu.
de: Headernamenskonflikt im Vorgang {0} des Vertrags {1}:{2}. Der in der Beschreibung gefundene Headername ist {3}. Der vom Formatierer hergeleitete Elementname ist {4}. Dieser Konflikt kann auftreten, wenn der im XmlElementAttribute oder XmlArrayAttribute angegebene ElementName nicht dem im MessageHeaderAttribute oder MessageHeaderArrayAttribute angegebenen Namen oder dem Membernamen entspricht.
es: El nombre del encabezado no coincide en la operación {0} del contrato {1}:{2}. El nombre del encabezado que se encontró en la descripción es {3}. El nombre del elemento que dedujo el formateador es {4}. Esta falta de coincidencia puede suceder si el elemento ElementName especificado en XmlElementAttribute o XmlArrayAttribute no coincide con el nombre especificado en MessageHeaderAttribute o MessageHeaderArrayAttribute, o con el nombre del miembro.
fr: Différence de nom d'en-tête dans l'opération {0} du contrat {1}:{2}. Le nom de l'en-tête trouvé dans la description est {3}. Le nom de l'élément déduit par le formateur est {4}. Cette différence peut se produire si le nom ElementName spécifié dans XmlElementAttribute ou XmlArrayAttribute ne correspond pas au nom spécifié dans MessageHeaderAttribute ou MessageHeaderArrayAttribute ou au nom du membre.
it: Nomi di intestazione non corrispondenti nell'operazione {0} del contratto {1}:{2}. Il nome di intestazione trovato nella descrizione è {3}. Il nome di elemento dedotto dal formattatore è {4}. Questa situazione può verificarsi se l'elemento ElementName specificato in XmlElementAttribute o XmlArrayAttribute non corrisponde al nome specificato in MessageHeaderAttribute o in MessageHeaderArrayAttribute o al nome del membro.
ja: コントラクト {1}:{2} の操作 {0} においてヘッダー名が一致しません。説明内に見つかったヘッダー名は {3} です。フォーマッタによって推測された要素名は {4} です。この不一致は、XmlElementAttribute や XmlArrayAttribute で指定された ElementName が MessageHeaderAttribute や MessageHeaderArrayAttribute で指定された名前、またはメンバー名と一致しない場合に起こる可能性があります。
ko: {1}:{2} 계약의 {0} 작업에서 헤더 이름이 일치하지 않습니다. 설명에 있는 헤더 이름은 {3}입니다. 포맷터에 의해 추론된 요소 이름은 {4}입니다. 이러한 불일치는 XmlElementAttribute 또는 XmlArrayAttribute에 지정된 ElementName이 MessageHeaderAttribute 또는 MessageHeaderArrayAttribute에 지정된 이름이나 멤버 이름과 일치하지 않는 경우에 발생합니다.
pl: Niezgodność nazwy nagłówka w operacji {0} z kontraktu {1}:{2}. Nazwa nagłówka odnaleziona w opisie to {3}. Nazwa elementu ustalona przez program formatujący to {4}. Taka niezgodność może nastąpić, jeśli nazwa elementu ElementName określona w parametrze XmlElementAttribute lub XmlArrayAttribute nie odpowiada nazwie określonej w parametrze MessageHeaderAttribute, MessageHeaderArrayAttribute lub nazwie składowej.
pt_br: Nome de cabeçalho incompatível na operação {0} do contrato {1}:{2}. O nome de cabeçalho encontrado na descrição é {3}. O nome do elemento deduzido pelo formatador é {4}. Essa incompatibilidade pode acontecer se o ElementName especificado em XmlElementAttribute ou em XmlArrayAttribute não corresponder ao nome especificado em MessageHeaderAttribute ou MessageHeaderArrayAttribute ou ao nome do membro.
tr: {1}:{2} anlaşmasındaki {0} işleminde üst bilgi adı uyumsuzluğu var. Açıklamada bulunan üst bilgi adı: {3}. Biçimlendirici tarafından atanan öğe adı: {4}. XmlElementAttribute içinde belirtilen ElementName ya da XmlArrayAttribute, MessageHeaderAttribute ya da MessageHeaderArrayAttribute içinde belirtilen adla veya üye adıyla eşleşmediğinde bu uyumsuzluk oluşabilir.
zh_hans: 来自协定 {1} 中操作 {0} 的标头名称不匹配: {2}。描述中的标头名称是 {3}。格式化程序推导出的元素名称是 {4}。如果在 XmlElementAttribute 或 XmlArrayAttribute 中指定的 ElementName 与在 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 或成员名称中指定的名称不匹配，就会出现这种情况。
zh_hant: 合約 {1}:{2} 作業 {0} 的標頭名稱不符。描述中的標頭名稱為 {3}，格式器推算出的元素名稱為 {4}。若 XmlElementAttribute 或 XmlArrayAttribute 中指定的 ElementName，不符合 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 中指定的名稱或成員名稱，便會發生上述不符的情形。
