Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# CSResponseWithOffer
source: The remote endpoint replied to a request for a one way session with an offer for a two way session. This is a WS-ReliableMessaging protocol violation. The channel could not be opened.
cs: Vzdálený koncový bod odpověděl na požadavek na jednosměrnou relaci nabídkou dvousměrné relace. To je narušení protokolu WS-ReliableMessaging. Kanál nelze otevřít.
de: Der Remoteendpunkt hat auf eine Anforderung nach einer unidirektionalen Sitzung mit einem Angebot für eine bidirektionale Sitzung geantwortet. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto respondió a una solicitud de una sesión unidireccional con una oferta de una sesión bidireccional. Esto constituye una infracción del protocolo WS-ReliableMessaging. No se pudo abrir el canal.
fr: Le point de terminaison distant a répondu à une demande de session monodirectionnelle avec une offre de session bidirectionnelle. Il s'agit d'une violation du protocole WS-ReliableMessaging. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha risposto a una richiesta di sessione unidirezionale con un'offerta di sessione bidirezionale, causando una violazione del protocollo WS-ReliableMessaging. Impossibile aprire il canale.
ja: リモート エンドポイントは、一方向セッションの要求に対して双方向セッションの提案で応答しました。これは WS-ReliableMessaging のプロトコル違反です。チャネルを開くことができませんでした。
ko: 원격 끝점이 양방향 세션 제공을 사용하여 단방향 세션에 대한 요청에 응답했습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy na żądanie sesji jednokierunkowej odpowiedział propozycją utworzenia sesji dwukierunkowej. Jest to naruszenie zasad protokołu WS-ReliableMessaging. Nie można otworzyć kanału.
pt_br: O ponto de extremidade remoto respondeu a uma solicitação para uma sessão unidirecional, com uma oferta para uma sessão bidirecional. Trata-se de uma violação do protocolo WS-ReliableMessaging. Não foi possível abrir o canal.
tr: Uzak bitiş noktası, tek yönlü bir oturum isteğine çift yönlü bir oturum teklifiyle yanıt verdi. Bu bir WS-ReliableMessaging protokolü ihlalidir. Kanal açılamadı.
zh_hans: 远程终结点通过提供双向会话答复了单向会话请求。这违反了 WS-ReliableMessaging 协议。无法打开通道。
zh_hant: 遠端端點以雙向工作階段提議回覆單向工作階段的要求。這違反 WS-ReliableMessaging 通訊協定。無法開啟通道。

# CSResponseWithOfferReason
source: A return sequence was not offered by the create sequence request. The create sequence response cannot accept a return sequence.
cs: Požadavek na vytvoření sekvence nenabídl návratovou sekvenci. Odpověď vytvoření sekvence nemůže přijmout návratovou sekvenci.
de: Von der Sequenzerstellungsanforderung wurde keine Rückgabesequenz angeboten. Die Sequenzerstellungsantwort kann keine Rückgabesequenz akzeptieren.
es: La solicitud de creación de secuencia no ofreció una secuencia de devolución. La respuesta de creación de secuencia no puede aceptar una secuencia de devolución.
fr: La demande de séquence de création n'a pas offert une séquence de retour. La réponse de séquence de création ne peut pas accepter une séquence de retour.
it: Restituzione di sequenza non offerta dalla richiesta di creazione di sequenza. La risposta alla creazione di sequenza non può accettare la restituzione di una sequenza.
ja: リターン シーケンスがシーケンス作成要求によって提案されませんでした。シーケンス作成応答はリターン シーケンスを受け入れできません。
ko: 반환 시퀀스가 시퀀스 만들기 요청에 의해 제공되지 않았습니다. 시퀀스 만들기 응답이 반환 시퀀스를 수락할 수 없습니다.
pl: Żądanie utworzenia sekwencji nie zawierało propozycji sekwencji zwrotnej. Odpowiedź utworzenia sekwencji nie może zaakceptować sekwencji zwrotnej.
pt_br: A solicitação de sequência de criação não ofereceu uma sequência de retorno. A resposta da sequência de criação não pode aceitar uma sequência de retorno.
tr: Bir geri dönüş sırası, oluşturma sırası isteği tarafından teklif edilmedi. Oluşturma sırası yanıtı, bir geri dönüş sırasını kabul edemez.
zh_hans: 创建序列请求未提供返回序列。创建序列响应无法接受返回序列。
zh_hant: 建立順序要求未提供傳回順序。建立順序回應無法接受傳回順序。

# CSResponseWithoutOffer
source: The remote endpoint replied to a request for a two way session with an offer for a one way session. This is a WS-ReliableMessaging protocol violation. The channel could not be opened.
cs: Vzdálený koncový bod odpověděl na požadavek na obousměrnou relaci nabídkou jednosměrné relace. To je narušení protokolu WS-ReliableMessaging. Kanál nelze otevřít.
de: Der Remoteendpunkt hat auf eine Anforderung nach einer bidirektionalen Sitzung mit einem Angebot für eine unidirektionale Sitzung geantwortet. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto respondió a una solicitud de una sesión bidireccional con una oferta para una sesión unidireccional. Esto constituye una infracción del protocolo WS-ReliableMessaging. No se pudo abrir el canal.
fr: Le point de terminaison distant a répondu à une demande de session bidirectionnelle par une session monodirectionnelle. Il s'agit d'une violation du protocole WS-ReliableMessaging. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha risposto a una richiesta di sessione bidirezionale con un'offerta di sessione unidirezionale, causando una violazione del protocollo WS-ReliableMessaging. Impossibile aprire il canale.
ja: リモート エンドポイントは、双方向セッションの要求に対して一方向セッションの提案で応答しました。これは WS-ReliableMessaging のプロトコル違反です。チャネルを開くことができませんでした。
ko: 원격 끝점이 단방향 세션 제공을 사용하여 양방향 세션에 대한 요청에 응답했습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy na żądanie sesji dwukierunkowej odpowiedział propozycją utworzenia sesji jednokierunkowej. Jest to naruszenie zasad protokołu WS-ReliableMessaging. Nie można otworzyć kanału.
pt_br: O ponto de extremidade remoto respondeu a uma solicitação de sessão bidirecional com uma oferta de uma sessão unidirecional. Trata-se de uma violação do protocolo WS-ReliableMessaging. Não foi possível abrir o canal.
tr: Uzak bitiş noktası, çift yönlü bir oturum isteğine tek yönlü bir oturum teklifiyle yanıt verdi. Bu bir WS-ReliableMessaging protokolü ihlalidir. Kanal açılamadı.
zh_hans: 远程终结点通过提供单向会话答复了双向会话请求。这违反了 WS-ReliableMessaging 协议。无法打开通道。
zh_hant: 遠端端點以單向工作階段提議回覆雙向工作階段的要求。這違反 WS-ReliableMessaging 通訊協定。無法開啟通道。

# CSResponseWithoutOfferReason
source: A return sequence was offered by the create sequence request but the create sequence response did not accept this sequence.
cs: Požadavek na vytvoření sekvence nabídl návratovou sekvenci, ale odpověď vytvoření sekvence tuto sekvenci nepřijala.
de: Von der Sequenzerstellungsanforderung wurde eine Rückgabesequenz angeboten, aber die Sequenzerstellungsantwort hat diese Sequenz nicht akzeptiert.
es: La solicitud de creación de secuencia ofreció una secuencia de devolución pero la respuesta de creación de secuencia no aceptó la secuencia.
fr: Une séquence de retour a été offerte par la demande de séquence de création, mais la réponse de séquence de création n'a pas accepté cette séquence.
it: Restituzione di sequenza offerta dalla richiesta di creazione di sequenza, ma la risposta alla creazione di sequenza non ha accettato la sequenza.
ja: リターン シーケンスがシーケンス作成要求によって提案されましたが、シーケンス作成応答はこのシーケンスを受け入れませんでした。
ko: 반환 시퀀스가 시퀀스 만들기 요청에 의해 제공되었지만 시퀀스 만들기 응답이 이 시퀀스를 수락하지 않았습니다.
pl: Żądanie utworzenia sekwencji zawierało propozycję sekwencji zwrotnej, ale ta sekwencja nie została przyjęta przez odpowiedź utworzenia sekwencji.
pt_br: Uma sequência de retorno foi oferecida pela solicitação de sequência de criação, mas a resposta da sequência de criação não aceitou essa sequência.
tr: Bir geri dönüş sırası, oluşturma sırası isteği tarafından teklif edildi, ancak oluşturma sırası yanıtı bu sırayı kabul etmedi.
zh_hans: 创建序列请求提供了返回序列，但是创建序列响应未接受此序列。
zh_hant: 建立順序要求有提供傳回順序，但建立順序回應未接受此順序。

# CacheQuotaReached
source: The item cannot be added. The maximum cache size is ({0} items).
cs: Položku nelze přidat. Maximální velikost mezipaměti je ({0} položek).
de: Das Element kann nicht hinzugefügt werden. Die maximale Cachegröße ist ({0} Elemente).
es: No se puede agregar el elemento. El tamaño máximo de la caché es de ({0} items).
fr: Impossible d'ajouter l'élément. La taille maximale de la mémoire cache est de ({0} éléments).
it: Non è possibile aggiungere l'elemento. Dimensioni massime della cache: ({0} elementi).
ja: キャッシュが最大サイズ ({0} 項目) に達したため、項目を追加できません。
ko: 항목을 추가할 수 없습니다. 최대 캐시 크기는 ({0}개 항목)입니다.
pl: Nie można dodać elementu. Maksymalny rozmiar pamięci podręcznej wynosi (elementy: {0}).
pt_br: Não é possível adicionar o item. O tamanho máximo do cache é ({0} itens).
tr: Öğe eklenemiyor. Önbellek boyutu üst sınırı: ({0} öğe).
zh_hans: 无法添加该项目。最大缓存大小为({0} 个项目)。
zh_hant: 無法新增項目。快取大小上限為 ({0} 個項目)。

# CannotAddTwoItemsWithTheSameKeyToSynchronizedKeyedCollection0
source: Cannot add two items with the same key to SynchronizedKeyedCollection.
cs: K třídě SynchronizedKeyedCollection nelze přidat dvě položky se stejným klíčem.
de: Der SynchronizedKeyedCollection können keine zwei Elemente mit dem gleichen Schlüssel hinzugefügt werden.
es: No se pueden agregar dos elementos con la misma clave a SynchronizedKeyedCollection.
fr: Impossible d'ajouter deux éléments avec la même clé à SynchronizedKeyedCollection.
it: Non è possibile aggiungere due elementi con la stessa chiave a SynchronizedKeyedCollection.
ja: 同じキーを持つ項目を 2 つ SynchronizedKeyedCollection に追加することはできません。
ko: 동일한 키를 가진 두 개의 항목을 SynchronizedKeyedCollection에 추가할 수 없습니다.
pl: Nie można dodać dwóch elementów z tym samym kluczem do kolekcji SynchronizedKeyedCollection.
pt_br: Não é possível adicionar dois itens com a mesma chave em SynchronizedKeyedCollection.
tr: Aynı anahtarlı iki öğe SynchronizedKeyedCollection içine eklenemiyor.
zh_hans: 无法将具有相同密钥的两个项目添加到 SynchronizedKeyedCollection 中。
zh_hant: 無法將具有相同金鑰的兩個項目新增至 SynchronizedKeyedCollection。

# CannotDetectAddressingVersion
source: Cannot detect WS-Addressing version. EndpointReference does not start with an Element.
cs: Nelze zjistit verzi elementu WS-Addressing. Třída EndpointReference nezačíná elementem.
de: Die WS-Addressing-Version wird nicht erkannt. EndpointReference beginnt nicht mit einem Element.
es: No se puede detectar la versión de WS-Addressing. EndpointReference no comienza por Element.
fr: Impossible de détecter la version de WS-Addressing. EndpointReference ne commence pas par un élément.
it: Non è possibile rilevare la versione di WS-Addressing. EndpointReference non inizia con un elemento Element.
ja: WS-Addressing のバージョンを検出できません。EndpointReference が Element で開始していません。
ko: WS-Addressing 버전을 검색할 수 없습니다. EndpointReference가 Element로 시작하지 않습니다.
pl: Nie można wykryć wersji WS-Addressing. Wartość EndpointReference nie zaczyna się od wartości Element.
pt_br: Não é possível detectar a versão do WS-Addressing. EndpointReference não começa com um Elemento.
tr: WS-Addressing sürümü algılanamıyor. EndpointReference, bir Element ile başlamıyor.
zh_hans: 无法检测到 WS-Addressing 版本。EndpointReference 不是以 Element 开头。
zh_hant: 無法偵測 WS-Addressing 版本。EndpointReference 的開頭不是 Element。

# CannotDetermineSPNBasedOnAddress
source: Client cannot determine the Service Principal Name based on the identity in the target address '{0}' for the purpose of SspiNegotiation/Kerberos. The target address identity must be a UPN identity (like acmedomain\alice) or SPN identity (like host/bobs-machine).
cs: Klient nemůže určit hlavní název služby (SPN) založený na identitě v cílové adrese {0} pro účel třídy SspiNegotiation nebo protokolu Kerberos. Identitou cílové adresy musí být identita UPN (jako například acmedomain\alice) nebo identita SPN (například host/honzuv-pocitac).
de: Der Client kann den Dienstprinzipalnamen auf der Basis der Identität in der Zieladresse „{0}“ für die Verwendung durch „SspiNegotiation/Kerberos“ nicht bestimmen. Bei der Identität der Zieladresse muss es sich um eine UPN-Identität (wie „acmedomain\alice“) oder SPN-Identität (wie „host/bobs-computer“) handeln.
es: El cliente no puede determinar el Nombre de entidad de seguridad de servicio en función de la identidad de la dirección de destino '{0}' para los fines de SspiNegotiation/Kerberos. La identidad de la dirección de destino debe ser una identidad UPN (como acmedomain\alice) o una identidad SPN (como host/bobs-machine).
fr: Le client ne peut pas déterminer le nom de principal du service en fonction de l’identité de l’adresse cible '{0}' pour les besoins de SspiNegotiation/Kerberos. L’identité de l’adresse cible doit être une identité UPN (par exemple acmedomain\alice) ou une identité SPN (par exemple host/bobs-machine).
it: Il client non può determinare il nome dell'entità servizio sulla base dell'identità nell'indirizzo di destinazione '{0}' ai fini di SspiNegotiation/Kerberos. L'identità nell'indirizzo di destinazione deve essere un'identità UPN (ad esempio dominioutente\nomeutente) o un'identità SPN (ad esempio host/nomecomputer).
ja: SspiNegotiation/Kerberos に使用される対象アドレス '{0}' の ID からサービス プリンシパル名を特定できません。対象アドレス ID は、UPN ID (例: acmedomain\alice) または SPN ID (例: host/bobs-machine) である必要があります。
ko: 클라이언트가 SspiNegotiation/Kerberos 목적을 위해 대상 주소 '{0}'의 ID에 기초하여 서비스 사용자 이름을 확인할 수 없습니다. 대상 주소 ID는 UPN ID(예: acmedomain\alice) 또는 SPN ID(예: host/bobs-machine)여야 합니다.
pl: Klient nie może określić jednostki usługi na podstawie tożsamości z adresu docelowego „{0}” na potrzeby SspiNegotiation/Kerberos. Tożsamość adresu docelowego musi być tożsamością UPN (jak acmedomain\alice) lub tożsamością SPN (jak host/bobs-machine).
pt_br: O cliente não pode determinar o Nome Principal do Serviço com base na identidade no endereço de destino '{0}' para fins de SspiNegotiation/Kerberos. A identidade do endereço de destino deve ser uma identidade UPN (como acmedomain\alice) ou identidade SPN (como host/bobs-machine).
tr: İstemci, SspiNegotiation/Kerberos amacıyla, '{0}' hedef adresindeki varlığa dayanan Hizmet Asıl Adı (SPN) öğesini belirleyemiyor. Hedef adres varlığı, bir UPN varlığı (örneketkialanı\ayse gibi) ya da SPN varlığı (konak/ebrunun-makinesi gibi) olmalıdır.
zh_hans: 客户端无法为 SspiNegotiation/Kerberos 根据目标地址“{0}”中的标识确定服务主体名称。目标地址标识必须是 UPN 标识(例如 acmedomain\alice)或 SPN 标识(例如 host/bobs-machine)。
zh_hant: 用戶端無法根據目標位址 '{0}' 中的身分識別來判斷服務主體名稱，以用於 SspiNegotiation/Kerberos。目標位址身分識別必須是 UPN 身分識別 (如 acmedomain\alice) 或 SPN 身分識別 (如 host/bobs-machine)。

# CannotFindCert
source: Cannot find the X.509 certificate using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
cs: Pomocí následujících kritérií hledání nelze najít certifikát X.509: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3}
de: Das X.509-Zertifikat kann nicht mithilfe der folgenden Suchkriterien gefunden werden: StoreName "{0}", StoreLocation "{1}", FindType "{2}" und FindValue "{3}".
es: No se encuentra el certificado X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}".
fr: Impossible de localiser le certificat X.509 à l'aide des critères de recherche suivants : StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
it: Non è stato trovato alcun certificato X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
ja: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}' という検索条件で検索しましたが、X.509 証明書が見つかりませんでした。
ko: 다음 검색 조건을 사용하여 X.509 인증서를 찾을 수 없습니다. StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
pl: Nie można odnaleźć certyfikatu X.509 przy użyciu następujących kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}”.
pt_br: Não é possível encontrar o certificado X.509 usando os seguintes critérios de pesquisa: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
tr: Aşağıdaki arama ölçütleri kullanılarak X.509 sertifikası bulunamıyor: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
zh_hans: 无法使用以下搜索标准找到 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。
zh_hant: 使用下列搜尋條件找不到 X.509 憑證: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。

# CannotFindCertForTarget
source: Cannot find The X.509 certificate using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' for target '{4}'.
cs: Pomocí následujících kritérií hledání nelze najít certifikát X.509: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3} pro cíl {4}
de: Das X.509-Zertifikat kann nicht mithilfe der folgenden Suchkriterien gefunden werden: StoreName "{0}", StoreLocation "{1}", FindType "{2}" und FindValue "{3}" für Ziel "{4}".
es: No se encuentra el certificado X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}" para el destino "{4}".
fr: Impossible de localiser le certificat X.509 à l'aide des critères de recherche suivants : StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' pour la cible '{4}'.
it: Non è stato trovato alcun certificato X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' per la destinazione '{4}'.
ja: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}' という検索条件で '{4}' を検索しましたが、X.509 証明書が見つかりませんでした。
ko: 다음 검색 조건을 사용하여 X.509 인증서를 찾을 수 없습니다. StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'(대상 '{4}').
pl: Nie można odnaleźć certyfikatu X.509 przy użyciu następujących kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}” dla obiektu docelowego „{4}”.
pt_br: Não é possível encontrar o certificado X.509 usando os seguintes critérios de pesquisa: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' para o destino '{4}'.
tr: Aşağıdaki arama ölçütleri kullanılarak X.509 sertifikası bulunamıyor: '{4}' hedefi için StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
zh_hans: 无法使用以下搜索标准为目标“{4}”找到 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。
zh_hant: 使用下列搜尋條件找不到 X.509 憑證: 目標 '{4}' 的 StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。

# CannotFindMatchingCrypto
source: The token's crypto collection does not support algorithm '{0}'.
cs: Kryptografická kolekce tokenu nepodporuje algoritmus {0}.
de: Die Kryptografiesammlung des Tokens unterstützt den Algorithmus "{0}" nicht.
es: El algoritmo '{0}' no es compatible con la colección criptográfica del token.
fr: La collection cryptographique du jeton ne prend pas en charge l'algorithme '{0}'.
it: La raccolta di crittografia del token non supporta l'algoritmo '{0}'.
ja: トークンの暗号コレクションがアルゴリズム '{0}' をサポートしていません。
ko: 토큰의 암호화 컬렉션이 '{0}' 알고리즘을 지원하지 않습니다.
pl: Kolekcja kryptograficzna tokenu nie obsługuje algorytmu „{0}”.
pt_br: A coleção criptográfica do token não dá suporte ao algoritmo '{0}'.
tr: Belirtecin şifre koleksiyonu '{0}' algoritmasını desteklemiyor.
zh_hans: 令牌的加密集合不支持算法“{0}”。
zh_hant: 權杖的加密集合不支援演算法 '{0}'。

# CannotHaveTwoOperationsWithTheSameName3
source: Cannot have two operations in the same contract with the same name, methods {0} and {1} in type {2} violate this rule. You can change the name of one of the operations by changing the method name or by using the Name property of OperationContractAttribute.
cs: V jednom kontraktu nemohou být dvě operace se stejným názvem. Metody {0} a {1} v typu {2} toto pravidlo porušují. Můžete změnit název jedné z operací, a to buď změnou názvu metody, nebo pomocí vlastnosti Name atributu OperationContractAttribute.
de: In einem Vertrag können nicht zwei Vorgänge mit dem gleichen Namen vorhanden sein. Die Methoden {0} und {1} im Typ {2} verstoßen gegen diese Regel. Sie können den Namen eines der Vorgänge ändern, indem Sie den Methodennamen ändern oder die Name-Eigenschaft von OperationContractAttribute verwenden.
es: No puede haber dos operaciones en el mismo contrato con el mismo nombre; los métodos {0} y {1} del tipo {2} infringen esta regla. Puede cambiar el nombre de una de las operaciones modificando el nombre del método o mediante la propiedad Name de OperationContractAttribute.
fr: Impossible d'avoir deux opérations dans le même contrat qui portent le même nom, les méthodes {0} et {1} dans le type {2} violent cette règle. Vous pouvez changer le nom de l'une des opérations en changeant le nom de la méthode ou en utilisant la propriété Name de l'attribut OperationContractAttribute.
it: Nello stesso contratto non possono essere presenti due operazioni con lo stesso nome. I metodi {0} e {1} nel tipo {2} violano questa regola. È possibile cambiare il nome di una delle operazioni modificando il nome del metodo oppure usando la proprietà Name di OperationContractAttribute.
ja: 同じ名前の 2 つの操作を同一のコントラクトに含めることはできません。型 {2} のメソッド {0} および {1} はこのルールに違反しています。いずれかの操作の名前を変更するには、メソッド名を変更するか、OperationContractAttribute の Name プロパティを使用します。
ko: 동일한 계약에 이름이 같은 두 개의 작업을 가질 수 없습니다. {2} 형식의 {0} 및 {1} 메서드가 이 규칙을 위반합니다. 메서드 이름을 변경하거나 OperationContractAttribute의 Name 속성을 사용하여 작업 중 하나의 이름을 변경할 수 있습니다.
pl: Nie można wykonać w jednym kontekście dwóch operacji o tej samej nazwie. Metody {0} i {1} w typie {2} naruszają tę regułę. Możesz zmienić nazwę jednej z operacji, zmieniając nazwę metody lub używając właściwości Name obiektu OperationContractAttribute.
pt_br: Não é possível ter duas operações no mesmo contrato com o mesmo nome; os métodos {0} e {1} no tipo {2} violam essa regra. Você pode alterar o nome de uma das operações alterando o nome do método ou usando a propriedade Name de OperationContractAttribute.
tr: Aynı anlaşmada aynı ada sahip iki işlem olamaz, {2} türündeki {0} ve {1} metotları bu kuralı ihlal ediyor. Metot adını değiştirerek veya OperationContractAttribute'un Name özelliğini kullanarak işlemlerden birinin adını değiştirebilirsiniz.
zh_hans: 同一个协定中不能存在两个名称相同的操作，类型为 {2} 的方法 {0} 和 {1} 违反了此规则。可以通过更改方法名称或使用 OperationContractAttribute 的 Name 属性更改其中一个操作的名称。
zh_hant: 同一合約中的兩項作業不可使用相同的名稱，類型 {2} 的方法 {0} 與 {1} 違反此規則。您可透過變更方法名稱或使用 OperationContractAttribute 的 Name 屬性，變更其中一項作業的名稱。
