Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# CustomBindingRequiresTransport
source: Binding '{0}' lacks a TransportBindingElement. Every binding must have a binding element that derives from TransportBindingElement. This binding element must appear last in the BindingElementCollection.
cs: Ve vazbě {0} chybí třída TransportBindingElement. Každá vazba musí mít element vazby, který je odvozen od třídy TransportBindingElement. Tento element vazby se musí vyskytnout ve třídě BindingElementCollection jako poslední.
de: In der Bindung "{0}" fehlt ein TransportBindingElement. Jede Bindung muss ein Bindungselement besitzen, das aus dem TransportBindingElement abgeleitet wird. Dieses Bindungselement muss zuletzt in der BindingElementCollection erscheinen.
es: Falta TransportBindingElement en el enlace "{0}". Todos los enlaces deben tener un elemento de enlace derivado de TransportBindingElement. Este elemento de enlace debe aparecer en último lugar en la colección BindingElementCollection.
fr: Un élément TransportBindingElement est manquant dans la liaison '{0}'. Chaque liaison doit avoir un élément de liaison qui dérive de l'élément TransportBindingElement. Cet élément de liaison doit apparaître en dernier dans la collection BindingElementCollection.
it: Nel binding '{0}' manca un elemento TransportBindingElement. Ogni binding deve contenere un elemento di binding derivante da TransportBindingElement. Questo elemento di binding deve essere incluso per ultimo nell'elemento BindingElementCollection.
ja: バインド '{0}' に TransportBindingElement がありません。すべてのバインドには、TransportBindingElement から派生するバインド要素が必要です。このバインド要素は BindingElementCollection の最後になければなりません。
ko: '{0}' 바인딩에 TransportBindingElement가 없습니다. 모든 바인딩은 TransportBindingElement에서 파생되는 바인딩 요소가 있어야 합니다. 이 바인딩 요소는 BindingElementCollection에서 마지막에 표시되어야 합니다.
pl: W powiązaniu „{0}” brakuje elementu TransportBindingElement. Każde powiązanie musi zawierać element TransportBindingElement. Ten element powiązania musi pojawić się jako ostatni element w obiekcie BindingElementCollection.
pt_br: A associação '{0}' não tem TransportBindingElement. Todas as associações devem ter um elemento de associação derivado de TransportBindingElement. Esse elemento de associação deve aparecer por último em BindingElementCollection.
tr: Binding '{0}' içinde bir TransportBindingElement eksik. Her bağlamanın TransportBindingElement'ten türetilen bir bağlama öğesi bulunmalıdır. Bu bağlama öğesi, BindingElementCollection içinde en sonda görünmelidir.
zh_hans: 绑定“{0}”缺少 TransportBindingElement。每个绑定必须拥有一个派生自 TransportBindingElement 的绑定元素。此绑定元素必须显示在 BindingElementCollection 中的最后。
zh_hant: 繫結 '{0}' 遺漏 TransportBindingElement，但每個繫結都必須具有衍生自 TransportBindingElement 的繫結元素。此繫結元素必須位於 BindingElementCollection 的最後。

# CustomCryptoAlgorithmIsNotValidHashAlgorithm
source: The custom crypto algorithm '{0}' obtained using CryptoConfig is not a valid or supported hash algorithm.
cs: Vlastní šifrovací algoritmus {0} načtený pomocí objektu CryptoConfig není platný nebo se nejedná o podporovaný algoritmus hash.
de: Der benutzerdefinierte Kryptografiealgorithmus '{0}', der mit CryptoConfig abgerufen wurde, ist ein ungültiger oder nicht unterstützter Hashalgorithmus.
es: El algoritmo criptográfico personalizado '{0}' obtenido mediante CryptoConfig no es un algoritmo hash válido o compatible.
fr: L'algorithme de chiffrement personnalisé '{0}' obtenu à l'aide de CryptoConfig n'est pas un algorithme de hachage valide ou pris en charge.
it: L'algoritmo di crittografia personalizzato '{0}' ottenuto tramite CryptoConfig non è un algoritmo hash valido o supportato.
ja: CryptoConfig を使用して取得したカスタムの暗号アルゴリズム '{0}' が、有効でないか、サポートされているハッシュ アルゴリズムではありません。
ko: CryptoConfig를 사용하여 가져온 사용자 지정 암호화 알고리즘 '{0}'이(가) 올바르지 않거나 지원되는 해시 알고리즘이 아닙니다.
pl: Niestandardowy algorytm kryptograficzny „{0}” uzyskany przy użyciu obiektu CryptoConfig jest nieprawidłowym lub nieobsługiwanym algorytmem wyznaczania wartości skrótu.
pt_br: O algoritmo de criptografia personalizado '{0}' obtido com o uso de CryptoConfig não é um algoritmo de hash válido ou com suporte.
tr: CryptoConfig kullanılarak alınan '{0}' özel şifre algoritması geçerli veya desteklenen bir karma algoritması değil.
zh_hans: 使用 CryptoConfig 获得的自定义加密算法“{0}”不是有效的哈希算法，或者不是受支持的哈希算法。
zh_hant: 使用 CryptoConfig 取得的自訂密碼編譯演算法 '{0}' 不是有效或支援的雜湊演算法。

# CustomCryptoAlgorithmIsNotValidKeyedHashAlgorithm
source: The custom crypto algorithm '{0}'obtained using CryptoConfig is not a valid or supported keyed hash algorithm.
cs: Vlastní šifrovací algoritmus {0} načtený pomocí objektu CryptoConfig není platný nebo se nejedná o podporovaný algoritmus hash s klíčem.
de: Der mit CryptoConfig abgerufene benutzerdefinierte Kryptoalgorithmus "{0}" ist kein gültiger oder unterstützter verschlüsselter Hashalgorithmus.
es: El algoritmo criptográfico personalizado "{0}" obtenido mediante CryptoConfig no es un algoritmo hash con clave válido o compatible.
fr: L'algorithme de chiffrement personnalisé '{0}' obtenu à l'aide de CryptoConfig n'est pas un algorithme de code de hachage de clé valide ou pris en charge.
it: L'algoritmo di crittografia personalizzato '{0}' ottenuto tramite CryptoConfig non è un algoritmo hash con chiave valido o supportato.
ja: CryptoConfig を使用して取得したカスタムの暗号アルゴリズム '{0}' が、有効でないか、サポートされているキー付きハッシュ アルゴリズムではありません。
ko: CryptoConfig를 사용하여 가져온 사용자 지정 암호화 알고리즘 '{0}'이(가) 유효하지 않거나 지원되는 키 해시 알고리즘이 아닙니다.
pl: Niestandardowy algorytm kryptograficzny „{0}” uzyskany przy użyciu obiektu CryptoConfig jest nieprawidłowym lub nieobsługiwanym algorytmem wyznaczania wartości skrótu z kluczem.
pt_br: O algoritmo de criptografia personalizado '{0}' obtido com o uso de CryptoConfig não é um algoritmo de hash de chave válido ou com suporte.
tr: CryptoConfig kullanılarak alınan '{0}' özel şifre algoritması geçerli veya desteklenen bir anahtarlı algoritma değil.
zh_hans: 使用 CryptoConfig 获得的自定义加密算法“{0}”不是有效的键控哈希算法，也不是受支持的键控哈希算法。
zh_hant: 使用 CryptoConfig 取得的自訂密碼編譯演算法 '{0}'，不是有效或受支援的雜湊演算法。

# DelayedSecurityApplicationAlreadyCompleted
source: Delayed security application has already been completed.
cs: Zpožděná aplikace zabezpečení již byla dokončena.
de: Die verzögerte Sicherheitsanwendung wurde bereits abgeschlossen.
es: La solicitud de seguridad retrasada ya ha sido completada..
fr: L'application de la sécurité retardée a déjà été effectuée.
it: L'applicazione di sicurezza ritardata è già stata completata.
ja: 保留されたセキュリティ アプリケーションの処理は既に完了しています。
ko: 지연된 보안 응용 프로그램이 이미 완료되었습니다.
pl: Zakończono opóźnioną aplikację zabezpieczeń.
pt_br: O aplicativo de segurança atrasado já foi concluído.
tr: Gecikmeli güvenlik uygulaması zaten tamamlandı.
zh_hans: 延迟的安全应用程序已经完成。
zh_hant: 已完成延遲的安全性應用程式。

# DelegatingHandlerArrayFromFuncContainsNullItem
source: The '{0}' list created by the Func '{1}' is invalid because it contains one or more null items.
cs: Seznam {0} vytvořený funkcí Func {1} je neplatný, protože obsahuje jednu nebo více položek s hodnotou null.
de: Die von der Funktion "{1}" erstellte Liste "{0}" ist ungültig, da sie mindestens ein NULL-Element enthält.
es: La lista "{0}" creada por la función "{1}" no es válida porque contiene uno o varios elementos nulos.
fr: La liste '{0}' créée par la fonction '{1}' est non valide, car elle contient un ou plusieurs éléments de valeur null.
it: L'elenco '{0}' creato dalla funzione '{1}' non è valido perché contiene uno o più elementi Null.
ja: Func '{1}' で作成された '{0}' リストは、null 項目が 1 つ以上含まれているため無効です。
ko: '{1}' 함수로 만든 '{0}' 목록은 하나 이상의 null을 포함하기 때문에 잘못되었습니다.
pl: Utworzona przez funkcję „{1}” lista „{0}” jest nieprawidłowa, ponieważ zawiera co najmniej jeden element o wartości null.
pt_br: A lista '{0}' criada pela Func '{1}' é inválida porque contém um ou mais itens nulos.
tr: Bir veya daha fazla null öğesi içerdiği için '{1}' İşlevi tarafından oluşturulan '{0}' listesi geçersizdir.
zh_hans: 由 Func“{1}”创建的“{0}”列表无效，因为其中包含一个或多个 null 项。
zh_hant: 函式 '{1}' 所建立的 '{0}' 清單無效，因為它包含一或多個 Null 項目。

# DelegatingHandlerArrayHasNonNullInnerHandler
source: The '{0}' list is invalid because the property '{1}' of '{2}' is not null.
cs: Seznam {0} je neplatný, protože vlastnost {1} objektu {2} nemá hodnotu null.
de: Die Liste "{0}" ist ungültig, da die Eigenschaft "{1}" von "{2}" nicht NULL ist.
es: La lista "{0}" no es válida porque la propiedad "{1}" de "{2}" no es un valor nulo.
fr: La liste '{0}' est non valide, car la propriété '{1}' de '{2}' n'a pas une valeur null.
it: L'elenco '{0}' non è valido perché la proprietà '{1}' di '{2}' non è Null.
ja: '{0}' リストは、'{2}' のプロパティ '{1}' が null でないため無効です。
ko: '{2}'의 '{1}' 속성이 null이 아니기 때문에 '{0}' 목록이 잘못되었습니다.
pl: Lista „{0}” jest nieprawidłowa, ponieważ właściwość „{1}” obiektu „{2}” nie ma wartości null.
pt_br: A lista '{0}' é inválida porque a propriedade '{1}' de '{2}' não é nula.
tr: '{2}' öğesinin '{1}' özelliği null olmadığından '{0}' listesi geçersizdir.
zh_hans: “{0}”列表无效，因为“{2}”的属性“{1}”不为 null。
zh_hant: '{0}' 清單無效，因為 '{2}' 的屬性 '{1}' 並非 Null。

# DerivedKeyCannotDeriveFromSecret
source: Derived Key Token cannot derive key from the secret.
cs: Token odvozených klíčů nemůže odvodit klíč od utajených.
de: DerivedKey-Token kann keinen Schlüssel aus dem Geheimnis ableiten.
es: El token de clave derivada no puede derivar la clave del secreto.
fr: Un jeton de clé dérivée ne peut pas dériver une clé du secret.
it: Il token della chiave derivata non può derivare la chiave dal segreto.
ja: DerivedKeyToken は、秘密キーから派生できません。
ko: 파생 키 토큰이 비밀에서 키를 파생시킬 수 없습니다.
pl: Pochodny token klucza nie może wyprowadzać klucza z wpisu tajnego.
pt_br: O Token de Chave Derivada não pode derivar a chave do segredo.
tr: Derived Key Token özniteliği gizli öğeden alınamıyor.
zh_hans: 派生密钥令牌无法从机密中派生密钥。
zh_hant: 衍生金鑰權杖無法從祕密衍生金鑰。

# DerivedKeyInvalidGenerationSpecified
source: The received derived key token has a invalid generation value specified. Value: {0}. The value should be greater than or equal to zero.
cs: Přijatý token odvozeného klíče má zadanou neplatnou hodnotu generace. Hodnota: {0}. Hodnota musí být větší nebo rovna nule.
de: Für das empfangene abgeleitete Schlüsseltoken wurde ein ungültiger Wert angegeben. Wert: {0}. Der Wert sollte größer oder gleich Null sein.
es: El token de clave derivada que se recibió tiene especificado un valor de generación no válido. Valor: {0}. El valor debe ser mayor o igual que cero.
fr: Le jeton de clé dérivée reçu est spécifié avec une valeur de génération non valide. Valeur : {0}. La valeur doit être supérieure ou égale à zéro.
it: Per il token di chiave derivata ricevuto è specificato un valore di generation non valido con valore {0}. Il valore deve essere maggiore o uguale a zero.
ja: 受信した派生キー トークンに無効な生成値が指定されています。値: {0}。この値は 0 以上である必要があります。
ko: 수신한 파생 키 토큰에 잘못된 생성 값이 지정되었습니다. 값이 {0}입니다. 값은 0보다 크거나 같아야 합니다.
pl: Otrzymany pochodny token klucza ma określoną niepoprawną wartość generowania. Wartość: {0}. Wartość powinna być większa lub równa zero.
pt_br: O token de chave derivada recebido tem um valor de geração inválido especificado. Valor: {0}. O valor deve ser maior ou igual a zero.
tr: Alınan türetilmiş anahtar belirtecinde belirtilen geçersiz bir oluşturma değeri var. Değer: {0}. Değer, sıfırdan büyük ya da ona eşit olmalıdır.
zh_hans: 接收到的派生密钥令牌指定的生成值无效。值: {0}。该值应大于或等于零。
zh_hant: 收到之衍生金鑰權杖的指定層代值無效。值: {0}。值應大於或等於零。

# DerivedKeyInvalidOffsetSpecified
source: The received derived key token has a invalid offset value specified. Value: {0}. The value should be greater than or equal to zero.
cs: Přijatý token odvozeného klíče má zadanou neplatnou hodnotu posunu. Hodnota: {0}. Hodnota musí být větší nebo rovna nule.
de: Für das empfangene abgeleitete Schlüsseltoken wurde ein ungültiger Offsetwert angegeben. Wert: {0}. Der Wert sollte größer oder gleich Null sein.
es: El token de clave derivada que se recibió tiene especificado un valor de desplazamiento no válido. Valor: {0}. El valor debe ser mayor o igual que cero.
fr: Le jeton de clé dérivée reçu est spécifié avec une valeur de décalage non valide. Valeur : {0}. La valeur doit être supérieure ou égale à zéro.
it: Per il token di chiave derivata ricevuto è specificato un valore di offset non valido. Valore: {0}. Il valore dovrebbe essere maggiore o uguale a zero.
ja: 受信した派生キー トークンに無効なオフセット値が指定されています。値: {0}。この値は 0 以上である必要があります。
ko: 수신한 파생 키 토큰에 잘못된 오프셋 값이 지정되었습니다. 값이 {0}입니다. 값은 0보다 크거나 같아야 합니다.
pl: Otrzymany pochodny token klucza ma określoną niepoprawną wartość przesunięcia. Wartość: {0}. Wartość powinna być większa lub równa zero.
pt_br: O token de chave derivada recebido tem um valor de deslocamento especificado inválido. Valor: {0}. O valor deve ser maior ou igual a zero.
tr: Alınan türetilmiş anahtar belirtecinde belirtilen geçersiz bir uzaklık değeri var. Değer: {0}. Değer, sıfırdan büyük ya da ona eşit olmalıdır.
zh_hans: 接收到的派生密钥令牌指定的偏移值无效。值: {0}。该值应大于或等于零。
zh_hant: 收到之衍生金鑰權杖的指定偏差值無效。值: {0}。值應大於或等於零。

# DerivedKeyLengthSpecifiedInImplicitDerivedKeyClauseTooLong
source: The Implicit derived key clause '{0}' specifies a derivation key length ({1}) which exceeds the allowed maximum length ({2}).
cs: Implicitní klauzule odvozeného klíče {0} určuje délku klíče odvození ({1}), která přesahuje povolenou maximální délku ({2}).
de: Für die implizit abgeleitete Schlüsselklausel "{0}" ist eine Ableitungsschlüssellänge ({1}) angegeben, die die zulässige Maximallänge überschreitet ({2}).
es: La cláusula de clave derivada implícita '{0}' especifica una longitud de clave de derivación ({1}) que supera la longitud máxima permitida ({2}).
fr: La clause de clé dérivée implicite '{0}' spécifie une longueur de clé de dérivation ({1}) qui dépasse la longueur maximale autorisée ({2}).
it: La clausola della chiave derivata Implicit '{0}' specifica una lunghezza della chiave di derivazione ({1}) che supera la lunghezza massima consentita ({2}).
ja: 暗黙的な派生キー句 '{0}' が指定している派生キーの長さ ({1}) が、許可されている最大長 ({2}) を超えています。
ko: 암시적 파생 키 절 '{0}'에서 허용되는 최대 길이({2})를 초과하는 파생 키 길이({1})를 지정합니다.
pl: Niejawna klauzula „{0}” klucza pochodnego określa długość ({1}) wyprowadzenia klucza, która przekracza dopuszczalną maksymalną długość ({2}).
pt_br: A cláusula implícita '{0}' de chave derivada especifica um comprimento de chave de derivação ({1}) que excede o comprimento máximo permitido ({2}).
tr: Implicit türetilmiş anahtarı tümceciği '{0}', izin verilen en büyük uzunluk değerini ({2}) aşan bir türetme anahtarı uzunluğu ({1}) belirtiyor.
zh_hans: 隐式派生密钥子句“{0}”指定的派生密钥长度({1})超过了所允许的最大长度({2})。
zh_hant: 隱含衍生金鑰子句 '{0}' 的指定衍生金鑰長度 ({1}) 超出允許的長度上限 ({2})。

# DerivedKeyLengthTooLong
source: DerivedKey length ({0}) exceeds the allowed settings ({1}).
cs: Délka třídy DerivedKey ({0}) přesahuje povolené nastavení ({1}).
de: Die DerivedKey-Länge ({0}) überschreitet die zulässigen Einstellungen ({1}).
es: La longitud de DerivedKey ({0}) supera la configuración permitida ({1}).
fr: La longueur de la clé dérivée ({0}) dépasse les valeurs autorisées ({1}).
it: La lunghezza DerivedKey ({0}) supera le impostazioni consentite ({1}).
ja: 派生キーの長さ ({0}) が、設定されている許容値 ({1}) を超えています。
ko: DerivedKey 길이({0})가 허용되는 설정({1})을 초과합니다.
pl: Długość ({0}) obiektu DerivedKey przekracza dozwolone ustawienia ({1}).
pt_br: O comprimento de DerivedKey ({0}) ultrapassa as configurações permitidas ({1}).
tr: DerivedKey uzunluğu ({0}), izin verilen ayar değerlerini ({1}) aşıyor.
zh_hans: DerivedKey 长度({0})超过了所允许的设置({1})。
zh_hant: DerivedKey 長度 ({0}) 超出允許的設定 ({1})。

# DerivedKeyLimitExceeded
source: The number of derived keys in the message has exceeded the maximum allowed number '{0}'.
cs: Počet odvozených klíčů ve zprávě překročil maximální povolený počet {0}.
de: Die Anzahl von abgeleiteten Schlüsseln in der Nachricht hat die maximal zulässige Anzahl "{0}" überschritten.
es: El número de claves derivadas en el mensaje superó el número máximo permitido '{0}'.
fr: Le nombre de clés dérivées du message a dépassé le nombre maximal autorisé '{0}'.
it: Il numero di chiavi derivate nel messaggio ha superato il numero massimo consentito '{0}'.
ja: メッセージに含まれる派生キーの数が、許可された最大数である '{0}' を超えました。
ko: 메시지의 파생 키 수가 허용되는 최대 개수 '{0}'을(를) 초과했습니다.
pl: Liczba kluczy pochodnych w komunikacie przekracza maksymalną dozwoloną liczbę „{0}”.
pt_br: O número de chaves derivadas na mensagem ultrapassou o número máximo permitido '{0}'.
tr: İletideki türetilmiş anahtar sayısı, izin verilen en büyük sayıyı '{0}' aştı.
zh_hans: 该消息中派生密钥的数目已经超过所允许的最大数目“{0}”。
zh_hant: 訊息中的衍生金鑰數目超出允許的數目上限 '{0}'。

# DerivedKeyNotInitialized
source: The derived key has not been computed for the security token.
cs: Odvozený klíč nebyl vypočítán pro token zabezpečení.
de: Der abgeleitete Schlüssel wurde für das Sicherheitstoken nicht berechnet.
es: No se calculó la clave derivada para el token de seguridad.
fr: La clé dérivée n'a pas été calculée pour le jeton de sécurité.
it: La chiave derivata non è stata calcolata per il token di sicurezza.
ja: 派生キーがセキュリティ トークンについて計算されていません。
ko: 보안 토큰에 대해 파생 키가 계산되지 않았습니다.
pl: Dla tokenu zabezpieczającego nie obliczono klucza pochodnego.
pt_br: A chave derivada não foi calculada para o token de segurança.
tr: Türetilmiş anahtar değeri, güvenlik belirteci için hesaplanmadı.
zh_hans: 未为安全令牌计算派生密钥。
zh_hant: 尚未計算安全性權杖的衍生金鑰。

# DerivedKeyPosAndGenBothSpecified
source: Both offset and generation cannot be specified for Derived Key Token.
cs: Pro token odvozených klíčů nelze určit ani posun, ani generaci.
de: Weder "Offset" noch "Generation" kann für Derived Key-Token angegeben werden.
es: No se pueden especificar el desplazamiento y la generación para el token de clave derivada.
fr: Ni le décalage ni la génération ne peuvent être spécifiés pour le jeton de clé dérivée.
it: Non è possibile specificare sia l'offset che la generazione per il token della chiave derivata.
ja: DerivedKeyToken に、offset と generation の両方を指定することはできません。
ko: 오프셋과 생성을 둘 다 파생 키 토큰에 지정할 수 없습니다.
pl: Wartości przesunięcia i generowania nie mogą być jednocześnie określone dla pochodnego tokenu klucza.
pt_br: Não é possível especificar o deslocamento e a geração para o Token de chave derivada.
tr: Uzaklık ve türetmenin her ikisi de Derived Key Token için belirtilemiyor.
zh_hans: 无法为派生密钥令牌指定偏移量和生成全部两者。
zh_hant: 無法指定衍生金鑰權杖的偏差和層代。

# DerivedKeyPosAndGenNotSpecified
source: Either offset or generation must be specified for Derived Key Token.
cs: Pro token odvozených klíčů musí být určen buď posun, nebo generace.
de: Entweder "Offset" oder "Generation" muss für Derived Key-Token angegeben werden.
es: Debe especificarse el desplazamiento o la generación para el token de clave derivada.
fr: Le décalage ou la génération doit être spécifié pour le jeton de clé dérivée.
it: Per il token della chiave derivata è necessario specificare l'offset o la generazione.
ja: DerivedKeyToken には、offset または generation のいずれかを指定する必要があります。
ko: 오프셋 또는 생성 중 하나를 파생 키 토큰에 지정해야 합니다.
pl: Dla pochodnego tokenu klucza musi być określona albo wartość przesunięcia, albo wartość generowania.
pt_br: É necessário especificar o deslocamento ou a geração para o Token de Chave Derivada.
tr: Derived Key Token için uzaklık ya da türetme değerlerinden biri belirtilmelidir.
zh_hans: 必须为派生密钥令牌指定偏移量和生成。
zh_hant: 必須指定衍生金鑰權杖的偏差或層代。

# DerivedKeyTokenGenerationAndLengthTooHigh
source: The derived key's generation ('{0}') and length ('{1}' bytes) result in a key derivation offset that is greater than the maximum offset ('{2}' bytes) allowed.
cs: Generace odvozeného klíče ({0}) a jeho délka (počet bajtů: {1}) má za následek posun odvození klíče, který je větší než maximální povolený posun (počet bajtů: {2}).
de: Die Generierung ("{0}") und Länge ("{1}" Bytes) des abgeleiteten Schlüssels führen zu einem Schlüsselableitungsoffset, der größer als der maximal zulässige Offset ("{2}" Bytes) ist.
es: La generación ("{0}") y la longitud ("{1}" bytes) de la clave derivada producen un desplazamiento de derivación de claves mayor que el desplazamiento máximo ("{2}" bytes) permitido.
fr: La génération ('{0}') et la longueur ('{1}' octets) de la clé dérivée aboutissent à un décalage de dérivation de clé supérieur au décalage maximal autorisé ('{2}' octets).
it: Con i valori di generation ('{0}') e length ('{1}' byte) della chiave derivata si ottiene un valore di offset della chiave di derivazione superiore al valore massimo consentito ('{2}' byte).
ja: 派生キーの世代 ('{0}') および長さ ('{1}' バイト) に問題があるため、キー派生オフセットが、許可されている最大数 ('{2}' バイト) を超えています。
ko: 파생 키의 생성('{0}') 및 길이('{1}'바이트)로 인해 허용되는 최대 오프셋('{2}'바이트)보다 큰 키 파생 오프셋이 발생합니다.
pl: Generowanie („{0}”) i długość („{1}” B) klucza pochodnego dają w wyniku przesunięcie wyprowadzenia klucza większe niż maksymalne dozwolone przesunięcie („{2}” B).
pt_br: A geração ('{0}') e o comprimento ('{1}' bytes) da chave derivada resultam em um deslocamento da derivação de chave maior que o deslocamento máximo permitido ('{2}' bytes).
tr: Türetilmiş anahtarın elde edilmesi ('{0}') ve uzunluğu ('{1}' bayt), izin verilen en büyük uzaklık değerini ('{2}' bayt) aşan bir anahtar türetme uzaklığıyla sonuçlanır.
zh_hans: 派生密钥的生成(“{0}”)和长度(“{1}”个字节)产生的密钥派生偏移大于所允许的最大偏移(“{2}”个字节)。
zh_hant: 衍生金鑰的層代 ('{0}') 與長度 ('{1}' 個位元組) 所導致的金鑰衍生偏差，大於允許的偏差上限 ('{2}' 個位元組)。

# DerivedKeyTokenLabelTooLong
source: The length ('{0}' bytes) of the derived key's Label exceeds the maximum length ('{1}' bytes) allowed.
cs: Délka (počet bajtů: {0}) popisku odvozeného klíče přesahuje maximální povolenou délku (počet bajtů: {1}).
de: Die Länge ("{0}" Bytes) der Bezeichnung des abgeleiteten Schlüssels überschreitet die maximal zulässige Länge ("{1}" Bytes).
es: La longitud ("{0}" bytes) de la etiqueta de la clave derivada supera la longitud máxima ("{1}" bytes) permitida.
fr: La longueur de l'étiquette ('{0}' octets) de la clé dérivée dépasse la longueur maximale autorisée ('{1}' octets).
it: Il valore length ('{0}' byte) dell'elemento Label della chiave derivata supera quello massimo consentito ('{1}' byte).
ja: 派生キーのラベルの長さ ('{0}' バイト) は、許可されている最大長 ('{1}' バイト) を超えています。
ko: 파생 키의 레이블 길이('{0}'바이트)가 허용되는 최대 길이('{1}'바이트)를 초과합니다.
pl: Długość etykiety („{0}” B) klucza pochodnego przekracza maksymalną dozwoloną długość („{1}” B).
pt_br: O comprimento ('{0}' bytes) da Etiqueta da chave derivada excede o comprimento máximo permitido ('{1}' bytes).
tr: Türetilmiş anahtarın Label özelliğinin uzunluğu ('{0}' bayt), izin verilen en büyük uzunluk değerini ('{1}' bayt) aşıyor.
zh_hans: 派生密钥的标签的长度(“{0}”个字节)超过了所允许的最大长度(“{1}”个字节)。
zh_hant: 衍生金鑰的 Label 長度 ('{0}' 個位元組) 超出允許的長度上限 ('{1}' 個位元組)。

# DerivedKeyTokenNonceTooLong
source: The length ('{0}' bytes) of the derived key's Nonce exceeds the maximum length ('{1}' bytes) allowed.
cs: Délka (počet bajtů: {0}) hodnoty Nonce odvozeného klíče přesahuje maximální povolenou délku (počet bajtů: {1}).
de: Die Länge ({0} Bytes) der Nonce des abgeleiteten Schlüssels überschreitet die maximal zulässige Länge ({1} Bytes).
es: La longitud ("{0}" bytes) del valor de seguridad (nonce) de la clave derivada supera la longitud máxima ("{1}" bytes) permitida.
fr: La longueur du nonce ('{0}' octets) de la clé dérivée dépasse la longueur maximale autorisée ('{1}' octets).
it: Il valore length ('{0}' byte) dell'elemento Nonce della chiave derivata supera quello massimo consentito ('{1}' byte).
ja: 派生キーの Nonce ('{0}' バイト) は、許可されている最大長 ('{1}' バイト) を超えています。
ko: 파생 키의 Nonce 길이('{0}'바이트)가 허용되는 최대 길이('{1}'바이트)를 초과합니다.
pl: Długość elementu Nonce („{0}” B) klucza pochodnego przekracza maksymalną dozwoloną długość („{1}” B).
pt_br: O comprimento ('{0}' bytes) de Nonce da chave derivada excede o comprimento máximo permitido ('{1}' bytes).
tr: Türetilen anahtarın Nonce özelliği uzunluğu ('{0}' bayt), izin verilen en büyük uzunluk değerini ('{1}' bayt) aşıyor.
zh_hans: 派生密钥的 Nonce 的长度(“{0}”个字节)超过了所允许的最大长度(“{1}”个字节)。
zh_hant: 衍生金鑰的 Nonce 長度 ('{0}' 個位元組) 超出允許的長度上限 ('{1}' 個位元組)。
