Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxNoEndpointMatchingAddressForConnectionOpeningMessage
source: The message with Action '{0}' cannot be processed at the receiver because this Action is reserved for the connection opening messages only and cannot be sent from client to server. To invoke this operation on the server, call the '{1}' method on the client proxy instead.
cs: Zprávu s akcí {0} nelze zpracovat na straně příjemce, protože tato akce je vyhrazena pro zprávy související s navázáním připojení a nelze ji odeslat z klienta na server. Pokud chcete tuto operaci volat na serveru, zavolejte namísto toho metodu {1} v klientovi proxy.
de: Die Nachricht mit Aktion "{0}" kann auf Empfängerseite nicht verarbeitet werden, weil diese Aktion für Nachrichten zum Öffnen von Verbindungen reserviert ist und nicht vom Client an den Server gesendet werden kann. Um diesen Vorgang auf dem Server aufzurufen, führen Sie stattdessen einen Aufruf der {1}-Methode auf dem Clientproxy aus.
es: El mensaje con Action "{0}" no se puede procesar en el receptor porque esta Action se reserva para los mensajes de apertura de conexión únicamente y no se puede enviar del cliente al servidor. Para invocar esta operación en el servidor, llame al método "{1}" en el proxy cliente en su lugar.
fr: Impossible de traiter le message contenant Action '{0}' au niveau du récepteur, car cette Action est réservée aux messages d'établissement de connexion et ne peut pas être envoyée du client au serveur. Pour appeler cette opération sur le serveur, appelez la méthode '{1}' sur le proxy client à la place.
it: Non è possibile elaborare nel destinatario il messaggio con l'elemento Action '{0}' perché tale elemento è riservato solo ai messaggi di apertura delle connessioni e non può essere inviato dal client al server. Per richiamare questa operazione nel server, chiamare il metodo '{1}' nel proxy client.
ja: この Action は接続オープン メッセージのみに予約されていて、クライアントからサーバーへ送信できないため、Action が '{0}' のメッセージを受信側で処理できません。サーバーでこの操作を呼び出すには、代わりにクライアント プロキシで '{1}' メソッドを呼び出します。
ko: '{0}' 동작은 연결을 여는 메시지에만 예약되어 있고 클라이언트에서 서버로 전송할 수 없으므로 이 동작이 있는 메시지는 수신자가 처리할 수 없습니다. 서버에서 이 작업을 호출하려면 클라이언트 프록시에서 '{1}' 메서드를 대신 호출하세요.
pl: Odbiornik nie może przetworzyć komunikatu z elementem Action „{0}”, ponieważ ta wartość elementu Action jest zastrzeżona dla komunikatów otwarcia połączenia i nie można jej wysyłać z klienta do serwera. Aby wywołać tę operację na serwerze, wywołaj metodę „{1}” na serwerze proxy klienta.
pt_br: A mensagem com Ação '{0}' não pode ser processada no destinatário porque essa Ação está reservada somente para mensagens de abertura de conexão e não pode ser enviada do cliente para o servidor. Para invocar essa operação no servidor, chame o método '{1}' no proxy do cliente.
tr: Bu Eylem yalnızca bağlantı açma iletileri için ayrılmış olduğu ve istemciden sunucuya gönderilemediği için '{0}' Eylemini içeren ileti alıcıda işlenemiyor. Sunucuda bu işlemi çağırmak için, istemci proxy'de '{1}' metodunu çağırın.
zh_hans: 接收方无法处理 Action 为“{0}”的消息，因为此 Action 仅为连接开放消息预留，不可从客户端发送到服务器。要在服务器上调用此操作，请改为在客户端代理上调用“{1}”方法。
zh_hant: 具有動作 '{0}' 的訊息無法於接收器處理，因為此動作僅保留供連線開啟訊息且無法從用戶端傳送至伺服器。若要叫用伺服器上的這項作業，請改為呼叫用戶端 Proxy 上的 '{1}' 方法。

# SFxNoEndpointMatchingContract
source: The message with Action '{0}' cannot be processed at the receiver, due to a ContractFilter mismatch at the EndpointDispatcher. This may be because of either a contract mismatch (mismatched Actions between sender and receiver) or a binding/security mismatch between the sender and the receiver. Check that sender and receiver have the same contract and the same binding (including security requirements, e.g. Message, Transport, None).
cs: Zprávu s akcí {0} nelze v příjemci zpracovat, protože se ve třídě EndpointDispatcher vyskytla neshoda ContractFilter. To mohlo být způsobeno neshodou kontraktu (neodpovídající akce mezi odesílatelem a příjemcem) nebo neshodou vazby či zabezpečení mezi odesílatelem a příjemcem. Zkontrolujte, zda mají odesílatel a příjemce stejný kontrakt a stejnou vazbu (včetně požadavků zabezpečení, např. Zpráva, Přenos, Žádný).
de: Die Nachricht mit der Aktion "{0}" kann aufgrund eines ContractFilter-Konflikts beim EndpointDispatcher nicht verarbeitet werden. Mögliche Ursachen: Vertragskonflikt (keine übereinstimmenden Aktionen zwischen Sender und Empfänger) oder ein Bindungs-/Sicherheitskonflikt zwischen dem Sender und dem Empfänger. Stellen Sie sicher, dass Sender und Empfänger über den gleichen Vertrag und die gleiche Bindung verfügen (einschließlich Sicherheitsanforderungen, z. B. "Message", "Transport", "None").
es: El mensaje con la acción "{0}" no se puede procesar en el destinatario debido a una falta de coincidencia de ContractFilter en EndpointDispatcher. La razón puede ser que los contratos no coinciden (falta de coincidencia de las acciones entre el remitente y el destinatario) o que el enlace/seguridad no coinciden en el remitente y el destinatario. Compruebe que el remitente y el destinatario tienen el mismo contrato y el mismo enlace (incluidos los requisitos de seguridad, por ejemplo Message, Transport, None).
fr: Impossible de traiter le message contenant Action '{0}' au récepteur en raison d'une non-correspondance de ContractFilter au EndpointDispatcher. Ceci peut être dû à une non-correspondance de contrat (Actions différentes entre expéditeur et récepteur) ou à une différence de liaison/sécurité entre expéditeur et récepteur. Vérifiez que l'expéditeur et le récepteur ont le même contrat et la même liaison (notamment les exigences de sécurité, par exemple Message, Transport, None).
it: Non è possibile elaborare nel destinatario il messaggio con elemento Action '{0}' a causa di una mancata corrispondenza ContractFilter in EndpointDispatcher. Il problema potrebbe dipendere da una mancata corrispondenza nel contratto (Action del mittente e del destinatario non corrispondenti) o da una mancata corrispondenza di binding/sicurezza tra il mittente e il destinatario. Controllare che il mittente e il destinatario abbiano lo stesso contratto e lo stesso binding, inclusi i requisiti di sicurezza, ad esempio Message, Transport, None.
ja: EndpointDispatcher で ContractFilter が一致していないため、Action が '{0}' のメッセージを受信側で処理できません。この原因としては、送信側と受信側の間でコントラクト (送信側と受信側の Action の不一致) またはバインド/セキュリティが一致していないことが考えられます。送信側と受信側に同じコントラクトおよび同じバインド (Message、Transport、None などのセキュリティ要件を含む) があることを確認してください。
ko: EndpointDispatcher에서 ContractFilter가 일치하지 않으므로 수신자 쪽에서 '{0}' 동작이 있는 메시지를 처리할 수 없습니다. 발신자와 수신자 사이에 계약 불일치(발신자와 수신자 사이의 동작 불일치) 또는 바인딩/보안 불일치가 있기 때문일 수 있습니다. 발신자와 수신자의 계약 및 바인딩(메시지, 전송, 없음 등의 보안 요구 사항 포함)이 같은지 확인하세요.
pl: Komunikat o parametrze Action „{0}” nie może zostać przetworzony w punkcie odbioru z powodu niezgodności parametru ContractFilter w elemencie EndpointDispatcher. Może to być spowodowane niezgodnością kontraktu (niezgodność czynności między nadawcą i odbiorcą) lub niezgodnością powiązania/zabezpieczeń między nadawcą i odbiorcą. Sprawdź, czy nadawca i odbiorca mają te same kontrakty i powiązania (w tym wymagania zabezpieczeń, np.: Message, Transport, None).
pt_br: A mensagem com a Ação '{0}' não pode ser processada no destinatário devido a um ContractFilter incompatível no EndpointDispatcher. Isso pode ser devido a um contrato incompatível (Ações incompatíveis entre remetente e destinatário) ou a uma incompatibilidade de associação/segurança entre o remetente e o destinatário. Verifique se o remetente e o destinatário têm o mesmo contrato e a mesma associação (incluindo os requisitos de segurança, por exemplo, Mensagem, Transporte, Nenhum).
tr: EndpointDispatcher içindeki bir ContractFilter uyumsuzluğu nedeniyle Action '{0}' özelliğine sahip ileti alıcıda işlenemiyor. Bu, bir anlaşma uyumsuzluğu (gönderen ve alıcı arasındaki Action özellikleri arasında) ya da gönderen ve alıcı arasında bir bağlama/güvenlik uyumsuzluğu nedeniyle olabilir. Gönderenin ve alıcının aynı anlaşma ve aynı bağlamaya (Message, Transport, None gibi güvenlik gereksinimleri de dahil olmak üzere) sahip olduğunu denetleyin.
zh_hans: 由于 ContractFilter 在 EndpointDispatcher 不匹配，因此 Action 为“{0}”的消息无法在接收方处理。这可能是由于协定不匹配(发送方和接收方 Action 不匹配)或发送方和接收方绑定/安全不匹配。请检查发送方和接收方是否具有相同的协定和绑定(包括安全要求，如 Message、Transport、None)。
zh_hant: EndpointDispatcher 的 ContractFilter 不符，因此收件者無法處理具有動作 '{0}' 的訊息。這可能是因為合約不符 (寄件者與收件者的動作不符)，或寄件者與收件者之間的繫結/安全性不符。請檢查寄件者與收件者是否具有相同的合約與繫結 (包括安全性需求，例如 Message、Transport、None)。

# SFxNoMostDerivedContract
source: The contract specified by type '{0}' is ambiguous. The type derives from at least two different types that each define its own service contract. For this type to be used as a contract type, exactly one of its inherited contracts must be more derived than any of the others.
cs: Kontrakt určený typem {0} je dvojznačný. Typ je odvozen nejméně ze dvou různých typů, z nichž každý definuje svůj vlastní kontrakt služby. Pokud se má tento typ používat jako typ kontraktu, musí být právě jeden ze zděděných kontraktů odvozený více než všechny ostatní.
de: Der vom Typ "{0}" angegebene Vertrag ist mehrdeutig. Der Typ wird von mindestens zwei verschiedenen Typen abgeleitet, die jeweils eigene Dienstverträge definieren. Für die Verwendung dieses Typs als Vertragstyp muss genau einer seiner geerbten Verträge stärker abgeleitet sein als alle anderen.
es: El contrato especificado por tipo "{0}" es ambiguo. El tipo se deriva de, al menos, dos tipos diferentes, cada uno de los cuales define su propio contrato de servicio. Para usar este tipo como un tipo de contrato, solamente uno de sus contratos heredados debe derivarse más que los otros.
fr: Le contrat spécifié par le type '{0}' est ambigu. Le type dérive d'au moins deux types différents qui définissent chacun leur propre contrat de service. Pour utiliser ce type en tant que type de contrat, exactement un de ces contrats hérités doit être plus dérivé que tous les autres.
it: Il contratto specificato dal tipo '{0}' è ambiguo. Il tipo deriva da almeno due tipi diversi, ognuno dei quali definisce il proprio contratto di servizio. Per usare il tipo come tipo di contratto, uno dei contratti ereditati deve essere più derivato rispetto a tutti gli altri.
ja: 型 '{0}' で指定されたコントラクトはあいまいです。この型は、それぞれが独自のサービス コントラクトを定義している 2 種類以上の型から派生しています。この型がコントラクト型として使用されるためには、この型の継承されたコントラクトの 1 つだけが、他のコントラクトより多く派生されている必要があります。
ko: '{0}' 형식에 의해 지정된 계약이 모호합니다. 형식이 각각 자체 서비스 계약을 정의하는 최소한 두 개 이상의 서로 다른 형식에서 파생됩니다. 이 형식을 계약 형식으로 사용하려면 상속된 계약 중 하나가 다른 계약보다 더 많이 파생되어야 합니다.
pl: Kontrakt określony przez typ „{0}” jest niejednoznaczny. Typ pochodzi z co najmniej dwóch różnych typów, z których każdy definiuje swój własny kontrakt usługi. Aby ten typ mógł zostać użyty jako typ kontraktu, dokładnie jeden z jego odziedziczonych kontraktów musi być bardziej pochodny niż pozostałe.
pt_br: O contrato especificado pelo tipo '{0}' é ambíguo. O tipo deriva de pelo menos dois tipos diferentes, cada um deles definindo seu próprio contrato de serviço. Para esse tipo ser usado como um tipo de contrato, exatamente um de seus contratos herdados deve ser mais derivado do qualquer um dos outros.
tr: '{0}' türüyle belirtilen anlaşma belirsiz. Tür, her biri kendi hizmet anlaşmasını tanımlayan en az iki farklı türden türetilir. Bu türün bir anlaşma türü olarak kullanılabilmesi için devralınan anlaşmalarından tam olarak biri diğerlerinden daha fazla türetilmiş olmalıdır.
zh_hans: 类型“{0}”指定的协定不明确。该类型至少从两个不同的类型派生，而这两个类型分别定义了其自己的服务协定。要将该类型用作协定类型，它继承的其中一个协定的派生次数必须多于任何其余协定。
zh_hant: 由類型 '{0}' 所指定的合約不明確。類型衍生自至少兩個各自定義其服務合約的不同類型。若要使用此類型作為合約類型，所繼承的合約必須有衍生性的差異。

# SFxNoServiceObject
source: The service implementation object was not initialized or is not available.
cs: Objekt implementace služby nebyl inicializován nebo není dostupný.
de: Das Dienstimplementierungsobjekt wurde nicht initialisiert oder ist nicht verfügbar.
es: El objeto de implementación de servicio no se inicializó o no está disponible.
fr: L'objet d'implémentation de service n'a pas été initialisé ou n'est pas disponible.
it: L'oggetto di implementazione del servizio non è inizializzato o non è disponibile.
ja: このサービス実装オブジェクトは初期化されなかったか使用不能です。
ko: 서비스 구현 개체가 초기화되지 않았거나 사용할 수 없는 상태입니다.
pl: Obiekt implementacji usługi nie został zainicjowany lub jest niedostępny.
pt_br: O objeto de implementação de serviço não foi inicializado ou não está disponível.
tr: Hizmet uygulama nesnesi başlatılmadı ya da kullanılamıyor.
zh_hans: 服务实现对象未初始化或不可用。
zh_hant: 服務實作物件未初始化或無法使用。

# SFxNonExceptionThrown
source: An object that is not an exception was thrown.
cs: Byl vyvolán objekt, který není výjimkou.
de: Es wurde ein Objekt ausgelöst, das keine Ausnahme darstellt.
es: Se inició un objeto que no es una excepción.
fr: Un objet qui n'est pas une exception a été levé.
it: È stato generato un oggetto diverso da un'eccezione.
ja: 例外ではないオブジェクトがスローされました。
ko: 예외가 아닌 개체가 발생했습니다.
pl: Zgłoszony został obiekt niebędący wyjątkiem.
pt_br: Um objeto que não é uma exceção foi gerado.
tr: Özel durum olmayan bir nesne gönderildi.
zh_hans: 引发了一个非异常对象。
zh_hant: 已擲回非例外狀況的物件。

# SFxNonInitiatingOperation1
source: The operation '{0}' cannot be the first operation to be called because IsInitiating is false.
cs: Operace {0} nemůže být první volanou operací, protože třída IsInitiating má hodnotu false.
de: Der Vorgang "{0}" kann nicht der erste aufgerufene Vorgang sein, da IsInitiating "false" ist.
es: La operación "{0}" no puede ser la primera operación que se llame porque IsInitiating es false.
fr: L'opération '{0}' ne peut pas être la première opération appelée, car IsInitiating a la valeur false.
it: L'operazione '{0}' non può essere la prima operazione chiamata perché IsInitiating è false.
ja: IsInitiating が false であるため、'{0}' という名前の操作を、最初に呼び出される操作にすることはできません。
ko: IsInitiating이 false이므로 '{0}' 작업을 첫 번째 작업으로 호출할 수 없습니다.
pl: Operacja „{0}” nie może być pierwszą wywoływaną operacją, ponieważ parametr IsInitiating ma wartość false.
pt_br: A operação '{0}' não pode ser a primeira operação a ser chamada porque IsInitiating é false.
tr: '{0}' işlemi, IsInitiating false olduğundan çağrılan ilk işlem olamaz.
zh_hans: 由于 IsInitiating 是 False，因此操作“{0}”不能是调用的第一个操作。
zh_hant: 由於 IsInitiating 為 False，因此作業 '{0}' 不可為第一項呼叫的作業。

# SFxNone2004
source: The WS-Addressing "none" value is not valid for the August 2004 version of WS-Addressing.
cs: Hodnota NONE elementu WS-Addressing není platná pro verzi elementu WS-Addressing ze srpna 2004.
de: Der Wert "none" der WS-Adressierung ist für die August 2004-Version der WS-Adressierung nicht gültig.
es: El valor "none" de WS-Addressing no es válido para la versión de agosto de 2004 de WS-Addressing.
fr: La valeur 'none' de WS-Addressing n'est pas valide pour la version d'août 2004 de WS-Addressing.
it: Valore WS-Addressing "none" non valido per la versione di agosto 2004 di WS-Addressing.
ja: WS-Addressing の値を "なし" にすることは、2004 年 8 月版の WS-Addressing では無効です。
ko: WS-Addressing "none" 값이 2004년 8월 버전의 WS-Addressing에 올바르지 않습니다.
pl: Wartość WS-Addressing „none” jest nieprawidłowa dla wersji WS-Addressing z sierpnia 2004.
pt_br: O valor "none" do WS-Addressing não é válido para a versão de agosto de 2004 do WS-Addressing.
tr: WS-Addressing "none" değeri, WS-Addressing Ağustos 2004 sürümü için geçerli değil.
zh_hans: WS-Addressing "none" 值对 2004 年 8 月版本的 WS-Addressing 无效。
zh_hant: WS-Addressing "none" 值對於 WS-Addressing August 2004 版本無效。

# SFxNullReplyFromExtension2
source: Extension {0} prevented call to operation '{1}' from replying by setting the reply to null.
cs: Rozšíření {0} zabránilo volání operace {1} v odpovědi nastavením odpovědi na hodnotu NULL.
de: Die Erweiterung "{0}" hat einen Aufruf an Vorgang "{1}" am Antworten gehindert, indem die Antwort auf NULL festgelegt wurde.
es: La extensión {0} impidió que la llamada a la operación '{1}' respondiera estableciendo la respuesta en Null.
fr: L'extension {0} a interdit la réponse à l'appel à l'opération '{1}' en définissant la réponse sur Null.
it: L'estensione {0} non ha consentito la risposta della chiamata all'operazione '{1}' impostando la risposta su Null.
ja: 拡張 {0} は、応答を NULL に設定することで、操作 '{1}' への呼び出しが応答しないようにしています。
ko: {0} 확장 때문에 회신을 null로 설정하여 '{1}' 작업에 대한 호출에 회신할 수 없습니다.
pl: Rozszerzenie {0} uniemożliwiło odpowiedź z wywołania operacji „{1}” przez ustawienie odpowiedzi na zerową.
pt_br: A extensão {0} impediu que a chamada para a operação '{1}' fosse respondida definindo a resposta como nulo.
tr: {0} uzantısı, yanıtı boşluk olarak ayarlayarak '{1}' işleminin çağrılmasını önledi.
zh_hans: 扩展 {0} 通过将回复设置为空使得对操作“{1}”的调用无法回复。
zh_hant: 延伸 {0} 將回覆設為 null，因此無法回覆作業 '{1}' 的呼叫。

# SFxNullReplyFromFormatter2
source: Formatter {0} returned a null reply message for call to operation '{1}'.
cs: Formátovací modul {0} vrátil zprávu odpovědi s hodnotou NULL pro volání do operace {1}.
de: Der Formatierer {0} hat eine leere Antwortnachricht für einen Aufruf des Vorgangs "{1}" zurückgegeben.
es: El formateador {0} devolvió un mensaje de respuesta nulo para la llamada a la operación "{1}".
fr: Le formateur {0} a retourné un message de réponse avec une valeur null pour l'appel à l'opération '{1}'.
it: Il formattatore {0} ha restituito un messaggio di risposta Null per la chiamata all'operazione '{1}'.
ja: フォーマッタ {0} が、操作 '{1}' への呼び出しに対して null の応答メッセージを返しました。
ko: {0} 포맷터가 '{1}' 작업의 호출에 대해 null 회신 메시지를 반환했습니다.
pl: Program formatujący {0} zwrócił komunikat odpowiedzi o wartości null dla wywołania operacji „{1}”.
pt_br: O formatador {0} retornou uma mensagem de resposta nula da chamada para a operação '{1}'.
tr: {0} biçimlendiricisi '{1}' işlemi çağrısı için bir null yanıt iletisi döndürdü.
zh_hans: 格式化程序 {0} 对操作“{1}”的调用返回了空回复消息。
zh_hant: 格式器 {0} 對作業 '{1}' 的呼叫，傳回了 null 的回覆訊息。

# SFxOneWayMessageToTwoWayMethod0
source: The incoming message with action could not be processed because it is targeted at a request-reply operation, but cannot be replied to as the MessageId property is not set.
cs: Příchozí zpráva s akcí nemohla být zpracována, protože je zaměřena na operaci požadavek-odpověď, ale nelze na ni odpovědět, protože není nastavena vlastnost MessageId.
de: Die eingehende Nachricht mit einer Aktion konnte nicht verarbeitet werden, da sie an einen Anforderung-Antwort-Vorgang gerichtet ist, eine Antwort jedoch nicht möglich ist, da die MessageId-Eigenschaft nicht festgelegt ist.
es: No se pudo procesar el mensaje entrante con la acción porque está destinado a una operación de solicitud-respuesta, pero no se puede responder porque no está establecida la propiedad MessageId.
fr: Impossible de traiter le message entrant contenant l'action, car il est ciblé à une opération request-reply et la réponse ne peut pas être émise, car la propriété MessageId n'est pas définie.
it: Non è stato possibile elaborare il messaggio in arrivo con azione perché è destinato a un'operazione Request/Reply, ma non è possibile rispondervi perché la proprietà MessageId non è impostata.
ja: アクションが指定された受信メッセージは要求-応答の操作を対象としていますが、MessageId プロパティが設定されていないためこのメッセージに応答できないため、このメッセージを処理できませんでした。
ko: 요청-회신 작업을 대상으로 하므로 동작이 있는 들어오는 메시지는 처리할 수 없으며, MessageId 속성이 설정되지 않아서 이에 회신할 수 없습니다.
pl: Komunikat przychodzący z czynnością nie mógł zostać przetworzony, ponieważ jego celem jest operacja żądanie-odpowiedź, a wysłanie odpowiedzi nie było możliwe z uwagi na brak ustawienia właściwości MessageId.
pt_br: A mensagem de entrada com ação não pôde ser processada porque ela é destinada a uma operação solicitação-resposta, mas não pode ser respondida porque a propriedade MessageId não está definida.
tr: Eylem içeren gelen ileti, bir istek-yanıt işleminde hedeflenmiş olduğu halde MessageId özelliği gereken şekilde ayarlanmadığı için yanıtlanamadığından işlenemedi.
zh_hans: 无法处理带有操作的传入消息，因为其目标是请求-回复操作，但由于未设置 MessageId 属性，因此无法回复。
zh_hant: 無法處理具有動作的內送郵件，因為其目標為要求回覆作業，但由於未設定 MessageId 屬性，所以無法回覆。

# SFxOperationContractOnNonServiceContract
source: Method '{0}' has OperationContractAttribute, but enclosing type '{1}' does not have ServiceContractAttribute. OperationContractAttribute can only be used on methods in ServiceContractAttribute types or on their CallbackContract types.
cs: Metoda {0} má atribut OperationContractAttribute, ale nadřazený typ {1} nemá atribut ServiceContractAttribute. Atribut OperationContractAttribute lze použít jen u metod v typech ServiceContractAttribute nebo u jejich typů CallbackContract.
de: Die Methode "{0}" weist OperationContractAttribute auf, der einschließende Typ "{1}" enthält jedoch kein ServiceContractAttribute. OperationContractAttribute kann nur für Methoden in ServiceContractAttribute-Typen oder für die zugehörigen CallbackContract-Typen verwendet werden.
es: El método "{0}" tiene OperationContractAttribute, pero el tipo delimitador "{1}" no tiene ServiceContractAttribute. OperationContractAttribute solo se puede usar en métodos de tipos de ServiceContractAttribute o en sus tipos de CallbackContract.
fr: La méthode '{0}' contient OperationContractAttribute, mais le type englobant '{1}' ne contient pas ServiceContractAttribute. OperationContractAttribute est utilisable uniquement sur les méthodes dans les types ServiceContractAttribute ou sur leurs types CallbackContract.
it: Il metodo '{0}' contiene OperationContractAttribute, ma il tipo di inclusione '{1}' non contiene l'elemento ServiceContractAttribute. OperationContractAttribute può essere usato solo su metodi nei tipi ServiceContractAttribute o nei rispettivi tipi CallbackContract.
ja: メソッド '{0}' は、OperationContractAttribute ですが、それを囲む型 '{1}' には ServiceContractAttribute がありません。OperationContractAttribute は、ServiceContractAttribute 型のメソッド、または CallbackContract 型でのみ使用できます。
ko: '{0}' 메서드에는 OperationContractAttribute가 있지만, 바깥쪽 형식 '{1}'에는 ServiceContractAttribute가 없습니다. ServiceContractAttribute 형식의 메서드 또는 CallbackContract 형식에서만 OperationContractAttribute를 사용할 수 있습니다.
pl: Metoda „{0}” ma atrybut OperationContractAttribute, ale typ otaczający „{1}” nie ma atrybutu ServiceContractAttribute. Atrybut OperationContractAttribute może być używany tylko w metodach typów ServiceContractAttribute lub w ich typach CallbackContract.
pt_br: O método '{0}' tem OperationContractAttribute, mas o ServiceContractAttribute não envolve o tipo '{1}'. O OperationContractAttribute só pode ser usado em métodos nos tipos ServiceContractAttribute ou em seus tipos CallbackContract.
tr: '{0}' metodu OperationContractAttribute özniteliğine sahip, ancak '{1}' içerik türünde ServiceContractAttribute bulunmuyor. OperationContractAttribute, yalnızca ServiceContractAttribute türündeki metotlarda ya da bunların CallbackContract türlerinde kullanılabilir.
zh_hans: 方法“{0}”具有 OperationContractAttribute，但封闭类型“{1}”没有 ServiceContractAttribute。OperationContractAttribute 只能用于 ServiceContractAttribute 类型中的方法或其 CallbackContract 类型。
zh_hant: 方法 '{0}' 具有 OperationContractAttribute，但封閉式類型 '{1}' 並不具有 ServiceContractAttribute。OperationContractAttribute 只可用於 ServiceContractAttribute 類型中的方法，或用於其 CallbackContract 類型上。
