Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# CannotInheritTwoOperationsWithTheSameName3
source: Cannot inherit two different operations with the same name, operation '{0}' from contracts '{1}' and '{2}' violate this rule. You can change the name of one of the operations by changing the method name or by using the Name property of OperationContractAttribute.
cs: Nelze zdědit dvě různé operace se stejným názvem. Operace {0} z kontraktů {1} a {2} toto pravidlo porušují. Název jedné z operací lze změnit tak, že změníte název metody nebo použijete vlastnost název třídy OperationContractAttribute.
de: Es können nicht zwei verschiedene Vorgänge mit dem gleichen Namen geerbt werden. Der Vorgang "{0}" aus den Verträgen "{1}" und "{2}" verstößt gegen diese Regel. Sie können den Namen eines der Vorgänge ändern, indem Sie den Methodennamen ändern oder die Name-Eigenschaft von OperationContractAttribute verwenden.
es: No se pueden heredar dos operaciones diferentes con el mismo nombre; la operación "{0}" de los contratos "{1}" y "{2}" infringen esta regla. Puede cambiar el nombre de una de las operaciones modificando el nombre del método o mediante la propiedad Name de OperationContractAttribute.
fr: Impossible d'hériter de deux opérations différentes portant le même nom, les opérations '{0}' des contrats '{1}' et '{2}' violent cette règle. Vous pouvez changer le nom de l'une des opérations en changeant le nom de la méthode ou en utilisant la propriété Name de OperationContractAttribute.
it: Non è possibile ereditare due diverse operazioni con lo stesso nome. L'operazione '{0}' dei contratti '{1}' e '{2}' viola questa regola. È possibile cambiare il nome di una delle operazioni modificando il nome del metodo oppure usando la proprietà Name di OperationContractAttribute.
ja: 同じ名前を持つ 2 つの異なる操作を継承することはできません。コントラクト '{1}' および '{2}' からの操作 '{0}' は、このルールに違反しています。いずれかの操作の名前を変更するには、メソッド名を変更するか、OperationContractAttribute の Name プロパティを使用します。
ko: 이름이 같은 두 개의 다른 작업을 상속할 수 없습니다. 계약 '{1}' 및 '{2}'의 '{0}' 작업이 이 규칙을 위반합니다. 메서드 이름을 변경하거나 OperationContractAttribute의 Name 속성을 사용하여 작업 중 하나의 이름을 변경할 수 있습니다.
pl: Nie można dziedziczyć dwóch różnych operacji o tej samej nazwie. Operacja „{0}” z kontraktów „{1}” i „{2}” narusza tę regułę. Można zmienić nazwę jednej z operacji, zmieniając nazwę metody lub używając właściwości Name obiektu OperationContractAttribute.
pt_br: Não é possível herdar duas operações diferentes com o mesmo nome; a operação '{0}' dos contratos '{1}' e '{2}' viola essa regra. Você pode alterar o nome de uma das operações, alterando o nome do método ou usando a propriedade Name de OperationContractAttribute.
tr: Aynı adlı iki farklı işlem devralınamaz, {1} ve {2} anlaşmalarından alınan {0} işlemi bu kuralı ihlal ediyor. Metot adını değiştirerek veya OperationContractAttribute'un Name özelliğini kullanarak işlemlerden birinin adını değiştirebilirsiniz.
zh_hans: 无法继承名称相同的两个不同操作，协定“{1}”和“{2}”的操作“{0}”违反了此规则。可以通过更改方法名称或使用 OperationContractAttribute 的 Name 属性更改其中一个操作的名称。
zh_hant: 無法繼承相同名稱的兩項不同作業，來自合約 '{1}' 與 '{2}' 的作業 '{0}' 違反此規則。您可透過變更方法名稱或使用 OperationContractAttribute 的 Name 屬性，變更其中一項作業的名稱。

# CannotObtainIssuedTokenKeySize
source: Cannot determine the key size of the issued token.
cs: Nelze určit velikost klíče vydaného tokenu.
de: Die Schlüsselgröße des ausgegebenen Tokens kann nicht bestimmt werden.
es: No se puede determinar el tamaño de la clave del token emitido.
fr: Impossible de déterminer la taille de la clé du jeton émis.
it: Impossibile determinare le dimensioni della chiave del token rilasciato.
ja: 発行されたトークンのキー サイズを特定できません。
ko: 발급된 토큰의 키 크기를 확인할 수 없습니다.
pl: Nie można określić rozmiaru klucza wystawionego tokenu.
pt_br: Não é possível determinar o tamanho da chave do token emitido.
tr: Verilen belirtecin anahtar boyutu belirlenemiyor.
zh_hans: 无法确定已颁发令牌的密钥大小。
zh_hant: 無法判斷發行的權杖金鑰大小。

# CannotReadKeyIdentifierClause
source: Cannot read KeyIdentifierClause from element '{0}' with namespace '{1}'. Custom KeyIdentifierClauses require custom SecurityTokenSerializers, please refer to the SDK for examples.
cs: Nelze přečíst klauzuli KeyIdentifierClause z elementu {0} s oborem názvů {1}. Vlastní klauzule KeyIdentifierClause vyžadují vlastní serializátory SecurityTokenSerializers. Příklady naleznete v sadě SDK.
de: Die KeyIdentifierClause kann nicht aus dem Element "{0}" mit dem Namespace "{1}" gelesen werden. Benutzerdefinierte KeyIdentifierClauses erfordern benutzerdefinierte SecurityTokenSerializers. Beispiele hierzu finden Sie im SDK.
es: No se puede leer KeyIdentifierClause en el elemento "{0}" con el espacio de nombres "{1}". Las cláusulas KeyIdentifierClause personalizadas requieren serializadores SecurityTokenSerializer personalizados. Consulte el SDK para ver ejemplos.
fr: Impossible de lire KeyIdentifierClause à partir de l'élément '{0}' avec l'espace de noms '{1}'. Des KeyIdentifierClauses personnalisés nécessitent des SecurityTokenSerializers personnalisés. Consultez le SDK pour obtenir des exemples.
it: Non è possibile leggere l'elemento KeyIdentifierClause dall'elemento '{0}' con spazio dei nomi '{1}'. Con gli elementi KeyIdentifierClause personalizzati sono richiesti elementi SecurityTokenSerializer personalizzati. Per gli esempi, fare riferimento all'SDK.
ja: 名前空間 '{1}' の要素 '{0}' から KeyIdentifierClause を読み取ることができません。カスタムの KeyIdentifierClauses には、カスタムの SecurityTokenSerializers が必要です。例については、SDK をご覧ください。
ko: 네임스페이스가 '{1}'인 '{0}' 요소에서 KeyIdentifierClause를 읽을 수 없습니다. 사용자 지정 KeyIdentifierClauses에는 사용자 지정 SecurityTokenSerializers가 필요합니다. 예제를 보려면 SDK를 참조하세요.
pl: Nie można odczytać klauzuli KeyIdentifierClause z elementu „{0}” z przestrzeni nazw „{1}”. Niestandardowe klauzule KeyIdentifierClauses wymagają niestandardowych elementów SecurityTokenSerializers. Przykłady można znaleźć w zestawie SDK.
pt_br: Não é possível ler a KeyIdentifierClause do elemento '{0}' com namespace '{1}'. As KeyIdentifierClauses personalizadas necessitam de SecurityTokenSerializers personalizados. Consulte o SDK para obter exemplos.
tr: '{1}' ad alanına sahip '{0}' öğesinden KeyIdentifierClause okunamıyor. Özel KeyIdentifierClause'lar için özel SecurityTokenSerializer'lar gerekir, örnekleri görmek için lütfen SDK'ya başvurun.
zh_hans: 无法从命名空间为“{1}”的元素“{0}”读取 KeyIdentifierClause 。自定义 KeyIdentifierClauses 需要自定义 SecurityTokenSerializers，有关示例，请参考 SDK。
zh_hant: 無法從命名空間為 '{1}' 的元素 '{0}' 讀取 KeyIdentifierClause。自訂 KeyIdentifierClauses 需要自訂 SecurityTokenSerializers，請參考 SDK 以取得範例。

# CannotReadToken
source: Cannot read the token from the '{0}' element with the '{1}' namespace for BinarySecretSecurityToken, with a '{2}' ValueType. If this element is expected to be valid, ensure that security is configured to consume tokens with the name, namespace and value type specified.
cs: Nelze přečíst token z elementu {0} s oborem názvů {1} pro BinarySecretSecurityToken s typem ValueType {2}. Je-li očekáváno, že tento element bude platný, ujistěte se, že zabezpečení je nakonfigurováno tak, aby využívalo tokeny se zadaným názvem, oborem názvů a typem hodnoty.
de: Das Token aus dem Element "{0}" mit dem Namespace "{1}" für BinarySecurityToken mit dem ValueType "{2}" kann nicht gelesen werden. Wenn Sie dieses Element für gültig halten, stellen Sie sicher, dass die Sicherheit für die Nutzung von Token mit dem angegebenen Namen, Namespace und Werttyp konfiguriert ist.
es: No se puede leer el token en el elemento "{0}" con el espacio de nombres "{1}" para BinarySecretSecurityToken, con un valor ValueType "{2}". Si se espera que este elemento sea válido, asegúrese de que la seguridad esté configurada para consumir tokens con el nombre, espacio de nombres y tipo de valor especificados.
fr: Impossible de lire le jeton à partir de l'élément '{0}' avec l'espace de noms '{1}' pour BinarySecretSecurityToken, avec un ValueType '{2}'. Si cet élément est censé être valide, vérifiez que la sécurité est configurée pour consommer des jetons dotés du nom, de l'espace de noms et du type valeur spécifiés.
it: Non è possibile leggere il token dall'elemento '{0}' con spazio dei nomi '{1}' per BinarySecretSecurityToken con un elemento ValueType '{2}'. Se l'elemento deve essere valido, assicurarsi che la sicurezza sia configurata in modo da usare token con il nome, lo spazio dei nomi e il tipo valore specificati.
ja: ValueType が '{2}' である BinarySecretSecurityToken の名前空間 '{1}' を持つ要素 '{0}' からトークンを読み取ることができません。この要素が有効であることが予期される場合は、指定された名前、名前空間、および値の型のトークンを使用するようにセキュリティが構成されていることを確認してください。
ko: BinarySecretSecurityToken에 대한 '{1}' 네임스페이스를 가진 '{0}' 요소에서 '{2}' ValueType의 토큰을 읽을 수 없습니다. 이 요소가 유효한지 보려면 보안이 해당 이름, 네임스페이스 및 값 형식이 지정된 토큰을 사용하도록 구성되었는지 확인하세요.
pl: Nie można odczytać tokenu z elementu „{0}” z przestrzenią nazw „{1}” dla elementu BinarySecretSecurityToken, z typem ValueType „{2}”. Jeśli ten element ma być poprawny, należy tak skonfigurować zabezpieczenia, aby obsługiwały tokeny o określonej nazwie, przestrzeni nazw i typie wartości.
pt_br: Não é possível ler o token do elemento '{0}' com o namespace '{1}' para BinarySecretSecurityToken, com ValueType '{2}'. Se esse elemento for esperado como válido, verifique se a segurança está configurada para consumir tokens com o nome, o namespace e o tipo de valor especificados.
tr: '{1}' ad alanına sahip '{0}' öğesinden '{2}' ValueType öğesine sahip BinarySecretSecurityToken için belirteç okunamıyor. Bu öğenin geçerli olması bekleniyorsa, güvenliğin ad, ad alanı ve değer türleri belirtilen belirteçleri kullanmasını sağlayın.
zh_hans: 对于具有“{2}”ValueType 的 BinarySecretSecurityToken，无法从命名空间为“{1}”的“{0}”元素中读取令牌。如果此元素预期有效，则请确保将安全性配置为使用具有指定的名称、命名空间和值类型的令牌。
zh_hant: 無法從 ValueType 為 '{2}'、BinarySecretSecurityToken 命名空間為 '{1}' 的元素 '{0}' 讀取權杖。若此元素應該要有效，請確認將安全性設定為使用具有該指定名稱、命名空間及實值型別的權杖。

# CannotValidateSecurityTokenType
source: The security token authenticator '{0}' cannot validate a token of type '{1}'.
cs: Ověřovací data tokenu zabezpečení {0} nemohou ověřit token typu {1}.
de: Der Sicherheitstokenauthentifizierer "{0}" kann ein Token vom Typ "{1}" nicht überprüfen.
es: El autenticador de tokens de seguridad "{0}" no puede validar un token de tipo "{1}".
fr: L'authentificateur de jeton de sécurité '{0}' ne peut pas valider un jeton de type '{1}'.
it: L'autenticatore del token di sicurezza '{0}' non può convalidare un token di tipo '{1}'.
ja: セキュリティ トークン認証システム '{0}' は、型が '{1}' のトークンを検証できません。
ko: 보안 토큰 인증자 '{0}'은(는) '{1}' 형식의 토큰 유효성을 검사할 수 없습니다.
pl: Wystawca uwierzytelnienia tokenu zabezpieczeń „{0}” nie może weryfikować tokenu typu „{1}”.
pt_br: O autenticador de token de segurança '{0}' não pode validar um token do tipo '{1}'.
tr: '{0}' güvenlik belirteci kimlik doğrulayıcısı '{1}' türündeki bir belirteci doğrulayamaz.
zh_hans: 安全令牌身份验证器“{0}”无法验证类型为“{1}”的令牌。
zh_hant: 安全性權杖驗證器 '{0}' 無法驗證類型 '{1}' 的權杖。

# CantCreateChannelWithManualAddressing
source: Cannot create channel for a contract that requires request/reply and a binding that requires manual addressing but only supports duplex communication.
cs: Nelze vytvořit kanál pro kontrakt, který vyžaduje požadavek nebo odpověď a vazbu, která vyžaduje ruční adresování, ale podporuje pouze duplexní komunikaci.
de: Es ist nicht möglich, einen Kanal für einen Vertrag zu erstellen, der eine Anforderung/Antwort und eine Bindung, für die eine manuelle Adressierung erforderlich ist, erfordert, aber nur die Duplexkommunikation unterstützt.
es: No se puede crear el canal para un contrato que requiere solicitud y respuesta, y un enlace que requiere direccionamiento manual pero solo admite comunicación dúplex.
fr: Impossible de créer un canal pour un contrat qui nécessite le mode requête/réponse et une liaison qui nécessite un adressage manuel mais qui prend en charge uniquement la communication duplex.
it: Non è possibile creare il canale per un contratto che richiede Request/Reply e un binding che richiede l'indirizzamento manuale ma supporta solo la comunicazione duplex.
ja: Request/Reply が必要なコントラクト、および双方の通信のみをサポートする手動によるアドレス指定が必要なバインドのチャネルを作成することができません。
ko: 수동 주소 지정이 필요하지만 이중 통신만 지원하는 바인딩 및 request/reply가 필요한 계약에 대한 채널을 만들 수 없습니다.
pl: Nie można utworzyć kanału dla kontraktu wymagającego żądań i odpowiedzi oraz powiązania wymagającego ręcznego adresowania, ale tylko obsługującego komunikację dupleksową.
pt_br: Não é possível criar um canal para um contrato que requer solicitação/resposta e uma associação que requer endereçamento manual, mas que apenas dá suporte à comunicação duplex.
tr: İstek/yanıt gerektiren bir anlaşma ve el ile adresleme gerektiren bir bağlama için değil, yalnızca çift yönlü iletişimi destekleyen bir kanal oluşturuluyor.
zh_hans: 无法为需要请求/回复的协定和需要手动寻址但只支持双工通信的绑定创建通道。
zh_hant: 無法為需要要求/回覆的合約及需要手動定址但僅支援雙工通訊的繫結，建立通道。

# CantInferReferenceForToken
source: Can't infer an external reference for '{0}' token type.
cs: Nelze odvodit externí odkaz pro typ tokenu {0}.
de: Ein externer Verweis für den Tokentyp "{0}" kann nicht abgeleitet werden.
es: No se puede inferir una referencia externa para el tipo de token "{0}".
fr: Impossible de déduire une référence externe pour le type de jeton '{0}'.
it: Non è possibile dedurre un riferimento esterno per il tipo di token '{0}'.
ja: トークン型 '{0}' への外部参照を推測できません。
ko: '{0}' 토큰 형식에 대한 외부 참조를 유추할 수 없습니다.
pl: Nie można wnioskować odwołania zewnętrznego dla typu tokenu „{0}”.
pt_br: Não é possível deduzir uma referência externa para o tipo de token '{0}'.
tr: '{0}' belirteç türü için bir dış başvuru oluşturulamıyor.
zh_hans: 无法为“{0}”令牌类型推断外部引用。
zh_hant: 無法推斷 '{0}' 權杖類型的外部參考。

# CertificateUnsupportedForHttpTransportCredentialOnly
source: Certificate-based client authentication is not supported in TransportCredentialOnly security mode. Select the Transport security mode.
cs: Ověření klienta pomocí certifikátu není v režimu zabezpečení TransportCredentialOnly podporováno. Vyberte režim zabezpečení Transport.
de: Die zertifikatbasierte Clientauthentifizierung wird im TransportCredentialOnly-Sicherheitsmodus nicht unterstützt. Wählen Sie den Transportsicherheitsmodus aus.
es: La autenticación de cliente basada en certificados no se admite en el modo de seguridad TransportCredentialOnly. Seleccione el modo de seguridad Transport.
fr: L'authentification client basée sur les certificats n'est pas prise en charge dans le mode de sécurité TransportCredentialOnly. Sélectionnez le mode de sécurité du transport.
it: L'autenticazione client basata su certificati non è supportata nella modalità di sicurezza TransportCredentialOnly. Selezionare la modalità di sicurezza Transport.
ja: 証明書ベースのクライアント認証は TransportCredentialOnly セキュリティ モードではサポートされません。Transport セキュリティ モードを選択してください。
ko: 인증서 기반 클라이언트 인증이 TransportCredentialOnly 보안 모드에서 지원되지 않습니다. Transport 보안 모드를 선택하세요.
pl: Uwierzytelnianie klienta oparte na certyfikatach jest nieobsługiwane w trybie zabezpieczeń TransportCredentialOnly. Wybierz tryb zabezpieczeń Transport.
pt_br: Não há suporte para autenticação de cliente com base em certificado no modo de segurança TransportCredentialOnly. Selecione o modo de segurança do Transporte.
tr: Sertifika temelli istemci kimlik doğrulaması, TransportCredentialOnly güvenlik modunda desteklenmez. Transport güvenlik modunu seçin.
zh_hans: TransportCredentialOnly 安全模式中不支持基于证书的客户端身份验证。请选择“传输安全性”模式。
zh_hant: TransportCredentialOnly 安全性模式不支援以憑證為基礎的用戶端驗證。請選取傳輪安全性模式。

# ChannelFactoryCannotBeUsedToCreateChannels
source: A call to IChannelFactory.CreateChannel made on an object of type {0} failed because Open has not been called on this object.
cs: Volání do třídy IChannelFactory.CreateChannel provedené v objektu typu {0} selhalo, protože v tomto objektu nebyla volána funkce otevření.
de: Fehler bei einem IChannelFactory.CreateChannel-Aufruf für ein Objekt vom Typ {0}. Für dieses Objekt wurde "Open" nicht aufgerufen.
es: Error de una llamada a IChannelFactory.CreateChannel realizada en un objeto de tipo {0} porque no se llamó a Open en este objeto.
fr: Échec d'un appel à IChannelFactory.CreateChannel effectué sur un objet de type {0}, car la méthode Open n'a pas été appelée sur cet objet.
it: Una chiamata a IChannelFactory.CreateChannel eseguita su un oggetto di tipo {0} non è riuscita perché sull'oggetto non è stato chiamato Open.
ja: 型 {0} のオブジェクトでは Open が呼び出されていないため、このオブジェクトで IChannelFactory.CreateChannel を呼び出せませんでした。
ko: {0} 형식의 개체에서 Open이 호출되지 않았기 때문에 이 개체에서 IChannelFactory.CreateChannel을 호출하지 못했습니다.
pl: Nie można wywołać metody IChannelFactory.CreateChannel dla obiektu typu {0}, ponieważ dla tego obiektu nie wywołano metody Open.
pt_br: Falha em uma chamada feita para IChannelFactory.CreateChannel em um objeto do tipo {0} porque a ação Abrir não foi chamada nesse objeto.
tr: Open işlevi bu nesnede çağrılmadığından, {0} türünde bir nesnede yapılan IChannelFactory.CreateChannel çağrısı başarısız oldu.
zh_hans: 在类型为 {0} 的对象上对 IChannelFactory.CreateChannel 的调用失败，因为未在此对象上调用 Open。
zh_hant: 呼叫類型為 {0} 之物件上的 IChannelFactory.CreateChannel 失敗，因為尚未呼叫此物件上的 Open。

# ChannelMustBeOpenedToGetSessionId
source: The session channel must be opened before the session ID can be accessed.
cs: Před přístupem k identifikátoru relace musí být otevřen kanál relace.
de: Der Sitzungskanal muss geöffnet werden, bevor auf die Sitzungs-ID zugegriffen werden kann.
es: Debe abrirse el canal de sesión para poder tener acceso al id. de la sesión.
fr: Le canal de session doit être ouvert avant de pouvoir accéder à l'ID de session.
it: Aprire il canale della sessione per poter accedere all'ID sessione.
ja: セッションのチャネルが開かれないと、セッション ID にアクセスすることはできません。
ko: 세션 ID에 액세스하려면 먼저 세션 채널을 열어야 합니다.
pl: Kanał sesji musi być otwarty, aby można było uzyskać dostęp do identyfikatora sesji.
pt_br: O canal de sessão deve estar aberto para que a Identificação de sessão possa ser acessada.
tr: Oturum kimliğine erişilebilmesi için oturum kanalının açılması gerekir.
zh_hans: 必须在打开会话通道之后才能访问会话 ID。
zh_hant: 必須先開啟工作階段通道，才能存取工作階段識別碼。

# ChannelNotOpen
source: The channel is not open.
cs: Kanál není otevřen.
de: Der Kanal ist nicht offen.
es: El canal no está abierto.
fr: Le canal n'est pas ouvert.
it: Il canale non è aperto.
ja: チャネルが開かれていません。
ko: 채널이 열리지 않았습니다.
pl: Kanał nie jest otwarty.
pt_br: O canal não está aberto.
tr: Kanal açık değil.
zh_hans: 通道未打开。
zh_hant: 通道未開啟。

# ChannelParametersCannotBeModified
source: Cannot modify channel parameters because the {0} is in the {1} state. This operation is only supported in the Created state.
cs: Nelze změnit parametry kanálu, protože {0} je ve stavu {1}. Tato operace je podporována pouze ve stavu Created.
de: Die Kanalparameter können nicht geändert werden, da {0} sich im {1}-Zustand befindet. Dieser Vorgang wird nur im Created-Zustand unterstützt.
es: No se pueden modificar los parámetros de canal porque {0} se encuentra en el estado {1}. Esta operación solo se admite en el estado Created.
fr: Modification des paramètres du canal impossible, car {0} présente l'état {1}. Cette opération est uniquement prise en charge dans l'état Created.
it: Non è possibile modificare i parametri del canale perché l'elemento {0} si trova nello stato {1}. L'operazione è supportata solo nello stato Created.
ja: {0} の状態が {1} のため、チャネル パラメーターを変更できません。この操作は、状態が Created の場合のみサポートされます。
ko: {0}의 상태가 {1}이기 때문에 채널 매개 변수를 수정할 수 없습니다. 이 작업은 Created 상태에서만 지원됩니다.
pl: Nie można zmodyfikować parametrów kanału, ponieważ stan elementu {0} to {1}. Ta operacja jest tylko obsługiwana w stanie Created.
pt_br: Não é possível modificar os parâmetros do canal porque {0} está no estado {1}. Há suporte para essa operação apenas no estado Criado.
tr: {0}, {1} durumunda olduğundan kanal parametreleri değiştirilemiyor. Bu işlem, yalnızca Created durumunda desteklenir.
zh_hans: 无法修改通道参数，因为 {0} 处于 {1} 状态。仅在处于“已创建”状态时才支持此操作。
zh_hant: 因為 {0} 目前為 {1} 狀態，所以無法修改通道參數。只有在「已建立」狀態才支援此作業。

# ChannelParametersCannotBePropagated
source: Cannot propagate channel parameters because the {0} is in the {1} state. This operation is only supported in the Opening or Opened state when the collection is locked.
cs: Parametry kanálu nelze rozšířit, protože {0} je ve stavu {1}. Tato operace je po zamknutí kolekce podporována pouze ve stavu Opening nebo Opened.
de: Die Kanalparameter können nicht propagiert werden, da {0} sich im {1}-Zustand befindet. Dieser Vorgang wird nur im Opening- oder Opened-Zustand unterstützt, wenn die Sammlung gesperrt ist.
es: No se pueden propagar los parámetros de canal porque {0} se encuentra en el estado {1}. Esta operación solo se admite en el estado Opening u Opened cuando la colección está bloqueada.
fr: Propagation des paramètres de canal impossible, car {0} présente l'état {1}. Cette opération est uniquement prise en charge dans l'état Opening ou Opened quand la collection est verrouillée.
it: Non è possibile propagare i parametri del canale perché l'elemento {0} si trova nello stato {1}. L'operazione è supportata solo nello stato Opening o Opened quando la raccolta è bloccata.
ja: {0} の状態が {1} のため、チャネル パラメーターを伝達できません。この操作は、コレクションがロックされているときに状態が Opening または Opened の場合のみサポートされます。
ko: {0}의 상태가 {1}이기 때문에 채널 매개 변수를 전파할 수 없습니다. 이 작업은 컬렉션이 잠긴 경우 여는 중 또는 열림 상태에서만 지원됩니다.
pl: Nie można propagować parametrów kanału, ponieważ stan elementu {0} to {1}. Ta operacja jest tylko obsługiwana w stanie Opening lub Opened, gdy kolekcja jest zablokowana.
pt_br: Não é possível propagar os parâmetros do canal porque {0} está no estado {1}. Há suporte para essa operação apenas no estado Aberto ou Abrindo, quando a coleção está bloqueada.
tr: {0}, {1} durumunda olduğundan kanal parametreleri doldurulamıyor. Bu işlem, koleksiyon kilitliyken yalnızca Opening ya da Opened durumunda desteklenir.
zh_hans: 无法传播通道参数，因为 {0} 处于 {1} 状态。只有在集合被锁定且处于“正在打开”或者“已打开”状态时才支持此操作。
zh_hant: 因為 {0} 目前為 {1} 狀態，所以無法傳播通道參數。當集合已鎖定時，只有在 Opening 或 Opened 狀態才支援此作業。

# ChannelTypeNotSupported
source: The specified channel type {0} is not supported by this channel manager.
cs: Určený typ kanálu {0} není tímto správcem kanálů podporován.
de: Der angegebene Kanaltyp {0} wird von diesem Kanal-Manager nicht unterstützt.
es: Este administrador de canales no admite el tipo de canal especificado {0}.
fr: Le type de canal {0} spécifié n'est pas pris en charge par ce gestionnaire de canaux.
it: Il tipo di canale specificato {0} non è supportato da questo gestore canali.
ja: このチャネル マネージャーでは、指定されたチャネルの型 {0} をサポートしていません。
ko: 지정된 채널 형식 {0}이(가) 이 채널 관리자에서 지원되지 않습니다.
pl: Określony typ kanału {0} jest nieobsługiwany przez tego menedżera kanałów.
pt_br: O tipo de canal especificado {0} não tem suporte deste gerenciador de canais.
tr: Belirtilen kanal türü {0}, bu kanal yöneticisi tarafından desteklenmiyor.
zh_hans: 此通道管理器不支持指定的通道类型 {0}。
zh_hant: 此通道管理員不支援指定的通道類型 {0}。

# ChildNodeTypeMissing
source: The XML element {0} does not have a child of type {1}.
cs: Element XML {0} nemá podřízený element typu {1}.
de: Das XML-Element {0} weist kein untergeordnetes Element vom Typ {1} auf.
es: El elemento XML {0} no tiene un elemento secundario del tipo {1}.
fr: L'élément XML {0} n'a aucun enfant de type {1}.
it: L'elemento XML {0} non contiene un elemento figlio di tipo {1}.
ja: XML 要素 {0} には、{1} 型の子がありません。
ko: XML 요소 {0}에 {1} 형식의 자식 항목이 없습니다.
pl: Element XML {0} nie ma elementu podrzędnego typu {1}.
pt_br: O elemento XML {0} não tem um filho do tipo {1}.
tr: {0} XML öğesi, {1} türünde bir alt öğeye sahip değil.
zh_hans: XML 元素 {0} 没有类型为 {1} 的子元素。
zh_hant: XML 元素 {0} 不具有類型 {1} 的子系。
