Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxDisallowedAttributeCombination
source: The type or member named '{0}' could not be loaded because it has two incompatible attributes: '{1}' and '{2}'. To fix the problem, remove one of the attributes from the type or member.
cs: Typ nebo člen nazvaný {0} nebylo možné načíst, protože má dva nekompatibilní atributy: {1} a {2}. Chcete-li tento problém vyřešit, odstraňte z typu nebo členu jeden atribut.
de: Der Typ oder Member mit dem Namen "{0}" kann nicht geladen werden, da er über zwei inkompatible Attribute verfügt: "{1}" und "{2}". Entfernen Sie eines der Attribute aus dem Typ bzw. Member, um das Problem zu beheben.
es: No se pudo cargar el tipo o el miembro con el nombre "{0}" porque tiene dos atributos incompatibles: "{1}" y "{2}". Para corregir el problema, quite uno de los atributos del tipo o el miembro.
fr: Impossible de charger le type de membre nommé '{0}', car il contient deux attributs incompatibles : '{1}' et '{2}'. Pour corriger le problème, supprimez l'un des attributs du type ou du membre.
it: Non è stato possibile caricare il tipo o il membro denominato '{0}' perché contiene due attributi incompatibili: '{1}' e '{2}'. Per risolvere il problema, rimuovere uno degli attributi dal tipo o dal membro.
ja: '{0}' という名前の型またはメンバーは、'{1}' と '{2}' という同時に使用できない 2 つの属性を含んでいるため読み込めませんでした。この問題を修正するには、この型またはメンバーからどちらかの属性を削除してください。
ko: 호환되지 않는 두 개의 특성 '{1}' 및 '{2}'이(가) 있으므로 이름이 '{0}'인 형식 또는 멤버를 로드할 수 없습니다. 문제점을 해결하려면 형식 또는 멤버에서 해당 특성 중 하나를 제거하세요.
pl: Nie można załadować typu lub składowej o nazwie „{0}”, ponieważ ma dwa niezgodne atrybuty: „{1}” i „{2}”. Aby rozwiązać ten problem, usuń jeden z tych atrybutów z typu lub składowej.
pt_br: O tipo ou membro denominado '{0}' não pôde ser carregado porque ele tem dois atributos incompatíveis: '{1}' e '{2}'. Para corrigir o problema, remova um dos atributos do tipo ou membro.
tr: '{1}' ve '{2}' gibi iki uyumsuz özniteliğe sahip olduğundan '{0}' adlı tür ya da üye yüklenemedi. Sorunu düzeltmek için özniteliklerden birini tür ya da üyeden kaldırın.
zh_hans: 无法加载名为“{0}”的类型或成员，因为它具有两个不兼容的属性:“{1}”和“{2}”。若要解决该问题，请从类型或成员中删除其中一个属性。
zh_hant: 無法載入名稱為 '{0}' 的類型或成員，因為它具有兩項不相容的屬性: '{1}' 與 '{2}'。若要修正此問題，請從類型或成員中移除其中一項屬性。

# SFxDispatchRuntimeMessageCannotBeNull
source: In operation '{0}', cannot return null from methods that return Message.
cs: V operaci {0} nelze vrátit hodnotu NULL z metod, které vracejí zprávu.
de: Im Vorgang "{0}" kann NULL nicht von Methoden zurückgegeben werden, die "Message" zurückgeben.
es: En la operación "{0}", no se puede devolver un valor nulo desde métodos que devuelven Message.
fr: Dans l'opération '{0}', impossible de retourner une valeur null à partir des méthodes qui retournent Message.
it: Nell'operazione '{0}' non è possibile restituire Null dai metodi che restituiscono Message.
ja: 操作 '{0}' では、メッセージを返すメソッドから、null を返すことはできません。
ko: '{0}' 작업 중 메시지를 반환하는 메서드에서 null을 반환할 수 없습니다.
pl: W operacji „{0}” metody zwracające komunikat nie mogą zwracać wartości null.
pt_br: Na operação '{0}', não é possível retornar nulo dos métodos que retornam Mensagem.
tr: '{0}' işleminde Message döndüren metotlardan null döndürülemez.
zh_hans: 在操作“{0}”中，无法从返回消息的方法中返回 null。
zh_hant: 在作業 '{0}' 中，無法從傳回 Message 的方法傳回 null。

# SFxDocEncodedNotSupported
source: Operation '{0}' could not be loaded as it uses an unsupported combination of Use and Style settings: Document with Encoded. To fix the problem, change the Use setting to Literal or change the Style setting to Rpc.
cs: Operaci {0} nebylo možné načíst, protože používá nepodporovanou kombinaci nastavení použití a stylu: dokument se zakódovaným. Chcete-li tento problém odstranit, změňte nastavení použití na literál nebo změňte nastavení stylu na Rpc.
de: Der Vorgang "{0}" konnte nicht geladen werden, da er eine nicht unterstützte Kombination von Use- und Style-Einstellungen verwendet: "Document" mit "Encoded". Ändern Sie die Use-Einstellung in "Literal", oder ändern Sie die Style-Einstellung in "Rpc", um das Problem zu beheben.
es: No se pudo cargar la operación "{0}" porque usa una combinación no admitida de valores de Use y Style: Document con Encoded. Para corregir el problema, cambie el valor de Use a Literal o cambie el valor de Style a Rpc.
fr: Impossible de charger l'opération '{0}', car elle utilise une combinaison non prise en charge de paramètres Use et Style : Document avec Encoded. Pour corriger le problème, remplacez le paramètre Use par Literal ou le paramètre Style par Rpc.
it: Non è stato possibile caricare l'operazione '{0}' perché usa una combinazione di impostazioni Use e Style non supportata: Document con Encoded. Per risolvere il problema, modificare l'impostazione Use in Literal o modificare l'impostazione Style in Rpc.
ja: 操作 '{0}' では Use と Style がそれぞれ Document と Encoded に設定されていますが、この設定の組み合わせはサポートされていないため、この操作を読み込めませんでした。この問題を修正するには、Use を Literal に変更するか、Style を Rpc に変更してください。
ko: 지원되지 않는 사용 및 스타일 설정의 조합(인코딩된 문서)을 사용하므로 '{0}' 작업을 로드할 수 없습니다. 문제를 해결하려면 Use 설정을 Literal로 변경하거나 Style 설정을 Rpc로 변경하세요.
pl: Nie można załadować operacji „{0}”, ponieważ używa ona nieobsługiwanej kombinacji ustawień wartości Use i Style: Document razem z Encoded. Aby usunąć ten problem, zmień ustawienie Use na Literal lub ustawienie Style na Rpc.
pt_br: A operação '{0}' não pôde ser carregada porque ela usa uma combinação sem suporte das configurações Use e Style: Documento com Codificação. Para corrigir o problema, altere a configuração Use para Literal ou altere a configuração Style para Rpc.
tr: Use ve Style ayarlarının desteklenmeyen birleşimi olan Encoded ile Document kullandığından '{0}' işlemi yüklenemedi. Sorunu düzeltmek için Use ayarını Literal ya da Style ayarını Rpc olarak değiştirin.
zh_hans: 无法加载操作“{0}”，因为它使用不受支持的 Use 和 Style 设置组合: 已编码的文档。若要解决该问题，请将 Use 设置更改为 Literal，或将 Style 设置更改为 RPC。
zh_hant: 無法載入作業 '{0}'，因為此作業使用不支援的 Use 和 Style 設定組合: Document 與 Encoded。若要更正此問題，請將 Use 設定變更為 Literal，或將 Style 設定變更為 Rpc。

# SFxDuplicateMessageParts
source: Message part {0} in namespace {1} appears more than once in Message.
cs: Část zprávy {0} v oboru názvů {1} se ve zprávě vyskytuje více než jednou.
de: Der Nachrichtenteil {0} im Namespace {1} kommt in der Nachricht mehrmals vor.
es: La parte de mensaje {0} del espacio de nombres {1} aparece más de una vez en Message.
fr: La partie de message {0} dans l'espace de noms {1} apparaît plus d'une fois dans le Message.
it: La parte del messaggio {0} nello spazio dei nomi {1} è presente più di una volta in Message.
ja: 名前空間 {1} のメッセージ部 {0} が、メッセージ内で 2 回以上使用されています。
ko: {1} 네임스페이스의 메시지 파트 {0}이(가) 메시지에서 두 번 이상 나타납니다.
pl: Część {0} komunikatu w przestrzeni nazw {1} pojawia się w komunikacie więcej niż jeden raz.
pt_br: A parte da mensagem {0} no namespace {1} aparece mais de uma vez na Mensagem.
tr: {1} ad alanlarındaki {0} ileti bölümü, Message içinde birden çok görünüyor.
zh_hans: 命名空间 {1} 中的消息部分 {0} 在消息中多次出现。
zh_hant: 命名空間 {1} 中的訊息組件 {0} 在訊息中出現了一次以上。

# SFxEndpointDispatcherDifferentChannelDispatcher0
source: This EndpointDispatcher is not currently attached to the provided ChannelDispatcher.
cs: Třída EndpointDispatcher touto dobou není připojena k zadané třídě ChannelDispatcher.
de: Dieser EndpointDispatcher ist derzeit nicht an den bereitgestellten ChannelDispatcher angefügt.
es: Este elemento EndpointDispatcher no está adjuntado al elemento ChannelDispatcher proporcionado.
fr: Ce EndpointDispatcher n'est pas attaché au ChannelDispatcher fourni.
it: Questo elemento EndpointDispatcher non è attualmente collegato all'elemento ChannelDispatcher fornito.
ja: この EndpointDispatcher は、指定された ChannelDispatcher に現在アタッチされていません。
ko: 이 EndpointDispatcher가 제공된 ChannelDispatcher에 현재 연결되어 있지 않습니다.
pl: Ten element EndpointDispatcher nie jest aktualnie dołączony do udostępnionego elementu ChannelDispatcher.
pt_br: Este EndpointDispatcher não está anexado no momento ao ChannelDispatcher fornecido.
tr: Bu EndpointDispatcher şu anda sağlanan ChannelDispatcher öğesine ekli değil.
zh_hans: 该 EndpointDispatcher 当前未附加到提供的 ChannelDispatcher。
zh_hant: 此 EndpointDispatcher 目前未附加至提供的 ChannelDispatcher。

# SFxEndpointDispatcherMultipleChannelDispatcher0
source: Cannot add EndpointDispatcher to more than one ChannelDispatcher.
cs: Třídu EndpointDispatcher nelze přidat k více než jedné třídě ChannelDispatcher.
de: Der EndpointDispatcher kann maximal einem ChannelDispatcher hinzugefügt werden.
es: No se puede agregar el elemento EndpointDispatcher a más de un elemento ChannelDispatcher.
fr: Impossible d'ajouter EndpointDispatcher à plusieurs ChannelDispatcher.
it: Non è possibile aggiungere EndpointDispatcher a più di un elemento ChannelDispatcher.
ja: EndpointDispatcher を複数の ChannelDispatcher に追加することはできません。
ko: EndpointDispatcher를 두 개 이상의 ChannelDispatcher에 추가할 수 없습니다.
pl: Elementu EndpointDispatcher nie można dodać do więcej niż jednego elementu ChannelDispatcher.
pt_br: Não é possível adicionar um EndpointDispatcher a mais de um ChannelDispatcher.
tr: EndpointDispatcher öğesi, birden çok ChannelDispatcher içine eklenemiyor.
zh_hans: 无法将 EndpointDispatcher 添加到多个 ChannelDispatcher。
zh_hant: 無法將 EndpointDispatcher 新增至一個以上的 ChannelDispatcher。

# SFxErrorCreatingMtomReader
source: Error creating a reader for the MTOM message
cs: Při vytváření modulu pro čtení pro zprávu MTOM došlo k chybě
de: Fehler beim Erstellen eines Readers für die MTOM-Nachricht.
es: Error al crear un lector para el mensaje MTOM.
fr: Erreur lors de la création d'un lecteur pour le message MTOM
it: Errore nella creazione di un lettore per il messaggio MTOM
ja: MTOM メッセージ用のリーダーを作成しているときにエラーが発生しました
ko: MTOM 메시지에 대한 판독기를 만드는 동안 오류가 발생했습니다.
pl: Błąd podczas tworzenia modułu odczytującego dla komunikatu MTOM.
pt_br: Erro a criar uma leitora para a mensagem MTOM
tr: MTOM iletisi için bir okuyucu oluşturma hatası
zh_hans: 创建 MTOM 消息读取器时出错
zh_hant: 為 MTOM 訊息建立讀取程式時發生錯誤

# SFxErrorDeserializingFault
source: Server returned an invalid SOAP Fault. Please see InnerException for more details.
cs: Server vrátil neplatnou chybu SOAP. Další informace naleznete u třídy InnerException.
de: Der Server hat einen ungültigen SOAP-Fehler zurückgegeben. Weitere Details finden Sie unter InnerException.
es: El servidor devolvió un error SOAP no válido. Consulte InnerException para obtener más información.
fr: Le serveur a retourné une erreur SOAP non valide. Pour plus d'informations, consultez InnerException.
it: Il server ha restituito un errore SOAP non valido. Per maggiori dettagli, vedere InnerException.
ja: サーバーから無効な SOAP フォールトが返されました。詳細については、InnerException を参照してください。
ko: 서버가 잘못된 SOAP 오류를 반환했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Serwer zwrócił nieprawidłowy błąd protokołu SOAP. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: O servidor retornou uma Falha SOAP inválida. Consulte a InnerException para obter mais detalhes.
tr: Sunucu, geçersiz bir SOAP Hatası döndürdü. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 服务器返回无效的 SOAP 错误。有关详细信息，请参见 InnerException。
zh_hant: 伺服器傳回無效的 SOAP 錯誤。如需詳細資訊，請參閱 InnerException。

# SFxErrorDeserializingHeader
source: There was an error in deserializing one of the headers in message {0}. Please see InnerException for more details.
cs: Došlo k chybě při deserializaci jednoho ze záhlaví ve zprávě {0}. Další informace naleznete u třídy InnerException.
de: Fehler beim Deserialisieren eines der Header in der Nachricht {0}. Weitere Details finden Sie unter InnerException.
es: Error al deserializar uno de los encabezados del mensaje {0}. Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant la désérialisation de l'un des en-têtes du message {0}. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante la deserializzazione di una delle intestazioni nel messaggio {0}. Per maggiori dettagli, vedere InnerException.
ja: メッセージ {0} のいずれかのヘッダーのシリアル化を解除しているときにエラーが発生しました。詳細については、InnerException を参照してください。
ko: {0} 메시지의 헤더 중 하나를 deserialize하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas deserializacji jednego z nagłówków komunikatu {0}. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro durante a desserialização de um dos cabeçalhos na mensagem {0}. Consulte a InnerException para obter mais detalhes.
tr: {0} iletisindeki üst bilgilerden biri seri durumdan çıkarılırken hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 对消息 {0} 中的其中一个标头进行反序列化时出错。有关详细信息，请参见 InnerException。
zh_hant: 將訊息 {0} 的其中一項標頭還原序列化時發生錯誤。如需詳細資訊，請參閱 InnerException。

# SFxErrorDeserializingReplyBody
source: Error in deserializing body of reply message for operation '{0}'.
cs: Došlo k chybě při deserializaci textu zprávy odpovědi pro operaci {0}.
de: Fehler beim Deserialisieren des Textkörpers der Antwortnachricht für den Vorgang "{0}".
es: Error al deserializar el cuerpo del mensaje de respuesta para la operación "{0}".
fr: Erreur durant la désérialisation du corps du message de réponse pour l'opération '{0}'.
it: Si è verificato un errore durante la deserializzazione del corpo del messaggio di risposta per l'operazione '{0}'.
ja: 操作 '{0}' の応答メッセージの本文をシリアル化解除しているときにエラーが発生しました。
ko: '{0}' 작업에 대한 회신 메시지의 본문을 deserialize하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas deserializacji treści komunikatu odpowiedzi dla operacji „{0}”.
pt_br: Erro durante a desserialização do corpo da mensagem de resposta para a operação '{0}'.
tr: '{0}' işlemi yanıt iletisinin gövdesi seri durumdan çıkarılırken hata oluştu.
zh_hans: 对操作“{0}”的回复消息正文进行反序列化时出错。
zh_hant: 還原序列化作業 '{0}' 的回覆訊息內文時，發生錯誤。

# SFxErrorDeserializingReplyBodyMore
source: Error in deserializing body of reply message for operation '{0}'. {1}
cs: Došlo k chybě při deserializaci textu zprávy odpovědi pro operaci {0}. {1}
de: Fehler beim Deserialisieren des Textkörpers der Antwortnachricht für den Vorgang "{0}". {1}
es: Error al deserializar el cuerpo del mensaje de respuesta para la operación "{0}". {1}
fr: Erreur durant la désérialisation du corps du message de réponse pour l'opération '{0}'. {1}
it: Si è verificato un errore durante la deserializzazione del corpo del messaggio di risposta per l'operazione '{0}'. {1}
ja: 操作 '{0}' の応答メッセージの本文をシリアル化解除しているときにエラーが発生しました。{1}
ko: '{0}' 작업에 대한 회신 메시지의 본문을 deserialize하는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas deserializacji treści komunikatu odpowiedzi dla operacji „{0}”. {1}
pt_br: Erro durante a desserialização do corpo da mensagem de resposta para a operação '{0}'. {1}
tr: '{0}' işlemi yanıt iletisinin gövdesi seri durumdan çıkarılırken hata oluştu. {1}
zh_hans: 反序列化操作“{0}”的响应消息的正文时出现错误。{1}
zh_hant: 還原序列化作業 '{0}' 的回覆訊息內文時，發生錯誤。{1}

# SFxErrorDeserializingRequestBody
source: Error in deserializing body of request message for operation '{0}'.
cs: Došlo k chybě při deserializaci textu zprávy požadavku pro operaci {0}.
de: Fehler beim Deserialisieren des Textkörpers der Anforderungsnachricht für den Vorgang "{0}".
es: Error al deserializar el cuerpo del mensaje de solicitud para la operación "{0}".
fr: Erreur durant la désérialisation du corps du message de requête pour l'opération '{0}'.
it: Si è verificato un errore durante la deserializzazione del corpo del messaggio di richiesta per l'operazione '{0}'.
ja: 操作 '{0}' の要求メッセージの本文をシリアル化解除しているときにエラーが発生しました。
ko: '{0}' 작업에 대한 요청 메시지의 본문을 deserialize하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas deserializacji treści komunikatu żądania dla operacji „{0}”.
pt_br: Erro durante a desserialização do corpo da mensagem de solicitação para a operação '{0}'.
tr: '{0}' işlemi istek iletisinin gövdesi seri durumdan çıkarılırken hata oluştu.
zh_hans: 对操作“{0}”的请求消息正文进行反序列化时出现错误。
zh_hant: 還原序列化作業 '{0}' 的要求訊息內文時，發生錯誤。

# SFxErrorDeserializingRequestBodyMore
source: Error in deserializing body of request message for operation '{0}'. {1}
cs: Došlo k chybě při deserializaci textu zprávy požadavku pro operaci {0}. {1}
de: Fehler beim Deserialisieren des Textkörpers der Anforderungsnachricht für den Vorgang "{0}". {1}
es: Error al deserializar el cuerpo del mensaje de solicitud para la operación "{0}". {1}
fr: Erreur durant la désérialisation du corps du message de requête pour l'opération '{0}'. {1}
it: Si è verificato un errore durante la deserializzazione del corpo del messaggio di richiesta per l'operazione '{0}'. {1}
ja: 操作 '{0}' の要求メッセージの本文をシリアル化解除しているときにエラーが発生しました。{1}
ko: '{0}' 작업에 대한 요청 메시지의 본문을 deserialize하는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas deserializacji treści komunikatu żądania dla operacji „{0}”. {1}
pt_br: Erro durante a desserialização do corpo da mensagem de solicitação para a operação '{0}'. {1}
tr: '{0}' işlemi istek iletisinin gövdesi seri durumdan çıkarılırken hata oluştu. {1}
zh_hans: 对操作“{0}”的请求消息正文进行反序列化时出现错误。{1}
zh_hant: 還原序列化作業 '{0}' 的要求訊息內文時，發生錯誤。{1}

# SFxErrorReflectingOnMethod3
source: An error occurred while loading attribute '{0}' on method '{1}' in type '{2}'. Please see InnerException for more details.
cs: Došlo k chybě při načítání atributu {0} v metodě {1} v typu {2}. Další informace naleznete u třídy InnerException.
de: Beim Laden des Attributs "{0}" für die Methode "{1}" im Typ "{2}" ist ein Fehler aufgetreten. Weitere Details finden Sie unter InnerException.
es: Error al cargar el atributo "{0}" en el método "{1}" del tipo "{2}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant le chargement de l'attribut '{0}' sur la méthode '{1}' dans le type '{2}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il caricamento dell'attributo '{0}' sul metodo '{1}' nel tipo '{2}'. Per maggiori dettagli, vedere InnerException.
ja: 型 '{2}' のメソッド '{1}' で属性 '{0}' を読み込んでいるときにエラーが発生しました。詳細については、InnerException を参照してください。
ko: '{2}' 형식의 '{1}' 메서드에서 '{0}' 특성을 로드하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas ładowania atrybutu „{0}” dla metody „{1}” w typie „{2}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao carregar o atributo '{0}' no método '{1}' no tipo '{2}'. Consulte a InnerException para obter mais detalhes.
tr: '{2}' türündeki '{1}' metodunda '{0}' özniteliği yüklenirken bir hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 在类型“{2}”中方法“{1}”上加载属性“{0}”时出错。有关详细信息，请参见 InnerException。
zh_hant: 載入類型 '{2}' 中方法 '{1}' 的屬性 '{0}' 時發生錯誤。請參閱 InnerException，以取得詳細資料。

# SFxErrorReflectingOnParameter4
source: An error occurred while loading attribute '{0}' on parameter {1} of method '{2}' in type '{3}'. Please see InnerException for more details.
cs: Došlo k chybě při načítání atributu {0} v parametru {1} metody {2} v typu {3}. Další informace naleznete u třídy InnerException.
de: Beim Laden des Attributs "{0}" für den Parameter {1} der Methode "{2}" im Typ "{3}" ist ein Fehler aufgetreten. Weitere Details finden Sie unter InnerException.
es: Error al cargar el atributo "{0}" en el parámetro {1} del método "{2}" del tipo "{3}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant le chargement de l'attribut '{0}' sur le paramètre {1} de la méthode '{2}' dans le type '{3}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il caricamento dell'attributo '{0}' sul parametro '{1}' del metodo '{2}' nel tipo '{3}'. Per maggiori dettagli, vedere InnerException.
ja: 型 '{3}' のメソッド '{2}' のパラメーター '{1}' で属性 '{0}' を読み込んでいるときにエラーが発生しました。詳細については、InnerException を参照してください。
ko: '{3}' 형식의 {2}' 메서드의 {1} 매개 변수에서 '{0}' 특성을 로드하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas ładowania atrybutu „{0}” dla parametru {1} metody „{2}” w typie „{3}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao carregar o atributo '{0}' no parâmetro {1} do método '{2}' no tipo '{3}'. Consulte a InnerException para obter mais detalhes.
tr: '{3}' türündeki '{2}' metodunda '{1}' parametresinin '{0}' özniteliği yüklenirken bir hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 在类型“{3}”中方法“{2}”的参数 {1} 上加载属性“{0}”时出错。有关详细信息，请参见 InnerException。
zh_hant: 載入類型 '{3}' 中方法 {2} 之參數 '{1}' 的屬性 '{0}' 時發生錯誤。請參閱 InnerException，以取得詳細資料。

# SFxErrorReflectingOnType2
source: An error occurred while loading attribute '{0}' on type '{1}'. Please see InnerException for more details.
cs: Došlo k chybě při načítání atributu {0} v typu {1}. Další informace naleznete u třídy InnerException.
de: Beim Laden des Attributs "{0}" für den Typ "{1}" ist ein Fehler aufgetreten. Weitere Details finden Sie unter InnerException.
es: Error al cargar el atributo "{0}" en el tipo "{1}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant le chargement de l'attribut '{0}' sur le type '{1}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il caricamento dell'attributo '{0}' sul tipo '{1}'. Per maggiori dettagli, vedere InnerException.
ja: 型 '{1}' で属性 '{0}' を読み込んでいるときにエラーが発生しました。詳細については、InnerException を参照してください。
ko: '{1}' 형식에서 '{0}' 특성을 로드하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas ładowania atrybutu „{0}” w typie „{1}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao carregar o atributo '{0}' no tipo '{1}'. Consulte a InnerException para obter mais detalhes.
tr: '{1}' türündeki '{0}' özniteliği yüklenirken bir hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 在类型“{1}”上加载属性“{0}”时出错。有关详细信息，请参见 InnerException。
zh_hant: 載入類型 '{1}' 的屬性 '{0}' 時發生錯誤。請參閱 InnerException，以取得詳細資料。

# SFxErrorReflectionOnUnknown1
source: An error occurred while loading attribute '{0}'. Please see InnerException for more details.
cs: Došlo k chybě při načítání atributu {0}. Další informace naleznete u třídy InnerException.
de: Beim Laden des Attributs "{0}" ist ein Fehler aufgetreten. Weitere Details finden Sie unter InnerException.
es: Error al cargar el atributo "{0}". Consulte InnerException para obtener más información.
fr: Une erreur s'est produite durant le chargement de l'attribut '{0}'. Pour plus d'informations, consultez InnerException.
it: Si è verificato un errore durante il caricamento dell'attributo '{0}'. Per maggiori dettagli, vedere InnerException.
ja: 属性 '{0}' の読み込み中にエラーが発生しました。詳細については、InnerException を参照してください。
ko: '{0}' 특성을 로드하는 동안 오류가 발생했습니다. 자세한 내용은 InnerException을 참조하세요.
pl: Wystąpił błąd podczas ładowania atrybutu „{0}”. Więcej informacji znajdziesz we właściwości InnerException.
pt_br: Erro ao carregar o atributo '{0}'. Consulte a InnerException para obter mais detalhes.
tr: '{0}' özniteliği yüklenirken bir hata oluştu. Ayrıntılar için InnerException öğesine bakın.
zh_hans: 加载属性“{0}”时出错。有关详细信息，请参见 InnerException。
zh_hant: 載入屬性 '{0}' 時發生錯誤。請參閱 InnerException，以取得詳細資料。
