Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxServiceChannelCannotBeCalledBecauseIsSessionOpenNotificationEnabled
source: The operation '{0}' could not be invoked because the property '{1}' on the OperationContract is set to '{2}'. To invoke this operation on the server, call the '{3}' method on the client proxy instead.
cs: Operaci {0} nelze volat, protože vlastnost {1} metody OperationContract je nastavena na hodnotu {2}. Chcete-li tuto operaci volat na serveru, zavolejte namísto toho metodu {3} v klientovi proxy.
de: Der Vorgang "{0}" konnte nicht aufgerufen werden, weil die {1}-Eigenschaft für den OperationContract auf "{2}" festgelegt ist. Um diesen Vorgang auf dem Server aufzurufen, führen Sie stattdessen einen Aufruf der {3}-Methode auf dem Clientproxy aus.
es: La operación {0}" no se pudo invocar porque la propiedad "{1}" en OperationContract está establecida en "{2}". Para invocar esta operación en el servidor, llame al método "{3}" en el proxy cliente en su lugar.
fr: Impossible d'appeler l'opération '{0}', car la propriété '{1}' de OperationContract a la valeur '{2}'. Pour appeler cette opération sur le serveur, appelez la méthode '{3}' sur le proxy client à la place.
it: Non è stato possibile richiamare l'operazione '{0}' perché la proprietà '{1}' in OperationContract è impostata su '{2}'. Per richiamare questa operazione nel server, chiamare il metodo '{3}' sul proxy client.
ja: OperationContract のプロパティ '{1}' が '{2}' に設定されているため、操作 '{0}' を呼び出すことができませんでした。サーバーでこの操作を呼び出すには、代わりにクライアント プロキシで '{3}' メソッドを呼び出します。
ko: OperationContract의 속성 '{1}'이(가) '{2}'(으)로 설정되어 있으므로 '{0}' 작업을 호출할 수 없습니다. 서버에서 이 작업을 호출하려면 클라이언트 프록시에서 '{3}' 메서드를 대신 호출하세요.
pl: Nie można wywołać operacji „{0}”, ponieważ właściwość „{1}” obiektu OperationContract ma wartość „{2}”. Aby wywołać tę operację na serwerze, wywołaj metodę „{3}” na serwerze proxy klienta.
pt_br: A operação '{0}' não pôde ser invocada porque a propriedade '{1}' em OperationContract está definida como '{2}'. Para invocar essa operação no servidor, chame o método '{3}' no proxy do cliente.
tr: OperationContract üzerinde '{1}' özelliği '{2}' olarak ayarlandığından, '{0}' işlemi çağrılamadı. Sunucuda bu işlemi çağırmak için, istemci proxy'de '{3}' metodunu çağırın.
zh_hans: 无法调用操作“{0}”，因为 OperationContract 上的属性“{1}”设置为“{2}”。要在服务器上调用此操作，请改为在客户端代理上调用“{3}”方法。
zh_hant: 因為 OperationContract 上的屬性 '{1}' 已設為 '{2}'，所以無法叫用作業 '{0}'。若要叫用伺服器上的這項作業，請改為呼叫用戶端 Proxy 上的 '{3}' 方法。

# SFxServiceChannelIdleAborted
source: The operation '{0}' could not be completed because the sessionful channel timed out waiting to receive a message. To increase the timeout, either set the receiveTimeout property on the binding in your configuration file, or set the ReceiveTimeout property on the Binding directly.
cs: Operace {0} nebyla dokončena, protože vypršel časový limit kanálu relací při čekání na příjem zprávy. Časový limit lze zvýšit nastavením vlastnosti receiveTimeout u vazby v konfiguračním souboru nebo nastavením vlastnosti ReceiveTimeout přímo u vazby.
de: Der Vorgang "{0}" konnte nicht abgeschlossen werden, da bei dem sitzungsbasierten Kanal beim Warten auf den Empfang einer Nachricht ein Timeout aufgetreten ist. Legen Sie entweder die receiveTimeout-Eigenschaft für die Bindung in der Konfigurationsdatei fest, oder stellen Sie die ReceiveTimeout-Eigenschaft direkt für die Bindung ein, um das Zeitlimit zu erhöhen.
es: No se pudo completar la operación "{0}" porque el canal con sesión agotó el tiempo de espera para recibir un mensaje. Para aumentar el tiempo de espera, establezca la propiedad receiveTimeout del enlace en el archivo de configuración o establezca la propiedad ReceiveTimeout directamente en el enlace.
fr: Exécution de l'opération '{0}' impossible, car le délai du canal de session a expiré en attendant la réception d'un message. Pour augmenter le délai d'expiration, définissez la propriété ReceiveTimeout sur la liaison de votre fichier config ou directement sur Binding.
it: Non è stato possibile completare l'operazione '{0}' perché si è verificato un timeout del canale con sessione mentre era in attesa di un messaggio. Per aumentare il timeout, impostare la proprietà receiveTimeout sul binding nel file di configurazione o impostare la proprietà ReceiveTimeout direttamente sull'elemento Binding.
ja: セッションフル チャネルがメッセージの受信待機中にタイムアウトしたため、操作 '{0}' を完了できませんでした。タイムアウト時間を増やすには、構成ファイル内のバインドで receiveTimeout プロパティを設定するか、バインドで直接 ReceiveTimeout プロパティを設定してください。
ko: 세션 채널이 메시지를 받기 위해 기다리는 동안 시간이 초과되어 '{0}' 작업을 완료할 수 없습니다. 시간 제한을 늘리려면 구성 파일의 바인딩에서 receiveTimeout 속성을 설정하거나 바인딩에서 직접 ReceiveTimeout 속성을 설정하세요.
pl: Operacja „{0}” nie mogła zostać ukończona, ponieważ przekroczono limit czasu oczekiwania kanału sesji na otrzymanie komunikatu. Aby zwiększyć limit czasu, należy ustawić właściwość receiveTimeout dla powiązania w pliku konfiguracji lub ustawić właściwość ReceiveTimeout bezpośrednio w powiązaniu.
pt_br: A operação '{0}' não pôde ser concluída porque o canal de sessão excedeu o tempo limite esperando receber uma mensagem. Para aumentar o tempo limite, defina a propriedade receiveTimeout da associação no seu arquivo de configuração ou defina a propriedade ReceiveTimeout diretamente na Associação.
tr: Oturum kanalı bir ileti almak için beklerken zaman aşımına uğradığından '{0}' işlemi tamamlanamadı. Zaman aşımı değerini artırmak için yapılandırma dosyanızda bağlamadaki receiveTimeout özelliğini ayarlayın ya da doğrudan Binding üstündeki ReceiveTimeout özelliğini ayarlayın.
zh_hans: 由于会话通道等待接收消息时超时，因此无法完成操作“{0}”。要增加超时，请在配置文件绑定上设置 receiveTimeout 属性或直接在 Binding 上设置 ReceiveTimeout 属性。
zh_hant: 無法完成作業 '{0}'，因為工作階段通道在等待接收訊息時逾時。若要增加逾時，請在組態檔的繫結上設定 receiveTimeout 內容，或是直接在繫結上設定 ReceiveTimeout 內容。

# SFxSetEnableFaultsOnChannelDispatcher0
source: This property sets EnableFaults on the client. To set EnableFaults on the server, use ChannelDispatcher's EnableFaults.
cs: Tato vlastnost nastavuje vlastnost EnableFaults u klienta. Vlastnost EnableFaults u serveru lze nastavit pomocí vlastnosti EnableFaults metody ChannelDispatcher.
de: Diese Eigenschaft legt EnableFaults für den Client fest. Verwenden Sie EnableFaults von ChannelDispatcher, um EnableFaults für den Server festzulegen.
es: Esta propiedad establece EnableFaults en el cliente. Para establecer EnableFaults en el servidor, use EnableFaults de ChannelDispatcher.
fr: Cette propriété définit EnableFaults sur le client. Pour définir EnableFaults sur le serveur, utilisez EnableFaults de ChannelDispatcher.
it: Questa proprietà imposta EnableFaults sul client. Per impostare EnableFaults sul server, usare EnableFaults di ChannelDispatcher.
ja: このプロパティは、クライアントの EnableFaults を設定します。サーバーの EnableFaults を設定するには、ChannelDispatcher の EnableFaults を使用してください。
ko: 이 속성은 클라이언트에서 EnableFaults를 설정합니다. 서버에서 EnableFaults를 설정하려면 ChannelDispatcher의 EnableFaults를 사용하세요.
pl: Ta właściwość ustawia opcję EnableFaults na kliencie. Aby ustawić opcję EnableFaults na serwerze, należy skorzystać z właściwości EnableFaults obiektu ChannelDispatcher.
pt_br: Essa propriedade define EnableFaults no cliente. Para definir EnableFaults no servidor, use EnableFaults de ChannelDispatcher.
tr: Bu özellik, istemcide EnableFaults ayarlar. EnableFaults ayarını sunucuda yapmak için ChannelDispatcher özniteliğinin EnableFaults özelliğini kullanın.
zh_hans: 此属性在客户端上设置 EnableFaults。要在服务器上设置 EnableFaults，请使用 ChannelDispatcher 的 EnableFaults。
zh_hant: 此內容在用戶端上設定 EnableFaults。若要在伺服器上設定 EnableFaults，請使用 ChannelDispatcher 的 EnableFaults。

# SFxSetManualAddressingOnChannelDispatcher0
source: This property sets ManualAddressing on the client. To set ManualAddressing on the server, use ChannelDispatcher's ManualAddressing.
cs: Tato vlastnost nastavuje vlastnost ManualAddressing u klienta. Vlastnost ManualAddressing u serveru lze nastavit pomocí vlastnosti ManualAddressing metody ChannelDispatcher.
de: Diese Eigenschaft legt ManualAddressing auf dem Client fest. Verwenden Sie ManualAddressing von ChannelDispatcher, um ManualAddressing auf dem Server festzulegen.
es: Esta propiedad establece ManualAddressing en el cliente. Para establecer ManualAddressing en el servidor, use ManualAddressing de ChannelDispatcher.
fr: Cette propriété définit ManualAddressing sur le client. Pour définir ManualAddressing sur le serveur, utilisez ManualAddressing de ChannelDispatcher.
it: Questa proprietà imposta ManualAddressing sul client. Per impostare ManualAddressing sul server, usare ManualAddressing di ChannelDispatcher.
ja: このプロパティでは、クライアント上の ManualAddressing を設定します。サーバー上の ManualAddressing を設定するには、ChannelDispatcher の ManualAddressing を使用してください。
ko: 이 속성은 클라이언트에서 ManualAddressing을 설정합니다. 서버에서 ManualAddressing을 설정하려면 ChannelDispatcher의 ManualAddressing을 사용하세요.
pl: Ta właściwość ustawia opcję ManualAddressing na kliencie. Aby ustawić opcję ManualAddressing na serwerze, należy skorzystać z właściwości ManualAddressing obiektu ChannelDispatcher.
pt_br: Essa propriedade define ManualAddressing no cliente. Para definir ManualAddressing no servidor, use ManualAddressing de ChannelDispatcher.
tr: Bu özellik, istemcide ManualAddressing ayarlar. ManualAddressing ayarını sunucuda yapmak için ChannelDispatcher özniteliğinin ManualAddressing özelliğini kullanın.
zh_hans: 此属性在客户端上设置 ManualAddressing。要在服务器上设置 ManualAddressing，请使用 ChannelDispatcher 的 ManualAddressing。
zh_hant: 此內容在用戶端上設定 ManualAddressing。若要在伺服器上設定 ManualAddressing，請使用 ChannelDispatcher 的 ManualAddressing。

# SFxStaticMessageHeaderPropertiesNotAllowed
source: Header properties cannot be set in MessageHeaderAttribute of {0} as its type is MessageHeader<T>.
cs: Vlastnosti záhlaví nelze nastavit v atributu MessageHeaderAttribute {0}, protože jeho typ je MessageHeader<T>.
de: Headereigenschaften können nicht im MessageHeaderAttribute von {0} festgelegt werden, weil der Typ MessageHeader<T> ist.
es: No se pueden establecer las propiedades del encabezado en MessageHeaderAttribute de {0} porque su tipo es MessageHeader<T>.
fr: Les propriétés de l'en-tête ne peuvent pas être définies dans MessageHeaderAttribute de {0}, car son type est MessageHeader<T>.
it: Non è possibile impostare le proprietà di intestazione in MessageHeaderAttribute di {0} perché è di tipo MessageHeader<T>.
ja: ヘッダーのプロパティは、型が MessageHeader であるため、{0} の MessageHeaderAttribute では設定できません<T>。
ko: 형식이 MessageHeader<T>이므로 헤더 속성을 {0}의 MessageHeaderAttribute에서 설정할 수 없습니다.
pl: Właściwości nagłówka nie mogą być ustawione w atrybucie MessageHeaderAttribute {0}, ponieważ jego typ to MessageHeader<T>.
pt_br: As propriedades do cabeçalho não podem ser definidas na MessageHeaderAttribute de {0} porque seu tipo é MessageHeader<T>.
tr: Üst bilgi özelikleri, türü MessageHeader<T> olduğundan, {0} MessageHeaderAttribute içinde yapılamaz.
zh_hans: 无法在 {0} 的 MessageHeaderAttribute 中设置 Header 属性，因为其类型是 MessageHeader<T>。
zh_hant: 在 {0} 的 MessageHeaderAttribute 中無法設定標頭屬性，因為其類型為 MessageHeader<T>。

# SFxStreamIOException
source: An exception has been thrown when reading the stream.
cs: Při čtení proudu došlo k výjimce.
de: Beim Lesen des Datenstroms wurde eine Ausnahme ausgelöst.
es: Se inició una excepción al leer la secuencia.
fr: Une exception a été levée durant la lecture du flux.
it: È stata generata un'eccezione durante la lettura del flusso.
ja: ストリームの読み取り中に例外がスローされました。
ko: 스트림을 읽는 동안에 예외가 발생했습니다.
pl: Zgłoszono wyjątek podczas odczytu strumienia.
pt_br: Foi gerada uma exceção durante a leitura do fluxo.
tr: Akış okunurken bir özel durum oluşturuldu.
zh_hans: 读取流时引发异常。
zh_hant: 讀取資料流時擲回例外狀況。

# SFxStreamRequestMessageClosed
source: The message containing this stream has been closed. Note that request streams cannot be accessed after the service operation returns.
cs: Zpráva obsahující tento proud byla zavřena. Proudy požadavků nelze otevřít po vrácení operace služby.
de: Die Nachricht, die diesen Datenstrom enthält, wurde geschlossen. Beachten Sie, dass nach der Rückgabe des Dienstvorgangs nicht auf Anforderungsdatenströme zugegriffen werden kann.
es: Se cerró el mensaje que contiene esta secuencia. Tenga en cuenta que no se puede tener acceso a las secuencias de solicitud después de la devolución de la operación de servicio.
fr: Le message contenant ce flux a été fermé. Notez que les flux de requête ne sont pas accessibles après le retour de l'opération de service.
it: Il messaggio contenente questo flusso è stato chiuso. Non è possibile accedere ai flussi di richiesta dopo la restituzione dell'operazione del servizio.
ja: このストリームを格納しているメッセージは閉じられています。サービス操作が返った後に要求ストリームにアクセスすることはできません。
ko: 이 스트림을 포함하는 메시지가 닫혔습니다. 참고로 서비스 작업이 반환된 후에는 요청 스트림에 액세스할 수 없습니다.
pl: Komunikat zawierający dany strumień został zamknięty. Należy pamiętać, że nie można otrzymać dostępu do strumieni żądania po powrocie z operacji usługi.
pt_br: A mensagem que contém este fluxo foi fechada. Note que os fluxos de solicitação não podem ser acessados depois que a operação de serviço é retornada.
tr: Bu akışı içeren ileti kapatıldı. İstek akışlarına, hizmet işlemi dönüşünden sonra erişilemeyeceğini unutmayın.
zh_hans: 包含此流的消息已关闭。请注意，服务操作返回后，无法访问请求流。
zh_hant: 包含此資料流的訊息已關閉。請注意，服務作業傳回後，則無法存取要求資料流。

# SFxStreamResponseMessageClosed
source: The message containing this stream has been closed.
cs: Zpráva obsahující tento proud byla zavřena.
de: Die Nachricht, die diesen Datenstrom enthält, wurde geschlossen.
es: Se cerró el mensaje que contiene esta secuencia.
fr: Le message contenant ce flux a été fermé.
it: Il messaggio contenente questo flusso è stato chiuso.
ja: このストリームを格納しているメッセージは閉じられています。
ko: 이 스트림을 포함하는 메시지가 닫혔습니다.
pl: Komunikat zawierający dany strumień został zamknięty.
pt_br: A mensagem que contém este fluxo foi fechada.
tr: Bu akışı içeren ileti kapatıldı.
zh_hans: 包含此流的消息已关闭。
zh_hant: 包含此資料流的訊息已關閉。

# SFxTerminatingOperationAlreadyCalled1
source: This channel cannot send any more messages because IsTerminating operation '{0}' has already been called.
cs: Tento kanál nemůže odeslat další zprávy, protože již byla volána operace IsTerminating {0}.
de: Dieser Kanal kann keine weiteren Nachrichten senden, da der IsTerminating-Vorgang "{0}" bereits aufgerufen wurde.
es: Este canal no puede enviar más mensajes porque ya se llamó a la operación IsTerminating "{0}".
fr: Ce canal ne peut envoyer aucun message supplémentaire car l'opération IsTerminating '{0}' a été appelée.
it: Il canale non è in grado di inviare altri messaggi perché l'operazione '{0}' IsTerminating è già stata chiamata.
ja: IsTerminating 操作 '{0}' が既に呼び出されているため、このチャネルでこれ以上メッセージを送信することはできません。
ko: IsTerminating 작업 '{0}'을(를) 이미 호출했으므로 이 채널은 추가 메시지를 보낼 수 없습니다.
pl: Dany kanał nie może wysłać więcej komunikatów, ponieważ operacja IsTerminating "{0}" już została wywołana.
pt_br: Este canal não pode enviar mais mensagens porque a operação IsTerminating '{0}' já foi chamada.
tr: IsTerminating işlemi '{0}' zaten çağrılmış olduğundan, bu kanal daha fazla ileti gönderemez.
zh_hans: 此通道无法再发送更多消息，因为已调用 IsTerminating 操作“{0}”。
zh_hant: 由於已呼叫 IsTerminating 作業 '{0}'，因此此通道無法再傳送訊息。

# SFxTimeoutOutOfRange0
source: Timeout must be greater than or equal to TimeSpan.Zero. To disable timeout, specify TimeSpan.MaxValue.
cs: Časový limit musí být větší než nula nebo se rovnat hodnotě TimeSpan.Zero. Pokud chcete časový limit zakázat, zadejte hodnotu TimeSpan.MaxValue.
de: Das Zeitlimit muss größer oder gleich TimeSpan.Zero sein. Geben Sie den TimeSpan.MaxValue an, um das Zeitlimit zu deaktivieren.
es: El tiempo de espera debe ser mayor o igual que TimeSpan.Zero. Para deshabilitar el tiempo de espera, especifique TimeSpan.MaxValue.
fr: Le délai d'expiration doit être supérieur ou égal à TimeSpan.Zero. Pour désactiver le délai d'expiration, spécifiez TimeSpan.MaxValue.
it: Il valore del timeout deve essere maggiore o uguale a TimeSpan.Zero. Per disabilitare il timeout, specificare TimeSpan.MaxValue.
ja: タイムアウトは TimeSpan.Zero 以上の値にする必要があります。タイムアウトを無効にするには、TimeSpan.MaxValue を指定してください。
ko: 제한 시간은 TimeSpan.Zero보다 크거나 같아야 합니다. 제한 시간을 사용하지 않도록 설정하려면 TimeSpan.MaxValue를 지정하세요.
pl: Limit czasu musi być większy lub równy wartości TimeSpan.Zero. Aby wyłączyć limit czasu, określ wartość TimeSpan.MaxValue.
pt_br: O tempo limite deve ser maior ou igual a TimeSpan.Zero. Para desabilitar o tempo limite, especifique TimeSpan.MaxValue.
tr: Zaman aşımı değeri, TimeSpan.Zero değerinden büyük ya da ona eşit olmalıdır. Zaman aşımını devre dışı bırakmak için TimeSpan.MaxValue değeri belirtin.
zh_hans: 超时必须大于或等于 TimeSpan.Zero。要禁用超时，请指定 TimeSpan.MaxValue。
zh_hant: Timeout 必須大於或等於 TimeSpan.Zero。若要停用逾時，請指定 TimeSpan.MaxValue。

# SFxTimeoutOutOfRangeTooBig
source: Timeouts larger than Int32.MaxValue TotalMilliseconds (approximately 24 days) cannot be honored. To disable timeout, specify TimeSpan.MaxValue.
cs: Časový limit větší než hodnota Int32.MaxValue TotalMilliseconds (přibližně 24 dní) nelze akceptovat. Pokud chcete časový limit zakázat, zadejte hodnotu TimeSpan.MaxValue.
de: Zeitlimits, die größer als Int32.MaxValue TotalMilliseconds (ca. 24 Tage) sind, können nicht akzeptiert werden. Geben Sie den TimeSpan.MaxValue an, um das Zeitlimit zu deaktivieren.
es: No se pueden aceptar valores de tiempo de espera mayores que Int32.MaxValue TotalMilliseconds (aproximadamente 24 días). Para deshabilitar el tiempo de espera, especifique TimeSpan.MaxValue.
fr: Les délais d'expiration supérieurs à Int32.MaxValue TotalMilliseconds (soit environ 24 jours) ne peuvent pas être appliqués. Pour désactiver le délai d'expiration, spécifiez TimeSpan.MaxValue.
it: Non è possibile rispettare i timeout in cui il valore di TotalMilliseconds è maggiore di Int32.MaxValue (circa 24 giorni). Per disabilitare il timeout, specificare TimeSpan.MaxValue.
ja: Int32.MaxValue TotalMilliseconds (約 24 日) よりも大きな値のタイムアウトは受け付けられません。タイムアウトを無効にするには、TimeSpan.MaxValue を指定してください。
ko: Int32.MaxValue TotalMilliseconds(약 24일)보다 큰 시간 제한은 허용되지 않습니다. 시간 제한을 사용하지 않으려면 TimeSpan.MaxValue를 지정하세요.
pl: Limity czasu większe niż Int32.MaxValue TotalMilliseconds (około 24 dni) nie mogą być uwzględniane. Aby wyłączyć limit czasu, określ wartość TimeSpan.MaxValue.
pt_br: Os tempos limites maiores que Int32.MaxValue TotalMilliseconds (aproximadamente 24 dias) não podem ser honrados. Para desabilitar o tempo limite, especifique TimeSpan.MaxValue.
tr: Int32.MaxValue TotalMilliseconds (yaklaşık 24 gün) değerinden büyük zaman aşımı değerleri dikkate alınmaz. Zaman aşımını devre dışı bırakmak için TimeSpan.MaxValue değeri belirtin.
zh_hans: 无法处理大于 Int32.MaxValue TotalMilliseconds (大约 24 天)的超时。要禁用超时，请指定 TimeSpan.MaxValue。
zh_hant: 無法遵循大於 Int32.MaxValue TotalMilliseconds (大約等於 24 天) 的逾時。若要停用逾時，請指定 TimeSpan.MaxValue。

# SFxTypedMessageCannotBeNull
source: Internal Error: The instance of the MessageContract cannot be null in {0}.
cs: Vnitřní chyba: Instance kontraktu MessageContract nemůže být prázdná hodnota v {0}.
de: Interner Fehler: Die Instanz von MessageContract kann in {0} nicht NULL sein.
es: Este error no proporcionó una traducción coincidente: {0}.
fr: Erreur interne : l'instance de MessageContract ne peut pas avoir une valeur null dans {0}.
it: Errore interno: l'istanza di MessageContract non può essere Null in {0}.
ja: 内部エラー: {0} で MessageContract のインスタンスを null にすることはできません。
ko: 내부 오류: MessageContract의 인스턴스는 {0}에서 null일 수 없습니다.
pl: Błąd wewnętrzny: Wystąpienie MessageContract nie może być równe null w elemencie {0}.
pt_br: Erro interno: a instância de MessageContract não pode ser nula em {0}.
tr: İç Hata: MessageContract örneği {0} içinde null olamaz.
zh_hans: 内部错误: MessageContract 的实例在 {0} 中不能为 null。
zh_hant: 內部錯誤: MessageContract 的執行個體在 {0} 中不可為 null。

# SFxTypedMessageCannotBeRpcLiteral
source: The operation '{0}' could not be loaded because it specifies "rpc-style" in "literal" mode, but uses message contract types or the System.ServiceModel.Channels.Message. This combination is disallowed -- specify a different value for style or use parameters other than message contract types or System.ServiceModel.Channels.Message.
cs: Operace {0} nebyla načtena, protože určuje styl rpc v literálovém režimu, ale používá typy kontraktů zpráv nebo parametr System.ServiceModel.Channels.Message. Tato kombinace není povolena - zadejte jinou hodnotu pro styl nebo použijte jiné parametry, než jsou typy kontraktů a System.ServiceModel.Channels.Message.
de: Der Vorgang "{0}" konnte nicht geladen werden, da er "rpc-style" im Modus "literal" angibt, jedoch Nachrichtenvertragstypen oder die System.ServiceModel.Channels.Message verwendet. Diese Kombination ist nicht zulässig. Geben Sie für die Style- oder Use-Parameter einen anderen Wert als Nachrichtenvertragstypen oder System.ServiceModel.Channels.Message an.
es: No se pudo cargar la operación '{0}' porque especifica "rpc-style" en modo "literal", pero usa tipos de contrato de mensaje o System.ServiceModel.Channels.Message. Esta combinación no se permite. Especifique un valor diferente para el estilo o use parámetros que no sean tipos de contrato de mensaje o System.ServiceModel.Channels.Message.
fr: Impossible de charger l'opération '{0} car elle spécifie 'rpc-style' dans le mode de 'literal', mais utilise des types de contrat de message ou System.ServiceModel.Channels.Message. Cette combinaison est interdite : spécifiez une autre valeur pour le style ou utilisez des paramètres autres que des types de contrat de message ou System.ServiceModel.Channels.Message.
it: Impossibile caricare l'operazione '{0}' perché specifica "rpc-style" in modalità "literal", ma utilizza tipi di contratto messaggio o System.ServiceModel.Channels.Message. Tale combinazione non è consentita. Specificare un valore diverso per lo stile o utilizzare parametri diversi da tipi di contratto messaggi o System.ServiceModel.Channels.Message.
ja: 操作 '{0}' を読み込めませんでした。原因は、この操作では "literal" モードの "rpc-style" が指定されていますが、メッセージ コントラクト型または System.ServiceModel.Channels.Message が使用されているためです。この組み合わせは許可されていません。style に別の値を指定するか、メッセージ コントラクト型や System.ServiceModel.Channels.Message 以外のパラメーターを使用してください。
ko: "literal" 모드에서 "rpc-style"을 지정하지만 메시지 계약 유형 또는 System.ServiceModel.Channels.Message를 사용하므로 '{0}' 작업을 로드할 수 없습니다. 이 조합은 허용되지 않습니다. 스타일에 대해 다른 값을 지정하거나, 메시지 계약 유형 또는 System.ServiceModel.Channels.Message 이외의 매개 변수를 사용하십시오.
pl: Operacja „{0}” nie mogła być załadowana, ponieważ określa styl „rpc-style” w trybie „literal”, ale korzysta z typów kontraktu lub z System.ServiceModel.Channels.Message. Ta kombinacja jest niedozwolona — określ inną wartość dla stylu lub użyj parametrów innych niż typy kontraktu komunikatu lub System.ServiceModel.Channels.Message.
pt_br: A operação '{0}' não pôde ser carregada porque ela especifica "rpc-style" no modo "literal", mas usa os tipos de contrato de mensagem ou a System.ServiceModel.Channels.Message. Essa combinação não é permitida -- especifique um valor diferente para o estilo ou use parâmetros diferentes dos tipos de contrato de mensagem ou System.ServiceModel.Channels.Message.
tr: "literal" modunda "rpc-style" belirtildiği halde ileti sözleşme türlerini ya da System.ServiceModel.Channels.Message öğesini kullandığından '{0}' işlemi yüklenemedi. Bu birleşime izin verilmez, stil için farklı bir değer belirtin ya da ileti sözleşme türlerinden veya System.ServiceModel.Channels.Message öğesinden farklı parametreler kullanın.
zh_hans: 无法加载操作“{0}”，因为它以 "literal" 模式指定了 "rpc-style"，但使用消息协定类型或 System.ServiceModel.Channels.Message。该组合不允许使用 -- 请为样式或用法参数指定消息协定类型或 System.ServiceModel.Channels.Message 之外的其他值。
zh_hant: 無法載入作業 '{0}'，因為它在 "literal" 模式中指定 "rpc-style"，但是使用訊息合約類型或 System.ServiceModel.Channels.Message。不允許此種組合。請為樣式指定不同值，或使用有別於訊息合約類型或 System.ServiceModel.Channels.Message 的參數。
