Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# EndpointListenerRequirementsCannotBeMetBy3
source: ChannelDispatcher requirements cannot be met by the IChannelListener for Binding '{0}' since the contract requires support for one of these channel types '{1}' but the binding only supports these channel types '{2}'.
cs: Požadavky třídy ChannelDispatcher nemohou být splněny třídou IChannelListener pro vazbu {0}, protože kontrakt vyžaduje podporu pro jeden z těchto typů kanálu {1}, ale vazba podporuje pouze typy kanálu {2}.
de: Die ChannelDispatcher-Anforderungen können durch den IChannelListener für die Bindung "{0}" nicht erfüllt werden, weil der Vertrag Unterstützung für einen dieser Kanaltypen "{1}" erfordert, die Bindung jedoch nur diese Kanaltypen "{2}" unterstützt.
es: ChannelDispatcher no puede cumplir los requisitos de IChannelListener para el enlace "{0}", ya que el contrato requiere compatibilidad con uno de estos tipos de canales "{1}" pero el enlace solo admite estos tipos de canales "{2}".
fr: Les exigences de ChannelDispatcher ne peuvent être satisfaites par IChannelListener pour la liaison '{0}', car le contrat nécessite la prise en charge de l'un de ces types de canal '{1}', alors que la liaison prend en charge seulement ces types de canal '{2}'.
it: IChannelListener non può soddisfare i requisiti di ChannelDispatcher per il binding '{0}' perché il contratto richiede il supporto per uno di questi tipi di canale '{1}', ma il binding supporta solo i tipi di canale '{2}'.
ja: バインド '{0}' の IChannelListener が ChannelDispatcher の要件を満たすことができません。コントラクトはチャネルの種類として '{1}' のいずれか 1 つのサポートを必要としていますが、バインドは種類が '{2}' のチャネルしかサポートしていません。
ko: 이러한 '{1}' 채널 형식 중 하나에 대한 지원이 계약에 필요하지만 바인딩이 '{2}' 채널 형식만 지원하므로, 바인딩 '{0}'에 대한 IChannelListener는 ChannelDispatcher 요구 사항을 충족할 수 없습니다.
pl: Interfejs IChannelListener nie może spełnić wymagań obiektu ChannelDispatcher dla powiązania „{0}”, ponieważ kontrakt wymaga obsługi jednego z typów kanałów „{1}”, a powiązanie obsługuje tylko następujące typy kanałów „{2}”.
pt_br: Os requisitos de ChannelDispatcher não podem ser atendidos pelo IChannelListener para a Associação '{0}' porque o contrato requer suporte para um desses tipos de canal '{1}', mas a associação apenas dá suporte a estes tipos de canal '{2}'.
tr: Anlaşma '{1}' kanal türlerinden birinin desteklenmesini zorunlu kılarken, bağlama yalnızca '{2}' kanal türlerini desteklediğinden, ChannelDispatcher gereksinimleri Binding '{0}' için IChannelListener tarafından karşılanamıyor.
zh_hans: 绑定“{0}”的 IChannelListener 无法满足 ChannelDispatcher 要求，因为协定需要支持通道类型“{1}”中的一种，但是绑定只支持通道类型“{2}”。
zh_hant: 繫結 '{0}' 的 IChannelListener 無法符合 ChannelDispatcher 需求，因為合約要求支援這些通道類型 '{1}' 的其中一種，但此繫結僅支援這些通道類型 '{2}'。

# EndpointNotFound
source: There was no endpoint listening at {0} that could accept the message. This is often caused by an incorrect address or SOAP action. See InnerException, if present, for more details.
cs: Na {0} neposlouchal žádný koncový bod, který by mohl přijmout zprávu. To je často způsobeno nesprávnou adresou nebo akcí SOAP. Další informace zjistíte podle hodnoty vlastnosti InnerException (je-li přítomna).
de: Es war kein an {0} lauschender Endpunkt vorhanden, der die Nachricht akzeptieren konnte. Dies wird häufig durch eine fehlerhafte Adresse oder SOAP-Aktion verursacht. Weitere Details finden Sie unter "InnerException" (sofern vorhanden).
es: No había ningún punto de conexión escuchando en {0} que pudiera aceptar el mensaje. La causa suele ser una dirección o una acción SOAP incorrecta. Consulte InnerException, si está presente, para obtener más información.
fr: Il n'existait pas de point de terminaison à l'écoute sur {0} pouvant accepter le message. Ceci est souvent dû à une adresse ou une action SOAP incorrecte. S'il est présent, consultez InnerException pour plus d'informations.
it: Non è disponibile alcun endpoint in ascolto su {0} in grado di accettare il messaggio. Questo problema dipende spesso da un'azione SOAP o da un indirizzo non corretto. Per maggiori dettagli, vedere InnerException, se presente.
ja: メッセージを受信できる {0} でリッスンしているエンドポイントがありませんでした。これは一般に、アドレスまたは SOAP アクションが正しくない場合に発生します。詳細については、InnerException を参照してください (もしあれば)。
ko: 메시지를 수락할 수 있는 {0}에서 수신 대기 중인 엔드포인트가 없습니다. 이것은 흔히 잘못된 주소나 SOAP 동작으로 인해 발생합니다. 자세한 내용은 InnerException(있을 경우)을 참조하세요.
pl: W elemencie {0} brak nasłuchującego punktu końcowego, który mógłby odebrać komunikat. Jest to często spowodowane niepoprawnym adresem lub akcją SOAP. Sprawdź właściwość InnerException (jeśli jest obecna), aby uzyskać więcej szczegółowych informacji.
pt_br: Não havia nenhum ponto de extremidade em escuta em {0} capaz de aceitar a mensagem. Em geral, isso é causado por endereço ou ação de SOAP incorretos. Consulte InnerException, se presente, para obter mais detalhes.
tr: {0} konumunda dinleme yapan, iletiyi kabul edebilecek uç nokta yoktu. Bunun nedeni genellikle hatalı bir adres ya da SOAP eylemidir. Ayrıntılar için varsa InnerException öğesine bakın.
zh_hans: 没有终结点在侦听可以接受消息的 {0}。这通常是由于不正确的地址或者 SOAP 操作导致的。如果存在此情况，请参见 InnerException 以了解详细信息。
zh_hant: 沒有任何在 {0} 上進行接聽的端點可以接受該訊息。這通常是由不正確位址或 SOAP 動作所造成。若有 InnerException，可參閱以取得詳細資訊。

# EntropyModeCannotHaveComputedKey
source: The issuer cannot provide a computed key in key entropy mode '{0}'.
cs: Vystavitel nemůže poskytnout vypočítaný klíč v režimu entropie klíče {0}.
de: Der Aussteller kann keinen berechneten Schlüssel im Schlüsselentropiemodus "{0}" bereitstellen.
es: El emisor no puede proporcionar una clave calculada en el modo de entropía de clave "{0}".
fr: L'émetteur ne peut pas fournir une clé calculée dans le mode d'entropie de clé '{0}'.
it: L'emittente non può fornire una chiave calcolata in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、発行者は計算されたキーを提供できません。
ko: 발급자가 키 엔트로피 모드 '{0}'에서 계산된 키를 제공할 수 없습니다.
pl: Wystawca nie może dostarczyć obliczonego klucza w trybie entropii klucza „{0}”.
pt_br: O emissor não pode fornecer uma chave calculada no modo de entropia de chave '{0}'.
tr: Veren, '{0}' anahtar entropi modunda hesaplanmış anahtar sağlayamıyor.
zh_hans: 颁发者无法在密钥熵模式“{0}”下提供计算密钥。
zh_hant: 簽發者無法在金鑰 Entropy 模式 '{0}' 下提供計算的金鑰。

# EntropyModeCannotHaveProofTokenOrIssuerEntropy
source: The issuer cannot provide key entropy or a proof token in key entropy mode '{0}'.
cs: Vystavitel nemůže poskytnout entropii klíče ani token důkazu v režimu entropie klíče {0}.
de: Der Aussteller kann keine Schlüsselentropie bzw. kein Prüftoken im Schlüsselentropiemodus "{0}" bereitstellen.
es: El emisor no puede proporcionar entropía de clave o un token de prueba en el modo de entropía de clave "{0}".
fr: L'émetteur ne peut pas fournir d'entropie de clé ou un jeton de preuve dans le mode d'entropie de clé '{0}'.
it: L'emittente non può fornire l'entropia chiave o un token di prova in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、発行者はキー エントロピまたは証明トークンを提供できません。
ko: 발급자가 키 엔트로피 모드 '{0}'에서 키 엔트로피 또는 증명 토큰을 제공할 수 없습니다.
pl: Wystawca nie może dostarczyć entropii klucza lub tokenu sprawdzającego w trybie entropii klucza „{0}”.
pt_br: O emissor não pode fornecer uma entropia de chave nem um token de prova no modo de entropia de chave '{0}'.
tr: Veren, '{0}' anahtar entropi modunda anahtar entropi veya düzeltme belirteci sağlayamıyor.
zh_hans: 颁发者无法在密钥熵模式“{0}”下提供密钥熵或证明令牌。
zh_hant: 簽發者無法在金鑰 Entropy 模式 '{0}' 下提供金鑰 Entropy 或證明權杖。

# EntropyModeCannotHaveRequestorEntropy
source: The client cannot provide key entropy in key entropy mode '{0}'.
cs: Klient nemůže poskytnout entropii klíče v režimu entropie klíče {0}.
de: Der Client kann keine Schlüsselentropie im Schlüsselentropiemodus "{0}" bereitstellen.
es: El cliente no puede proporcionar entropía de clave en el modo de entropía de clave "{0}".
fr: Le client ne peut pas fournir d'entropie de clé dans le mode d'entropie de clé '{0}'.
it: Il client non può fornire l'entropia chiave in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、クライアントはキー エントロピを提供できません。
ko: 클라이언트가 키 엔트로피 모드 '{0}'에서 키 엔트로피를 제공할 수 없습니다.
pl: Klient nie może dostarczyć entropii klucza w trybie entropii klucza „{0}”.
pt_br: O cliente não pode fornecer uma entropia de chave no modo de entropia de chave '{0}'.
tr: İstemci, '{0}' anahtar entropi modunda anahtar entropi sağlayamıyor.
zh_hans: 客户端无法在密钥熵模式“{0}”下提供密钥熵。
zh_hant: 用戶端無法在金鑰 Entropy 模式 '{0}' 下提供金鑰 Entropy。

# EntropyModeRequiresComputedKey
source: The issuer must provide a computed key in key entropy mode '{0}'.
cs: Vystavitel musí poskytnout vypočítaný klíč v režimu entropie klíče {0}.
de: Der Aussteller muss einen berechneten Schlüssel im Schlüsselentropiemodus "{0}" bereitstellen.
es: El emisor debe proporcionar una clave calculada en el modo de entropía de clave "{0}".
fr: L'émetteur doit fournir une clé calculée dans le mode d'entropie de clé '{0}'.
it: L'emittente deve fornire una chiave calcolata in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、発行者は計算されたキーを提供する必要があります。
ko: 발급자가 키 엔트로피 모드 '{0}'에서 계산된 키를 제공해야 합니다.
pl: Wystawca musi dostarczyć obliczony klucz w trybie entropii klucza „{0}”.
pt_br: O emissor deve fornecer uma chave calculada no modo de entropia de chave '{0}'.
tr: Veren, '{0}' anahtar entropi modunda hesaplanmış anahtar sağlamalıdır.
zh_hans: 颁发者必须在密钥熵模式“{0}”下提供计算密钥。
zh_hant: 簽發者必須在金鑰 Entropy 模式 '{0}' 下提供計算的金鑰。

# EntropyModeRequiresIssuerEntropy
source: The issuer must provide key entropy in key entropy mode '{0}'.
cs: Vystavitel musí poskytnout entropii klíče v režimu entropie klíče {0}.
de: Der Aussteller muss eine Schlüsselentropie im Schlüsselentropiemodus "{0}" bereitstellen.
es: El emisor debe proporcionar entropía de clave en el modo de entropía de clave "{0}".
fr: L'émetteur doit fournir une entropie de clé dans le mode d'entropie de clé '{0}'.
it: L'emittente deve fornire l'entropia chiave in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、発行者はキー エントロピを提供する必要があります。
ko: 발급자가 키 엔트로피 모드 '{0}'에서 키 엔트로피를 제공해야 합니다.
pl: Wystawca musi dostarczyć entropię klucza w trybie entropii klucza „{0}”.
pt_br: O emissor deve fornecer uma entropia de chave no modo de entropia de chave '{0}'.
tr: Veren, '{0}' anahtar entropi modunda anahtar entropi sağlamalıdır.
zh_hans: 颁发者必须在密钥熵模式“{0}”下提供密钥熵。
zh_hant: 簽發者必須在金鑰 Entropy 模式 '{0}' 下提供金鑰 Entropy。

# EntropyModeRequiresProofToken
source: The issuer must provide a proof token in key entropy mode '{0}'.
cs: Vystavitel musí poskytnout token důkazu v režimu entropie klíče {0}.
de: Der Aussteller muss ein Prüftoken im Schlüsselentropiemodus "{0}" bereitstellen.
es: El emisor debe proporcionar un token de prueba en el modo de entropía de clave "{0}".
fr: L'émetteur doit fournir un jeton de preuve dans le mode d'entropie de clé '{0}'.
it: L'emittente deve fornire un token di prova in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、発行者は証明トークンを提供する必要があります。
ko: 발급자가 키 엔트로피 모드 '{0}'에서 증명 토큰을 제공해야 합니다.
pl: Wystawca musi dostarczyć token sprawdzający w trybie entropii klucza „{0}”.
pt_br: O emissor deve fornecer um token de prova no modo de entropia de chave '{0}'.
tr: Veren, '{0}' anahtar entropi modunda düzeltme belirteci sağlamalıdır.
zh_hans: 颁发者必须在密钥熵模式“{0}”下提供证明令牌。
zh_hant: 簽發者必須在金鑰 Entropy 模式 '{0}' 下提供證明權杖。

# EntropyModeRequiresRequestorEntropy
source: The client must provide key entropy in key entropy mode '{0}'.
cs: Klient musí poskytnout klíčovou entropii v režimu entropie klíče {0}.
de: Der Client muss eine Schlüsselentropie im Schlüsselentropiemodus "{0}" bereitstellen.
es: El cliente debe proporcionar entropía de clave en el modo de entropía de clave "{0}".
fr: Le client doit fournir une entropie de clé dans le mode d'entropie de clé '{0}'.
it: Il client deve fornire l'entropia chiave in modalità entropia chiave '{0}'.
ja: キー エントロピ モード '{0}' では、クライアントがキー エントロピを提供する必要があります。
ko: 클라이언트가 키 엔트로피 모드 '{0}'에서 키 엔트로피를 제공해야 합니다.
pl: Klient musi dostarczyć entropię klucza w trybie entropii klucza „{0}”.
pt_br: O cliente deve fornecer uma entropia de chave no modo de entropia de chave '{0}'.
tr: İstemci '{0}' anahtar entropi modunda anahtar entropi sağlamalıdır.
zh_hans: 客户端必须在密钥熵模式“{0}”下提供密钥熵。
zh_hant: 用戶端必須在金鑰 Entropy 模式 '{0}' 中提供金鑰 Entropy。

# EnvelopeVersionNotSupported
source: Envelope Version '{0}' is not supported.
cs: Verze obálky {0} není podporována.
de: Die Umschlagversion "{0}" wird nicht unterstützt.
es: No se admite la versión de sobre "{0}".
fr: La version d'enveloppe '{0}' n'est pas prise en charge.
it: La versione '{0}' di Envelope non è supportata.
ja: エンベロープ バージョン '{0}' はサポートされていません。
ko: 봉투 버전 '{0}'이(가) 지원되지 않습니다.
pl: Wersja „{0}” schematu Envelope nie jest obsługiwana.
pt_br: Não há suporte à Versão de Envelope '{0}'.
tr: Envelope Version '{0}' desteklenmiyor.
zh_hans: 不支持信封版本“{0}”。
zh_hant: 不支援信封版本 '{0}'。

# EnvelopeVersionUnknown
source: Unrecognized envelope version: {0}.
cs: Nerozpoznaná verze obálky: {0}
de: Unbekannte Umschlagversion: {0}.
es: No se reconoce la versión de sobre: {0}.
fr: Version d'enveloppe non reconnue : {0}.
it: La versione di Envelope non è riconosciuta: {0}.
ja: 不明なエンベロープのバージョン: {0}。
ko: 인식할 수 없는 봉투 버전입니다. {0}.
pl: Nierozpoznana wersja schematu Envelope: {0}.
pt_br: Versão de envelope não reconhecida: {0}.
tr: Bilinmeyen zarf sürümü: {0}.
zh_hans: 无法识别的信封版本: {0}。
zh_hant: 無法辨識的信封版本: {0}。

# ErrorDeserializingKeyIdentifierClause
source: There was an error deserializing the security key identifier clause XML. Please see the inner exception for more details.
cs: Při deserializaci klauzule identifikátoru klíče zabezpečení kódu XML došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Deserialisieren des XML-Codes für die Sicherheitsschlüsselbezeichner-Klausel ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al deserializar el código XML de la cláusula de identificador de clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la désérialisation du code XML de la clause de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la deserializzazione dell'XML della clausola dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子句の XML の逆シリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자 절 XML을 deserialize하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas deserializacji kodu XML klauzuli identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao desserializar o XML da cláusula do identificador da chave de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Güvenlik anahtarı tanımlayıcısının yan tümce XML'i seri durumdan çıkarılırken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 反序列化安全密钥标识符子句 XML 时发生错误。请参见内部异常以了解详细信息。
zh_hant: 還原序列化安全性金鑰識別碼子句時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ErrorDeserializingKeyIdentifierClauseFromTokenXml
source: There was an error creating the security key identifier clause from the security token XML. Please see the inner exception for more details.
cs: Při vytváření klauzule identifikátoru klíče zabezpečení z tokenu zabezpečení XML došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Erstellen der Sicherheitsschlüsselbezeichner-Klausel aus dem XML-Code des Sicherheitstokens ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al crear la cláusula de identificador de clave de seguridad a partir del código XML del token de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la création de la clause de l'identificateur de la clé de sécurité à partir du code XML du jeton de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la creazione della clausola dell'identificatore della chiave di sicurezza dall'XML del token di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ トークンの XML からセキュリティ キー識別子句を作成しているときにエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 토큰 XML에서 보안 키 식별자 절을 만드는 동안 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas tworzenia klauzuli identyfikatora klucza zabezpieczeń z kodu XML tokenu zabezpieczającego. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao criar a cláusula do identificador da chave de segurança com base no XML do token de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Güvenlik belirteci XML'den güvenlik anahtarı tanımlayıcısı yan tümcesi oluşturulurken bir hata oluştu. Diğer ayrıntılar için iç özel duruma bakın.
zh_hans: 从安全令牌 XML 创建安全密钥标识符子句时发生错误。请参见内部异常以了解详细信息。
zh_hant: 從安全性權杖 XML 建立安全性金鑰識別碼子句時發生錯誤。如需詳細資訊，請參閱內部例外狀況。

# ErrorDeserializingTokenXml
source: There was an error deserializing the security token XML. Please see the inner exception for more details.
cs: Při deserializaci tokenu zabezpečení XML došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Deserialisieren des XML-Codes des Sicherheitstokens ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al deserializar el código XML del token de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la désérialisation du code XML du jeton de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la deserializzazione dell'XML del token di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ トークンの XML をシリアル化解除しているときにエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 토큰 XML을 deserialize하는 동안 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas deserializacji kodu XML tokenu zabezpieczającego. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao desserializar o XML do token de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Güvenlik belirteci XML'si seri durumdan çıkarılırken bir hata oluştu. Diğer ayrıntılar için iç özel duruma bakın.
zh_hans: 反序列化安全令牌 XML 时发生错误。请参见内部异常以了解详细信息。
zh_hant: 將安全性權杖 XML 還原序列化時發生錯誤。如需詳細資訊，請參閱內部例外狀況。

# ErrorSerializingKeyIdentifier
source: There was an error serializing the security key identifier. Please see the inner exception for more details.
cs: Při serializaci identifikátoru klíče zabezpečení došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Serialisieren des Sicherheitsschlüsselbezeichners ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al serializar el identificador de la clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la sérialisation de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la serializzazione dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子のシリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자를 직렬화하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas serializacji identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao serializar o identificador de chave de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Anahtar tanımlayıcısı serileştirilirken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 序列化安全密钥标识符时发生错误。请参见内部异常以了解详细信息。
zh_hant: 序列化安全性金鑰識別碼時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ErrorSerializingKeyIdentifierClause
source: There was an error serializing the security key identifier clause. Please see the inner exception for more details.
cs: Při deserializaci klauzule identifikátoru klíče zabezpečení došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Serialisieren der Sicherheitsschlüsselbezeichner-Klausel ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al serializar la cláusula de identificador de clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la sérialisation de la clause de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la serializzazione della clausola dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子句のシリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자 절을 직렬화하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas serializacji klauzuli identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao serializar a cláusula do identificador da chave de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Güvenlik anahtarı tanımlayıcısı yan tümcesi serileştirilirken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 序列化安全密钥标识符子句时发生错误。请参见内部异常以了解详细信息。
zh_hant: 序列化安全性金鑰識別碼子句時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ErrorSerializingSecurityToken
source: There was an error serializing the security token. Please see the inner exception for more details.
cs: Při serializaci tokenu zabezpečení došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Serialisieren des Sicherheitstokens ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al serializar el token de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la sérialisation du jeton de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la deserializzazione del token di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ トークンをシリアル化しているときにエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 토큰을 직렬화하는 동안 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas serializacji tokenu zabezpieczającego. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao serializar o token de segurança. Consulte a exceção interna para obter mais detalhes.
tr: Güvenlik belirteci serileştirilirken bir hata oluştu. Diğer ayrıntılar için iç özel duruma bakın.
zh_hans: 序列化安全令牌时发生错误。请参见内部异常以了解详细信息。
zh_hant: 將安全性權杖序列化時發生錯誤。如需詳細資訊，請參閱內部例外狀況。

# ExpectedElementMissing
source: Element '{0}' with namespace '{1}' not found.
cs: Element {0} s oborem názvů {1} nebyl nalezen.
de: Das erwartete Element "{0}" mit dem Namespace "{1}" wurde nicht gefunden.
es: No se encuentra el elemento "{0}" con el espacio de nombres "{1}".
fr: Impossible de localiser l'élément '{0}' avec l'espace de noms '{1}'.
it: L'elemento '{0}' con spazio dei nomi '{1}' non è stato trovato.
ja: 名前空間が '{1}' の要素 '{0}' が見つかりません。
ko: '{1}' 네임스페이스를 가진 '{0}' 요소를 찾을 수 없습니다.
pl: Nie znaleziono elementu „{0}” z przestrzenią nazw „{1}”.
pt_br: Elemento '{0}' com namespace '{1}' não encontrado.
tr: '{1}' ad alanına sahip '{0}' öğesi bulunamadı.
zh_hans: 未找到命名空间为“{1}”的元素“{0}”。
zh_hant: 找不到命名空間為 '{1}' 的元素 '{0}'。
