Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# TimeoutOnOpen
source: The open operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Otevřená operace nebyla dokončena ve vyhrazeném časovém intervalu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Das Öffnen wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La operación de apertura no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération d'ouverture ne s'est pas effectuée dans le délai imparti de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: L'operazione di apertura non è stata completata entro il timeout allocato pari a {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内に、開く操作は完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한({0}) 내에 열기 작업이 완료되지 않았습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja otwierania nie zakończyła się w ciągu przydzielonego limitu czasu {0}. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação de abertura não foi concluída no tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Açma işlemi ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 打开操作没有在分配的超时 {0} 内完成。分配给此操作的时间可能比超时长。
zh_hant: 開啟作業無法在預定的逾時 {0} 內完成。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutOnOperation
source: The operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Operace nebyla dokončena ve vyhrazeném časovém intervalu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Der Vorgang wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La operación no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération ne s'est pas effectuée dans le délai imparti de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: L'operazione non è stata completata entro il timeout allocato pari a {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内に操作が完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한인 {0} 내에 작업을 완료하지 못했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja nie została ukończona przed upływem wyznaczonego limitu czasu o wartości {0}. Być może czas przydzielony dla tej operacji stanowi część większego limitu czasu.
pt_br: A operação não foi concluída no tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: İşlem ayrılan {0} süre sonu içinde tamamlanmadı. Bu işlem için ayrılan süre, daha uzun bir süre sonu değerinin bir bölümü olabilir.
zh_hans: 操作没有在分配的超时 {0} 内完成。分配给此操作的时间可能比超时长。
zh_hant: 作業未在配置的逾時 ({0}) 內完成。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutOnRequest
source: The request operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Operace požadavku nebyla dokončena ve vyhrazeném časovém intervalu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Der Anforderungsvorgang wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La operación de solicitud no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération de demande ne s'est pas terminée dans le délai imparti de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Operazione di richiesta non completata entro il timeout assegnato di {0}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内に、要求操作は完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한({0}) 내에 요청 작업이 완료되지 않았습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja żądania nie zakończyła się w ciągu przydzielonego limitu czasu {0}. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação de solicitação não foi concluída dentro do tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: İstek işlemi ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 在分配的超时 {0} 内，请求操作没有完成。分配给此操作的时间可能已经是更长超时的一部分。
zh_hant: 要求作業無法在預定逾時 {0} 內完成。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutOnSend
source: The send operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Operace odeslání nebyla dokončena ve vyhrazeném časovém intervalu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Der Sendevorgang wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La operación de envío no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'opération d'envoi ne s'est pas terminée dans le délai imparti de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Operazione di invio non completata entro il timeout assegnato di {0}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内に、送信操作は完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한({0}) 내에 보내기 작업이 완료되지 않았습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja wysyłania nie zakończyła się w ciągu przydzielonego limitu czasu {0}. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A operação de envio não foi concluída dentro do tempo limite alocado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Gönderme işlemi ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 在分配的超时 {0} 内，发送操作没有完成。分配给此操作的时间可能已经是更长超时的一部分。
zh_hant: 傳送作業無法在預定逾時 {0} 內完成。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutServiceChannelConcurrentOpen1
source: Opening the channel timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit otevření kanálu vypršel po {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Öffnen des Kanals ist nach {0} ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La apertura del canal agotó el tiempo de espera después de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'ouverture du canal a dépassé le délai imparti après {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout dell'apertura del canale dopo {0}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: {0} 後にチャネルを開こうとしてタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {0} 이후에 채널 열기 시간 제한이 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Po {0} upłynął limit czasu otwierania kanału. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A abertura do canal atingiu o tempo limite após {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: Kanalı açma işlemi {0} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 打开通道在 {0} 之后超时。分配给此操作的时间可能比超时长。
zh_hant: 開啟通道在 {0} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# TimeoutServiceChannelConcurrentOpen2
source: Opening the {0} channel timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Časový limit otevření kanálu {0} vypršel po {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Öffnen des {0}-Kanals ist nach {1} ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: La apertura del canal {0} agotó el tiempo de espera después de {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'ouverture du canal {0} a dépassé le délai imparti après {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout dell'apertura del canale {0} dopo {1}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: {1} 後に {0} チャネルを開こうとしてタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {1} 이후에 {0} 채널 열기 시간 제한이 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Po {1} upłynął limit czasu otwierania kanału {0}. Czas przydzielony na tę operację mógł być częścią dłuższego limitu czasu.
pt_br: A abertura do canal {0} atingiu o tempo limite após {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} kanalını açma işlemi {1} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 打开 {0} 通道在 {1} 之后超时。分配给此操作的时间可能比超时长。
zh_hant: 開啟 {0} 通道在 {1} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# TimestampToSignHasNoId
source: The timestamp element added to security header to sign has no id.
cs: Element časového razítka přidaný do záhlaví zabezpečení k podpisu nemá identifikátor.
de: Das dem Sicherheitsheader hinzugefügte Zeitstempelelement weist keine ID auf.
es: El elemento de marca de tiempo agregado al encabezado de seguridad para firmar no tiene id.
fr: L'élément d'horodatage ajouté à l'en-tête de sécurité à signer ne contient pas d'id.
it: L'elemento timestamp aggiunto all'intestazione di sicurezza da firmare è privo di ID.
ja: 署名のためにセキュリティ ヘッダーに追加されたタイムスタンプの要素に ID がありません。
ko: 서명할 보안 헤더에 추가된 타임스탬프 요소에 ID가 없습니다.
pl: Element sygnatury czasowej dodany do nagłówka zabezpieczeń przeznaczonego do podpisania nie ma identyfikatora.
pt_br: O elemento de carimbo de data/hora adicionado ao cabeçalho de segurança para assinatura não tem identificação.
tr: İmzalamak için güvenlik üst bilgisine eklenen zaman damgası öğesinin kimliği yok.
zh_hans: 添加到安全标头进行签名的时间戳没有 ID。
zh_hant: 已新增到安全性標頭要簽署的時間戳記元素沒有識別碼。

# TokenCancellationNotSupported
source: The token provider '{0}' does not support token cancellation.
cs: Poskytovatel tokenu {0} nepodporuje možnost zrušit token.
de: Der Tokenanbieter "{0}" unterstützt den Tokenabbruch nicht.
es: El proveedor de token "{0}" no admite la cancelación de token.
fr: Le fournisseur de jetons '{0}' ne prend pas en charge l'annulation des jetons.
it: Il provider di token '{0}' non supporta l'annullamento dei token.
ja: トークン プロバイダー '{0}' はトークンのキャンセルをサポートしていません。
ko: 토큰 공급자 '{0}'은(는) 토큰 취소를 지원하지 않습니다.
pl: Dostawca tokenu „{0}” nie obsługuje anulowania tokenu.
pt_br: O provedor de token '{0}' não dá suporte ao cancelamento de token.
tr: '{0}' belirteç sağlayıcısı, belirteç iptal etmeyi desteklemiyor.
zh_hans: 令牌提供程序“{0}”不支持令牌取消。
zh_hant: 權杖提供者 '{0}' 不支援取消權杖。

# TokenCannotCreateSymmetricCrypto
source: A symmetric crypto could not be created from token '{0}'.
cs: Z tokenu {0} nelze vytvořit symetrickou šifru.
de: Es konnte keine symmetrische Verschlüsselung aus dem Token "{0}" erstellt werden.
es: No se pudo crear una clave criptográfica simétrica a partir del token "{0}".
fr: Impossible de créer un chiffrement symétrique à partir du jeton '{0}'.
it: Non è stato possibile creare una crittografia simmetrica dal token '{0}'.
ja: トークン '{0}' から対称暗号を作成できませんでした。
ko: '{0}' 토큰에서 대칭 암호를 만들 수 없습니다.
pl: Nie można z tokenu „{0}” utworzyć kryptografii asymetrycznej.
pt_br: Uma criptografia simétrica não pôde ser criada com base no token '{0}'.
tr: '{0}' belirtecinden simetrik bir şifre oluşturulamadı.
zh_hans: 无法根据令牌“{0}”创建对称加密。
zh_hant: 無法從權杖 '{0}' 建立對稱式加密。

# TokenDoesNotSupportKeyIdentifierClauseCreation
source: '{0}' does not support '{1}' creation.
cs: {0} nepodporuje vytvoření {1}.
de: "{0}" unterstützt nicht die Erstellung von "{1}".
es: "{0}" no admite la creación de "{1}".
fr: '{0}' ne prend pas en charge la création de '{1}'.
it: '{0}' non supporta la creazione di '{1}'.
ja: '{0}' は '{1}' の作成をサポートしていません。
ko: '{0}'이(가) '{1}' 작성을 지원하지 않습니다.
pl: Element „{0}” nie obsługuje tworzenia elementu „{1}”.
pt_br: '{0}' não dá suporte à criação de '{1}'.
tr: '{0}', '{1}' oluşturmayı desteklemiyor.
zh_hans: “{0}”不支持“{1}”创建。
zh_hant: '{0}' 不支援建立 '{1}'。

# TokenManagerCannotCreateTokenReference
source: The supplied token manager cannot create a token reference.
cs: Poskytnutý správce tokenů nemůže vytvořit odkaz na token.
de: Der angegebene Token-Manager kann keinen Tokenverweis erstellen.
es: El administrador de tokens proporcionado no puede crear una referencia de token.
fr: Le gestionnaire de jetons fourni ne peut pas créer de référence de jeton.
it: Il gestore del token specificato non è in grado di creare un riferimento token.
ja: 指定されたトークン マネージャーはトークンの参照を作成できません。
ko: 제공된 토큰 관리자가 토큰 참조를 만들 수 없습니다.
pl: Podany menedżer tokenów nie może utworzyć odwołania do tokenu.
pt_br: O gerenciador de token fornecido não pode criar uma referência de token.
tr: Sağlanan belirteç yöneticisi, bir belirteç başvurusu oluşturamıyor.
zh_hans: 提供的标记管理器无法创建标记引用。
zh_hant: 所提供的權杖管理員無法建立權杖參照。

# TokenManagerCouldNotReadToken
source: Security token manager could not parse token with name '{0}', namespace '{1}', valueType '{2}'.
cs: Správce tokenů zabezpečení neanalyzoval token s názvem {0}, oborem názvů {1} a typem valueType {2}.
de: Der Sicherheitstoken-Manager konnte das Token mit dem Namen "{0}", Namespace "{1}" und valueType "{2}" nicht analysieren.
es: El administrador de tokens de seguridad no pudo analizar el token con el nombre '{0}', espacio de nombres '{1}' y tipo de valor '{2}'.
fr: Le gestionnaire de jetons de sécurité n'a pas pu analyser le jeton contenant le nom '{0}', l'espace de noms '{1}' et valueType '{2}'.
it: Il gestore del token di sicurezza non è stato in grado di analizzare il token con nome '{0}', spazio dei nomi '{1}', valueType '{2}'.
ja: セキュリティ トークン マネージャーは、名前が '{0}'、名前空間が '{1}'、valueType が '{2}' であるトークンを解析できませんでした。
ko: 보안 토큰 관리자가 이름 '{0}', 네임스페이스 '{1}', valueType '{2}'인 토큰을 구문 분석할 수 없습니다.
pl: Menedżer tokenów zabezpieczających nie może przeanalizować tokenu o nazwie „{0}”, przestrzeni nazw „{1}”, typie valueType „{2}”.
pt_br: O gerenciador de token de segurança não pôde analisar o token com o nome '{0}', namespace '{1}', valueType '{2}'.
tr: Güvenlik belirteci yöneticisi belirteci çözümleyemedi, adı: '{0}', ad alanı: '{1}', valueType: '{2}'.
zh_hans: 安全标记管理器无法分析名称为“{0}”、命名空间为“{1}”、valueType 为“{2}”的标记。
zh_hant: 安全性權杖管理員無法剖析權杖，名稱 '{0}'、命名空間 '{1}'、valueType '{2}'。

# TokenMustBeNullWhenTokenParametersAre
source: The SecurityTokenParameters and SecurityToken tuple specified for use in the security header must both be null or must both be non-null.
cs: Parametr SecurityTokenParameters a záznam SecurityToken uvedený k použití v záhlaví zabezpečení musejí být oba prázdná hodnota nebo neprázdná hodnota.
de: Die SecurityTokenParameters und das für die Verwendung im Sicherheitsheader angegebene SecurityToken-Tupel müssen entweder beide NULL sein oder beide nicht NULL sein.
es: Los parámetros SecurityTokenParameters y la tupla de SecurityToken que se usan en el encabezado de seguridad deben ser ambos Null o ambos no Null.
fr: SecurityTokenParameters et le tuple SecurityToken spécifiés pour une utilisation dans l'en-tête de sécurité doivent tous deux être Null ou tous deux non Null.
it: I parametri SecurityTokenParameter e la tupla SecurityToken specificati per l'utilizzo nell'intestazione di sicurezza devono essere entrambi Null o non Null.
ja: セキュリティ ヘッダーで使用するために指定された SecurityTokenParameters と SecurityToken のタプルは、両方とも NULL であるか、両方とも NULL 以外である必要があります。
ko: 보안 헤더에서 사용하도록 지정한 SecurityTokenParameters 및 SecurityToken 튜플은 모두 null이거나 모두 null이 아니어야 합니다.
pl: Krotki SecurityTokenParameters i SecurityToken określone do użycia w nagłówku zabezpieczeń muszą być obie zerowe lub niezerowe.
pt_br: A tupla de SecurityTokenParameters e SecurityToken especificada para uso no cabeçalho de segurança deve ser nula ou não nula.
tr: Güvenlik üst bilgisinde kullanılmak üzere belirtilen SecurityTokenParameters ve SecurityToken değerlerinin her ikisi de boş olmalı ya da her ikisi de boş olmamalıdır.
zh_hans: 指定用于安全标头的 SecurityTokenParameters 和 SecurityToken 类型必须同时为空或同时非空。
zh_hant: 指定用於安全性標頭的 SecurityTokenParameters 及 SecurityToken 集合必須同時是 Null 或同時非 Null。

# TokenProviderCannotGetTokensForTarget
source: The token provider cannot get tokens for target '{0}'.
cs: Poskytovatel tokenů nemůže získat tokeny pro cíl {0}.
de: Der Tokenanbieter kann keine Token für Ziel "{0}" abrufen.
es: El proveedor de tokens no puede obtener tokens para el destino '{0}'.
fr: Le fournisseur de jetons ne peut pas obtenir de jeton pour la cible '{0}'.
it: Il provider di token non è in grado di ottenere token per la destinazione '{0}'.
ja: トークン プロバイダーはターゲット '{0}' 用のトークンを取得できません。
ko: 토큰 공급자가 '{0}' 대상에 대한 토큰을 가져올 수 없습니다.
pl: Dostawca tokenu nie może uzyskać tokenów dla celu „{0}”.
pt_br: O fornecedor de token não pode obter tokens para '{0}' de destino.
tr: Belirteç sağlayıcı '{0}' hedefi için belirteç alamıyor.
zh_hans: 标记提供程序无法获得目标“{0}”的标记。
zh_hant: 權杖提供者無法為目標 '{0}' 取得權杖。

# TokenProviderRequiresSecurityBindingElement
source: The security token manager requires the security binding element to be specified in order to create a token provider for requirement '{0}'.
cs: Správce tokenů zabezpečení vyžaduje zadání prvku vazby zabezpečení, aby byl vytvořen poskytovatel tokenů pro požadavek {0}.
de: Der Sicherheitstoken-Manager erfordert die Angabe des Sicherheitsbindungselements, um einen Tokenanbieter für die Anforderung "{0}" zu erstellen.
es: El administrador de tokens de seguridad requiere que se especifique el elemento de enlace de seguridad para crear un proveedor de tokens para el requisito '{0}'.
fr: Le gestionnaire de jetons de sécurité impose que l'élément de liaison de sécurité soit spécifié pour pouvoir créer un fournisseur de jetons pour la condition '{0}'.
it: Il gestore del token di sicurezza richiede la specifica dell'elemento associazione di sicurezza per poter creare un provider di token per il requisito '{0}'.
ja: セキュリティ トークン マネージャーでは、要件 '{0}' に対するトークン プロバイダーを作成できるように、セキュリティ バインド要素を指定する必要があります。
ko: 요구 사항 '{0}'에 대한 토큰 공급자를 만들려면 보안 토큰 관리자에서 보안 바인딩 요소를 지정해야 합니다.
pl: Menedżer tokenów zabezpieczających wymaga określenia elementu powiązania zabezpieczeń, aby można było utworzyć dostawcę tokenu dla wymagania „{0}”.
pt_br: O gerenciador de token de segurança requer que o elemento de associação de segurança seja especificado para criar um fornecedor de token para o requisito '{0}'.
tr: Güvenlik belirteci yöneticisi, '{0}' gereksinimi için bir belirteç sağlayıcısı oluşturmak üzere güvenlik bağlama öğesinin belirtilmesini gerektirir.
zh_hans: 安全标记管理器要求指定安全绑定元素，以便为要求“{0}”创建标记提供程序。
zh_hant: 安全性權杖管理員要求指定安全性繫結元素，這樣才能針對需求 '{0}' 建立權杖提供者。

# TokenProviderUnableToGetToken
source: The token provider '{0}' was unable to provide a security token.
cs: Poskytovatel tokenu {0} nemohl poskytnout token zabezpečení.
de: Der Tokenanbieter "{0}" konnte kein Sicherheitstoken bereitstellen.
es: El proveedor de token "{0}" no pudo proporcionar un token de seguridad.
fr: Le fournisseur de jetons '{0}' n'a pas pu fournir de jeton de sécurité.
it: Il provider di token '{0}' non è riuscito a fornire un token di sicurezza.
ja: トークン プロバイダー '{0}' はセキュリティ トークンを提供できませんでした。
ko: 토큰 공급자 '{0}'에서 보안 토큰을 제공하지 못했습니다.
pl: Dostawca tokenu „{0}” nie mógł zapewnić tokenu zabezpieczającego.
pt_br: O provedor de token '{0}' não pôde fornecer um token de segurança.
tr: '{0}' belirteç sağlayıcısı bir güvenlik belirteci sağlayamadı.
zh_hans: 令牌提供程序“{0}”无法提供安全令牌。
zh_hant: 權杖提供者 '{0}' 無法提供安全性權杖。

# TokenProviderUnableToRenewToken
source: The token provider '{0}' was unable to renew the security token.
cs: Poskytovatel tokenu {0} nemohl obnovit token zabezpečení.
de: Der Tokenanbieter "{0}" konnte das Sicherheitstoken nicht erneuern.
es: El proveedor de token "{0}" no pudo renovar un token de seguridad.
fr: Le fournisseur de jetons '{0}' n'a pas pu renouveler le jeton de sécurité.
it: Il provider di token '{0}' non è riuscito a rinnovare il token di sicurezza.
ja: トークン プロバイダー '{0}' はセキュリティ トークンを更新できませんでした。
ko: 토큰 공급자 '{0}'에서 보안 토큰을 갱신하지 못했습니다.
pl: Dostawca tokenu „{0}” nie mógł odnowić tokenu zabezpieczającego.
pt_br: O provedor de token '{0}' não pôde renovar o token de segurança.
tr: '{0}' belirteç sağlayıcısı güvenlik belirtecini yenileyemedi.
zh_hans: 令牌提供程序“{0}”无法续订安全令牌。
zh_hant: 權杖提供者 '{0}' 無法更新安全性權杖。

# TokenRenewalNotSupported
source: The token provider '{0}' does not support token renewal.
cs: Poskytovatel tokenu {0} nepodporuje možnost obnovit token.
de: Der Tokenanbieter "{0}" unterstützt die Tokenerneuerung nicht.
es: El proveedor de token "{0}" no admite la renovación de token.
fr: Le fournisseur de jetons '{0}' ne prend pas en charge le renouvellement des jetons.
it: Il provider di token '{0}' non supporta il rinnovo dei token.
ja: トークン プロバイダー '{0}' はトークンの更新をサポートしていません。
ko: 토큰 공급자 '{0}'은(는) 토큰 갱신을 지원하지 않습니다.
pl: Dostawca tokenu „{0}” nie obsługuje odnowienia tokenu.
pt_br: O provedor de token '{0}' não dá suporte à renovação de token.
tr: '{0}' belirteç sağlayıcısı, belirteç yenilemeyi desteklemiyor.
zh_hans: 令牌提供程序“{0}”不支持令牌续订。
zh_hant: 權杖提供者 '{0}' 不支援更新權杖。
