Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# UnexpectedEmptyElementExpectingClaim
source: The '{0}' from the '{1}' namespace is empty and does not specify a valid identity claim.
cs: {0} z oboru názvů {1} je prázdný a neudává platnou deklaraci identity.
de: "{0}" aus dem {1}-Namespace ist leer und gibt keinen gültigen Identitätsanspruch an.
es: El elemento "{0}" del espacio de nombres "{1}" está vacío y no especifica una notificación de identidad válida.
fr: Le '{0}' de l'espace de noms '{1}' est vide et ne spécifie pas une revendication d'identité valide.
it: L'elemento '{0}' dello spazio dei nomi '{1}' è vuoto e non specifica un'attestazione di identità valida.
ja: 名前空間 '{1}' からの '{0}' が空であり、有効な ID 要求が指定されていません。
ko: '{1}' 네임스페이스에서의 '{0}'이(가) 비어 있으며 유효한 ID 클레임을 지정하지 않습니다.
pl: Element „{0}” z przestrzeni nazw „{1}” jest pusty i nie określa prawidłowego oświadczenia tożsamości.
pt_br: O '{0}' do namespace '{1}' está vazio e não especifica uma declaração de identidade válida.
tr: '{1}' ad alanındaki '{0}' öğesi boş ve geçerli bir kimlik talebi belirtmiyor.
zh_hans: 来自命名空间“{1}”的“{0}”为空，且未指定有效的标识声明。
zh_hant: '{1}' 命名空間的 '{0}' 是空的，因而未指定有效的身分識別宣告。

source: Unexpected end of file.
cs: Neočekávaný konec souboru
de: Unerwartetes Dateiende.
es: Final de archivo inesperado.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりです。
ko: 예기치 않은 파일의 끝입니다.
pl: Nieoczekiwany koniec pliku.
pt_br: Final de arquivo inesperado.
tr: Beklenmeyen dosya sonu.
zh_hans: 意外的文件尾。
zh_hant: 未預期的檔案結尾。

# UnexpectedHttpResponseCode
source: The remote server returned an unexpected response: ({0}) {1}.
cs: Vzdálený server vrátil neočekávanou odpověď: ({0}) {1}.
de: Der Remoteserver hat eine unerwartete Antwort zurückgegeben: ({0}) {1}.
es: El servidor remoto devolvió una respuesta inesperada: ({0}) {1}.
fr: Le serveur distant a retourné une réponse inattendue : ({0}) {1}.
it: Il server ha restituito una risposta imprevista: ({0}) {1}.
ja: リモート サーバーから予期しない応答が返されました: ({0}) {1}。
ko: 원격 서버가 예기치 않은 응답을 반환했습니다. ({0}) {1}.
pl: Serwer zdalny zwrócił nieoczekiwaną odpowiedź: ({0}) {1}.
pt_br: O servidor remoto retornou uma resposta inesperada: ({0}) {1}.
tr: Uzak sunucu beklenmeyen bir yanıt döndürdü: ({0}) {1}.
zh_hans: 远程服务器返回了意外响应: ({0}) {1}。
zh_hant: 遠端伺服器傳回非預期的回應: ({0}) {1}。

# UnexpectedSecuritySessionClose
source: The security session received an unexpected close from the other party.
cs: Relace zabezpečení přijala neočekávané zavření od druhé strany.
de: Die Sicherheitssitzung hat eine unerwartete Schließen-Nachricht von dem anderen Teilnehmer empfangen.
es: La sesión de seguridad recibió un cierre inesperado de la otra parte.
fr: La session de sécurité a reçu une fermeture inattendue de l'autre partie.
it: La sessione di sicurezza ha ricevuto una chiusura non prevista dall'altra parte.
ja: セキュリティ セッションは相手側から予期しない終了を受信しました。
ko: 보안 세션이 상대방으로부터 필요하지 않은 닫기 요청을 받았습니다.
pl: Sesja zabezpieczeń odebrała nieoczekiwany komunikat o zamykaniu sesji od drugiej strony.
pt_br: A sessão de segurança recebeu um fechamento inesperado da outra parte.
tr: Güvenlik oturumu, diğer taraftan beklenmeyen bir kapatma aldı.
zh_hans: 安全会话收到来自另一方的意外关闭。
zh_hant: 安全性工作階段已從另一方接收意外的關閉。

# UnexpectedSecuritySessionCloseResponse
source: The security session received an unexpected close response from the other party.
cs: Relace zabezpečení přijala neočekávanou odpověď zavření od druhé strany.
de: Die Sicherheitssitzung hat eine unerwartete Schließen-Antwort von dem anderen Teilnehmer empfangen.
es: La sesión de seguridad recibió una respuesta de cierre inesperada de la otra parte.
fr: La session de sécurité a reçu une réponse de fermeture inattendue de l'autre partie.
it: La sessione di sicurezza ha ricevuto una risposta di chiusura non prevista dall'altra parte.
ja: セキュリティ セッションは相手側から予期しない終了応答を受信しました。
ko: 보안 세션이 상대방으로부터 필요하지 않은 닫기 응답을 받았습니다.
pl: Sesja zabezpieczeń odebrała nieoczekiwaną odpowiedź z wywołaniem zamknięcia sesji od drugiej strony.
pt_br: A sessão de segurança recebeu uma resposta de fechamento inesperado da outra parte.
tr: Güvenlik oturumu, diğer taraftan beklenmeyen bir kapatma yanıtı aldı.
zh_hans: 安全会话收到来自另一方的意外关闭响应。
zh_hant: 安全性工作階段已從另一方接收意外的關閉回應。

# UnexpectedTerminateSequence
source: The remote endpoint sent an unexpected terminate sequence message. Simplex clients do not process this message.
cs: Vzdálený koncový bod odeslal neočekávanou zprávu ukončení sekvence. Jednodušší klienti nezpracovávají tuto zprávu.
de: Der Remoteendpunkt hat eine unerwartete Nachricht zum Beenden der Sequenz gesendet. Simplex-Clients verarbeiten diese Nachricht nicht.
es: El extremo remoto envió un mensaje inesperado de finalización de secuencia. Los clientes símplex no procesan este mensaje.
fr: Le point de terminaison distant a envoyé un message de fin de séquence inattendu. Les clients simplex ne traitent pas ce message.
it: L'endpoint remoto ha inviato un messaggio di interruzione sequenza non previsto. I client simplex non elaborano il messaggio.
ja: リモート エンドポイントは、予期しないシーケンス終了メッセージを送信しました。シンプレックス クライアントはこのメッセージを処理しません。
ko: 원격 끝점이 필요하지 않은 시퀀스 종료 메시지를 보냈습니다. 단면 클라이언트가 이 메시지를 처리하지 않습니다.
pl: Zdalny punkt końcowy wysłał nieoczekiwany komunikat o zakończeniu sekwencji. Jednostronni klienci nie przetwarzają tego komunikatu.
pt_br: O ponto de extremidade remoto enviou uma mensagem de término de sequência inesperada. Os clientes Simplex não processam essa mensagem.
tr: Uzak bitiş noktası beklenmeyen sonlandırma sırası iletisi gönderdi. Tek yönlü istemciler bu iletiyi işlemez.
zh_hans: 远程终结点发送了意外的终止序列消息。单工客户端无法处理此消息。
zh_hant: 遠端端點傳送未預期的終止順序訊息。Simplex 用戶端不處理此訊息。

# UnexpectedXmlChildNode
source: XML child node {0} of type {1} is unexpected for element {2}.
cs: Podřízený uzel XML {0} typu {1} není pro element {2} očekáván.
de: Der untergeordnete XML-Knoten {0} vom Typ {1} wird für das Element {2} nicht erwartet.
es: No se espera el nodo secundario XML {0} de tipo {1} para el elemento {2}.
fr: Le nœud enfant XML {0} de type {1} est inattendu pour l'élément {2}.
it: Il nodo figlio XML {0} di tipo {1} non è previsto per l'elemento {2}.
ja: 型 {1} の XML 子ノード {0} は要素 {2} に対して予期されていません。
ko: {1} 형식의 XML 자식 노드 {0}은(는) 요소 {2}에 대해 예기치 않은 자식 노드입니다.
pl: Węzeł podrzędny XML {0} typu {1} jest nieoczekiwany dla elementu {2}.
pt_br: O nó filho XML {0} do tipo {1} é inesperado para o elemento {2}.
tr: {2} öğesi için {1} türündeki {0} XML alt düğümü beklenmiyor.
zh_hans: 类型为 {1} 的 XML 子节点 {0} 不是元素 {2} 所预期的。
zh_hant: 類型為 {1} 的 XML 子節點 {0} 不是元素 {2} 所預期的項目。

# UnknownComputedKeyAlgorithm
source: The computed key algorithm '{0}' is not supported.
cs: Vypočtený algoritmus klíče {0} není podporován.
de: Der berechnete Schlüsselalgorithmus "{0}" wird nicht unterstützt.
es: No se admite el algoritmo de clave calculada "{0}".
fr: L'algorithme de clé calculé '{0}' n'est pas pris en charge.
it: L'algoritmo '{0}' della chiave calcolata non è supportato.
ja: 計算されたキー アルゴリズム '{0}' はサポートされていません。
ko: 계산한 키 알고리즘 '{0}'이(가) 지원되지 않습니다.
pl: Algorytm klucza obliczanego „{0}” jest nieobsługiwany.
pt_br: Não há suporte para o algoritmo de chave computada '{0}'.
tr: '{0}' hesaplanan anahtar algoritması desteklenmiyor.
zh_hans: 不支持计算密钥算法“{0}”。
zh_hant: 不支援計算金鑰演算法 '{0}'。

# UnknownEncodingInBinarySecurityToken
source: Unrecognized encoding occurred while reading the binary security token.
cs: Při čtení binárního tokenu zabezpečení bylo nalezeno nerozpoznané kódování.
de: Beim Lesen des binären Sicherheitstokens ist eine unbekannte Codierung aufgetreten.
es: Codificación no reconocida al leer token de seguridad binario.
fr: Un encodage non reconnu s'est produit durant la lecture du jeton de sécurité binaire.
it: La codifica non è stata riconosciuta durante la lettura del token di sicurezza binario.
ja: バイナリ セキュリティ トークンの読み取り中に不明なエンコードが検出されました。
ko: 이진 보안 토큰을 읽는 동안 인식할 수 없는 인코딩을 찾았습니다.
pl: Podczas odczytu binarnego tokenu zabezpieczającego napotkano nierozpoznane kodowanie.
pt_br: Codificação não reconhecida ao ler o token de segurança binário.
tr: İkili güvenlik belirteci okunurken tanınmayan kodlama oluştu.
zh_hans: 读取二进制安全令牌时，遇到无法识别的编码。
zh_hant: 讀取二進位安全性權杖時發生無法辨識的編碼。

# UnknownEncodingInKeyIdentifier
source: Unrecognized encoding while reading key identifier.
cs: Při čtení identifikátoru klíče se zjistilo nerozpoznané kódování.
de: Unbekannte Codierung beim Lesen des Schlüsselbezeichners.
es: Codificación no reconocida al leer el identificador de clave.
fr: Encodage non reconnu durant la lecture d'un identificateur de clé.
it: Codifica non riconosciuta durante la lettura dell'identificatore chiave.
ja: キー ID を読み取るときの不明なエンコードです。
ko: 키 식별자를 읽는 중 인식할 수 없는 인코딩을 발견했습니다.
pl: Nierozpoznane kodowanie podczas odczytywania identyfikatora klucza.
pt_br: Codificação não reconhecida ao ler o identificador de chave.
tr: Anahtar tanımlayıcısı okunurken kodlama tanınmadı.
zh_hans: 读取密钥标识符时出现无法识别的编码。
zh_hant: 讀取金鑰識別碼時出現無法辨識的編碼。

# UnknownICryptoType
source: The ICrypto implementation '{0}' is not supported.
cs: Implementace ICrypto {0} není podporována.
de: Die ICrypto-Implementierung "{0}" wird nicht unterstützt.
es: No se admite la implementación ICrypto '{0}'.
fr: L'implémentation ICrypto '{0}' n'est pas prise en charge.
it: Implementazione ICrypto '{0}' non supportata.
ja: ICrypto 実装 '{0}' はサポートされていません。
ko: ICrypto 구현 '{0}'이(가) 지원되지 않습니다.
pl: Implementacja interfejsu ICrypto „{0}” nie jest obsługiwana.
pt_br: Não há suporte à implementação ICrypto '{0}'.
tr: '{0}' ICrypto uygulaması desteklenmiyor.
zh_hans: 不支持 ICrypto 实现“{0}”。
zh_hant: 不支援 ICrypto 實作 '{0}'。

# UnknownListenerType1
source: The listener at Uri '{0}' could not be initialized because it was created for an unrecognized channel type.
cs: Naslouchání na identifikátoru URI {0} nelze inicializovat, protože bylo vytvořeno pro nerozpoznaný typ kanálu.
de: Der Listener an URI "{0}" konnte nicht initialisiert werden, da er für einen unbekannten Kanaltyp erstellt wurde.
es: No se pudo inicializar la escucha en el URI "{0}" porque se creó para un tipo de canal no reconocido.
fr: L'écouteur à l'Uri '{0}' n'a pas pu être initialisé, car il a été créé pour un type de canal non reconnu.
it: Non è stato possibile inizializzare il listener nell'URI '{0}' perché è stato creato per un tipo di canale non riconosciuto.
ja: URI '{0}' のリスナーは、認識できないチャネルの種類用に作成されているため初期化できませんでした。
ko: 인식할 수 없는 채널 형식을 위해 만들어졌으므로 URI '{0}'에서 수신기를 초기화할 수 없습니다.
pl: Nie można zainicjować odbiornika dla identyfikatora URI „{0}”, ponieważ utworzono go dla nierozpoznanego typu kanału.
pt_br: O ouvinte URI '{0}' não pôde ser inicializado porque foi criado um tipo de canal não reconhecido.
tr: Tanınmayan bir kanal türü için oluşturulmuş olduğundan Uri '{0}' konumundaki dinleyici başlatılamadı.
zh_hans: 由于位于 URI“{0}”的侦听器是为无法识别的通道类型创建的，无法初始化该侦听器。
zh_hant: 無法初始化 Uri '{0}' 的接聽程式，因為無法識別此接聽程式的通道類型。

# UnknownSequenceFaultReason
source: The value of wsrm:Identifier is not a known Sequence identifier.
cs: Hodnota identifikátoru wsrm:Identifier není známý identifikátor sekvence.
de: Der Wert von "wsrm:Identifier" ist keine bekannte Sequenzkennung.
es: El valor de wsrm:Identifier no es un identificador de secuencia conocido.
fr: La valeur de wsrm:Identifier n'est pas un identificateur de séquence connu.
it: Il valore di wsrm:Identifier non è un identificatore Sequence conosciuto.
ja: wsrm:Identifier の値が既知のシーケンス ID ではありません。
ko: wsrm:Identifier 값이 알려진 시퀀스 식별자가 아닙니다.
pl: Wartość elementu wsrm:Identifier nie jest znanym identyfikatorem sekwencji.
pt_br: O valor de wsrm:Identifier não é um identificador de Sequência conhecido.
tr: wsrm:Identifier değeri, bilinen bir Sequence tanımlayıcısı değil.
zh_hans: WSRM:Identifier 的值不是已知的序列标识符。
zh_hant: wsrm:Identifier 的值不是已知的順序識別項。

# UnknownSequenceFaultReceived
source: The remote endpoint no longer recognizes this sequence. This is most likely due to an abort on the remote endpoint. {0} The reliable session was faulted.
cs: Vzdálený koncový bod již nerozpoznává tuto sekvenci. Pravděpodobně je to způsobeno přerušením u vzdáleného koncového bodu. {0} Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt erkennt diese Sequenz nicht mehr. Dies ist vermutlich auf einen Abbruch am Remoteendpunkt zurückzuführen. {0} Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto ya no reconoce esta secuencia. Probablemente se deba a una anulación en el extremo remoto. {0} Se generó un error en la sesión confiable.
fr: Le point de terminaison distant ne reconnaît plus cette séquence. Cet incident est probablement dû à un abandon sur le point de terminaison distant. {0} La session fiable a généré une erreur.
it: L'endpoint remoto non riconosce più la sequenza. È possibile che si sia verificata un'interruzione nell'endpoint remoto. {0} Sessione affidabile non riuscita.
ja: リモート エンドポイントでは、現在このシーケンスは認識されません。この原因として最も可能性が高いのは、リモート エンドポイント上での中止操作です。 {0} 信頼できるセッションは途中終了されました。
ko: 원격 끝점이 더 이상 이 시퀀스를 인식하지 않습니다. 원격 끝점에서의 중단이 원인일 수 있습니다. {0} 신뢰 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy nie rozpoznaje już tej sekwencji. Jest to prawdopodobnie spowodowane przerwaniem działania w zdalnym punkcie końcowym. {0} Wystąpił błąd uwierzytelnionej sesji.
pt_br: O ponto de extremidade remoto não reconhece mais essa sequência. Isso ocorre provavelmente devido a uma anulação no ponto de extremidade remoto. {0} Falha na sessão confiável.
tr: Uzak bitiş noktası artık bu sırayı tanımıyor. Bu, büyük bir olasılıkla uzak bitiş noktasındaki bir iptal işlemine bağlı olarak oluştu. {0} Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点不再能识别此序列。这很可能是由于远程终结点上发生中止。{0} 可靠会话出错。
zh_hant: 遠端端點無法再識別此順序。這很可能是由於遠端端點中止。{0} 可靠工作階段發生錯誤。

# UnknownSequenceMessageReceived
source: The remote endpoint has sent a message containing an unrecognized sequence identifier. The reliable session was faulted.
cs: Vzdálený koncový bod odeslal zprávu obsahující nerozpoznaný identifikátor sekvence. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat eine Nachricht gesendet, die einen unbekannten Sequenzbezeichner enthält. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto envió un mensaje que contiene un identificador de secuencia no reconocido. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a envoyé un message contenant un identificateur de séquence non reconnu. La session fiable a généré une erreur.
it: L'endpoint remoto ha inviato un messaggio contenente un identificatore di sequenza non riconosciuto. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、不明なシーケンス ID を含むメッセージを送信しました。信頼できるセッションは途中終了されました。
ko: 원격 끝점이 인식할 수 없는 시퀀스 식별자가 포함된 메시지를 보냈습니다. 신뢰 세션에서 오류가 발생했습니다.
pl: Zdalny punkt końcowy wysłał wiadomość zawierającą nierozpoznany identyfikator sekwencji. Wystąpił błąd uwierzytelnionej sesji.
pt_br: O ponto de extremidade remoto enviou uma mensagem contendo um identificador de sequência não reconhecido. Falha na sessão confiável.
tr: Uzak bitiş noktası, tanınmayan sıra tanımlayıcısı içeren bir ileti gönderdi. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点发送的消息包含无法识别的序列标识符。可靠的会话出错。
zh_hant: 遠端端點傳送的訊息包含無法辨識的順序識別項。可靠工作階段發生錯誤。

# UnknownTokenAttachmentMode
source: Unknown token attachment mode: {0}.
cs: Neznámý režim připojení tokenu: {0}.
de: Unbekannter Tokenanfügemodus: {0}.
es: Modo de datos adjuntos de token desconocido: {0}.
fr: Mode d'attachement de jeton inconnu : {0}.
it: Modalità assegnazione token sconosciuta: {0}.
ja: 不明なトークン添付モードです: {0}。
ko: 알 수 없는 토큰 첨부 모드: {0}.
pl: Nieznany tryb dołączania tokenu: {0}.
pt_br: Modo de anexação de token desconhecido: {0}.
tr: Bilinmeyen belirteç eki modu: {0}.
zh_hans: 未知令牌附件模式: {0}。
zh_hant: 未知的權杖附加模式: {0}。

# UnknownTokenAuthenticatorUsedInTokenProcessing
source: An unrecognized token authenticator '{0}' was used for token processing.
cs: Pro zpracování tokenu byla použita nerozpoznaná ověřovací data tokenů {0}.
de: Ein unbekannter Tokenauthentifizierer "{0}" wurde für die Tokenverarbeitung verwendet.
es: Se usó un autenticador de tokens no reconocido '{0}' para el procesamiento de tokens.
fr: Un authentificateur de jeton non reconnu '{0}' a été utilisé pour le traitement des jetons.
it: Per l'elaborazione token è stato utilizzato un autenticatore token '{0}'.
ja: 不明なトークン認証システム '{0}' がトークン処理に使用されました。
ko: 토큰 처리를 위해 인식할 수 없는 토큰 인증자 '{0}'을(를) 사용했습니다.
pl: Do przetwarzania tokenu użyto nierozpoznanego wystawcy uwierzytelnienia tokenu „{0}”.
pt_br: Um autenticador de token não reconhecido '{0}' foi usado para o processamento de token.
tr: Belirteç işleme için '{0}' tanınmayan belirteç kimlik doğrulayıcısı kullanıldı.
zh_hans: 无法识别的令牌身份验证器“{0}”被用于令牌处理。
zh_hant: 已將無法辨識的權杖驗證器 '{0}' 用於權杖處理。

# UnparsableCSResponse
source: The remote endpoint replied to the request for a sequence with a response that could not be parsed. See inner exception for details. The channel could not be opened.
cs: Vzdálený koncový bod odpověděl na požadavek na sekvenci odpovědí, kterou nelze analyzovat. Podrobnosti naleznete ve vnitřní výjimce. Kanál nelze otevřít.
de: Der Remoteendpunkt hat auf die Sequenzanforderung mit einer Antwort reagiert, die nicht analysiert werden konnte. Detaillierte Informationen finden Sie in der inneren Ausnahme. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto respondió a la solicitud de una secuencia con una respuesta que no se pudo analizar. Consulte la excepción interna para obtener más información. No se pudo abrir el canal.
fr: Le point de terminaison distant a répondu à la demande d'une séquence avec une réponse ne pouvant pas être analysée. Pour plus d'informations, consultez l'exception interne. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha risposto alla richiesta di una sequenza con una risposta che non è stato possibile analizzare. Per ulteriori dettagli, vedere l'eccezione interna. Impossibile aprire il canale.
ja: リモート エンドポイントは、シーケンス要求に対して解析できない応答を返しました。詳細については、内部例外を参照してください。チャネルを開けませんでした。
ko: 원격 끝점이 구문 분석할 수 없는 응답의 시퀀스에 대한 요청에 회신했습니다. 자세한 내용은 내부 예외를 참조하십시오. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy w odpowiedzi na żądanie sekwencji przesłał dane, których nie można przeanalizować. Szczegóły są dostępne w wewnętrznych wyjątkach. Nie można otworzyć kanału.
pt_br: O ponto de extremidade remoto respondeu à solicitação para uma sequência com uma resposta que não pôde ser analisada. Veja a exceção interna para obter detalhes. Não foi possível abrir o canal.
tr: Uzak bitiş noktası, bir sıra isteğine ayrıştırılamayan bir yanıtla cevap verdi. Ayrıntılar için iç özel duruma bakın. Kanal açılamadı.
zh_hans: 远程终结点使用无法分析的响应回复了序列的请求。有关详细信息，请参见内部异常。无法打开通道。
zh_hant: 無法剖析遠端端點回覆給順序要求的回應。如需詳細資訊，請參閱內部例外狀況。無法開啟通道。

# UnrecognizedClaimTypeForIdentity
source: The ClaimType '{0}' is not recognized. Expected ClaimType '{1}'.
cs: Typ ClaimType {0} není rozpoznán. Byl očekáván typ ClaimType {1}.
de: Der ClaimType "{0}" wird nicht erkannt. Erwartet wurde der ClaimType "{1}".
es: No se reconoce el tipo ClaimType "{0}". Se esperaba ClaimType "{1}".
fr: Le ClaimType '{0}' n'est pas reconnu. ClaimType attendu '{1}'.
it: L'elemento ClaimType '{0}' non è stato riconosciuto. È previsto l'elemento ClaimType '{1}'.
ja: ClaimType '{0}' は認識されません。ClaimType '{1}' が必要です。
ko: ClaimType '{0}'을(를) 인식할 수 없습니다. ClaimType '{1}'이(가) 필요합니다.
pl: Typ oświadczenia „{0}” nie jest rozpoznawany. Oczekiwano typu oświadczenia „{1}”.
pt_br: O ClaimType '{0}' não foi reconhecido. ClaimType '{1}' esperado.
tr: ClaimType '{0}' tanınmıyor. Beklenen ClaimType: '{1}'.
zh_hans: 无法识别 ClaimType“{0}”。意外的 ClaimType“{1}”。
zh_hant: 無法辨識 ClaimType '{0}'。應為 ClaimType '{1}'。

# UnrecognizedFaultReceived
source: The remote endpoint has sent an unrecognized fault with namespace, {0}, name {1}, and reason {2}. The reliable session was faulted.
cs: Vzdálený koncový bod odeslal nerozpoznanou chybu s oborem názvů {0}, názvem {1} a důvodem {2}. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat einen unbekannten Fehler mit Namespace {0}, Name {1} und Ursache {2} gesendet. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto envió un error no reconocido con el espacio de nombres {0}, nombre {1} y razón {2}. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a envoyé une faute non reconnue avec l'espace de noms, {0}, nom {1}, et la raison {2}. La session fiable a généré une erreur.
it: L'endpoint remoto ha inviato un errore non riconosciuto con spazio dei nomi, {0}, nome {1} e motivo {2}. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、名前空間 {0}、名前 {1}、および理由 {2} の認識されないフォールトを送信しました。信頼できるセッションは途中終了されました。
ko: 원격 끝점이 네임스페이스 {0}, 이름 {1} 및 원인 {2}의 인식할 수 없는 오류를 보냈습니다. 신뢰 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy wysłał nierozpoznany błąd obejmujący przestrzeń nazw, {0}, nazwę {1} oraz powód {2}. Wystąpił błąd uwierzytelnionej sesji.
pt_br: O ponto de extremidade remoto enviou uma falha não reconhecida com namespace {0}, nome {1} e motivo {2}. Falha na sessão confiável.
tr: Uzak bitiş noktası, {0} ad alanına sahip, {1} adlı ve {2} nedeni sonunda tanınmayan bir hata gönderdi. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点发送了无法识别的错误，命名空间为 {0}，名称为 {1}，原因为 {2}。可靠会话出错。
zh_hant: 遠端端點已傳送無法辨識錯誤，命名空間 {0}，名稱 {1} 及原因 {2}。可靠工作階段發生錯誤。

# UnrecognizedFaultReceivedOnOpen
source: The remote endpoint has sent an unrecognized fault with namespace, {0}, name {1}, and reason {2}. The channel could not be opened.
cs: Vzdálený koncový bod odeslal nerozpoznanou chybu s oborem názvů {0}, názvem {1} a důvodem {2}. Kanál nelze otevřít.
de: Der Remoteendpunkt hat einen unbekannten Fehler mit Namespace {0}, Name {1} und Ursache {2} gesendet. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto envió un error no reconocido con el espacio de nombres {0}, nombre {1} y razón {2}. No se pudo abrir el canal.
fr: Le point de terminaison distant a envoyé une faute non reconnue avec l'espace de noms, {0}, nom {1}, et la raison {2}. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha inviato un errore non riconosciuto con spazio dei nomi, {0}, nome {1} e motivo {2}. Impossibile aprire il canale.
ja: リモート エンドポイントは、名前空間 {0}、名前 {1}、および理由 {2} の認識できないフォールトを送信しました、チャネルを開けませんでした。
ko: 원격 끝점이 네임스페이스 {0}, 이름 {1} 및 원인 {2}의 인식할 수 없는 오류를 보냈습니다. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy wysłał nierozpoznany błąd obejmujący przestrzeń nazw, {0}, nazwę {1} oraz powód {2}. Nie można otworzyć kanału.
pt_br: O ponto de extremidade remoto enviou uma falha não reconhecida com namespace {0}, nome {1} e motivo {2}. Não foi possível abrir o canal.
tr: Uzak bitiş noktası, {0} ad alanına sahip, {1} adlı ve {2} nedeni sonunda tanınmayan bir hata gönderdi. Kanal açılamadı.
zh_hans: 远程终结点发送了无法识别的错误，命名空间为 {0}，名称为 {1}，原因为 {2}。无法打开通道。
zh_hant: 遠端端點已傳送無法辨識錯誤，命名空間 {0}，名稱 {1} 及原因 {2}。無法開啟通道。

# UnrecognizedIdentityPropertyType
source: Unrecognized identity property type: '{0}'.
cs: Nerozpoznaný typ vlastnosti identity: {0}.
de: Unbekannter Identitätseigenschaftstyp: "{0}".
es: Tipo de propiedad de identidad no reconocido: "{0}".
fr: Type de propriété d'identité non reconnu : '{0}'.
it: Tipo di proprietà di identità non riconosciuto: '{0}'.
ja: 認識されない ID のプロパティ タイプ: '{0}'。
ko: ID 속성 형식을 인식할 수 없습니다. '{0}'.
pl: Nierozpoznany typ właściwości tożsamości: „{0}”.
pt_br: Tipo de propriedade de identidade não reconhecida: '{0}'.
tr: Tanınmayan kimlik özelliği adı: '{0}'.
zh_hans: 无法识别的标识属性类型:“{0}”。
zh_hant: 無法辨識的身分識別屬性類型: '{0}'。
