Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SyncTaskMatchConsistency_Property6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must have the same value for the '{4}' property. In this case, the values are different. To fix it, change the '{4} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} typu {1} se shoduje s úlohově orientovanou asynchronní metodou OperationContract {2}, protože obě mají shodný název operace {3}. Pokud se synchronní metoda OperationContract shoduje s úlohově orientovanou asynchronní metodou OperationContract, musejí mít obě tyto metody OperationContract stejnou hodnotu vlastnosti {4}. V tomto případě jsou tyto hodnoty odlišné. Tento problém je možné odstranit tak, že změníte hodnotu vlastnosti {4} jedné z metod OperationContract tak, aby se obě shodovaly. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde der aufgabenbasierten asynchronen OperationContract-Methode "{2}" zugeordnet, da sie den gleichen Vorgangsnamen "{3}" besitzen. Wenn eine synchrone OperationContract-Methode einer aufgabenbasierten asynchronen OperationContract-Methode zugeordnet wird, müssen die beiden OperationContracts den gleichen Wert für die {4}-Eigenschaft aufweisen. In diesem Fall unterscheiden sich die Werte. Ändern Sie zum Korrigieren dieses Problems die {4}-Eigenschaft eines der OperationContracts, sodass er mit dem anderen Vertrag übereinstimmt. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract sincrónico en el tipo "{1}" coincide con el método "{2}" OperationContract asincrónico basado en tareas porque tienen el mismo nombre de operación "{3}". Cuando un método OperationContract sincrónico coincide con un método OperationContract asincrónico basado en tareas, los dos métodos OperationContract deben tener el mismo valor para la propiedad "{4}". En este caso, los valores son diferentes. Para solucionarlo, cambie la propiedad "{4}" de uno de los métodos OperationContracts para que coincida con el otro. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec la méthode OperationContract asynchrone basée sur les tâches '{2}', car elles contiennent le même nom d'opération '{3}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une méthode OperationContract asynchrone basée sur les tâches, les deux méthodes OperationContracts doivent avoir la même valeur pour la propriété '{4}'. Dans ce cas, les valeurs sont différentes. Pour corriger le problème, modifiez la propriété '{4}' d'une des méthodes OperationContracts pour les faire correspondre. D'une autre manière, le changement du nom de l'une des méthodes évite la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato al metodo OperationContract '{2}' asincrono basato su attività perché hanno lo stesso nome di operazione '{3}'. Quando un metodo OperationContract sincrono viene abbinato a un metodo OperationContract asincrono basato su attività, i due metodi OperationContract devono contenere lo stesso valore per la proprietà '{4}'. In questo caso i valori sono diversi. Per risolvere il problema, modificare la proprietà '{4}' di uno dei metodi OperationContract in modo che siano uguali. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、タスクベースの非同期 OperationContract メソッド '{2}' と同じ操作名 '{3}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドがタスクベースの非同期 OperationContract メソッドに対応付けられた場合は、2 つの OperationContract の '{4}' プロパティの値が同じである必要があります。このケースでは、値が異なります。この問題を修正するには、いずれかの OperationContract の '{4}' プロパティを変更して、他の '{4}' プロパティと一致させます。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 작업 기반 비동기 OperationContract 메서드 '{2}'과(와) 같은 작업 이름 '{3}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 작업 기반 비동기 OperationContract 메서드와 일치하는 경우 두 OperationContract 모두 '{4}' 속성에 대해 동일한 값을 가져야 합니다. 이 경우 값이 달라집니다. 이를 해결하려면 두 OperationContract 중 하나의 '{4}' 속성을 다른 속성과 일치하도록 변경하세요. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Synchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do opartej na zadaniach asynchronicznej metody klasy OperationContract „{2}”, ponieważ zawierają one operację o takiej samej nazwie „{3}”. Gdy synchroniczna metoda klasy OperationContract jest dopasowywana do opartej na zadaniach asynchronicznej metody klasy OperationContract, obie klasy OperationContract muszą mieć taką samą wartość właściwości „{4}”. W tym przypadku te wartości są różne. Aby rozwiązać ten problem, popraw wartość właściwości „{4}” w jednej z klas OperationContract, tak aby pasowała do drugiej. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com o método assíncrono OperationContract baseado em tarefa '{2}' porque eles têm o mesmo nome de operação '{3}'. Quando um método síncrono OperationContract coincide com um método assíncrono OperationContract baseado em tarefa, os dois OperationContracts devem ter o mesmo valor para a propriedade '{4}'. Nesse caso, os valores são diferentes. Para corrigir isso, altere a propriedade '{4}' de um dos OperationContracts para coincidir com a outra. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{3}' işlem adına sahip olduklarından '{1}' türü içindeki zaman uyumlu OperationContract metodu '{0}' ile görev tabanlı asenkron OperationContract metodu '{2}' eşleştirildi. Zaman uyumlu bir OperationContract metodu görev tabanlı asenkron bir OperationContract metoduyla eşleştirildiğinde, iki OperationContract metodunun '{4}' özelliği aynı değere sahip olmalıdır. Bu durumda, değerler farklıdır. Düzeltmek için, bir OperationContract'in '{4}' özelliğini diğeriyle eşleşecek şekilde değiştirin. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与基于任务的异步 OperationContract 方法“{2}”匹配，因为它们具有相同的操作名称“{3}”。当同步 OperationContract 方法与基于任务的异步 OperationContract 方法匹配时，两个 OperationContract 必须具有相同的“{4}”属性值。在本例中，这些值不同。若要修复此问题，请更改其中一个 OperationContract 的“{4}”属性以匹配另一个。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 中的同步 OperationContract 方法 '{0}' 符合以工作為基礎的非同步 OperationContract 方法 '{2}'，因為它們都有相同的作業名稱 '{3}'。如果同步 OperationContract 方法符合以工作為基礎的非同步 OperationContract 方法，兩個 OperationContract 的 '{4}' 屬性值就會相同。在這種狀況下，兩個值是不同的。若要修正此問題，請變更其中一個 OperationContract 的 '{4} 屬性，使其彼此相符。或者也可以變更其中一個方法的名稱，即可避免發生相符狀況。

# SyncTaskMatchConsistency_ReturnType5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{2}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} typu {1} se shoduje s úlohově orientovanou asynchronní metodou OperationContract {2}, protože obě mají shodný název operace {3}. Pokud se synchronní metoda OperationContract shoduje s úlohově orientovanou asynchronní metodou OperationContract, musejí obě tyto metody OperationContract definovat stejný návratový typ. V tomto případě jsou tyto návratové typy rozdílné. Tento problém je možné odstranit tak, že zajistíte, aby metoda {0} i metoda {2} měly stejný návratový typ. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde der aufgabenbasierten asynchronen OperationContract-Methode "{2}" zugeordnet, da sie den gleichen Vorgangsnamen "{3}" besitzen. Wenn eine synchrone OperationContract-Methode einer aufgabenbasierten asynchronen OperationContract-Methode zugeordnet wird, müssen die beiden OperationContracts den gleichen Rückgabetyp definieren. In diesem Fall unterscheiden sich die Rückgabetypen. Stellen Sie sicher, dass die Methoden "{0}" und "{2}" über den gleichen Rückgabetyp verfügen, um dieses Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract sincrónico en el tipo "{1}" coincide con el método "{2}" OperationContract asincrónico basado en tareas porque tienen el mismo nombre de operación "{3}". Cuando un método OperationContract sincrónico coincide con un método OperationContract asincrónico basado en tareas, los dos métodos OperationContract deben definir el mismo tipo de valor devuelto. En este caso, los tipos de valores devueltos son diferentes. Para solucionarlo, asegúrese de que ese método "{0}" y el método "{2}" tienen el mismo tipo de valor devuelto. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec la méthode OperationContract asynchrone basée sur les tâches '{2}', car elles contiennent le même nom d'opération '{3}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une méthode OperationContract asynchrone basée sur les tâches, les deux méthodes OperationContracts doivent définir le même type de retour. Dans ce cas, les types de retour sont différents. Pour corriger le problème, vérifiez que la méthode '{0}' et la méthode '{2}' ont le même type de retour. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato al metodo di OperationContract '{2}' asincrono basato su attività perché hanno lo stesso nome di operazione '{3}'. Quando un metodo OperationContract sincrono viene abbinato a un metodo OperationContract asincrono basato su attività, i due metodi OperationContract devono definire lo stesso tipo restituito. In questo caso i tipi restituiti sono diversi. Per risolvere il problema, assicurarsi che il metodo '{0}' e il metodo '{2}' contengano lo stesso tipo restituito. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、タスクベースの非同期 OperationContract メソッド '{2}' と同じ操作名 '{3}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドがタスクベースの非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract では同じ戻り値の型を定義する必要があります。このケースでは、戻り値の型が異なります。この問題を修正するには、メソッド '{0}' とメソッド '{3}' の戻り値の型を同じにしてください。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 작업 기반 비동기 OperationContract 메서드 '{2}'과(와) 같은 작업 이름 '{3}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 작업 기반 비동기 OperationContract 메서드와 일치하는 경우 두 OperationContract 모두 동일한 반환 형식을 정의해야 합니다. 이 경우 반환 형식이 달라집니다. 이를 해결하려면 메서드 '{0}'과(와) 메서드 '{2}'의 반환 형식이 동일한지 확인해야 합니다. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Synchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do opartej na zadaniach asynchronicznej metody klasy OperationContract „{2}”, ponieważ zawierają one operację o takiej samej nazwie „{3}”. Gdy synchroniczna metoda klasy OperationContract jest dopasowywana do opartej na zadaniach asynchronicznej metody klasy OperationContract, obie klasy OperationContract muszą definiować taki sam zwracany typ. W tym przypadku zwracane typy są różne. Aby rozwiązać ten problem, upewnij się, że metoda „{0}” i metoda „{2}” mają taki sam zwracany typ. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com o método assíncrono OperationContract baseado em tarefa '{2}' porque eles têm o mesmo nome de operação '{3}'. Quando um método síncrono OperationContract coincide com um método assíncrono OperationContract baseado em tarefa, os dois OperationContracts devem definir o mesmo tipo de retorno. Nesse caso, os tipos de retorno são diferentes. Para corrigir isso, verifique se os métodos '{0}' e '{2}' têm o mesmo tipo de retorno. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{3}' işlem adına sahip olduklarından '{1}' türü içindeki zaman uyumlu OperationContract metodu '{0}' ile görev tabanlı asenkron OperationContract metodu '{2}' eşleştirildi. Zaman uyumlu bir OperationContract metodu görev tabanlı asenkron bir OperationContract metoduyla eşleştirildiğinde, iki OperationContract tarafından aynı dönüş türü tanımlanmalıdır. Bu durumda, dönüş türleri farklıdır. Bunu düzeltmek için, '{0}' metodu ile '{2}' metodunun aynı dönüş türüne sahip olduğundan emin olun. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与基于任务的异步 OperationContract 方法“{2}”匹配，因为它们具有相同的操作名称“{3}”。当同步 OperationContract 方法与基于任务的异步 OperationContract 方法匹配时，两个 OperationContract 必须定义相同的返回类型。在本例中，返回类型不同。若要修复此问题，请确保方法“{0}”和方法“{2}”具有相同的返回类型。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合以工作為基礎的非同步 OperationContract 方法 '{2}'，因為它們具有相同的作業名稱 '{3}'。當同步 OperationContract 方法符合以工作為基礎的非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同的傳回型別。在此例中，傳回型別不同。若要修正此問題，請確認方法 '{0}' 與方法 '{2}' 具有相同的傳回型別。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# SynchronizedCollectionWrongType1
source: A value of type '{0}' cannot be added to the generic collection, because the collection has been parameterized with a different type.
cs: Hodnotu typu {0} nelze přidat do obecné kolekce, protože kolekce byla opatřena parametry jiného typu.
de: Ein Wert vom Typ "{0}" kann der generischen Sammlung nicht hinzugefügt werden, weil die Sammlung mit einem anderen Typ parametrisiert wurde.
es: No se puede agregar un valor de tipo "{0}" a la colección genérica, porque ya se incluyó en la colección un parámetro con un tipo diferente.
fr: Impossible d'ajouter une valeur de type '{0}' à la collection générique, car cette dernière a été paramétrée avec un autre type.
it: Non è possibile aggiungere un valore di tipo '{0}' alla raccolta generica perché alla raccolta sono stati assegnati parametri di un tipo diverso.
ja: 汎用コレクションに '{0}' 型の値を追加できません。これは、そのコレクションが異なる型でパラメーター化されていたためです。
ko: 컬렉션의 매개 변수가 서로 다른 형식이므로 '{0}' 형식의 값을 제네릭 컬렉션에 추가할 수 없습니다.
pl: Wartości typu „{0}” nie można dodawać do kolekcji ogólnej, ponieważ kolekcja ta została sparametryzowana przy użyciu innego typu.
pt_br: Um valor do tipo '{0}' não pode ser adicionado à coleção genérica, porque a coleção foi parametrizada com um tipo diferente.
tr: Koleksiyon, farklı bir türle parametreli hale getirildiğinden, '{0}' türünde bir değer genel koleksiyona eklenemiyor.
zh_hans: 类型为“{0}”的值无法添加到泛型集合，因为该集合已使用其他类型参数化。
zh_hant: 因為集合已用不同的類型進行參數化，所以無法將類型 '{0}' 的值新增到一般集合。

# SynchronizedCollectionWrongTypeNull
source: A null value cannot be added to the generic collection, because the collection has been parameterized with a value type.
cs: Do obecné kolekce nelze přidat prázdnou hodnotu, protože kolekce byla opatřena parametry typu hodnota.
de: Ein NULL-Wert kann der generischen Sammlung nicht hinzugefügt werden, weil die Sammlung mit einem Werttyp parametrisiert wurde.
es: No se puede agregar un valor nulo a la colección genérica, porque ya se incluyó en la colección un parámetro con un tipo de valor.
fr: Impossible d'ajouter une valeur null à la collection générique, car cette dernière a été paramétrée avec un type valeur.
it: Non è possibile aggiungere un valore Null alla raccolta generica perché alla raccolta è stato assegnato un parametro di tipo valore.
ja: 汎用コレクションに null 値を追加できません。これは、そのコレクションが値型でパラメーター化されていたためです。
ko: 컬렉션의 매개 변수가 값 형식이므로 null 값을 제네릭 컬렉션에 추가할 수 없습니다.
pl: Wartości null nie można dodawać do kolekcji ogólnej, ponieważ kolekcja ta została sparametryzowana przy użyciu pewnego typu wartości.
pt_br: Não é possível adicionar um valor nulo à coleção genérica, porque a coleção foi parametrizada com um tipo de valor.
tr: Koleksiyon bir değer türüyle parametreli hale getirildiğinden genel koleksiyona bir null değer eklenemez.
zh_hans: null 值无法添加到泛型集合，因为该集合已使用值类型参数化。
zh_hant: 因為集合已利用實值型別進行了參數化，所以無法將 Null 值新增到一般集合。

# TargetAddressIsNotSet
source: The target service address was not specified on '{0}'.
cs: Adresa cílové služby není určena v {0}.
de: Die Adresse des Zieldiensts wurde auf "{0}" nicht angegeben.
es: No se especificó la dirección de servicio de destino en '{0}'.
fr: L'adresse du service cible n'a pas été spécifiée sur '{0}'.
it: Indirizzo del servizio di destinazione non specificato su '{0}'.
ja: 対象のサービス アドレスは '{0}' で指定されていません。
ko: 대상 서비스 주소가 '{0}'에서 지정되지 않았습니다.
pl: Dla „{0}” nie określono adresu docelowego usługi.
pt_br: O endereço de destino do serviço não foi especificado em '{0}'.
tr: Hedef hizmet adresi, '{0}' üstünde belirtilmemiş.
zh_hans: 未在“{0}”上指定目标服务地址。
zh_hant: 未對 '{0}' 指定目標服務位址。
