Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# UnrecognizedIdentityType
source: Unrecognized identity type Name='{0}', Namespace='{1}'.
cs: Nerozpoznaný typ identity Název={0}, Obor názvů={1}.
de: Unbekannter Identitätstyp mit Name="{0}", Namespace="{1}".
es: Tipo de identidad no reconocido Nombre="{0}", Espacio de nombres="{1}".
fr: Type d'identité non reconnu : Name='{0}', Namespace='{1}'.
it: Tipo di identità non riconosciuto. Nome '{0}', spazio dei nomi '{1}'.
ja: 認識されない ID の種類の名前='{0}'、名前空間='{1}'。
ko: 이름='{0}', 네임스페이스='{1}'의 ID 형식을 인식할 수 없습니다.
pl: Nierozpoznany typ tożsamości: nazwa=„{0}”, przestrzeń nazw=„{1}”.
pt_br: Tipo de identidade não reconhecido Nome='{0}', Namespace='{1}'.
tr: Tanınmayan kimlik türü: Name='{0}', Namespace='{1}'.
zh_hans: 无法识别的标识类型 Name=“{0}”，Namespace=“{1}”。
zh_hant: 身分識別類型 Name='{0}'，Namespace='{1}' 無法辨識。

# UnsecuredMessageFaultReceived
source: An unsecured or incorrectly secured fault was received from the other party. See the inner FaultException for the fault code and detail.
cs: Od druhé strany byla přijata nezabezpečená nebo chybně zabezpečená chyba. Kód chyby a podrobnosti naleznete ve vnitřní výjimce FaultException.
de: Ein nicht gesicherter oder fehlerhaft gesicherter Fehler wurde vom anderen Teilnehmer empfangen. Den Fehlercode und Details finden Sie unter der inneren FaultException.
es: Se recibió un error no seguro o protegido incorrectamente de la otra parte. Consulte la excepción FaultException interna para ver el código del error y obtener más información.
fr: Une faute non sécurisée ou incorrectement sécurisée a été reçue de l'autre partie. Voir le FaultException interne pour le code et les détails de la faute.
it: Errore non protetto o protetto in modo non corretto ricevuto dall'altra parte . Per il codice di errore e ulteriori dettagli, vedere FaultException interno.
ja: セキュリティで保護されていないか正しくセキュリティで保護されていないフォールトを相手側から受信しました。フォールト コードおよび詳細については、内部の FaultException を参照してください。
ko: 상대방으로부터 보호되지 않거나 잘못 보호된 오류를 받았습니다. 오류 코드 및 세부 정보는 내부 FaultException을 참조하십시오.
pl: Odebrano niezabezpieczony lub nieprawidłowo zabezpieczony błąd od drugiej strony. Kod i szczegóły błędu można uzyskać w wewnętrznym wyjątku FaultException.
pt_br: Uma falha protegida incorretamente ou não protegida foi recebida da outra parte. Veja a FaultException interna para obter detalhes do código da falha.
tr: Diğer taraftan korunmayan ya da hatalı biçimde korunan hata alındı. Hata kodu ve ayrıntılar için iç FaultException değerine bakın.
zh_hans: 从另一方收到未进行安全处理或安全处理不正确的错误。有关错误代码和详细信息，请参见内部 FaultException。
zh_hant: 從另一方接收了不安全的錯誤。如需錯誤碼及詳細資料，請參閱內部 FaultException。

# UnsupportedAlgorithmForCryptoOperation
source: The algorithm {0} is not supported for operation {1}.
cs: Algoritmus {0} se pro operaci {1} nepodporuje.
de: Der Algorithmus "{0}" wird für den Vorgang {1} nicht unterstützt.
es: El algoritmo {0} no es compatible con la operación {1}.
fr: L'algorithme {0} n'est pas pris en charge pour l'opération {1}.
it: L'algoritmo {0} non è supportato per l'operazione {1}.
ja: アルゴリズム {0} は処理 {1} ではサポートされていません。
ko: {0} 알고리즘은 {1} 작업에 지원되지 않습니다.
pl: Algorytm {0} nie jest obsługiwany dla operacji {1}.
pt_br: O algoritmo {0} não tem suporte para a operação {1}.
tr: {0} algoritması {1} işlemi için desteklenmiyor.
zh_hans: 操作 {1} 不支持算法 {0}。
zh_hant: 對作業 {1} 不支援演算法 {0}。

# UnsupportedBinaryEncoding
source: Binary encoding {0} is not supported.
cs: Binární kódování {0} není podporováno.
de: Die binäre Codierung {0} wird nicht unterstützt.
es: No se admite la codificación binaria {0}.
fr: L'encodage binaire {0} n'est pas pris en charge.
it: La codifica binaria {0} non è supportata.
ja: バイナリ エンコード {0} はサポートされていません。
ko: 이진 인코딩 {0}을(를) 지원하지 않습니다.
pl: Kodowanie binarne {0} nie jest obsługiwane.
pt_br: Não há suporte para codificação binária {0}.
tr: İkili kodlama {0} desteklenmiyor.
zh_hans: 不支持二进制编码 {0}。
zh_hant: 不支援二進位編碼 {0}。

# UnsupportedBindingProperty
source: The value '{1}' is not supported in this context for the binding property '{0}'.
cs: Hodnota {1} není v tomto kontextu pro vlastnost vazby {0} podporována.
de: Der Wert "{1}" wird in diesem Kontext nicht für die Bindungseigenschaft "{0}" unterstützt.
es: El valor "{1}" no se admite en este contexto para la propiedad de enlace "{0}".
fr: La valeur '{1}' n'est pas prise en charge dans ce contexte pour la propriété de liaison '{0}'.
it: Il valore '{1}' non è supportato in questo contesto per la proprietà di binding '{0}'.
ja: 値 '{1}' は、このコンテキストではバインド プロパティ '{0}' に対してサポートされていません。
ko: '{1}' 값은 이 컨텍스트에서 바인딩 속성 '{0}'에 지원되지 않습니다.
pl: Wartość „{1}” jest nieobsługiwana w tym kontekście dla właściwości powiązania „{0}”.
pt_br: Não há suporte para o valor '{1}' neste contexto da propriedade de associação '{0}'.
tr: '{1}' değeri, bu bağlamda '{0}' bağlama özelliği için desteklenmiyor.
zh_hans: 绑定属性“{0}”在此上下文中不支持值“{1}”。
zh_hant: 此繫結屬性 '{0}' 的內容中不支援值 '{1}'。

# UnsupportedCanonicalizationAlgorithm
source: Canonicalization algorithm '{0}' is not supported.
cs: Normalizační algoritmus {0} není podporován.
de: Der Kanonisierungsalgorithmus "{0}" wird nicht unterstützt.
es: No se admite el algoritmo de canonización '{0}'.
fr: L'algorithme de canonicalisation '{0}' n'est pas pris en charge.
it: Algoritmo di canonizzazione '{0}' non supportato.
ja: 標準化アルゴリズム '{0}' はサポートされていません。
ko: 정형화 알고리즘 '{0}'을(를) 지원하지 않습니다.
pl: Algorytm kanonizacji „{0}” nie jest obsługiwany.
pt_br: Não há suporte para conversão em formato canônico no algoritmo '{0}'.
tr: '{0}' kural koyma algoritması desteklenmiyor.
zh_hans: 不支持规范化算法“{0}”。
zh_hant: 不支援標準化演算法 '{0}'。

# UnsupportedCloseExceptionString
source: The remote endpoint closed the sequence before message transfer was complete. This is not supported since all messages could not be transferred. The reliable session was faulted.
cs: Vzdálený koncový bod uzavřel sekvenci dříve, než byl dokončen přenos zpráv. To není podporováno, protože nebylo možné přenést všechny zprávy. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat die Sequenz geschlossen, bevor die Nachrichtenübertragung abgeschlossen war. Dies wird nicht unterstützt, weil nicht alle Nachrichten übertragen werden konnten. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto cerró la secuencia antes de que se completara la transferencia del mensaje. Esto no es compatible, ya que no se pudieron transferir todos los mensajes. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a fermé la séquence avant la fin du transfert du message. Ceci n'est pas pris en charge car tous les messages n'ont pas pu être transférés. La session fiable a généré une erreur.
it: L'endpoint remoto ha chiuso la sequenza prima del completamento del trasferimento dei messaggi. L'operazione non è supportata perché non è possibile trasferire tutti i messaggi. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、メッセージの転送が完了する前にシーケンスを閉じました。すべてのメッセージを転送できなかったため、これはサポートされません。信頼できるセッションは途中終了されました。
ko: 메시지 전송을 마치기 전에 원격 끝점에서 시퀀스를 닫았습니다. 일부 메시지를 전송할 수 없기 때문에 이 작업은 지원되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy zamknął sekwencję przed ukończeniem transferu komunikatów. To zachowanie nie jest obsługiwane, ponieważ nie można przetransferować wszystkich komunikatów. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto fechou a sequência antes que a transferência da mensagem fosse concluída. Não há suporte para isso já que nenhuma mensagem foi transferida. Falha na sessão confiável.
tr: İleti aktarma tamamlanmadan önce uzak bitiş noktası sırayı kapattı. Tüm iletiler aktarılmadığından bu desteklenmiyor. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点在消息传输完成之前关闭了此序列。由于所有消息均无法传输，因此该操作不受支持。可靠会话已出错。
zh_hant: 在訊息傳輸完成前，遠端端點已關閉該序列。不支援此情況，因為無法傳輸所有訊息。可靠工作階段發生錯誤。

# UnsupportedCryptoAlgorithm
source: Crypto algorithm '{0}' not supported in this context.
cs: Šifrovací algoritmus {0} není v tomto kontextu podporován.
de: Der Kryptoalgorithmus "{0}" wird in diesem Kontext nicht unterstützt.
es: El algoritmo criptográfico {0} no se admite en este contexto.
fr: L'algorithme de chiffrement '{0}' n'est pas pris en charge dans ce contexte.
it: L'algoritmo di crittografia '{0}' non è supportato in questo contesto.
ja: このコンテキストでは、暗号アルゴリズム '{0}' はサポートされていません。
ko: 이 컨텍스트에서는 암호화 알고리즘 '{0}'이(가) 지원되지 않습니다.
pl: Algorytm kryptograficzny „{0}” nie jest obsługiwany w tym kontekście.
pt_br: Não há suporte para o algoritmo de criptografia '{0}' nesse contexto.
tr: "{0}" şifreleme algoritması bu bağlamda desteklenmiyor.
zh_hans: 此上下文中不支持加密算法“{0}”。
zh_hant: 此內容中不支援密碼編譯演算法 '{0}'。

# UnsupportedEnvelopeVersion
source: The {0} binding element requires envelope version '{1}' It doesn't support '{2}'.
cs: Element vazby {0} vyžaduje verzi obálky {1}. Nepodporuje {2}.
de: Das {0}-Bindungselement erfordert Umschlagsversion "{1}". "{2}" wird nicht unterstützt.
es: El elemento de enlace {0} requiere la versión de sobre "{1}". No admite "{2}".
fr: L'élément de liaison {0} nécessite la version d'enveloppe '{1}'. Il ne prend pas en charge '{2}'.
it: L'elemento di binding {0} richiede un envelope con versione '{1}'. Non supporta '{2}'.
ja: {0} バインド要素にはエンベロープ バージョン '{1}' が必要です。このバインド要素は '{2}' をサポートしていません。
ko: {0} 바인딩 요소에서는 봉투 버전 '{1}'이(가) 필요합니다. '{2}'은(는) 지원하지 않습니다.
pl: Element powiązania {0} wymaga schematu Envelope w wersji „{1}”. Wersja „{2}” nie jest obsługiwana.
pt_br: O elemento de associação {0} requer a versão de envelope '{1}'. Ele não dá suporte a '{2}'.
tr: {0} bağlama öğesi, '{1}' zarf sürümünü gerektiriyor. '{2}' desteklenmiyor.
zh_hans: {0} 绑定元素需要信封版本“{1}”。该信封版本不支持“{2}”。
zh_hant: {0} 繫結元素需要信封版本 '{1}'，它並不支援 '{2}'。

# UnsupportedIssuerEntropyType
source: Issuer entropy is not BinarySecretSecurityToken or WrappedKeySecurityToken.
cs: Entropie vydavatele není BinarySecretSecurityToken nebo WrappedKeySecurityToken.
de: Die Ausstellerentropie ist nicht BinarySecretSecurityToken oder WrappedKeySecurityToken.
es: La entropía del emisor no es BinarySecretSecurityToken ni WrappedKeySecurityToken.
fr: L'entropie d'émetteur n'est pas BinarySecretSecurityToken ou WrappedKeySecurityToken.
it: L'entropia dell'emittente non è BinarySecretSecurityToken o WrappedKeySecurityToken.
ja: 発行者エントロピが BinarySecretSecurityToken または WrappedKeySecurityToken ではありません。
ko: 발급자 엔트로피가 BinarySecretSecurityToken 또는 WrappedKeySecurityToken이 아닙니다.
pl: Entropia wystawcy nie jest elementem BinarySecretSecurityToken ani elementem WrappedKeySecurityToken.
pt_br: A entropia do emissor não é BinarySecretSecurityToken nem WrappedKeySecurityToken.
tr: Veren entropi, BinarySecretSecurityToken ya da WrappedKeySecurityToken değil.
zh_hans: 颁发者熵不是 BinarySecretSecurityToken 或 WrappedKeySecurityToken。
zh_hant: 簽發者 Entropy 不是 BinarySecretSecurityToken 或 WrappedKeySecurityToken。

# UnsupportedKeyDerivationAlgorithm
source: Key derivation algorithm '{0}' is not supported.
cs: Algoritmus pro odvození klíče {0} není podporován.
de: Der Schlüsselableitungsalgorithmus "{0}" wird nicht unterstützt.
es: No se admite el algoritmo de derivación de claves "{0}".
fr: L'algorithme de dérivation de clé '{0}' n'est pas pris en charge.
it: L'algoritmo '{0}' di derivazione di chiave non è supportato.
ja: キー派生アルゴリズム '{0}' はサポートされていません。
ko: 키 파생 알고리즘 '{0}'을(를) 지원하지 않습니다.
pl: Algorytm wyprowadzania klucza „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o algoritmo de derivação '{0}'.
tr: Anahtar türetme algoritması '{0}' desteklenmiyor.
zh_hans: 不支持密钥派生算法“{0}”。
zh_hant: 不支援金鑰衍生演算法 '{0}'。

# UnsupportedPasswordType
source: The '{0}' username token has an unsupported password type.
cs: Token uživatelského jména {0} má nepodporovaný typ hesla.
de: Das {0}-Benutzernamentoken verfügt über einen nicht unterstützten Kennworttyp.
es: El token de nombre de usuario "{0}" tiene un tipo de contraseña no admitido.
fr: Le jeton de nom d'utilisateur '{0}' a un type de mot de passe non pris en charge.
it: Il tipo di password del token di nome utente '{0}' non è supportato.
ja: ユーザー名トークン '{0}' には、サポートされていないパスワードの種類が含まれています。
ko: '{0}' 사용자 이름 토큰에 지원되지 않는 암호 형식이 있습니다.
pl: Token nazwy użytkownika „{0}” zawiera nieobsługiwany typ hasła.
pt_br: O token de nome de usuário '{0}' tem um tipo de senha sem suporte.
tr: '{0}' kullanıcı adı belirteci, desteklenmeyen bir parola türüne sahip.
zh_hans: 不支持“{0}”用户名令牌所使用的密码类型。
zh_hant: 不支援 '{0}' 使用者名稱的密碼類型。

# UnsupportedSecuritySetting
source: The value '{1}' is not supported in this context for the binding security property '{0}'.
cs: Hodnota {1} není v tomto kontextu pro vlastnost zabezpečení vazby {0} podporována.
de: Der Wert "{1}" wird in diesem Kontext nicht für die Bindungssicherheitseigenschaft "{0}" unterstützt.
es: El valor "{1}" no se admite en este contexto para la propiedad de seguridad del enlace "{0}".
fr: La valeur '{1}' n'est pas prise en charge dans ce contexte pour la propriété de sécurité de liaison '{0}'.
it: Il valore '{1}' non è supportato in questo contesto per la proprietà di sicurezza di binding '{0}'.
ja: 値 '{1}' は、このコンテキストではバインド セキュリティ プロパティ '{0}' に対してサポートされていません。
ko: '{1}' 값은 이 컨텍스트에서 바인딩 보안 속성 '{0}'에 지원되지 않습니다.
pl: Wartość „{1}” jest nieobsługiwana w tym kontekście dla właściwości zabezpieczeń powiązania „{0}”.
pt_br: Não há suporte para o valor '{1}' neste contexto da propriedade de segurança de associação '{0}'.
tr: '{1}' değeri, bu bağlamda '{0}' bağlama güvenlik özelliği için desteklenmiyor.
zh_hans: 绑定安全属性“{0}”在此上下文中不支持值“{1}”。
zh_hant: 此繫結安全性屬性 '{0}' 的內容中不支援值 '{1}'。

# UnsupportedSslProtectionLevel
source: The protection level '{0}' was specified, yet SSL transport security only supports EncryptAndSign.
cs: Byla zadána úroveň zabezpečení {0}, ale zabezpečení přenosu SSL podporuje pouze EncryptAndSign.
de: Die Schutzebene "{0}" war angegeben, die SSL-Transportsicherheit unterstützt jedoch nur EncryptAndSign.
es: Se especificó el nivel de protección "{0}", pero la seguridad de transporte SSL solo admite EncryptAndSign.
fr: Le niveau de protection '{0}' a été spécifié, mais la sécurité du transport SSL prend uniquement en charge EncryptAndSign.
it: È stato specificato il livello di protezione '{0}', ma la sicurezza del trasporto SSL supporta solo EncryptAndSign.
ja: 保護レベル '{0}' が指定されましたが、SSL トランスポート セキュリティでサポートされるのは EncryptAndSign のみです。
ko: 보호 수준 '{0}'이(가) 지정되었지만, SSL 전송 보안은 EncryptAndSign만 지원합니다.
pl: Określono poziom zabezpieczeń „{0}”, jednak zabezpieczenia transportowe protokołu SSL obsługują tylko metodę EncryptAndSign.
pt_br: O nível de proteção '{0}' foi especificado, ainda assim a segurança do transporte SSL apenas dá suporte a EncryptAndSign.
tr: SSL aktarım güvenliği yalnızca EncryptAndSign özelliğini desteklese de, '{0}' koruma düzeyi belirtildi.
zh_hans: 指定了保护级别“{0}”，但 SSL 传输安全性仅支持 EncryptAndSign。
zh_hant: 已指定保護層級 '{0}'，但是 SSL 傳輸安全性只支援 EncryptAndSign。

# UnsupportedTerminateSequenceExceptionString
source: The remote endpoint terminated the sequence before message transfer was complete. This is not supported since all messages could not be transferred. The reliable session was faulted.
cs: Vzdálený koncový bod ukončil sekvenci dříve, než byl dokončen přenos zpráv. To není podporováno, protože nebylo možné přenést všechny zprávy. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat die Sequenz beendet, bevor die Nachrichtenübertragung abgeschlossen war. Dies wird nicht unterstützt, weil nicht alle Nachrichten übertragen werden konnten. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto terminó la secuencia antes de que se completara la transferencia del mensaje. Esto no es compatible, ya que no se pudieron transferir todos los mensajes. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a terminé la séquence avant la fin du transfert du message. Ceci n'est pas pris en charge car tous les messages n'ont pas pu être transférés. La session fiable a généré une erreur.
it: L'endpoint remoto ha interrotto la sequenza prima del completamento del trasferimento dei messaggi. L'operazione non è supportata perché non è possibile trasferire tutti i messaggi. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、メッセージの転送が完了する前にシーケンスを終了しました。すべてのメッセージを転送できなかったため、これはサポートされません。信頼できるセッションは途中終了されました。
ko: 메시지 전송을 마치기 전에 원격 끝점에서 시퀀스를 종료했습니다. 일부 메시지를 전송할 수 없기 때문에 이 작업은 지원되지 않습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy zakończył sekwencję przed ukończeniem transferu komunikatów. To zachowanie nie jest obsługiwane, ponieważ nie można przetransferować wszystkich komunikatów. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto encerrou a sequência antes que a transferência da mensagem fosse concluída. Não há suporte para isso já que nenhuma mensagem foi transferida. Falha na sessão confiável.
tr: İleti aktarma tamamlanmadan önce uzak bitiş noktası sırayı sonlandırdı. Tüm iletiler aktarılmadığından bu desteklenmiyor. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点在消息传输完成之前终止了此序列。由于所有消息均无法传输，因此该操作不受支持。可靠会话已出错。
zh_hant: 在訊息傳輸完成前，遠端端點已終止該序列。不支援此情況，因為無法傳輸所有訊息。可靠工作階段發生錯誤。

# UnsupportedTokenImpersonationLevel
source: The value '{1}' for the '{0}' property is not supported in Windows Store apps.
cs: Hodnota {1} vlastnosti {0} není v aplikacích z Windows Store podporována.
de: Der Wert "{1}" für die {0}-Eigenschaft wird in Windows Store-Apps nicht unterstützt.
es: El valor "{1}" de la propiedad "{0}" no se admite en las aplicaciones de la Tienda Windows.
fr: La valeur '{1}' correspondant à la propriété '{0}' n'est pas prise en charge dans les applications du Windows Store.
it: Il valore '{1}' per la proprietà '{0}' non è supportato nelle app di Windows Store.
ja: '{0}' プロパティの値 '{1}' は、Windows ストア アプリでサポートされていません。
ko: '{0}' 속성의 값 '{1}'은(는) Windows 스토어 앱에서 지원되지 않습니다.
pl: Wartość „{1}” właściwości „{0}” jest nieobsługiwana w aplikacjach ze Sklepu Windows.
pt_br: O valor '{1}' da propriedade '{0}' não tem suporte nos Aplicativos da Windows Store.
tr: '{0}' özelliği için '{1}' değeri, Windows Mağazası uygulamalarında desteklenmiyor.
zh_hans: Windows 应用商店应用中不支持“{0}”属性的值“{1}”。
zh_hant: Windows Store 應用程式中不支援 '{0}' 屬性的值 '{1}'。

# UnsupportedTokenInclusionMode
source: Token inclusion mode '{0}' is not supported.
cs: Režim zařazení tokenu {0} není podporován.
de: Der Tokeneinschlussmodus "{0}" wird nicht unterstützt.
es: No se admite el modo de inclusión de token '{0}'.
fr: Le mode d'inclusion de jeton '{0}' n'est pas pris en charge.
it: Modalità di inclusione token '{0}' non supportata.
ja: トークンのインクルード モード '{0}' はサポートされていません。
ko: 토큰 포함 모드 '{0}'을(를) 지원하지 않습니다.
pl: Tryb dołączania tokenu „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o modo de inclusão de token '{0}'.
tr: '{0}' belirteç ekleme modu desteklenmiyor.
zh_hans: 不支持令牌包含模式“{0}”。
zh_hant: 不支援權杖內含模式 '{0}'。

# UnsupportedUpgradeInitiator
source: The StreamUpgradeInitiator specified ({0}) is not supported by this IStreamUpgradeChannelBindingProvider implementation. The most likely cause of this is passing a StreamUpgradeInitiator that was not created by the StreamUpgradeProvider associated with the current IStreamUpgradeChannelBindingProvider implementation.
cs: Tato implementace rozhraní IStreamUpgradeChannelBindingProvider nepodporuje hodnotu {0} určenou objektem StreamUpgradeInitiator. Nejpravděpodobnější příčinou této chyby je předání objektu StreamUpgradeInitiator, který nebyl vytvořen poskytovatelem StreamUpgradeProvider přidruženým k aktuální implementaci rozhraní IStreamUpgradeChannelBindingProvider.
de: Der angegebene StreamUpgradeInitiator ({0}) wird von dieser IStreamUpgradeChannelBindingProvider-Implementierung nicht unterstützt. Die wahrscheinlichste Ursache hierfür ist, dass ein StreamUpgradeInitiator übergeben wurde, der nicht von dem StreamUpgradeProvider erstellt wurde, der dieser IStreamUpgradeChannelBindingProvider-Implementierung zugeordnet ist.
es: Esta implementación de IStreamUpgradeChannelBindingProvider no admite el valor de StreamUpgradeInitiator especificado ({0}). Esto se debe probablemente a que se ha pasado un elemento StreamUpgradeInitiator que no fue creado por el proveedor StreamUpgradeProvider asociado a esta implementación de IStreamUpgradeChannelBindingProvider.
fr: Le StreamUpgradeInitiator ({0}) spécifié n'est pas pris en charge par cette implémentation IStreamUpgradeChannelBindingProvider. La cause la plus probable est le passage d'un StreamUpgradeInitiator qui n'a pas été créé par le StreamUpgradeProvider associé à l'implémentation IStreamUpgradeChannelBindingProvider actuelle.
it: L'elemento StreamUpgradeInitiator specificato ({0}) non è supportato da questa implementazione di IStreamUpgradeChannelBindingProvider. Probabilmente è stato passato un elemento StreamUpgradeInitiator non creato dall'elemento StreamUpgradeProvider associato all'implementazione corrente di IStreamUpgradeChannelBindingProvider.
ja: 指定された StreamUpgradeInitiator ({0}) は、この IStreamUpgradeChannelBindingProvider 実装でサポートされていません。現在の IStreamUpgradeChannelBindingProvider 実装に関連付けられた StreamUpgradeProvider で作成されたものではない StreamUpgradeInitiator を渡している可能性があります。
ko: 지정된 StreamUpgradeInitiator({0})는 이 IStreamUpgradeChannelBindingProvider 구현에서 지원되지 않습니다. 이 오류가 발생하는 원인 중 대부분은 현재 IStreamUpgradeChannelBindingProvider 구현과 관련된 StreamUpgradeProvider에서 생성되지 않은 StreamUpgradeInitiator를 전달했기 때문입니다.
pl: Określony obiekt StreamUpgradeInitiator ({0}) nie jest obsługiwany przez tę implementację interfejsu IStreamUpgradeChannelBindingProvider. Najbardziej prawdopodobną przyczyną jest przekazanie obiektu StreamUpgradeInitiator, który nie został utworzony przez obiekt StreamUpgradeProvider skojarzony z bieżącą implementacją interfejsu IStreamUpgradeChannelBindingProvider.
pt_br: O StreamUpgradeInitiator especificado ({0}) não tem suporte nessa implementação de IStreamUpgradeChannelBindingProvider. A causa mais provável disso é que foi passado um StreamUpgradeInitiator não criado pelo StreamUpgradeProvider associado à implementação atual de IStreamUpgradeChannelBindingProvider.
tr: Belirtilen StreamUpgradeInitiator ({0}) bu IStreamUpgradeChannelBindingProvider uygulaması tarafından desteklenmiyor. Bunun en olası nedeni, geçerli IStreamUpgradeChannelBindingProvider uygulamasıyla ilişkili StreamUpgradeProvider tarafından oluşturulmamış bir StreamUpgradeInitiator geçirilmesidir.
zh_hans: 此 IStreamUpgradeChannelBindingProvider 实现不支持所指定的 StreamUpgradeInitiator ({0})。最可能的原因是，所传递的 StreamUpgradeInitiator 不是由当前 IStreamUpgradeChannelBindingProvider 实现的关联 StreamUpgradeProvider 创建的。
zh_hant: 這個 IStreamUpgradeChannelBindingProvider 實作不支援指定的 StreamUpgradeInitiator ({0})。最可能的原因是傳遞不是由與目前 IStreamUpgradeChannelBindingProvider 實作相關聯之 StreamUpgradeProvider 所建立的 StreamUpgradeInitiator 而造成的。

# UriGeneratorSchemeMustNotBeEmpty
source: The scheme parameter must not be empty.
cs: Parametr schéma nesmí být prázdný.
de: Der Schemaparameter darf nicht leer sein.
es: El parámetro de esquema no debe estar vacío.
fr: Le paramètre de schéma ne doit pas être vide.
it: Il parametro dello schema non deve essere vuoto.
ja: スキーマのパラメーターは空にしないでください。
ko: 스키마 매개 변수는 비어 있을 수 없습니다.
pl: Parametr schematu nie może być pusty.
pt_br: O parâmetro do esquema não deve estar vazio.
tr: Düzen parametresi boş olmamalıdır.
zh_hans: 方案参数不得为空。
zh_hant: 結構描述參數不可以空白。

# UriMustBeAbsolute
source: The given URI must be absolute.
cs: Zadaný identifikátor URI musí být absolutní.
de: Der angegebene URI muss absolut sein.
es: El URI proporcionado debe ser absoluto.
fr: L'URI donné doit être absolu.
it: L'URI specificato deve essere assoluto.
ja: 指定された URI は絶対 URI である必要があります。
ko: 주어진 URI은 절대 URI여야 합니다.
pl: Dany identyfikator URI musi być bezwzględny.
pt_br: O URI dado deve ser absoluto.
tr: Verilen URI mutlak olmalı.
zh_hans: 给出的 URI 必须是绝对值。
zh_hant: 指定的 URI 必須是絕對 URI。
