Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SessionValueInvalid
source: The Session value '{0}' is invalid. Please specify 'CurrentSession','ServiceSession' or a valid non-negative Windows Session Id.
cs: Hodnota Session {0} je neplatná. Zadejte hodnotu CurrentSession, ServiceSession nebo platnou nezápornou hodnotu Windows Session Id.
de: Der Session-Wert "{0}" ist ungültig. Geben Sie CurrentSession, ServiceSession oder eine gültige nicht negative Windows-Sitzungs-ID an.
es: El valor "{0}" de la sesión no es válido. Especifique "CurrentSession","ServiceSession" o un id. de sesión de Windows válido que no sea negativo.
fr: La valeur de session '{0}' est non valide. Spécifiez 'CurrentSession','ServiceSession' ou un ID de session Windows non négatif.
it: Il valore '{0}' di Session non è valido. Specificare 'CurrentSession', 'ServiceSession' o un ID sessione Windows valido non negativo.
ja: セッションの値 '{0}' は無効です。'CurrentSession'、'ServiceSession'、有効な負でない Windows セッション ID を指定してください。
ko: 세션 값 '{0}'이(가) 잘못되었습니다. 'CurrentSession', 'ServiceSession' 또는 음수가 아닌 유효한 Windows 세션 ID를 지정하세요.
pl: Wartość właściwości Session „{0}” jest nieprawidłowa. Określ wartość CurrentSession lub ServiceSession albo nieujemny identyfikator sesji systemu Windows.
pt_br: O valor de Session '{0}' é inválido. Especifique 'CurrentSession','ServiceSession' ou uma ID de Sessão do Windows válida não negativa.
tr: '{0}' Oturum değeri geçersiz. Lütfen 'CurrentSession','ServiceSession' geçerli bir negatif olmayan Windows Oturum Kimliği belirtin.
zh_hans: Session 值“{0}”无效。请指定 "CurrentSession"、"ServiceSession" 或有效的非负 Windows 会话 ID。
zh_hant: 工作階段值 '{0}' 無效。請指定 'CurrentSession'、'ServiceSession' 或有效的非負數 Windows 工作階段識別碼。

# SfxCallbackTypeCannotBeNull
source: In order to use the contract '{0}' with DuplexChannelFactory, the contract must specify a valid callback contract. If your contract does not have a callback contract, consider using ChannelFactory instead of DuplexChannelFactory.
cs: Pokud se má použít kontrakt {0} s třídou DuplexChannelFactory, musí kontrakt určit platný kontrakt zpětného volání. Pokud kontrakt nedisponuje kontraktem zpětného volání, zvažte použití třídy ChannelFactory namísto třídy DuplexChannelFactory.
de: Der Vertrag muss einen gültigen Rückrufvertrag angeben, um den Vertrag "{0}" mit DuplexChannelFactory verwenden zu können. Wenn der Vertrag nicht über einen Rückrufvertrag verfügt, sollten Sie ggf. ChannelFactory anstelle von DuplexChannelFactory verwenden.
es: Para usar el contrato "{0}" con DuplexChannelFactory, el contrato debe especificar un contrato válido de devolución de llamada. Si el contrato no tiene un contrato de devolución de llamada, considere la posibilidad de usar ChannelFactory en lugar de DuplexChannelFactory.
fr: Pour utiliser le contrat '{0}' avec DuplexChannelFactory, le contrat doit spécifier un contrat de rappel valide. Si votre contrat ne contient pas de contrat de rappel, utilisez ChannelFactory au lieu de DuplexChannelFactory.
it: Per usare il contratto '{0}' con DuplexChannelFactory, il contratto deve specificare un contratto di callback valido. Se il contratto non contiene di un contratto di callback, provare a usare ChannelFactory invece di DuplexChannelFactory.
ja: コントラクト '{0}' を DuplexChannelFactory と共に使用するには、このコントラクトで有効なコールバック コントラクトを指定する必要があります。使用しているコントラクトにコールバック コントラクトがない場合は、DuplexChannelFactory の代わりに ChannelFactory を使用してください。
ko: DuplexChannelFactory에 '{0}' 계약을 사용하려면 계약에서 유효한 콜백 계약을 지정해야 합니다. 계약에 콜백 계약이 없으면 DuplexChannelFactory 대신 ChannelFactory를 사용하세요.
pl: Aby użyć kontraktu „{0}” z elementem DuplexChannelFactory, kontrakt musi zawierać poprawny kontrakt wywołania zwrotnego. Jeśli dany kontrakt nie zawiera kontraktu wywołania zwrotnego, spróbuj użyć elementu ChannelFactory zamiast elementu DuplexChannelFactory.
pt_br: Para usar o contrato '{0}' com DuplexChannelFactory, o contrato deve especificar um contrato do retorno de chamada válido. Se o contrato não tiver o contrato do retorno de chamada, considere usar ChannelFactory em vez de DuplexChannelFactory.
tr: '{0}' anlaşmasının DuplexChannelFactory ile kullanılabilmesi için anlaşmanın geçerli bir geri çağırma anlaşması belirtmesi gerekir. Anlaşmanızda bir geri çağırma anlaşması yoksa, DuplexChannelFactory yerine ChannelFactory özelliğini kullanmayı deneyin.
zh_hans: 为了将协定“{0}”与 DuplexChannelFactory 一起使用，该协定必须指定一个有效的回拨协定。如果协定没有回拨协定，请考虑使用 ChannelFactory 而不是 DuplexChannelFactory。
zh_hant: 若要使用具有 DuplexChannelFactory 的合約 '{0}'，該合約必須指定有效的回呼合約。若合約沒有回呼合約，請考慮使用 ChannelFactory 取代 DuplexChannelFactory。

# SfxCloseTimedOutWaitingForDispatchToComplete
source: Close process timed out waiting for service dispatch to complete.
cs: Procesu ukončení skončila doba platnosti při čekání na dokončení odeslání služby.
de: Beim Schließen ist ein Timeout aufgetreten, während auf den Abschluss der Dienstverteilung gewartet wurde.
es: El proceso de cierre agotó el tiempo de espera para que se completara la distribución del servicio.
fr: Le processus de fermeture a dépassé le délai imparti en attendant l'exécution de la distribution du service.
it: Timeout del processo di chiusura in attesa del completamento dell'invio del servizio.
ja: サービスのディスパッチが完了するのを待機しているときに終了プロセスがタイムアウトしました。
ko: 서비스 발송이 완료되기를 기다리는 동안 닫기 프로세스가 시간 초과되었습니다.
pl: Proces zamykania przekroczył limit czasu, czekając na zakończenie wysyłania usługi.
pt_br: Processo de fechamento excedeu o tempo limite esperando a conclusão da expedição do serviço.
tr: Hizmet dağıtımının tamamlanması beklenirken Kapatma işlemi süresi doldu.
zh_hans: 等待完成服务调度时关闭进程超时。
zh_hant: 關閉處理序在等待服務發送完成時逾時。

# Sharing_ConnectionDispatchFailed
source: The message could not be dispatched to the service at address '{0}'. Refer to the server Event Log for more details
cs: Zpráva nebyla odeslána ke službě na adrese {0}. Další podrobnosti naleznete v Protokolu událostí
de: Die Nachricht konnte nicht an den Dienst an der Adresse "{0}" verteilt werden. Weitere Details finden Sie im Ereignisprotokoll des Servers.
es: No se pudo distribuir el mensaje al servicio en la dirección "{0}". Consulte el Registro de eventos del servidor para obtener más información
fr: Impossible de distribuer le message au service à l'adresse '{0}'. Pour plus d'informations, consultez le journal des événements du serveur
it: Non è stato possibile inviare il messaggio al servizio all'indirizzo '{0}'. Per maggiori dettagli, vedere il log eventi
ja: アドレス '{0}' のサービスにメッセージをディスパッチできませんでした。詳細については、サーバーのイベント ログを参照してください。
ko: '{0}' 주소의 서비스로 메시지를 발송할 수 없습니다. 자세한 내용은 서버 이벤트 로그를 참조하세요.
pl: Komunikat nie mógł zostać wysłany do usługi pod adres „{0}”. Aby uzyskać więcej szczegółów, zobacz dziennik zdarzeń serwera
pt_br: A mensagem não pôde ser expedida ao serviço no endereço '{0}'. Consulte o Log de Eventos do servidor para obter mais detalhes
tr: İleti, '{0}' adresindeki hizmete dağıtılamadı. Ayrıntılar için sunucu Event Log öğesine bakın
zh_hans: 无法将消息调度到地址“{0}”上的服务。有关详细信息，请参见服务器事件日志
zh_hant: 無法將訊息發送至位於位址 '{0}' 的服務。如需詳細資訊，請參閱事件記錄檔

# Sharing_EndpointUnavailable
source: The message could not be dispatched because the service at the endpoint address '{0}' is unavailable for the protocol of the address.
cs: Zpráva nebyla odeslána, protože služba na adrese koncového bodu {0} není dostupná pro protokol adresy.
de: Die Nachricht konnte nicht versendet werden, da der Dienst an der Endpunktadresse "{0}" für das Protokoll der Adresse nicht verfügbar ist.
es: No se pudo distribuir el mensaje porque el servicio en la dirección de punto de conexión "{0}" no está disponible para el protocolo de la dirección.
fr: Impossible de distribuer le message, car le service à l'adresse de point de terminaison '{0}' n'est pas disponible pour le protocole de l'adresse.
it: Non è stato possibile inviare il messaggio perché il servizio all'indirizzo dell'endpoint '{0}' non è disponibile per il protocollo dell'indirizzo.
ja: エンドポイント アドレス '{0}' のプロトコルについて、このアドレスのサービスを使用できないため、メッセージをディスパッチできませんでした。
ko: 끝점 주소 '{0}'의 서비스는 해당 주소의 프로토콜에 사용할 수 없으므로 메시지를 발송할 수 없습니다.
pl: Nie można wysłać komunikatu, ponieważ usługa pod adresem punktu końcowego „{0}” jest niedostępna dla protokołu adresu.
pt_br: A mensagem não pôde ser expedida porque o serviço no endereço do ponto de extremidade '{0}' não está disponível para o protocolo do endereço.
tr: '{0}' uç nokta adresindeki hizmet, adres protokolü için kullanılamadığından ileti dağıtılamadı.
zh_hans: 无法调度消息，因为终结点地址“{0}”上的服务对该地址的协议不可用。
zh_hant: 無法發送訊息，因為位址的通訊協定無法使用端點位址 '{0}' 的服務。

# SignatureConfirmationNotSupported
source: The configured SecurityVersion does not support signature confirmation. Use WsSecurity11 or above.
cs: Nakonfigurovaná verze SecurityVersion nepodporuje potvrzení podpisu. Použijte verzi WsSecurity11 nebo vyšší.
de: Die konfigurierte SecurityVersion unterstützt keine Signaturbestätigung. Verwenden Sie WsSecurity11 oder höher.
es: El elemento SecurityVersion configurado no admite la confirmación de signatura. Use WsSecurity11 o una versión posterior.
fr: La SecurityVersion configurée ne prend pas en charge la confirmation de signature. Utilisez WsSecurity11 ou une version ultérieure.
it: L'elemento SecurityVersion configurato non supporta la conferma di firma. Usare WsSecurity11 o versione successiva.
ja: 構成されている SecurityVersion は署名確認をサポートしていません。WsSecurity11 以上を使用してください。
ko: 구성된 SecurityVersion이 시그니처 확인을 지원하지 않습니다. WsSecurity11 이상을 사용하세요.
pl: Skonfigurowana wersja SecurityVersion nie obsługuje potwierdzenia podpisu. Użyj obiektu WsSecurity11 lub nowszego.
pt_br: O SecurityVersion configurado não dá suporte à confirmação de assinatura. Use WsSecurity11 ou superior.
tr: Yapılandırılan SecurityVersion, imza onayını desteklemiyor. WsSecurity11 ya da üstünü kullanın.
zh_hans: 配置的 SecurityVersion 不支持签名确认。请使用 WsSecurity11 或更高版本。
zh_hant: 設定的 SecurityVersion 不支援簽章確認。請使用 WsSecurity11 或更新的版本。

# SignedSupportingTokenNotExpected
source: A signed supporting token is not expected in the security header in this context.
cs: V záhlaví zabezpečení v tomto kontextu není očekáván podepsaný token.
de: Im Sicherheitsheader wird in diesem Kontext kein signiertes unterstützendes Token erwartet.
es: No se espera un token auxiliar firmado en el encabezado de seguridad en este contexto.
fr: Un jeton de prise en charge signé n'est pas attendu dans l'en-tête de sécurité de ce contexte.
it: Non è previsto un token di supporto firmato nell'intestazione di sicurezza in questo contesto.
ja: このコンテキストのセキュリティ ヘッダーでは、署名されたサポート トークンを使用できません。
ko: 서명된 지원 토큰은 이 컨텍스트의 보안 헤더에 사용할 수 없습니다.
pl: Podpisany token pomocniczy jest nieoczekiwany w nagłówku zabezpieczeń w tym kontekście.
pt_br: Um token de suporte assinado não é esperado no cabeçalho de segurança nesse contexto.
tr: İmzalı destekleme belirteci, bu kapsamda güvenlik üst bilgisinde beklenmiyor.
zh_hans: 签名的支持标记不应出现在此上下文的安全标头中。
zh_hant: 此內容的安全性標頭中不應該有簽署的支援權杖。

# SigningTokenHasNoKeys
source: The signing token {0} has no keys. The security token is used in a context that requires it to perform cryptographic operations, but the token contains no cryptographic keys. Either the token type does not support cryptographic operations, or the particular token instance does not contain cryptographic keys. Check your configuration to ensure that cryptographically disabled token types (for example, UserNameSecurityToken) are not specified in a context that requires cryptographic operations (for example, an endorsing supporting token).
cs: Podepisující token {0} nemá žádné klíče. Token zabezpečení se používá v kontextu, který ho vyžaduje k provedení kryptografických operací, ale token neobsahuje žádné kryptografické klíče. Buď typ tokenu nepodporuje kryptografické operace, nebo konkrétní instance tokenu neobsahuje kryptografické klíče. Zkontrolujte, jestli v konfiguraci nejsou zadané typy tokenů, které nepodporují kryptografické operace (například UserNameSecurityToken), v kontextu, který vyžaduje kryptografické operace (například token podporující potvrzení).
de: Das Signaturtoken {0} weist keine Schlüssel auf. Das Sicherheitstoken wird in einem Kontext verwendet, der kryptografische Vorgänge erfordert. Das Token enthält jedoch keine Kryptografieschlüssel. Entweder unterstützt der Tokentyp keine kryptografischen Vorgänge, oder die jeweilige Tokeninstanz enthält keine Kryptografieschlüssel. Überprüfen Sie die Konfiguration, um sicherzustellen, dass nicht kryptografiefähige Tokentypen (beispielsweise UserNameSecurityToken) nicht in einem Kontext angegeben werden, der kryptografische Vorgänge erfordert (beispielsweise ein unterzeichnendes unterstützendes Token).
es: El token de firma {0} no tiene claves. El token de seguridad se usa en un contexto que requiere que realice operaciones criptográficas, pero el token no contiene claves criptográficas. El tipo de token no admite operaciones criptográficas, o bien esa instancia de token en particular no contiene claves criptográficas. Compruebe la configuración para asegurarse de que no se especifican tipos de token deshabilitados criptográficamente (por ejemplo, UserNameSecurityToken) en un contexto que requiera operaciones criptográficas (por ejemplo, un token auxiliar de aprobación).
fr: Le jeton de signature {0} n'a pas de clés. Le jeton de sécurité est utilisé dans un contexte qui lui impose d'effectuer des opérations de chiffrement, mais il ne contient aucune clé de chiffrement. Le type de jeton ne prend pas en charge les opérations de chiffrement, ou l'instance particulière du jeton ne contient pas de clé de chiffrement. Vérifiez dans votre configuration que les types de jeton dont le chiffrement est désactivé (par exemple, UserNameSecurityToken) ne sont pas spécifiés dans un contexte qui nécessite des opérations de chiffrement (par exemple, un jeton de prise en charge d'endossement).
it: Il token di firma {0} non contiene chiavi. Il token di sicurezza viene usato in un contesto in base al quale deve eseguire operazioni di crittografia, ma il token non contiene chiavi di crittografia. Il tipo di token non supporta le operazioni di crittografia o l'istanza token specifica non contiene chiavi di crittografia. Controllare la configurazione per verificare che i tipi di token non abilitati alla crittografia, ad esempio UserNameSecurityToken, non siano specificati in un contesto che richiede operazioni di crittografia, ad esempio un token di supporto di verifica dell'autenticità.
ja: 署名トークン {0} にキーがありません。セキュリティ トークンは、暗号化操作を実行するためにセキュリティ トークンを必要とするコンテキストで使用されます。ただし、このトークンには暗号化キーが含まれていません。トークンの型が暗号化操作をサポートしていないか、特定のトークン インスタンスに暗号化キーが含まれていません。構成を確認し、暗号化を無効とするトークンの型 (UserNameSecurityToken など) が、暗号化操作を必要とするコンテキスト (サポートを保証されているトークンなど) で指定されていないことを確認してください。
ko: 서명 토큰 {0}에 키가 없습니다. 보안 토큰이 암호화 작업을 수행하기 위해 이 토큰을 필요로 하는 컨텍스트에서 사용되지만, 토큰에 암호화 키가 없습니다. 토큰 형식이 암호화 작업을 지원하지 않거나, 특정 토큰 인스턴스에 암호화 키가 없습니다. 구성을 점검하여 암호화 사용이 불가능한 토큰 형식(예: UserNameSecurityToken)이 암호화 작업(예: 인증 지원 토큰)이 필요한 컨텍스트에 지정되어 있지 않은지 확인하세요.
pl: Token podpisujący {0} nie ma kluczy. Token zabezpieczający jest używany w kontekście, który wymaga wykonywania operacji kryptograficznych, ale token nie zawiera kluczy kryptograficznych. Albo typ tokenu nie obsługuje operacji kryptograficznych, albo konkretne wystąpienie tokenu nie zawiera kluczy kryptograficznych. Dopilnuj, aby w konfiguracji typy tokenów bez obsługi kryptograficznej (na przykład UserNameSecurityToken) nie były określane w kontekście wymagającym operacji kryptograficznych (takich jak token pomocniczy potwierdzenia).
pt_br: O token de assinatura {0} não tem chaves. O token de segurança é usado em um contexto que requer que sejam realizadas operações de criptografia, mas o token não contém chaves de criptografia. O tipo de token não dá suporte a operações de criptografia ou a instância particular do token não contém chaves de criptografia. Verifique sua configuração para garantir que os tipos de token com criptografia desabilitada (por exemplo, UserNameSecurityToken) não sejam especificados em um contexto que exija operações de criptografia (por exemplo, um token de suporte de endosso).
tr: {0} imzalama belirtecinin anahtarı yok. Güvenlik belirteci, şifreleme işlemlerini gerçekleştirmesi beklenen bir bağlamda kullanılmış, ancak belirteçte herhangi bir şifreleme anahtarı yok. Belirteç türü şifreleme işlemlerini desteklemiyor olabilir ya da belirli belirteç örnekleri şifreleme anahtarları bulundurmuyor olabilir. yapılandırmanızı denetleyerek şifrelemesi devre dışı bırakılan belirteç türlerinin (örneğin UserNameSecurityToken) şifreleme işlemleri gerektiren bağlamda (örneğin bir onaylama destekleme belirteci) belirtilmemesini sağlayın.
zh_hans: 签名令牌 {0} 没有密钥。安全令牌用于需要它执行加密操作的上下文中，但令牌不包含加密密钥。令牌类型不支持加密操作或特定令牌实例不包含加密密钥。请检查配置，以确保未在需要加密操作的上下文(例如，认可签名令牌)中指定禁用加密的令牌类型(如 UserNameSecurityToken)。
zh_hant: 簽署權杖 {0} 沒有金鑰。安全性權杖使用時需要執行加密作業，但是權杖未包含加密金鑰。可能是權杖類型未支援加密作業，或是特定權杖執行個體未包含加密金鑰。請檢查組態，確認在需要加密作業時 (例如，簽署支援權杖)，未指定停用加密的權杖類型 (例如，UserNameSecurityToken)。

# SigningTokenHasNoKeysSupportingTheAlgorithmSuite
source: The signing token {0} has no key that supports the algorithm suite {1}.
cs: Označující token {0} nemá žádný klíč, který podporuje sadu algoritmů {1}.
de: Das Signaturtoken {0} weist keinen Schlüssel auf, der die Algorithmussammlung {1} unterstützt.
es: El token de firma {0} no tiene ninguna clave que admita el conjunto de algoritmos {1}.
fr: Le jeton de signature {0} ne comporte aucune clé prenant en charge la suite d'algorithmes {1}.
it: Il token di firma {0} non contiene alcuna chiave che supporta il gruppo di algoritmi {1}.
ja: 署名トークン {0} に、アルゴリズム スイート {1} をサポートするキーがありません。
ko: 서명 토큰 {0}에 알고리즘 모음 {1}을(를) 지원하는 키가 없습니다.
pl: Token podpisujący {0} nie ma klucza obsługującego pakiet algorytmów {1}.
pt_br: O token de assinatura {0} não tem nenhuma chave que dê suporte ao pacote de algoritmos {1}.
tr: {0} imzalama belirtecinin, {1} algoritma paketini destekleyen anahtarı yok.
zh_hans: 签名令牌 {0} 没有支持算法套件 {1} 的密钥。
zh_hant: 簽署權杖 {0} 沒有支援演算法組合 {1} 的金鑰。

source: Signing without primary signature requires timestamp.
cs: Podepsání bez primárního podpisu vyžaduje časové razítko.
de: Für das Signieren ohne primäre Signatur ist ein Zeitstempel erforderlich.
es: Para firmar sin la firma principal, es necesaria una marca de tiempo.
fr: Une signature sans signature primaire nécessite un horodatage.
it: La firma senza una firma primaria richiede un timestamp.
ja: プライマリ署名がない署名にはタイムスタンプが必要です。
ko: 기본 서명이 없는 서명에는 타임스탬프가 필요합니다.
pl: Podpisywanie bez podpisu podstawowego wymaga sygnatury czasowej.
pt_br: Assinar sem uma assinatura principal requer carimbo de data/hora.
tr: Birincil imza olmadan imzalama zaman damgası gerektirir.
zh_hans: 不带主签名的签名需要时间戳。
zh_hant: 在沒有主要簽章的情況下進行簽章時，需要時間戳記。

# SinceTheBindingForDoesnTSupportIBindingCapabilities1_1
source: The DeliveryRequirementsAttribute on contract '{0}' specifies that the binding must support ordered delivery (RequireOrderedDelivery). This condition could not be verified because the configured binding does not implement IBindingDeliveryCapabilities. The DeliveryRequirementsAttribute may only be used with bindings that implement the IBindingDeliveryCapabilities interface.
cs: Atribut DeliveryRequirementsAttribute u kontraktu {0} udává, že vazba musí podporovat objednané dodání (RequireOrderedDelivery). Tato podmínka nemohla být ověřena, protože nakonfigurovaná vazba neimplementuje rozhraní IBindingDeliveryCapabilities. Atribut DeliveryRequirementsAttribute může být použit jen s vazbami, které implementují rozhraní IBindingDeliveryCapabilities.
de: Das DeliveryRequirementsAttribute für Vertrag "{0}" gibt an, dass die Bindung eine sortierte Übermittlung (RequireOrderedDelivery) unterstützen muss. Diese Bedingung konnte nicht überprüft werden, da die konfigurierte Bindung keine IBindingDeliveryCapabilities implementiert. Das DeliveryRequirementsAttribute darf nur mit Bindungen verwendet werden, die die IBindingDeliveryCapabilities-Schnittstelle implementieren.
es: El atributo DeliveryRequirementsAttribute del contrato '{0}' especifica que el enlace debe admitir la entrega ordenada (RequireOrderedDelivery). Esta condición no se pudo comprobar porque el enlace configurado no implementa IBindingDeliveryCapabilities. El atributo DeliveryRequirementsAttribute sólo se puede usar con enlaces que implementen la interfaz IBindingDeliveryCapabilities.
fr: DeliveryRequirementsAttribute sur le contrat '{0}' spécifie que la liaison doit prendre en charge la livraison ordonnée (RequireOrderedDelivery). Cette condition ne peut plus être vérifiée car la liaison configurée n'implémente pas IBindingDeliveryCapabilities. DeliveryRequirementsAttribute peut être utilisé uniquement avec des liaisons qui implémentent l'interface IBindingDeliveryCapabilities.
it: DeliveryRequirementsAttribute nel contratto '{0}' specifica che il binding deve supportare il recapito ordinato (RequireOrderedDelivery). Impossibile verificare tale condizione perché il binding configurato non implementa IBindingDeliveryCapabilities. DeliveryRequirementsAttribute può essere utilizzato solo con i binding che implementano l'interfaccia IBindingDeliveryCapabilities.
ja: コントラクト '{0}' の DeliveryRequirementsAttribute では、バインドが順次配送 (RequireOrderedDelivery) をサポートする必要があると指定されています。構成されたバインドには IBindingDeliveryCapabilities が実装されていないため、この条件を確認できませんでした。DeliveryRequirementsAttribute は、IBindingDeliveryCapabilities インターフェイスを実装しているバインドでのみ使用できます。
ko: '{0}' 계약의 DeliveryRequirementsAttribute는 바인딩이 정렬된 배달을 지원해야 한다고 지정합니다(RequireOrderedDelivery). 구성된 바인딩이 IBindingDeliveryCapabilities를 구현하지 않으므로 이 조건을 확인할 수 없습니다. DeliveryRequirementsAttribute는 IBindingDeliveryCapabilities 인터페이스를 구현하는 바인딩에만 사용할 수 있습니다.
pl: Element DeliveryRequirementsAttribute kontraktu „{0}” określa, że powiązanie musi obsługiwać dostarczania uporządkowanego (RequireOrderedDelivery). Tego warunku nie można zweryfikować, ponieważ skonfigurowane powiązanie nie ma zaimplementowanego interfejsu IBindingDeliveryCapabilities. Atrybut DeliveryRequirementsAttribute można używać tylko z powiązaniami, które mają zaimplementowany interfejs IBindingDeliveryCapabilities.
pt_br: O DeliveryRequirementsAttribute no contrato '{0}' especifica que a associação deve oferecer suporte à entrega ordenada (RequireOrderedDelivery). Essa condição não pôde ser verificada porque a associação configurada não implementa IBindingDeliveryCapabilities. O DeliveryRequirementsAttribute só pode ser usado com associações que implementam a interface IBindingDeliveryCapabilities.
tr: '{0}' sözleşmesindeki DeliveryRequirementsAttribute, bağlamanın sıralanan teslimi (RequireOrderedDelivery) desteklemesi gerektiğini belirtir. Yapılandırılan bağlama IBindingDeliveryCapabilities öğelerini uygulamadığından bu koşul doğrulanamadı. DeliveryRequirementsAttribute yalnızca, IBindingDeliveryCapabilities arabirimini uygulayan bağlamalarla kullanılabilir.
zh_hans: 协定“{0}”上的 DeliveryRequirementsAttribute 指定绑定必须支持顺序传送(RequireOrderedDelivery)。无法验证此条件，因为配置的绑定未实现 IBindingDeliveryCapabilities。DeliveryRequirementsAttribute 只能与实现 IBindingDeliveryCapabilities 接口的绑定共同使用。
zh_hant: 合約 '{0}' 上的 DeliveryRequirementsAttribute 指定繫結必須支援依照順序的傳遞 (RequireOrderedDelivery)。由於設定的繫結未實作 IBindingDeliveryCapabilities，因此無法驗證此條件。DeliveryRequirementsAttribute 可能只用於實作 IBindingDeliveryCapabilities 介面的繫結。
