Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# ManualAddressingNotSupported
source: Binding validation failed because the TransportBindingElement's ManualAddressing property was set to true on a binding that is configured to create reliable sessions. This combination is not supported and the channel factory or service host was not opened.
cs: Ověření vazby se nezdařilo, protože vlastnost ManualAddressing třídy TransportBindingElement byla nastavena na hodnotu true na vazbě, která je nakonfigurována pro vytváření stabilních relací. Tato kombinace není podporována a objekt pro vytváření kanálů nebo hostitel služby nebyl otevřen.
de: Bei der Bindungsvalidierung ist ein Fehler aufgetreten, da die ManualAddressing-Eigenschaft des TransportBindingElement für eine Bindung, die zum Erstellen von zuverlässigen Sitzungen konfiguriert wurde, auf "true" festgelegt ist. Diese Kombination wird nicht unterstützt, und die Kanalfactory oder der Diensthost wurde nicht geöffnet.
es: Error de validación del enlace porque la propiedad ManualAddressing del elemento TransportBindingElement se estableció en true en un enlace que está configurado para crear sesiones confiables. Esta combinación no se admite y no se abrió el generador de canales ni el host del servicio.
fr: Échec de la validation de la liaison, car la propriété ManualAddressing de l'élément TransportBindingElement a la valeur true sur une liaison qui est configurée pour créer des sessions fiables. Cette combinaison n'est pas prise en charge et la fabrique de canaux ou l'hôte de service n'a pas été ouvert.
it: La convalida del binding non è riuscita perché la proprietà ManualAddressing di TransportBindingElement è stata impostata su true in un binding configurato per la creazione di sessioni affidabili. Questa combinazione non è supportata e non è stato possibile aprire la factory canale o l'host servizio.
ja: バインド検証が失敗しました。原因は、信頼できるセッションを作成するように構成されたバインドで TransportBindingElement の ManualAddressing プロパティが true に設定されていたことです。この組み合わせはサポートされていないため、チャネル ファクトリやサービス ホストは開かれませんでした。
ko: 신뢰할 수 있는 세션을 만들도록 구성된 바인딩에서 TransportBindingElement의 ManualAddressing 속성이 true로 설정되었기 때문에 바인딩을 확인하지 못했습니다. 이 조합이 지원되지 않으며 채널 팩터리 또는 서비스 호스트가 열리지 않았습니다.
pl: Nie można zweryfikować powiązania, ponieważ właściwość ManualAddressing elementu TransportBindingElement ma wartość true dla powiązania, które zostało skonfigurowane w celu tworzenia sesji uwierzytelnionych. To połączenie nie jest obsługiwane i nie nastąpiło otwarcie fabryki kanałów lub hosta usługi.
pt_br: Falha na validação da associação porque a propriedade ManualAddressing de TransportBindingElement foi definida como true em uma associação configurada para criar sessões confiáveis. Não há suporte para essa combinação e a fábrica de canais ou o host de serviço não foi aberto.
tr: TransportBindingElement'in ManualAddressing özelliği, güvenilir oturum oluşturmak için yapılandırılan bir bağlamada true olarak ayarlandığından, bağlama doğrulaması başarısız oldu. Bu birleşim desteklenmiyor ve kanal fabrikası ya da hizmet barındırma ortamı açılmadı.
zh_hans: 绑定验证失败，因为 TransportBindingElement 的 ManualAddressing 属性已在配置用于创建可靠会话的绑定上设置为 true。这种组合不受支持，且通道工厂或服务主机未打开。
zh_hant: 繫結驗證失敗，因為在設定用於建立可靠工作階段的繫結上，TransportBindingElement 的 ManualAddressing 屬性設定為 True。但並不支援此組合，所以未開啟通道處理站或服務主機。

# ManualAddressingRequiresAddressedMessages
source: Manual addressing is enabled on this factory, so all messages sent must be pre-addressed.
cs: Ruční adresování je v tomto objektu pro vytváření povoleno, takže všechny odeslané zprávy musí být předběžně adresovány.
de: Die manuelle Adressierung ist für diese Factory aktiviert. Daher müssen alle gesendeten Nachrichten voradressiert sein.
es: El direccionamiento manual está habilitado en este generador, por lo que todos los mensajes deben tener una dirección previa.
fr: L'adressage manuel est activé sur cette fabrique : tous les messages envoyés doivent donc être préalablement adressés.
it: L'indirizzamento manuale è abilitato in questa factory, di conseguenza tutti i messaggi inviati devono contenere già un indirizzo.
ja: このファクトリでは手動によるアドレス指定が有効にされているため、メッセージの送信前にアドレスを指定する必要があります。
ko: 이 팩터리에서 수동 주소 지정이 사용하도록 설정되었으므로 보내지는 모든 메시지의 주소가 미리 지정되어야 합니다.
pl: Ręczne adresowanie jest włączone w tej fabryce, więc wszystkie wysłane wiadomości muszą być wstępnie zaadresowane.
pt_br: O endereçamento manual está habilitado nesta fábrica e, portanto, todas as mensagens enviadas devem ser pré-endereçadas.
tr: El ile adresleme bu fabrika etkinleştirildi, bu nedenle gönderilen iletilerin tümü önceden adreslenmiş olmalı.
zh_hans: 此工厂上启用了手动寻址，因此发送的所有消息都必须进行预寻址。
zh_hant: 此處理站已啟用手動定址，因此所有送出的訊息必須預先定址。

# MaxBufferSizeMustMatchMaxReceivedMessageSize
source: For TransferMode.Buffered, MaxReceivedMessageSize and MaxBufferSize must be the same value.
cs: Pro třídy TransferMode.Buffered, MaxReceivedMessageSize a MaxBufferSize musí být stejné hodnoty.
de: Die Werte für TransferMode.Buffered, MaxReceivedMessageSize und MaxBufferSize müssen identisch sein.
es: Para TransferMode.Buffered, MaxReceivedMessageSize y MaxBufferSize deben tener el mismo valor.
fr: Pour TransferMode.Buffered, MaxReceivedMessageSize et MaxBufferSize doivent avoir la même valeur.
it: Il valore di MaxReceivedMessageSize e MaxBufferSize deve essere identico per TransferMode.Buffered.
ja: TransferMode.Buffered の場合は、MaxReceivedMessageSize と MaxBufferSize の値が同じである必要があります。
ko: TransferMode.Buffered의 경우 MaxReceivedMessageSize 및 MaxBufferSize가 동일한 값이어야 합니다.
pl: Elementy TransferMode.Buffered, MaxReceivedMessageSize i MaxBufferSize muszą mieć takie same wartości.
pt_br: Para TransferMode.Buffered, MaxReceivedMessageSize e MaxBufferSize devem ter o mesmo valor.
tr: TransferMode.Buffered için MaxReceivedMessageSize ve MaxBufferSize aynı değere sahip olmalıdır.
zh_hans: 对于 TransferMode.Buffered，MaxReceivedMessageSize 和 MaxBufferSize 的值必须相同。
zh_hant: TransferMode.Buffered 的 MaxReceivedMessageSize 與 MaxBufferSize 之值必須相同。

source: MaxBufferSize must not exceed MaxReceivedMessageSize.
cs: Třída MaxBufferSize nesmí přesahovat třídu MaxReceivedMessageSize.
de: MaxBufferSize darf MaxReceivedMessageSize nicht überschreiten.
es: MaxBufferSize no debe superar MaxReceivedMessageSize.
fr: MaxBufferSize ne peut pas avoir une valeur supérieure à MaxReceivedMessageSize.
it: Il valore di MaxBufferSize non deve superare quello di MaxReceivedMessageSize.
ja: MaxBufferSize の値は、MaxReceivedMessageSize の値以下である必要があります。
ko: MaxBufferSize는 MaxReceivedMessageSize를 초과해서는 안 됩니다.
pl: Wartość MaxBufferSize nie może przekraczać wartości MaxReceivedMessageSize.
pt_br: MaxBufferSize não deve exceder MaxReceivedMessageSize.
tr: MaxBufferSize, MaxReceivedMessageSize değerini aşmamalıdır.
zh_hans: MaxBufferSize 不得超过 MaxReceivedMessageSize。
zh_hant: MaxBufferSize 不可超過 MaxReceivedMessageSize。

# MaxMimePartsExceeded
source: The number of MIME parts in the MTOM message exceeded the current quota '{0}'. To increase the quota, change the '{1}' setting in the AppSettings section of the configuration file.
cs: Počet částí MIME ve zprávě MTOM překročil aktuální kvótu {0}. Pokud chcete kvótu zvýšit, změňte nastavení {1} v oddílu AppSettings v konfiguračním souboru.
de: Die Anzahl der MIME-Abschnitte in der MTOM-Nachricht lag über dem aktuellen Kontingent "{0}". Um das Kontingent zu erhöhen, ändern Sie die {1}-Einstellung im AppSettings-Abschnitt der Konfigurationsdatei.
es: El número de partes MIME del mensaje MTOM supera la cuota actual '{0}'. Para aumentar la cuota, cambie la configuración '{1}' en la sección AppSettings del archivo de configuración.
fr: Le nombre de parties MIME dans le message MTOM a dépassé le quota actuel '{0}'. Pour augmenter le quota, changez le paramètre '{1}' dans la section AppSettings du fichier de configuration.
it: Il numero di parti MIME nel messaggio MTOM ha superato la quota '{0}' corrente. Per aumentare la quota, modificare l'impostazione '{1}' nella sezione AppSettings del file di configurazione.
ja: MTOM メッセージ内の MIME パーツの数が現在のクォータ '{0}' を超えました。クォータを増やすには、構成ファイルの AppSettings セクション内の '{1}' 設定を変更します。
ko: MTOM 메시지에 있는 MIME 부분의 수가 현재 할당량 '{0}'을(를) 초과했습니다. 할당량을 늘리려면 구성 파일의 AppSettings 섹션에서 '{1}' 설정을 변경하십시오.
pl: Liczba części MIME komunikatu MTOM przekracza limit przydziału „{0}”. Aby zwiększyć ten przydział, należy zmienić ustawienie „{1}” w sekcji AppSettings pliku konfiguracji.
pt_br: O número de partes MIME na mensagem MTOM ultrapassou a cota atual '{0}'. Para aumentar a cota, altere a configuração '{1}' na seção AppSettings do arquivo de configuração.
tr: MTOM iletisindeki MIME bölümü sayısı '{0}' geçerli kotasını aştı. Kotayı artırmak için yapılandırma dosyasının AppSettings bölümünde '{1}' ayarını değiştirin.
zh_hans: MTOM 消息中 MIME 部分的数量超过了当前配额“{0}”。要增加配额，请更改配置文件的 AppSettings 部分中的“{1}”设置。
zh_hant: MTOM 訊息中的 MIME 部分數目超過目前配額 '{0}'。若要增加配額，請在組態檔的 AppSettings 區段中變更 '{1}' 設定。

# MaxReceivedMessageSizeExceeded
source: The maximum message size quota for incoming messages ({0}) has been exceeded. To increase the quota, use the MaxReceivedMessageSize property on the appropriate binding element.
cs: Maximální kvóta velikosti zprávy pro příchozí zprávy ({0}) byla překročena. Chcete-li zvýšit kvótu, použijte vlastnost MaxReceivedMessageSize na příslušném elementu vazby.
de: Das Kontingent für die maximale Nachrichtengröße für eingehende Nachrichten ({0}) wurde überschritten. Verwenden Sie die MaxReceivedMessageSize-Eigenschaft für das entsprechende Bindungselement, um das Kontingent zu erhöhen.
es: Se ha excedido la cuota de tamaño máximo de los mensajes entrantes ({0}). Para aumentar la cuota, use la propiedad MaxReceivedMessageSize en el elemento de enlace correspondiente.
fr: Le quota de taille maximale des messages entrants ({0}) a été dépassé. Pour augmenter le quota, utilisez la propriété MaxReceivedMessageSize sur l'élément de liaison approprié.
it: È stata superata la quota massima delle dimensioni per i messaggi in arrivo ({0}). Per aumentare la quota, usare la proprietà MaxReceivedMessageSize nell'elemento di binding appropriato.
ja: 受信メッセージの最大メッセージ サイズ クォータ ({0}) を超えました。このクォータを増やすには、適切なバインディング要素の MaxReceivedMessageSize プロパティを使用してください。
ko: 들어오는 메시지의 최대 메시지 크기 할당량({0})을 초과했습니다. 할당량을 늘리려면 적합한 바인딩 요소에서 MaxReceivedMessageSize 속성을 사용하세요.
pl: Maksymalny przydział rozmiaru wiadomości dla wiadomości przychodzących ({0}) został przekroczony. Aby zwiększyć przydział, użyj właściwości MaxReceivedMessageSize we właściwym elemencie powiązania.
pt_br: A cota máxima de tamanho de mensagens de entrada ({0}) foi excedida. Para aumentar a cota, use a propriedade MaxReceivedMessageSize no elemento de associação apropriado.
tr: Gelen iletiler için en büyük ileti boyutu kotası ({0}) aşıldı. Kotayı artırmak için, ilgili bağlama öğesinde MaxReceivedMessageSize özelliğini kullanın.
zh_hans: 已超过传入消息({0})的最大消息大小配额。若要增加配额，请使用相应绑定元素上的 MaxReceivedMessageSize 属性。
zh_hant: 已超出內送郵件 ({0}) 的訊息大小配額上限。若要增加此配額，請利用適當繫結元素上的 MaxReceivedMessageSize 屬性。

# MaxReceivedMessageSizeMustBeInIntegerRange
source: This factory buffers messages, so the message sizes must be in the range of an integer value.
cs: Tento objekt pro vytváření ukládá zprávy do vyrovnávací paměti, takže velikost zpráv musí být v rozsahu hodnoty celých čísel.
de: Diese Factory puffert Nachrichten, daher müssen sich die Nachrichtengrößen im Bereich eines ganzzahligen Werts befinden.
es: Este generador almacena mensajes en búfer, por lo que los tamaños de mensaje deben estar comprendidos en el intervalo de un valor entero.
fr: Cette fabrique place les messages en mémoire tampon : les tailles des messages doivent donc se trouver dans la plage d'une valeur entière.
it: Questa factory memorizza i messaggi nel buffer. Le dimensioni dei messaggi devono essere quindi comprese nell'intervallo di un valore intero.
ja: このファクトリはメッセージをバッファーするため、メッセージ サイズは整数値の範囲内である必要があります。
ko: 이 팩터리가 메시지를 버퍼링하므로 메시지 크기는 정수 값 범위에 있어야 합니다.
pl: Ta fabryka buforuje wiadomości, więc rozmiary wiadomości muszą być wartościami z zakresu liczb całkowitych.
pt_br: Esta fábrica armazena mensagens em buffer e, portanto, os tamanhos das mensagens devem estar no intervalo de um valor inteiro.
tr: Bu fabrika, ileti boyutları bir tamsayı değer aralığında kalacak şekilde iletileri arabelleğe alır.
zh_hans: 这是工厂缓冲区消息，因此该消息大小必须在整数值范围内。
zh_hant: 此處理站會將訊息緩衝處理，因此訊息大小必須在整數值範圍內。

# MaxSentMessageSizeExceeded
source: The maximum message size quota for outgoing messages ({0}) has been exceeded.
cs: Maximální kvóta velikosti zprávy pro odchozí zprávy ({0}) byla překročena.
de: Das Kontingent für die maximale Nachrichtengröße für ausgehende Nachrichten ({0}) wurde überschritten.
es: Se ha excedido la cuota de tamaño máximo de los mensajes salientes ({0}).
fr: Le quota de taille maximale autorisée pour les messages sortants ({0}) a été dépassé.
it: È stata superata la quota massima delle dimensioni per i messaggi in uscita ({0}).
ja: 送信メッセージの最大メッセージ サイズ クォータ ({0}) を超えました。
ko: 보내는 메시지에 대한 최대 메시지 크기 할당량({0})을 초과했습니다.
pl: Przekroczono maksymalny przydział rozmiaru komunikatu dla komunikatów wychodzących ({0}).
pt_br: A cota máxima de tamanho de mensagens de saída ({0}) foi excedida.
tr: Giden iletiler için en büyük ileti boyutu kotası ({0}) aşıldı.
zh_hans: 已超过传出消息({0})的最大消息大小配额。
zh_hant: 已超出外寄郵件 ({0}) 訊息大小配額上限。

# MaximumRetryCountExceeded
source: The maximum retry count has been exceeded with no response from the remote endpoint. The reliable session was faulted. This is often an indication that the remote endpoint is no longer available.
cs: Maximální počet opakování byl překročen bez odpovědi ze vzdáleného koncového bodu. Ve stabilní relaci došlo k chybě. To často znamená, že vzdálený koncový bod již není dostupný.
de: Die maximale Wiederholungsanzahl wurde ohne Antwort vom Remoteendpunkt überschritten. Die zuverlässige Sitzung war nicht erfolgreich. Dies weist häufig darauf hin, dass der Remoteendpunkt nicht mehr verfügbar ist.
es: Se superó el número máximo de reintentos sin respuesta del extremo remoto. Se generó un error en la sesión confiable. Esto suele indicar que el extremo remoto ya no está disponible.
fr: Le nombre maximal de nouvelles tentatives a été dépassé sans qu'il y ait une réponse du point de terminaison distant. La session fiable a généré une erreur. Ceci indique souvent que le point de terminaison distant n'est plus disponible.
it: È stato superato il numero massimo di tentativi, senza risposta dall'endpoint remoto. Sessione affidabile non riuscita. Tale problema indica spesso che l'endpoint remoto non è più disponibile.
ja: 最大再試行回数を超えましたが、リモート エンドポイントからの応答はありませんでした。信頼できるセッションは途中終了されました。この原因としては、リモート エンドポイントが現在使用不能になっていることが考えられます。
ko: 원격 끝점으로부터의 응답 없이 최대 재시도 횟수에 도달했습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다. 이것은 흔히 원격 끝점을 더 이상 사용할 수 없다는 것을 나타냅니다.
pl: Maksymalna liczba powtórzeń została przekroczona przy braku odpowiedzi ze zdalnego punktu końcowego. Wystąpił błąd sesji uwierzytelnionej. Taka sytuacja często wskazuje na to, że zdalny punkt końcowy nie jest już dostępny.
pt_br: A contagem máxima de novas tentativas foi excedida sem resposta a partir do ponto de extremidade remoto. Falha na sessão confiável. Em geral, isso indica que o ponto de extremidade remoto não está mais disponível.
tr: En fazla deneme sayısı, uzak bitiş noktasından yanıt gelmeden aşıldı. Güvenilir oturum hatayla sonlandırıldı. Bu, genellikle uzak bitiş noktasının artık kullanılamadığının bir göstergesidir.
zh_hans: 已超过最大重试计数，但仍未收到来自远程终结点的响应。该可靠的会话出错。这通常指示远程终结点不再可用。
zh_hant: 已超出最大重試計數，而遠端端點沒有回應。可靠工作階段發生錯誤。這通常代表遠端端點已無法使用。

# MessageBodyIsStream
source: ... stream ...
de: ... Datenstrom ...
es: ... secuencia ...
fr: ... flux ...
it: ... flusso ...
ja: ... ストリーム ...
ko: ... 스트림 ...
pl: ... strumień ...
pt_br: ... fluxo...
tr: ... akış ...
zh_hans: ...流...
zh_hant: ... 串流 ...

# MessageBodyMissing
source: A body element was not found inside the message envelope.
cs: V obálce zprávy nebyl nalezen element textu.
de: Im Nachrichtenumschlag wurde kein body-Element gefunden.
es: No se encontró un elemento de cuerpo dentro del sobre del mensaje.
fr: Élément de corps introuvable dans l'enveloppe du message.
it: Non è stato trovato alcun elemento del corpo del messaggio all'interno dell'envelope del messaggio.
ja: メッセージ エンベロープ内に body 要素がありませんでした。
ko: 메시지 봉투 안에서 본문 요소를 찾을 수 없습니다.
pl: Nie znaleziono elementu treści wewnątrz koperty wiadomości.
pt_br: Um elemento de corpo não foi encontrado dentro do envelope da mensagem.
tr: İleti zarfı içinde bir gövde öğesi bulunamadı.
zh_hans: 未在消息信封中找到正文元素。
zh_hant: 訊息信封內找不到內文元素。

# MessageBodyOperationNotValidInBodyState
source: Operation '{0}' is not valid in message body state '{1}'.
cs: Operace {0} je neplatná ve stavu textu zprávy {1}.
de: Vorgang "{0}" ist im Nachrichtenkörperstatus "{1}" nicht gültig.
es: La operación '{0}' no es válida en el estado de cuerpo de mensaje '{1}'.
fr: L'opération '{0}' n'est pas valide dans l'état '{1}' du corps du message.
it: Operazione '{0}' non valida nel corpo del messaggio con stato '{1}'.
ja: メッセージ本文の状態が '{1}' の場合、操作 '{0}' は無効です。
ko: '{0}' 작업이 메시지 본문 상태 '{1}'에서 올바르지 않습니다.
pl: Operacja „{0}” jest nieprawidłowa dla stanu treści wiadomości „{1}”.
pt_br: A operação '{0}' não é válida no estado de corpo da mensagem '{1}'.
tr: '{0}' işlemi, {1} ileti gövdesi durumunda geçerli değildir.
zh_hans: 操作“{0}”在消息正文状态“{1}”下无效。
zh_hant: 訊息本文狀態 '{1}' 中的作業 '{0}' 無效。

# MessageBodyReaderInvalidReadState
source: The body reader is in ReadState '{0}' and cannot be consumed.
cs: Modul pro čtení textů je ve třídě ReadState {0} a nelze jej využít.
de: Das Body Reader-Objekt befindet sich im ReadState "{0}" und kann nicht genutzt werden.
es: El lector de cuerpo está en ReadState "{0}" y no se puede consumir.
fr: Le lecteur de corps est dans l'état ReadState '{0}' et ne peut pas être consommé.
it: Il lettore del corpo si trova in ReadState '{0}' e non può essere utilizzato.
ja: ReadState が '{0}' であるため、本文のリーダーを利用できません。
ko: 본문 판독기가 '{0}' ReadState이므로 사용할 수 없습니다.
pl: Moduł odczytujący treść jest w stanie ReadState „{0}” i nie można go użyć.
pt_br: O leitor de corpo está em ReadState '{0}' e não pode ser consumido.
tr: Gövde okuyucu ReadState '{0}' durumunda ve tüketilemiyor.
zh_hans: 正文读取器处于 ReadState“{0}”，因此无法使用。
zh_hant: 內文讀取裝置的 ReadState 為 '{0}'，因此無法取用。

# MessageBodyToStringError
source: ... Error reading body: {0}: {1} ...
cs: ... Chyba při čtení textu: {0}: {1} ...
de: ... Fehler beim Lesen des Textkörpers: {0}: {1} ...
es: ... Error al leer el cuerpo: {0}: {1} ...
fr: ... Erreur de lecture du corps : {0} : {1} ...
it: ... Errore durante la lettura del corpo: {0}: {1} ...
ja: ... 本文の読み取りでエラーが発生しました: {0}: {1} ...
ko: ... 본문을 읽는 동안 오류 발생: {0}: {1} ...
pl: ... Błąd podczas odczytywania treści: {0}: {1} ...
pt_br: ... Erro ao fazer a leitura do corpo: {0}: {1}...
tr: ... Gövde okuma hatası: {0}: {1} ...
zh_hans: ...读取正文时出错: {0}: {1}...
zh_hant: ... 讀取內文時發生錯誤: {0}: {1} ...

source: MessageBuffer is closed.
cs: Třída MessageBuffer je uzavřena.
de: MessageBuffer ist geschlossen.
es: MessageBuffer está cerrado.
fr: MessageBuffer fermé.
it: L'elemento MessageBuffer è chiuso.
ja: MessageBuffer は閉じています。
ko: MessageBuffer가 닫혀 있습니다.
pl: Element MessageBuffer jest zamknięty.
pt_br: O MessageBuffer está fechado.
tr: MessageBuffer kapatıldı.
zh_hans: MessageBuffer 已关闭。
zh_hant: MessageBuffer 已關閉。

# MessageClosed
source: Message is closed.
cs: Zpráva je uzavřena.
de: Die Nachricht ist geschlossen.
es: El mensaje está cerrado.
fr: Message fermé.
it: L'elemento Message è chiuso.
ja: Message は閉じられています。
ko: 메시지가 닫혀 있습니다.
pl: Wiadomość jest zamknięta.
pt_br: A mensagem está fechada.
tr: İleti kapatıldı.
zh_hans: 消息已关闭。
zh_hant: 訊息已關閉。

# MessageExceptionOccurred
source: A problem occurred while reading a message. See inner exception for details.
cs: Při čtení zprávy došlo k potížím. Další informace naleznete v popisu vnitřní výjimky.
de: Beim Lesen einer Nachricht ist ein Problem aufgetreten. Weitere Informationen finden Sie in der internen Ausnahme.
es: Error al leer un mensaje. Consulte la excepción interna para obtener más información.
fr: Un problème s'est produit lors de la lecture d'un message. Pour plus d'informations, consultez l'exception interne.
it: Problema durante la lettura di un messaggio. Per ulteriori dettagli, vedere l'eccezione interna.
ja: メッセージの読み取り中に問題が発生しました。詳細については、内部例外を参照してください。
ko: 메시지를 읽는 동안 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하십시오.
pl: Wystąpił błąd podczas odczytywania wiadomości. Sprawdź wyjątki wewnętrzne, aby uzyskać szczegółowe informacje.
pt_br: Problema ao fazer a leitura de uma mensagem. Consulte a exceção interna para obter detalhes.
tr: Bir ileti okunurken hata oluştu. ayrıntılar için iç özel duruma bakın.
zh_hans: 读取消息时发生问题。有关详细信息，请参见内部异常。
zh_hant: 讀取訊息時發生問題。如需詳細資訊，請參閱內部例外狀況。

# MessageHasBeenCopied
source: This message cannot support the operation because it has been copied.
cs: Tato zpráva nemůže podporovat operaci, protože byla zkopírována.
de: Diese Nachricht kann den Vorgang nicht unterstützen, da sie kopiert wurde.
es: Este mensaje no puede admitir la operación porque se ha copiado.
fr: Ce message ne peut pas prendre en charge l'opération, car il a été copié.
it: Questo messaggio non può supportare l'operazione perché è stato copiato.
ja: このメッセージはコピーされているため、操作をサポートできません。
ko: 이 메시지는 복사되었기 때문에 작업을 지원할 수 없습니다.
pl: Ta wiadomość nie może obsługiwać operacji, ponieważ została skopiowana.
pt_br: Esta mensagem não pode dar suporte à operação porque ela foi copiada.
tr: Kopyalanmış olduğu için bu ileti işlemi desteklemez.
zh_hans: 此消息不支持该操作，因为已复制该操作。
zh_hant: 此訊息已被複製，因此無法支援作業。

# MessageHasBeenRead
source: This message cannot support the operation because it has been read.
cs: Tato zpráva nemůže podporovat operaci, protože byla přečtena.
de: Diese Nachricht kann den Vorgang nicht unterstützen, da sie gelesen wurde.
es: Este mensaje no puede admitir la operación porque se ha leído.
fr: Ce message ne peut pas prendre en charge l'opération, car il a été lu.
it: Questo messaggio non può supportare l'operazione perché è stato letto.
ja: このメッセージは読み取られているため、操作をサポートできません。
ko: 이 메시지는 읽었기 때문에 작업을 지원할 수 없습니다.
pl: Ta wiadomość nie może obsługiwać operacji, ponieważ została odczytana.
pt_br: Esta mensagem não pode dar suporte à operação porque ela foi lida.
tr: Okunmuş olduğu için bu ileti işlemi desteklemez.
zh_hans: 此消息不支持该操作，因为已读取该操作。
zh_hant: 此訊息已被讀取，因此無法支援作業。

# MessageHasBeenWritten
source: This message cannot support the operation because it has been written.
cs: Tato zpráva nemůže podporovat operaci, protože byla zapsána.
de: Diese Nachricht kann den Vorgang nicht unterstützen, da sie geschrieben wurde.
es: Este mensaje no puede admitir la operación porque se ha escrito.
fr: Ce message ne peut pas prendre en charge l'opération, car il a été écrit.
it: Questo messaggio non può supportare l'operazione perché è stato scritto.
ja: このメッセージは書き込まれているため、操作をサポートできません。
ko: 이 메시지는 기록되었기 때문에 작업을 지원할 수 없습니다.
pl: Ta wiadomość nie może obsługiwać operacji, ponieważ została zapisana.
pt_br: Esta mensagem não pode dar suporte à operação porque ela foi gravada.
tr: Yazılmış olduğu için bu ileti işlemi desteklemez.
zh_hans: 此消息不支持该操作，因为已写入该操作。
zh_hant: 此訊息已寫入，因此無法支援作業。
