Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxHeaderNamespaceMismatchInMessageContract
source: Header namespace mismatch in member {1} of type {0}. The header namespace found in the description is {2}. The element namespace deduced by the formatter is {3}. This mismatch can happen if the Namespace specified in XmlElementAttribute or XmlArrayAttribute does not match the namespace specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the contract namespace.
cs: Došlo k neshodě oborů názvů záhlaví ve členu {1} typu {0}. Obor názvů záhlaví nalezený v popisu je {2}. Obor názvů elementu odvozený formátovacím modulem je {3}. K této neshodě může dojít, pokud obor názvů určený ve třídě XmlElementAttribute nebo XmlArrayAttribute neodpovídá oboru názvů určenému ve třídě MessageHeaderAttribute nebo MessageHeaderArrayAttribute nebo v oboru názvů kontraktu.
de: Headernamespacekonflikt im Member {1} vom Typ {0}. Der in der Beschreibung gefundene Headernamespace ist {2}. Der vom Formatierer hergeleitete Elementnamespace ist {3}. Dieser Konflikt kann auftreten, wenn der im XmlElementAttribute oder XmlArrayAttribute angegebene Namespace nicht dem im MessageHeaderAttribute oder MessageHeaderArrayAttribute angegebenen Namespace oder dem Vertragsnamespace entspricht.
es: El espacio de nombres del encabezado no coincide en el miembro {1} del tipo {0}. El espacio de nombres del encabezado que se encontró en la descripción es {2}. El espacio de nombres del elemento que dedujo el formateador es {3}. Esta falta de coincidencia puede suceder si el espacio de nombres especificado en el elemento XmlElementAttribute o XmlArrayAttribute no coincide con el espacio de nombres especificado en el elemento MessageHeaderAttribute o MessageHeaderArrayAttribute, o con el espacio de nombres del contrato.
fr: Différence d'espace de noms dans le membre {1} du type {0}. L'espace de noms de l'en-tête trouvé dans la description est {2}. L'espace de noms de l'élément déduit par le formateur est {3}. Cette différence peut se produire si le Namespace spécifié dans XmlElementAttribute ou XmlArrayAttribute ne correspond pas à l'espace de noms spécifié dans MessageHeaderAttribute ou MessageHeaderArrayAttribute ou au contrat de l'espace de noms.
it: Spazio dei nomi di intestazione non corrispondenti nel membro {1} di tipo {0}. Lo spazio dei nomi di intestazione trovato nella descrizione è {2}. Lo spazio di nomi di elemento dedotto dal formattatore è {3}. Questa situazione può verificarsi se l'elemento Namespace specificato in XmlElementAttribute o XmlArrayAttribute non corrisponde allo spazio dei nomi specificato in MessageHeaderAttribute o in MessageHeaderArrayAttribute o allo spazio dei nomi del contratto.
ja: 型 {0} のメンバー {1} においてヘッダーの名前空間が一致しません。説明内に見つかったヘッダーの名前空間は {2} です。フォーマッタによって推測された要素の名前空間は {3} です。この不一致は、XmlElementAttribute や XmlArrayAttribute で指定された Namespace が MessageHeaderAttribute や MessageHeaderArrayAttribute で指定された名前空間、またはコントラクトの名前空間と一致しない場合に起こる可能性があります。
ko: {0} 형식의 {1} 멤버에서 헤더 네임스페이스가 일치하지 않습니다. 설명에 있는 헤더 네임스페이스는 {2}입니다. 포맷터에 의해 추론된 요소 네임스페이스는 {3}입니다. 이러한 불일치는 XmlElementAttribute 또는 XmlArrayAttribute에 지정된 Namespace가 MessageHeaderAttribute 또는 MessageHeaderArrayAttribute에 지정된 네임스페이스나 계약 네임스페이스와 일치하지 않는 경우에 발생합니다.
pl: Niezgodność przestrzeni nazw nagłówka w składowej {1} typu {0}. Przestrzeń nazw nagłówka odnaleziona w opisie to {2}. Przestrzeń nazw elementu ustalona przez program formatujący to {3}. Taka niezgodność może nastąpić, jeśli przestrzeń nazw określona w parametrze XmlElementAttribute lub XmlArrayAttribute nie odpowiada przestrzeni nazw określonej w parametrze MessageHeaderAttribute, MessageHeaderArrayAttribute lub przestrzeni nazw kontraktu.
pt_br: Namespace de cabeçalho incompatível no membro {1} do tipo {0}. O namespace de cabeçalho encontrado na descrição é {2}. O namespace do elemento deduzido pelo formatador é {3}. Essa incompatibilidade pode acontecer se o Namespace especificado em XmlElementAttribute ou em XmlArrayAttribute não corresponde ao namespace especificado em MessageHeaderAttribute ou em MessageHeaderArrayAttribute ou ao namespace do contrato.
tr: {0} türünün {1} üyesinde üst bilgi ad alanı uyumsuzluğu var. Açıklamada bulunan üst bilgi ad alanı: {2}. Biçimlendirici tarafından atanan öğe ad alanı: {3}. XmlElementAttribute içinde belirtilen Namespace ya da XmlArrayAttribute, MessageHeaderAttribute ya da MessageHeaderArrayAttribute içinde belirtilen ad alanı veya anlaşma ad alanıyla eşleşmediğinde bu uyumsuzluk oluşabilir.
zh_hans: 类型为 {0} 的成员 {1} 中的标头命名空间不匹配。描述中的标头命名空间是 {2}。格式化程序推导出的元素命名空间是 {3}。如果在 XmlElementAttribute 或 XmlArrayAttribute 中指定的 Namespace 与在 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 或协定命名空间中指定的命名空间不匹配，就会出现这种情况。
zh_hant: 類型 {0} 成員 {1} 的標頭命名空間不符。描述中的標頭名稱為 {2}，格式器推算出的元素命名空間為 {3}。若 XmlElementAttribute 或 XmlArrayAttribute 中指定的 Namespace，不符合 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 中指定的命名空間或合約命名空間，便會發生上述不符的情形。

# SFxHeaderNamespaceMismatchInOperation
source: Header namespace mismatch in operation {0} from contract {1}:{2}. The header namespace found in the description is {3}. The element namespace deduced by the formatter is {4}. This mismatch can happen if the Namespace specified in XmlElementAttribute or XmlArrayAttribute does not match the namespace specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the contract namespace.
cs: Došlo k neshodě oborů názvů záhlaví v operaci {0} z kontraktu {1}:{2}. Obor názvů záhlaví nalezený v popisu je {3}. Obor názvů elementu odvozený formátovacím modulem je {4}. K této neshodě může dojít, pokud obor názvů určený ve třídě XmlElementAttribute nebo XmlArrayAttribute neodpovídá oboru názvů určenému ve třídě MessageHeaderAttribute nebo MessageHeaderArrayAttribute nebo v oboru názvů kontraktu.
de: Headernamespacekonflikt im Vorgang {0} des Vertrags {1}:{2}. Der in der Beschreibung gefundene Headernamespace ist {3}. Der vom Formatierer hergeleitete Elementnamespace ist {4}. Dieser Konflikt kann auftreten, wenn der im XmlElementAttribute oder XmlArrayAttribute angegebene Namespace nicht dem im MessageHeaderAttribute oder MessageHeaderArrayAttribute angegebenen Namespace oder dem Vertragsnamespace entspricht.
es: El espacio de nombres del encabezado no coincide en la operación {0} del contrato {1}:{2}. El espacio de nombres del encabezado que se encontró en la descripción es {3}. El espacio de nombres del elemento que dedujo el formateador es {4}. Esta falta de coincidencia puede suceder si el espacio de nombres especificado en el elemento XmlElementAttribute o XmlArrayAttribute no coincide con el espacio de nombres especificado en MessageHeaderAttribute o MessageHeaderArrayAttribute, o con el espacio de nombres del contrato.
fr: Différence d'espace de noms d'en-tête dans l'opération {0} du contrat {1}:{2}. L'espace de noms de l'en-tête trouvé dans la description est {3}. L'espace de noms de l'élément déduit par le formateur est {4}. Cette différence peut se produire si le Namespace spécifié dans XmlElementAttribute ou XmlArrayAttribute ne correspond pas à l'espace de noms spécifié dans MessageHeaderAttribute ou MessageHeaderArrayAttribute ou au contrat de l'espace de noms.
it: Spazio dei nomi di intestazione non corrispondenti nell'operazione {0} del contratto {1}:{2}. Lo spazio dei nomi di intestazione trovato nella descrizione è {3}. Lo spazio di nomi di elemento dedotto dal formattatore è {4}. Questa situazione può verificarsi se l'elemento Namespace specificato in XmlElementAttribute o XmlArrayAttribute non corrisponde allo spazio dei nomi specificato in MessageHeaderAttribute o in MessageHeaderArrayAttribute o allo spazio dei nomi del contratto.
ja: コントラクト {1}:{2} の操作 {0} においてヘッダーの名前空間が一致しません。説明内に見つかったヘッダーの名前空間は {3} です。フォーマッタによって推測された要素の名前空間は {4} です。この不一致は、XmlElementAttribute や XmlArrayAttribute で指定された Namespace が MessageHeaderAttribute や MessageHeaderArrayAttribute で指定された名前空間、またはコントラクトの名前空間と一致しない場合に起こる可能性があります。
ko: {1}:{2} 계약의 {0} 작업에서 헤더 네임스페이스가 일치하지 않습니다. 설명에 있는 헤더 네임스페이스는 {3}입니다. 포맷터에 의해 추론된 요소 네임스페이스는 {4}입니다. 이러한 불일치는 XmlElementAttribute 또는 XmlArrayAttribute에 지정된 Namespace가 MessageHeaderAttribute 또는 MessageHeaderArrayAttribute에 지정된 네임스페이스나 계약 네임스페이스와 일치하지 않는 경우에 발생합니다.
pl: Niezgodność przestrzeni nazw nagłówka w operacji {0} z kontraktu {1}:{2}. Przestrzeń nazw nagłówka odnaleziona w opisie to {3}. Przestrzeń nazw elementu ustalona przez program formatujący to {4}. Taka niezgodność może nastąpić, jeśli przestrzeń nazw określona w parametrze XmlElementAttribute lub XmlArrayAttribute nie odpowiada przestrzeni nazw określonej w parametrze MessageHeaderAttribute, MessageHeaderArrayAttribute lub przestrzeni nazw kontraktu.
pt_br: Namespace de cabeçalho incompatível na operação {0} do contrato {1}:{2}. O namespace de cabeçalho encontrado na descrição é {3}. O namespace do elemento deduzido pelo formatador é {4}. Essa incompatibilidade pode acontecer se o Namespace especificado em XmlElementAttribute ou em XmlArrayAttribute não corresponder ao namespace especificado em MessageHeaderAttribute ou em MessageHeaderArrayAttribute ou ao namespace do contrato.
tr: {1}:{2} anlaşmasındaki {0} işleminde üst bilgi ad alanı uyumsuzluğu var. Açıklamada bulunan üst bilgi ad alanı: {3}. Biçimlendirici tarafından atanan öğe ad alanı: {4}. XmlElementAttribute içinde belirtilen Namespace ya da XmlArrayAttribute, MessageHeaderAttribute ya da MessageHeaderArrayAttribute içinde belirtilen ad alanıyla veya anlaşma ad alanıyla eşleşmediğinde bu uyumsuzluk oluşabilir.
zh_hans: 来自协定 {1} 中操作 {0} 的标头命名空间不匹配: {2}。描述中的标头命名空间是 {3}。格式化程序推导出的元素命名空间是 {4}。如果在 XmlElementAttribute 或 XmlArrayAttribute 中指定的 Namespace 与在 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 或协定命名空间中指定的命名空间不匹配，就会出现这种不匹配。
zh_hant: 合約 {1}:{2} 作業 {0} 的標頭命名空間不符。描述中的標頭命名空間為 {3}，格式器推算出的元素命名空間為 {4}。若 XmlElementAttribute 或 XmlArrayAttribute 中指定的 Namespace，不符合 MessageHeaderAttribute 或 MessageHeaderArrayAttribute 中指定的命名空間或合約命名空間，便會發生上述不符的情形。

# SFxHeaderNotUnderstood
source: The header '{0}' from the namespace '{1}' was not understood by the recipient of this message, causing the message to not be processed. This error typically indicates that the sender of this message has enabled a communication protocol that the receiver cannot process. Please ensure that the configuration of the client's binding is consistent with the service's binding.
cs: Záhlaví {0} z oboru názvů {1} příjemce této zprávy neporozuměl, takže zpráva nebyla zpracována. Tato chyba obvykle udává, že odesílatel zprávy povolil komunikační protokol, který příjemce nemůže zpracovat. Zkontrolujte, zda je konfigurace klientovy vazby konzistentní s vazbou služby.
de: Der Header "{0}" aus dem Namespace "{1}" wurde vom Empfänger dieser Nachricht nicht erkannt. Daher wird die Nachricht nicht verarbeitet. Dieser Fehler weist im Allgemeinen darauf hin, dass der Sender dieser Nachricht ein Kommunikationsprotokoll aktiviert hat, dass der Empfänger nicht verarbeiten kann. Stellen Sie sicher, dass die Konfiguration der Bindung des Clients mit der Bindung des Diensts übereinstimmt.
es: El destinatario de este mensaje no entendió el encabezado "{0}" del espacio de nombres "{1}", por lo que el mensaje no se procesó. Este error suele indicar que el remitente del mensaje habilitó un protocolo de comunicación que el destinatario no puede procesar. Asegúrese de que la configuración del enlace del cliente es coherente con el enlace del servicio.
fr: L'en-tête '{0}' de l'espace de noms '{1}' n'a pas été compris par le destinataire de ce message, provoquant le non-traitement du message. Cette erreur indique en général que l'expéditeur de ce message a activé un protocole de communication que le récepteur ne peut pas traiter. Vérifiez que la configuration de la liaison du client correspond à la liaison du service.
it: L'intestazione '{0}' dello spazio dei nomi '{1}' non è stata riconosciuta dal destinatario del messaggio. Il messaggio non è stato elaborato. Questo errore indica in genere che il mittente del messaggio ha abilitato un protocollo di comunicazione che non può essere elaborato dal destinatario. Assicurarsi che la configurazione del binding del client sia coerente con il binding del servizio.
ja: このメッセージの受信側で名前空間 '{1}' のヘッダー '{0}' を認識できなかったため、このメッセージは処理されませんでした。このエラーは一般に、受信側で処理できない通信プロトコルがこのメッセージの送信側で有効になっていることを示します。クライアントのバインドの構成がサービスのバインドと整合していることを確認してください。
ko: 이 메시지를 받은 사람이 '{1}' 네임스페이스의 '{0}' 헤더를 인식할 수 없으므로 메시지가 처리되지 않습니다. 이 오류는 일반적으로 이 메시지를 보낸 사람이 받는 사람이 처리할 수 없는 통신 프로토콜을 사용했다는 것을 의미합니다. 클라이언트 바인딩의 구성이 서비스 바인딩의 구성과 일치하는지 확인하세요.
pl: Nagłówek „{0}” z przestrzeni nazw „{1}” nie został zrozumiany przez odbiorcę tego komunikatu, przez co komunikat nie został przetworzony. Ten błąd zazwyczaj oznacza, że nadawca komunikatu uruchomił protokół komunikacyjny, którego odbiorca nie może przetworzyć. Należy upewnić się, czy konfiguracja powiązań klienta jest spójna z powiązaniem usługi.
pt_br: O cabeçalho '{0}' do namespace '{1}' não foi entendido pelo destinatário desta mensagem, fazendo com que a mensagem não fosse processada. Esse erro normalmente indica que o remetente desta mensagem habilitou um protocolo de comunicação que o receptor não pode processar. Verifique se a configuração da associação do cliente é coerente com a associação do serviço.
tr: '{1}' ad alanındaki '{0}' üst bilgisi bu ileti alıcısı tarafından anlaşılmadı ve iletinin işlenmemesine neden oldu. Bu hata tipik biçimde bu iletiyi gönderenin alıcının işleyemeyeceği bir iletişim protokolü etkinleştirdiğini göstermektedir. İstemci bağlaması yapılandırmasının, hizmet bağlamasıyla tutarlı olmasını sağlayın.
zh_hans: 此消息的接收方不能理解来自命名空间“{1}”的标头“{0}”，因此无法处理该消息。该错误通常表明消息发送方启用了接收方无法处理的通信协议。请确保客户端的绑定配置与服务的绑定一致。
zh_hant: 此訊息的收件者無法辨認命名空間 '{1}' 的標頭 '{0}'，因而無法處理該訊息。此錯誤通常表示這個訊息的寄件者啟用了收件者無法處理的通訊協定。請確認用戶端繫結的組態與服務的繫結一致。

# SFxHeadersAreNotSupportedInEncoded
source: Message {0} must not have headers to be used in RPC encoded style.
cs: Zpráva {0} nesmí mít záhlaví určená ke zpracování ve stylu kódovaném pomocí RPC.
de: Die {0}-Nachricht darf keine Header enthalten, wenn das Format "RPC/encoded" verwendet werden soll.
es: El mensaje {0} no debe tener encabezados que se vayan a usar en el estilo codificado RPC.
fr: Le message {0} ne doit pas contenir d'en-tête à utiliser dans le style encodé RPC.
it: Il messaggio {0} non deve avere intestazioni da utilizzare nello stile codificato RPC.
ja: メッセージ {0} に、RPC でエンコードされたスタイルで使用するヘッダーを含めることはできません。
ko: {0} 메시지에는 RPC 인코딩된 스타일의 헤더를 사용할 수 없습니다.
pl: Komunikat {0} nie może mieć nagłówków, aby mógł zostać użyty w stylu wywołania RPC z kodowaniem.
pt_br: A mensagem {0} não deve ter cabeçalhos para ser usada no estilo RPC codificado.
tr: {0} iletisi, RPC kodlama stilinde kullanılmak üzere üst bilgi bulundurmamalıdır.
zh_hans: 消息 {0} 不能有用于 RPC 编码样式的标头。
zh_hant: 訊息 {0} 不可具有用於 RPC 編碼樣式的標頭。

# SFxImmutableChannelFactoryBehavior0
source: This value cannot be changed after the ChannelFactory has opened.
cs: Tuto hodnotu po otevření třídy ChannelFactory nelze změnit.
de: Dieser Wert kann nicht geändert werden, nachdem die ChannelFactory geöffnet wurde.
es: Este valor no se puede cambiar una vez abierto ChannelFactory.
fr: Impossible de changer cette valeur après l'ouverture de ChannelFactory.
it: Non è possibile modificare questo valore dopo l'apertura di ChannelFactory.
ja: ChannelFactory が開かれた後に、この値を変更することはできません。
ko: ChannelFactory가 열리고 나면 이 값을 변경할 수 없습니다.
pl: Ta wartość nie może zostać zmieniona po otwarciu elementu ChannelFactory.
pt_br: Não é possível alterar este valor após abrir a ChannelFactory.
tr: ChannelFactory açıldıktan sonra bu değer değiştirilemez.
zh_hans: 打开 ChannelFactory 后，无法更改此值。
zh_hant: 開啟 ChannelFactory 之後，便不能更改此值。

# SFxImmutableClientBaseCacheSetting
source: This value cannot be changed after the first ClientBase of type '{0}' has been created.
cs: Tato vlastnost nemůže být změněna po vytvoření prvního objektu ClientBase typu {0}.
de: Dieser Wert kann nicht geändert werden, nachdem die erste ClientBase vom Typ "{0}" erstellt wurde.
es: Este valor no se puede modificar una vez se haya creado el primer elemento ClientBase de tipo '{0}'.
fr: Cette valeur ne peut pas être changée après la création du premier ClientBase de type '{0}'.
it: Impossibile modificare questo valore dopo la creazione del primo ClientBase di tipo '{0}'.
ja: '{0}' 型の最初の ClientBase が作成された後にこの値を変更することはできません。
ko: 이 값은 '{0}' 형식의 첫 번째 ClientBase를 만든 다음 변경할 수 없습니다.
pl: Tej wartości nie można zmienić po utworzeniu pierwszego obiektu ClientBase typu „{0}”.
pt_br: Esse valor não pode ser alterado após a criação do primeiro ClientBase do tipo '{0}'.
tr: '{0}' türündeki ilk ClientBase oluşturulduktan sonra bu değer değiştirilemez.
zh_hans: 在创建第一个类型为“{0}”的 ClientBase 之后，无法更改此值。
zh_hant: 第一次建立 '{0}' 類型的 ClientBase 之後，就無法變更此值。

# SFxImmutableServiceHostBehavior0
source: This value cannot be changed after the ServiceHost has opened.
cs: Tuto hodnotu po otevření třídy ServiceHost nelze změnit.
de: Dieser Wert kann nicht geändert werden, nachdem der ServiceHost geöffnet wurde.
es: Este valor no se puede cambiar una vez abierto ServiceHost.
fr: Impossible de changer cette valeur après l'ouverture de ServiceHost.
it: Non è possibile modificare questo valore dopo l'apertura di ServiceHost.
ja: ServiceHost が開かれた後に、この値を変更することはできません。
ko: ServiceHost가 열리고 나면 이 값을 변경할 수 없습니다.
pl: Ta wartość nie może zostać zmieniona po otwarciu elementu ServiceHost.
pt_br: Não é possível alterar este valor após abrir o ServiceHost.
tr: ServiceHost açıldıktan sonra bu değer değiştirilemez.
zh_hans: 打开 ServiceHost 后，无法更改此值。
zh_hant: 開啟 ServiceHost 之後，便不能更改此值。

# SFxInitializationUIDisallowed
source: AllowInitializationUI was set to false for this channel, but the channel is configured to use the '{0}' as an interactive initializer.
cs: Třída AllowInitializationUI byla pro tento kanál nastavena na hodnotu false, ale kanál je nakonfigurován pro použití {0} jako interaktivního spouštěče.
de: AllowInitializationUI wurde für diesen Kanal auf "false" gesetzt, der Kanal ist jedoch zur Verwendung von "{0}" als interaktiver Initialisierer konfiguriert.
es: El elemento AllowInitializationUI se estableció en false para este canal, pero el canal está configurado para usar "{0}" como inicializador interactivo.
fr: AllowInitializationUI a la valeur false pour ce canal, mais le canal est configuré pour utiliser '{0}' comme initialiseur interactif.
it: AllowInitializationUI è stato impostato su false per il canale, ma il canale è configurato per l'uso di '{0}' come inizializzatore interattivo.
ja: AllowInitializationUI はこのチャネルに対して False に設定されていますが、このチャネルはインタラクティブな初期化子として '{0}' を使用するように構成されています。
ko: AllowInitializationUI가 이 채널에 대해 false로 설정되었지만, 채널은 대화형 이니셜라이저로서 '{0}'을(를) 사용하도록 구성되었습니다.
pl: Wartość parametru AllowInitializationUI dla tego kanału została ustawiona na false, ale kanał został skonfigurowany do korzystania z „{0}” jako interaktywnego inicjatora.
pt_br: A AllowInitializationUI foi definida como false para este canal, mas o canal está configurado para usar a '{0}' como um inicializador interativo.
tr: AllowInitializationUI, bu kanal için false olarak ayarlanmış, ancak kanal '{0}' öğesini bir etkileşimli başlatıcı olarak kullanacak biçimde yapılandırılmış.
zh_hans: 该通道的 AllowInitializationUI 设置为 False，但该通道配置为使用“{0}”作为交互初始值设定项。
zh_hant: 此通道的 AllowInitializationUI 設定為 False，但是通道設定為使用 '{0}' 作為互動式初始設定式。

# SFxInitializationUINotCalled
source: The channel is configured to use interactive initializer '{0}', but the channel was Opened without calling DisplayInitializationUI. Call DisplayInitializationUI before calling Open or other methods on this channel.
cs: Kanál je nakonfigurován k použití interaktivního spouštěče {0}, ale kanál byl otevřen bez volání třídy DisplayInitializationUI. Před voláním otevření nebo jiných metod v tomto kanálu volejte třídu DisplayInitializationUI.
de: Der Kanal ist zur Verwendung von "{0}" als interaktiver Initialisierer konfiguriert, der Kanal wurde jedoch geöffnet, ohne DisplayInitializationUI aufzurufen. Rufen Sie DisplayInitializationUI auf, bevor Sie die Open-Methode oder andere Methoden für diesen Kanal aufrufen.
es: El canal está configurado para usar el inicializador interactivo "{0}", pero se abrió sin llamar a DisplayInitializationUI. Llame a DisplayInitializationUI antes de llamar a Open u otros métodos en este canal.
fr: Le canal est configuré pour utiliser l'initialiseur interactif '{0}', mais le canal était Opened sans appeler DisplayInitializationUI. Appelez DisplayInitializationUI avant d'appeler Open ou d'autres méthodes sur ce canal.
it: Il canale è configurato per l'uso dell'inizializzatore interattivo '{0}', ma per il canale è stato chiamato il metodo Open senza chiamare DisplayInitializationUI. Chiamare DisplayInitializationUI prima di chiamare Open o altri metodi sul canale.
ja: このチャネルはインタラクティブな初期化子 '{0}' を使用するように構成されていますが、このチャネルは DisplayInitializationUI を呼び出さずに開かれました。このチャネルで Open メソッドまたは他のメソッドを呼び出す前に、DisplayInitializationUI を呼び出してください。
ko: 대화형 이니셜라이저 '{0}'을(를) 사용하도록 채널을 구성했지만, 채널이 DisplayInitializationUI를 호출하지 않고 열림 상태입니다. 이 채널에서 Open 또는 다른 메서드를 호출하기 전에 DisplayInitializationUI를 호출하세요.
pl: Kanał jest skonfigurowany do korzystania z interaktywnego inicjatora „{0}”, ale został otwarty bez wywoływania metody DisplayInitializationUI. Wywołaj metodę DisplayInitializationUI przed wywołaniem metody Open lub innych metod dla tego kanału.
pt_br: O canal está configurado para usar inicializador interativo '{0}', mas o canal foi Aberto sem chamar a DisplayInitializationUI. Chame a DisplayInitializationUI antes de chamar Open ou outros métodos neste canal.
tr: Kanal, '{0}' etkileşimli başlatıcısını kullanacak biçimde yapılandırılmış, ancak kanal DisplayInitializationUI çağrısı yapmadan Opened durumuna gelmiş. Bu kanalda Open ya da diğer metotları çağırmadan DisplayInitializationUI işlevini çağırın.
zh_hans: 该通道配置为使用交互初始值设定项“{0}”，但该通道是在未调用 DisplayInitializationUI 的情况下打开的。在该通道上调用 Open 或其他方法前调用 DisplayInitializationUI。
zh_hant: 通道設定為使用互動式初始設定式 '{0}'，但是通道於先前 Open 時並未呼叫 DisplayInitializationUI。在此通道上呼叫 Open 或其他方法之前，請先呼叫 DisplayInitializationUI。
