Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxMetadataReferenceInvalidLocation
source: The value '{0}' is not valid for the Location property. The Location property must be a valid absolute or relative URI.
cs: Hodnota {0} je neplatná pro vlastnost umístění. Vlastnost umístění musí být platný absolutní nebo relativní identifikátor URI.
de: Der Wert "{0}" ist für die Location-Eigenschaft ungültig. Die Location-Eigenschaft muss ein gültiger absoluter oder relativer URI sein.
es: El valor "{0}" no es válido para la propiedad Location. La propiedad Location debe ser un URI absoluto o relativo válido.
fr: La valeur '{0}' est non valide pour la propriété Location. La propriété Location doit être un URI absolu ou relatif valide.
it: Il valore '{0}' non è valido per la proprietà Location. La proprietà Location deve essere un URI relativo o assoluto valido.
ja: 値 '{0}' は、Location プロパティには有効ではありません。Location プロパティは、有効な絶対 URI または相対 URI であることが必要です。
ko: '{0}' 값이 Location 속성에 유효하지 않습니다. Location 속성은 유효한 절대 또는 상대 URI이어야 합니다.
pl: Wartość „{0}” jest nieprawidłowa dla właściwości Location. Właściwość Location musi być prawidłowym, bezwzględnym lub względnym identyfikatorem URI.
pt_br: O valor '{0}' é inválido para a propriedade Location. A propriedade Location deve ser um URI absoluto ou relativo válido.
tr: '{0}' değeri, Location özelliği için geçerli değil. Location özelliği, geçerli bir mutlak ya da göreli URI olmalıdır.
zh_hans: 值“{0}”对于 Location 属性无效。Location 属性必须是有效的绝对 URI 或相对 URI。
zh_hant: 值 '{0}' 並非 Location 屬性的有效值。Location 屬性必須是有效的絕對或相對 URI。

# SFxMethodNotSupported1
source: Method {0} is not supported on this proxy, this can happen if the method is not marked with OperationContractAttribute or if the interface type is not marked with ServiceContractAttribute.
cs: Metoda {0} není na tomto proxy serveru podporována. To se může stát, pokud metoda není označena třídou OperationContractAttribute, nebo pokud typ rozhraní není označen třídou ServiceContractAttribute.
de: Die {0}-Methode wird für diesen Proxy nicht unterstützt. Dies kann vorkommen, wenn die Methode nicht mit dem OperationContractAttribute markiert ist oder der Schnittstellentyp nicht mit dem ServiceContractAttribute markiert ist.
es: No se admite el método {0} en este proxy. Esto puede suceder si el método no está marcado con el atributo OperationContractAttribute o si el tipo de interfaz no está marcado con el atributo ServiceContractAttribute.
fr: La méthode {0} n'est pas prise en charge sur ce proxy ; ceci peut se produire si la méthode n'est pas marquée avec OperationContractAttribute ou si le type d'interface n'est pas marqué avec ServiceContractAttribute.
it: Il metodo {0} non è supportato su questo proxy. È possibile che il metodo non sia contrassegnato con OperationContractAttribute o che il tipo di interfaccia non sia contrassegnato con ServiceContractAttribute.
ja: メソッド {0} はこのプロキシでサポートされません。これは、メソッドが OperationContractAttribute でマークされていない場合、またはインターフェイスの種類が ServiceContractAttribute でマークされていない場合に発生することがあります。
ko: {0} 메서드가 이 프록시에서 지원되지 않습니다. 메서드가 OperationContractAttribute로 표시되지 않거나 인터페이스 형식이 ServiceContractAttribute로 표시되지 않으면 이러한 현상이 발생합니다.
pl: Metoda {0} nie jest obsługiwana na tym serwerze proxy. Taka sytuacja może mieć miejsce, jeśli metoda nie jest oznaczona atrybutem OperationContractAttribute lub jeśli typ interfejsu nie jest oznaczony atrybutem ServiceContractAttribute.
pt_br: Não há suporte para o método {0} neste proxy. Isso poderá acontecer se o método não estiver marcado com a classe OperationContractAttribute ou se o tipo de interface não estiver marcado com ServiceContractAttribute.
tr: {0} metodu bu proxy üzerinde desteklenmiyor, bu durumun oluşma nedeni, metodun OperationContractAttribute ile işaretlenmemiş olması ya da arabirim türünün ServiceContractAttribute ile işaretlenmemiş olmasıdır.
zh_hans: 方法 {0} 在此代理中不受支持，如果未使用 OperationContractAttribute 标记方法或未使用 ServiceContractAttribute 标记接口类型，则会出现此情况。
zh_hant: 此 Proxy 上不支援方法 {0}。若方法未標示有 OperationContractAttribute，或介面類型未標示有 ServiceContractAttribute，即會發生此一狀況。

# SFxMethodNotSupportedOnCallback1
source: Callback method {0} is not supported, this can happen if the method is not marked with OperationContractAttribute or if its interface type is not the target of the ServiceContractAttribute's CallbackContract.
cs: Metoda zpětného volání {0} není podporována. To se může stát, pokud metoda není označena třídou OperationContractAttribute, nebo pokud typ rozhraní není cílem třídy CallbackContract třídy ServiceContractAttribute.
de: Die Rückrufmethode {0} wird nicht unterstützt. Dies kann vorkommen, wenn die Methode nicht mit dem OperationContractAttribute markiert ist oder der Schnittstellentyp nicht das Ziel des CallbackContract von ServiceContractAttribute ist.
es: No se admite el método de devolución de llamada {0}. Esto puede suceder si el método no está marcado con el atributo OperationContractAttribute o si el tipo de interfaz no es el destino de CallbackContract del atributo ServiceContractAttribute.
fr: La méthode de rappel {0} n'est pas prise en charge ; ceci peut se produire si la méthode n'est pas marquée avec OperationContractAttribute ou si son type d'interface n'est pas la cible du CallbackContract de ServiceContractAttribute.
it: Il metodo callback {0} non è supportato. È possibile che il metodo non sia contrassegnato con OperationContractAttribute o che il relativo tipo di interfaccia non sia la destinazione dell'elemento CallbackContract di ServiceContractAttribute.
ja: コールバック メソッド {0} はサポートされません。この原因としては、このメソッドに OperationContractAttribute が設定されていないこと、またはそのインターフェイスの型が ServiceContractAttribute の CallbackContract のターゲットでないことが考えられます。
ko: 콜백 메서드 {0}이(가) 지원되지 않습니다. 메서드가 OperationContractAttribute로 표시되지 않거나 해당 인터페이스 형식이 ServiceContractAttribute의 CallbackContract의 대상이 아닌 경우 이러한 현상이 발생합니다.
pl: Metoda wywołania zwrotnego {0} nie jest obsługiwana. Taka sytuacja może mieć miejsce, jeśli metoda nie jest oznaczona atrybutem OperationContractAttribute lub jeśli typ interfejsu nie jest celem kontraktu CallbackContract z ServiceContractAttribute.
pt_br: Não há suporte para o método de retorno de chamada {0}. Isso poderá acontecer se o método não estiver marcado com OperationContractAttribute ou se seu tipo de interface não for o destino da propriedade CallbackContract de ServiceContractAttribute.
tr: Callback metodu {0} desteklenmiyor, bunun nedeni metodun OperationContractAttribute ile işaretlenmemiş olması ya da arabirimi türünün ServiceContractAttribute CallbackContract öğesinin hedefi olmaması olabilir.
zh_hans: 回调方法 {0} 不受支持，如果未使用 OperationContractAttribute 标记方法或其接口类型不是 ServiceContractAttribute 的 CallbackContract 的目标，则会出现此情况。
zh_hant: 不支援回呼方法 {0}。若方法未標示有 OperationContractAttribute，或介面類型並非 ServiceContractAttribute 的 CallbackContract 目標，即會發生此狀況。

# SFxMismatchedOperationParent
source: A DispatchOperation (or ClientOperation) can only be added to its parent DispatchRuntime (or ClientRuntime).
cs: Třídu DispatchOperation (nebo ClientOperation) lze přidat pouze k její nadřazené třídě DispatchRuntime (nebo ClientRuntime).
de: Ein DispatchOperation (oder ClientOperation) kann nur der übergeordneten DispatchRuntime (oder ClientRuntime) hinzugefügt werden.
es: La operación DispatchOperation (o ClientOperation) solo se puede agregar a su DispatchRuntime (o ClientRuntime) primario.
fr: Une opération DispatchOperation (ou ClientOperation) peut être ajoutée uniquement à son parent DispatchRuntime (ou ClientRuntime).
it: È possibile aggiungere un'operazione DispatchOperation (o ClientOperation) solo al relativo elemento DispatchRuntime (o ClientRuntime) padre.
ja: DispatchOperation (または ClientOperation) を追加できるのは、親の DispatchRuntime (または ClientRuntime) だけです。
ko: 상위 DispatchRuntime(또는 ClientRuntime)에만 DispatchOperation(또는 ClientOperation)을 추가할 수 있습니다.
pl: Operacja DispatchOperation (lub ClientOperation) może być jedynie dodana do elementu nadrzędnego DispatchRuntime (lub ClientRuntime).
pt_br: Uma DispatchOperation (ou ClientOperation) só pode ser adicionada ao seu DispatchRuntime pai (ou ClientRuntime).
tr: Bir DispatchOperation (ya da ClientOperation) yalnızca kendi ana DispatchRuntime (ya da ClientRuntime) öğesine eklenebilir.
zh_hans: DispatchOperation (或 ClientOperation)只能添加到其父 DispatchRuntime (或 ClientRuntime)。
zh_hant: 只可將 DispatchOperation (或 ClientOperation) 新增至其父 DispatchRuntime (或 ClientRuntime)。

# SFxMissingActionHeader
source: No Action header was found with namespace '{0}' for the given message.
cs: Nebylo nalezeno záhlaví akce s oborem názvů {0} pro danou zprávu.
de: Für die angegebene Nachricht wurde kein Action-Header mit dem Namespace "{0}" gefunden.
es: No se encontró ningún encabezado de acción con el espacio de nombres "{0}" para el mensaje indicado.
fr: Aucun en-tête Action header n'a été trouvé avec l'espace de noms '{0}' pour le message donné.
it: Non è stata trovata alcuna intestazione Action con lo spazio dei nomi '{0}' per il messaggio specificato.
ja: 指定されたメッセージについて、名前空間が '{0}' の Action ヘッダーがありませんでした。
ko: 주어진 메시지에 대한 네임스페이스가 '{0}'인 동작 헤더를 찾을 수 없습니다.
pl: Nie znaleziono nagłówka Action z przestrzenią nazw „{0}” dla tego komunikatu.
pt_br: Nenhum cabeçalho de Ação foi encontrado com o namespace '{0}' para a mensagem especificada.
tr: Verilen ileti için '{0}' ad alanına sahip herhangi bir Action üst bilgisi bulunmadı.
zh_hans: 未找到带有给定消息的命名空间“{0}”的 Action 标头。
zh_hant: 無法為指定的訊息找到具有命名空間 '{0}' 的 Action 標頭。

# SFxMultipleCallbackFromAsyncOperation
source: The callback passed to operation '{0}' was called more than once. This indicates an internal error in the implementation of that operation.
cs: Zpětné volání předané operaci {0} bylo vyvoláno více než jednou. To určuje vnitřní chybu v implementaci této operace.
de: Der an den Vorgang "{0}" übergebene Rückruf wurde mehr als einmal aufgerufen. Dies weist auf einen internen Fehler in der Implementierung des Vorgangs hin.
es: La devolución de llamada pasada a la operación "{0}" se llamó más de una vez. Esto indica un error interno en la implementación de dicha operación.
fr: Le rappel passé à l'opération '{0}' a été appelé plusieurs fois. Ceci indique une erreur interne dans l'implémentation de cette opération.
it: Il callback passato all'operazione '{0}' è stato chiamato più di una volta. Questo indica un errore interno nell'implementazione dell'operazione.
ja: 操作 '{0}' に渡されたコールバックは複数回呼び出されました。これは、この操作の実装において内部エラーがあることを示します。
ko: '{0}' 작업에 전달된 콜백을 두 번 이상 호출했습니다. 해당 작업을 구현하면서 내부 오류가 발생했다는 것을 의미합니다.
pl: Wywołanie zwrotne przekazane do operacji „{0}” zostało wywołane więcej niż raz. Oznacza to błąd wewnętrzny w implementacji danej operacji.
pt_br: O retorno de chamada passado para a operação '{0}' foi chamado mais de uma vez. Isso indica um erro interno na implementação dessa operação.
tr: '{0}' işlemine geçirilen geri çağırma birden çok kez çağrıldı. Bu, ilgili işlemin uygulanmasında bir iç hata olduğunu gösterir.
zh_hans: 传递给操作“{0}”的回调调用了多次。这表明该操作的实现中出现内部错误。
zh_hant: 已呼叫一次以上傳遞至作業 '{0}' 的回呼。這代表該作業實作發生內部錯誤。

# SFxMultipleCallbackFromSynchronizationContext
source: Calling Post() on '{0}' resulted in multiple callbacks. This indicates a problem in '{0}'.
cs: Volání Post() na {0} způsobilo více zpětných volání. To určuje potíže v {0}.
de: Der Aufruf von Post() für "{0}" hat zu mehreren Rückrufen geführt. Dies weist auf ein Problem in "{0}" hin.
es: La llamada a Post() en "{0}" generó varias devoluciones de llamada. Esto indica un problema en "{0}".
fr: L'appel de Post() sur '{0}' a produit plusieurs rappels. Ceci indique un problème dans '{0}'.
it: La chiamata di Post() su '{0}' ha causato più callback. Questo indica un problema in '{0}'.
ja: '{0}' で Post() を呼び出した結果、複数のコールバックが発生しました。これは '{0}' に問題があることを示します。
ko: '{0}'에서 Post()를 호출한 결과 여러 번의 콜백이 발생했습니다. '{0}'에 문제가 있다는 의미입니다.
pl: Wywołanie Post() w elemencie „{0}” spowodowało wiele wywołań zwrotnych. Oznacza to problem w elemencie „{0}”.
pt_br: Chamar Post() em '{0}' resultou em vários retornos de chamada. Isso indica um problema em '{0}'.
tr: '{0}' üstündeki Post() çağrısı birden çok geri çağırmayla sonuçlandı. Bu '{0}' içinde bir sorun olduğunu gösterir.
zh_hans: 对“{0}”调用 Post() 导致多次回调。这表明“{0}”中有问题。
zh_hant: 在 '{0}' 上呼叫 Post() 導致多重回呼。這代表 '{0}' 中發生問題。

# SFxMultipleContractStarOperations0
source: A ServiceContract has more the one operation with an Action of "*". A ServiceContract can have at most one operation an Action = "*".
cs: Třída ServiceContract má více než jednu operaci s akcí "*". Třída ServiceContract může mít nejvýše jednu operaci s akcí = "*".
de: Ein ServiceContract verfügt über mehr als einen Vorgang mit Action = "*". Ein ServiceContract kann maximal einen Vorgang mit Action = "*" enthalten.
es: ServiceContract tiene más de una operación con una acción de "*". ServiceContract puede tener sólo una operación con Action = "*".
fr: Un ServiceContract contient plusieurs opérations contenant l'Action '*'. Un ServiceContract peut contenir au plus une opération contenant l'Action '*'.
it: Un ServiceContract ha più di un'operazione con Action "*". Un ServiceContract può avere un massimo di un'operazione con Action = "*".
ja: ServiceContract には、Action = "*" が指定された複数の操作がありますが、このような操作は 1 つ以下である必要があります。
ko: ServiceContract에 동작이 "*"인 작업이 두 개 이상 있습니다. ServiceContract에는 Action = "*" 작업이 최대 하나만 있을 수 있습니다.
pl: Kontrakt ServiceContract ma więcej niż jedną operację z czynnością "*". Obiekt ServiceContract może mieć najwyżej jeden parametr Action = "*".
pt_br: Um ServiceContract tem mais de uma operação com uma Ação de "*". Um ServiceContract pode ter no máximo uma operação Action = "*".
tr: Bir ServiceContract, "*" Action özelliği bulunan birden çok işleme sahip. ServiceContract, en fazla bir Action = "*" olan işleme sahip olabilir.
zh_hans: ServiceContract 有多个操作具有 Action "*"。ServiceContract 至多只能有一个操作为 Action = "*"。
zh_hant: ServiceContract 有一個以上具有 "*" 的 Action 作業。ServiceContract 最多只能有一個具有 Action = "*" 的作業。

# SFxMultiplePartsNotAllowedInEncoded
source: Part {1}:{0} is repeating and is not supported in Soap Encoding.
cs: Část {1}:{0} se opakuje a v kódování SOAP se nepodporuje.
de: Teil {1}:{0} wird wiederholt und ist in SOAP-Codierung nicht unterstützt.
es: Parte {1}:{0} se repite y no se admite en la codificación SOAP.
fr: La partie {1}:{0} se répète et n'est pas prise en charge dans Soap Encoding.
it: Parte {1}:{0} viene ripetuta e non è supportata nella codifica Soap.
ja: 部分 {1}:{0} は繰り返されており、SOAP のエンコードではサポートされません。
ko: 파트 {1}:{0}(이)가 반복되며 Soap 인코딩에서 지원되지 않습니다.
pl: Część {1}:{0} powtarza się i nie jest obsługiwana w kodowaniu protokołu SOAP.
pt_br: Parte {1}:{0} está repetindo e não tem suporte na Codificação Soap.
tr: Bölüm {1}:{0} yineleniyor ve Soap Encoding içinde desteklenmiyor.
zh_hans: 部分{1}: {0} 正在重复且在 SOAP 编码中不受支持。
zh_hant: 部分 {1}:{0} 重複，且 Soap 編碼中不支援。

# SFxMultipleUnknownHeaders
source: Method {0} in type {1} has more than one header part of type array of XmlElement.
cs: Metoda {0} v typu {1} má více než jednu část záhlaví pole typů třídy XmlElement.
de: Die {0}-Methode im Typ {1} enthält mehrere Headerteile vom Array-Typ des XmlElement.
es: El método {0} en el tipo {1} tiene más de una parte de encabezado de matriz de tipos de XmlElement.
fr: La méthode {0} du type {1} contient plusieurs parties d'en-tête de type tableau de XmlElement.
it: Il metodo {0} nel tipo {1} contiene più di una parte di intestazione della matrice dei tipi di XmlElement.
ja: 型 {1} のメソッド {0} には、配列型が XmlElement であるヘッダー部分が複数存在します。
ko: {1} 형식의 {0} 메서드에 XmlElement 배열 형식의 헤더 파트가 두 개 이상 있습니다.
pl: Metoda {0} w typie {1} ma więcej niż jedną część nagłówkową typu tablicy XmlElement.
pt_br: O método {0} no tipo {1} tem mais de uma parte de cabeçalho de matriz de tipos de XmlElement.
tr: {1} türündeki {0} metodu, birden fazla XmlElement dizisi türünde üst bilgi bölümüne sahip.
zh_hans: 类型 {1} 中的方法 {0} 具有多个 XmlElement 类型数组的标头部分。
zh_hant: 類型 {1} 的方法 {0} 有一個以上類型為 XmlElement 陣列的標頭組件。

# SFxNameCannotBeEmpty
source: The Name property must be a non-empty string.
cs: Vlastností název musí být neprázdný řetězec.
de: Die Name-Eigenschaft muss eine nicht leere Zeichenfolge sein.
es: La propiedad Name debe ser una cadena no vacía.
fr: La propriété Name doit être une chaîne non vide.
it: La proprietà Name deve essere una stringa non vuota.
ja: Name プロパティは空でない文字列である必要があります。
ko: Name 속성은 비어 있지 않은 문자열이어야 합니다.
pl: Właściwość Name nie może być pustym łańcuchem.
pt_br: A propriedade Name deve ser uma cadeia de caracteres não vazia.
tr: Name özelliği boş olmayan bir dize olmalıdır.
zh_hans: Name 属性必须是非空字符串。
zh_hant: Name 屬性必須是非空白字串。

# SFxNeedProxyBehaviorOperationSelector2
source: Cannot handle invocation of {0} on interface {1} because the OperationSelector on ClientRuntime is null.
cs: Nelze zpracovat vyvolání pro {0} v rozhraní {1}, protože třída OperationSelector ve třídě ClientRuntime má hodnotu NULL.
de: Der Aufruf von {0} an die Schnittstelle {1} kann nicht verarbeitet werden, weil der OperationSelector für ClientRuntime NULL ist.
es: No se puede controlar la invocación de {0} en la interfaz {1} porque OperationSelector en ClientRuntime es nulo.
fr: Impossible de traiter l'appel de {0} sur l'interface {1}, car OperationSelector sur ClientRuntime a une valeur null.
it: Non è possibile gestire la chiamata di {0} sull'interfaccia {1} perché l'elemento OperationSelector su ClientRuntime è Null.
ja: ClientRuntime の OperationSelector が null であるため、インターフェイス {1} での {0} の呼び出しを処理できません。
ko: ClientRuntime의 OperationSelector가 null이므로 {1} 인터페이스에서 {0}의 호출을 처리할 수 없습니다.
pl: Nie można obsłużyć wywołania {0} w interfejsie {1}, ponieważ parametr OperationSelector w wywołaniu ClientRuntime ma wartość null.
pt_br: Não é possível tratar uma invocação de {0} na interface {1} porque a OperationSelector na ClientRuntime é nula.
tr: ClientRuntime üstündeki OperationSelector null olduğundan {1} üzerindeki {0} hizmetini başlatılması işlenemiyor.
zh_hans: 无法处理对接口 {1} 的调用 {0}，因为 ClientRuntime 上的 OperationSelector 为 null。
zh_hant: 因為 ClientRuntime 上的 OperationSelector 為 null，所以無法處理介面 {1} 上 {0} 的引動過程。

# SFxNoDefaultConstructor
source: The service type provided could not be loaded as a service because it does not have a default (parameter-less) constructor. To fix the problem, add a default constructor to the type, or pass an instance of the type to the host.
cs: Zadaný typ služby nebylo možné načíst jako službu, protože nemá výchozí konstruktor (bez parametrů). Chcete-li tento problém vyřešit, přidejte k typu výchozí konstruktor nebo hostiteli předejte instanci typu.
de: Der bereitgestellte Diensttyp konnte nicht als Dienst geladen werden, da er nicht über einen (parameterlosen) Standardkonstruktor verfügt. Fügen Sie dem Typ einen Standardkonstruktor hinzu, oder übergeben Sie eine Instanz des Typs an den Host, um das Problem zu beheben.
es: El tipo de servicio proporcionado no se pudo cargar como un servicio porque no tiene un constructor predeterminado (sin parámetros). Para corregir el problema, agregue un constructor predeterminado al tipo o pase una instancia del tipo al host.
fr: Impossible de charger le type de service en tant que service, car il n'a pas de constructeur par défaut (sans paramètres). Pour résoudre le problème, ajoutez un constructeur par défaut au type, ou passez une instance du type à l'hôte.
it: Non è stato possibile caricare come servizio il tipo di servizio specificato perché non contiene un costruttore predefinito (senza parametri). Per risolvere il problema, aggiungere un costruttore predefinito al tipo o passare un'istanza del tipo all'host.
ja: 指定されたサービスの型には既定の (パラメーターのない) コンストラクターがないため、このサービスの型をサービスとして読み込めませんでした。この問題を修正するには、この型に既定のコンストラクターを追加するか、この型のインスタンスをホストに渡してください。
ko: 매개 변수 없는 기본 생성자가 없으므로 제공된 서비스 형식을 서비스로서 로드할 수 없습니다. 문제를 해결하려면 기본 생성자를 형식에 추가하거나, 형식의 인스턴스를 호스트에 전달하세요.
pl: Przekazany typ usługi nie mógł zostać załadowany w trybie usługi, ponieważ nie ma domyślnego (bezparametrowego) konstruktora. Aby naprawić problem, dodaj konstruktor do typu lub przekaż wystąpienie typu do hosta.
pt_br: O tipo de serviço fornecido não pôde ser carregado como um serviço porque ele não tem um construtor padrão (sem parâmetros). Para corrigir o problema, adicione um construtor padrão ao tipo ou passe uma instância do tipo ao host.
tr: Varsayılan (parametresiz) bir oluşturucusu olmadığından sağlanan hizmet türü bir hizmet olarak yüklenemedi. Sorunu gidermek için türe varsayılan bir oluşturucu ekleyin ya da konağa türün bir örneğini geçirin.
zh_hans: 提供的服务类型无法加载为服务，因为它没有默认(无参数)构造函数。要解决此问题，请将默认构造函数添加到类型或将类型的实例传递到主机。
zh_hant: 由於服務類型沒有預設 (無參數) 建構函式，因此無法將提供的服務類型載入成為服務。若要修正此問題，請將預設建構函式新增至類型，或將類型執行個體傳至主機。

# SFxNoEndpointMatchingAddress
source: The message with To '{0}' cannot be processed at the receiver, due to an AddressFilter mismatch at the EndpointDispatcher. Check that the sender and receiver's EndpointAddresses agree.
cs: Zprávu s funkcí do {0} nelze v příjemci zpracovat, protože se ve třídě EndpointDispatcher vyskytla neshoda AddressFilter. Zkontrolujte, zda třídy EndpointAddresses odesílatele a příjemce souhlasí.
de: Die Nachricht mit der To-Adresse "{0}" kann beim Empfänger aufgrund einer fehlenden AddressFilter-Übereinstimmung beim EndpointDispatcher nicht verarbeitet werden. Stellen Sie sicher, dass die EndpointAddresses von Sender und Empfänger übereinstimmen.
es: El mensaje con To "{0}" no se puede procesar en el destinatario debido a una falta de coincidencia de AddressFilter en EndpointDispatcher. Compruebe que los valores de EndpointAddresses concuerdan en el remitente y el destinatario.
fr: Impossible de traiter le message contenant To '{0}' au récepteur en raison d'une non-correspondance de AddressFilter au EndpointDispatcher. Vérifiez que les EndpointAddresses de l'expéditeur et du récepteur s'accordent.
it: Non è possibile elaborare nel destinatario il messaggio con elemento To '{0}' a causa di una mancata corrispondenza AddressFilter in EndpointDispatcher. Controllare la corrispondenza degli elementi EndpointAddress di mittente e destinatario.
ja: EndpointDispatcher で AddressFilter が一致していないため、To '{0}' を含むメッセージを受信側で処理できません。送信側と受信側の EndpointAddress が一致していることを確認してください。
ko: EndpointDispatcher에서 AddressFilter가 일치하지 않으므로 수신자 쪽에서 To '{0}'이(가) 있는 메시지를 처리할 수 없습니다. 발신자와 수신자의 EndpointAddress가 일치하는지 확인하세요.
pl: Komunikat z elementem To „{0}” nie może zostać przetworzony w punkcie odbioru z powodu niezgodności wartości AddressFilter w elemencie EndpointDispatcher. Sprawdź zgodność elementów EndpointAddress nadawcy i odbiorcy.
pt_br: A mensagem com To '{0}' não pode ser processada no destinatário devido a um AddressFilter incorreto no EndpointDispatcher. Verifique se o EndpointAddresses do remetente e do destinatário estão de acordo.
tr: EndpointDispatcher içindeki bir AddressFilter uyumsuzluğu nedeniyle To '{0}' özelliğine sahip ileti alıcıda işlenemiyor. Gönderenin ve alıcının EndpointAddress değerlerinin uyumlu olduğundan emin olun.
zh_hans: 由于 AddressFilter 在 EndpointDispatcher 不匹配，To 为“{0}”的消息无法在接收方处理。请检查发送方和接收方的 EndpointAddresses 是否一致。
zh_hant: 由於 EndpointDispatcher 的 AddressFilter 不符，因此收件者無法處理具有 To '{0}' 的訊息。請檢查寄件者與收件者的 EndpointAddresses 是否一致。
