Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# AChannelServiceEndpointSBindingIsNull0
source: A Channel/Service endpoint's Binding is null.
cs: Vazba koncového bodu kanálu nebo služby má hodnotu null.
de: Die Bindung eines Kanal-/Dienstendpunkts ist NULL.
es: El enlace de un punto de conexión de servicioo o canal es nulo.
fr: Une liaison de point de terminaison de canal/service a une valeur null.
it: Il binding di un endpoint servizio/canale è Null.
ja: チャネルまたはサービスのエンドポイントのバインドが null です。
ko: 채널/서비스 끝점의 바인딩이 null입니다.
pl: Powiązanie punktu końcowego kanału/usługi ma wartość null.
pt_br: A Associação de um ponto de extremidade de Canal/Serviço é nula.
tr: Bir Channel/Service uç noktasının Binding değeri null.
zh_hans: 通道/服务终结点的绑定为 Null。
zh_hant: 通道/服務端點的繫結為 null。

# AChannelServiceEndpointSContractIsNull0
source: A Channel/Service endpoint's Contract is null.
cs: Kontrakt koncového bodu kanálu nebo služby má hodnotu null.
de: Der Vertrag eines Kanal-/Dienstendpunkts ist NULL.
es: El contrato de un punto de conexión de servicio o canal es nulo.
fr: Un contrat de point de terminaison de canal/service a une valeur null.
it: Il contratto di un endpoint servizio/canale è Null.
ja: チャネルまたはサービスのエンドポイントのコントラクトが null です。
ko: 채널/서비스 끝점의 계약이 null입니다.
pl: Kontrakt punktu końcowego kanału/usługi ma wartość null.
pt_br: O Contrato de um ponto de extremidade de Canal/Serviço é nulo.
tr: Bir Channel/Service uç noktasının Contract değeri null.
zh_hans: 通道/服务终结点的协定为 Null。
zh_hant: 通道/服務端點的合約為 null。

# AChannelServiceEndpointSContractSNameIsNull0
source: A Channel/Service endpoint's Contract's name is null or empty.
cs: Název kontraktu koncového bodu kanálu nebo služby má hodnotu null nebo je prázdný.
de: Der Vertragsname eines Kanal-/Dienstendpunkts ist NULL oder leer.
es: El nombre del contrato de punto de conexión de servicio o canal es nulo o está vacío.
fr: Un nom de contrat de point de terminaison de canal/service a une valeur null ou est vide.
it: Il nome del contratto di un endpoint servizio/canale è Null o vuoto.
ja: チャネルまたはサービスのエンドポイントのコントラクトの名前が null です。
ko: 채널/서비스 끝점의 계약 이름이 null이거나 비어 있습니다.
pl: Nazwa kontraktu punktu końcowego kanału/usługi ma wartość null lub jest pusta.
pt_br: O nome do Contrato de um ponto de extremidade de Canal/Serviço é nulo ou está vazio.
tr: Bir Channel/Service uç noktasının Contract adı null ya da boş.
zh_hans: 通道/服务终结点的协定名称为 Null 或为空。
zh_hant: 通道/服務端點的合約名稱為 null 或空白。

# AChannelServiceEndpointSContractSNamespace0
source: A Channel/Service endpoint's Contract's namespace is null.
cs: Obor názvů kontraktu koncového bodu kanálu nebo služby má hodnotu null.
de: Der Vertragsnamespace eines Kanal-/Dienstendpunkts ist NULL.
es: El espacio de nombres del contrato de un punto de conexión de servicio o canal es nulo.
fr: Un espace de noms de contrats de point de terminaison de canal/service a une valeur null.
it: Lo spazio dei nomi del contratto di un endpoint servizio/canale è Null.
ja: チャネルまたはサービスのエンドポイントの名前空間が null です。
ko: 채널/서비스 끝점의 계약 네임스페이스가 null입니다.
pl: Przestrzeń nazw kontraktu punktu końcowego kanału/usługi ma wartość null.
pt_br: O namespace do Contrato de um ponto de extremidade de Canal/Serviço é nulo.
tr: Bir Channel/Service uç noktasının Contract ad alanı null.
zh_hans: 通道/服务终结点的协定命名空间为 Null。
zh_hant: 通道/服務端點的合約命名空間為 null。

# AcksToMustBeSameAsRemoteAddress
source: The remote endpoint requested an address for acknowledgements that is not the same as the address for application messages. The channel could not be opened because this is not supported. Ensure the endpoint address used to create the channel is identical to the one the remote endpoint was set up with.
cs: Vzdálený koncový bod požaduje adresu pro potvrzení, která není shodná s adresou pro zprávy aplikace. Kanál nelze otevřít, protože akce není podporována. Zkontrolujte, zda je adresa koncového bodu pro vytvoření kanálu totožná s adresou, se kterou byl koncový bod nastaven.
de: Der Remoteendpunkt hat eine Adresse für Bestätigungen angefordert, die nicht mit der Adresse für Anwendungsnachrichten identisch ist. Der Kanal konnte nicht geöffnet werden, da er nicht unterstützt wird. Stellen Sie sicher, dass die zum Erstellen des Kanals verwendete Endpunktadresse mit der Adresse identisch ist, die zum Einrichten des Endpunkts verwendet wurde.
es: El extremo remoto solicitó una dirección para confirmaciones que no es la misma que la dirección para mensajes de aplicación. No se pudo abrir el canal porque no se admite esta posibilidad. Asegúrese de que la dirección del extremo usada para crear el canal es idéntica a la dirección con la que se configuró el extremo remoto.
fr: Le point de terminaison distant a demandé une adresse différente de l'adresse des messages d'application pour les accusés de réception. Impossible d'ouvrir le canal puisqu'il n'existe aucune prise en charge pour cela. Vérifiez que l'adresse du point de terminaison utilisée pour créer le canal est la même que celle avec laquelle le point de terminaison distant a été configuré.
it: L'endpoint remoto ha richiesto un indirizzo per gli acknowledgement diverso dall'indirizzo per i messaggi dell'applicazione. Tale operazione non è supportata ed è stato impossibile aprire il canale. Verificare che l'indirizzo endpoint utilizzato per creare il canale sia identico a quello impostato per l'endpoint remoto.
ja: リモート エンドポイントは、アプリケーション メッセージのアドレスとは異なる受信確認用アドレスを要求しました。これはサポートされていないため、チャネルを開けませんでした。チャネルを作成するために使用されたエンドポイント アドレスが、リモート エンドポイントをセットアップするのに使用されたアドレスと同じであることを確認してください。
ko: 원격 끝점이 응용 프로그램 메시지용 주소와 같지 않은 승인용 주소를 요청했습니다. 이것이 지원되지 않기 때문에 채널을 열 수 없습니다. 채널을 만드는 데 사용되는 끝점 주소가 원격 끝점이 설정된 주소와 동일한지 확인하십시오.
pl: Zdalny punkt końcowy żądał adresu dla potwierdzeń innego niż adres dla komunikatów aplikacji. Nie można otworzyć kanału, ponieważ takie działanie jest nieobsługiwane. Adres punktu końcowego używany do tworzenia kanału musi być identyczny z adresem, który skonfigurowano dla zdalnego punktu końcowego.
pt_br: O ponto de extremidade remoto solicitou um endereço para confirmações que não corresponde ao endereço referente a mensagens de aplicativo. Não foi possível abrir o canal devido à falta de suporte. Certifique-se de que o endereço do ponto de extremidade usado para criar o canal seja idêntico ao endereço usado para a configuração do ponto de extremidade remoto.
tr: Uzak bitiş noktası, uygulama iletileri adresiyle aynı olmayan bir bildirim adresi istedi. Desteklenmediğinden kanal açılamadı. Kanalı oluşturmak için kullanılan bitiş noktasının uzak bitiş noktasının oluşturulmasında kullanılanla özdeş olmasını sağlayın.
zh_hans: 远程终结点需要与应用程序消息的地址不同的确认地址。无法打开通道，因为不受支持。请确保用于创建通道的终结点地址和用于设置远程终结点的地址完全相同。
zh_hant: 遠端端點所要求的通知位址與應用程式訊息的位址不同。由於不支援此一狀況，因此無法開啟通道。請確認用來建立通道的端點位址，與設定遠端端點的位址相同。

# AcksToMustBeSameAsRemoteAddressReason
source: The address for acknowledgements must be the same as the address for application messages. Verify that your endpoint is configured to use the same URI for these two addresses.
cs: Adresa pro potvrzení musí být stejná jako adresa pro zprávy aplikace. Zkontrolujte, zda je koncový bod nakonfigurován tak, aby pro tyto dvě adresy používal stejný identifikátor URI.
de: Die Adresse für Bestätigungen muss mit der Adresse für Anwendungsnachrichten identisch sein. Stellen Sie sicher, dass der Endpunkt so konfiguriert ist, dass für diese beiden Adressen der gleiche URI verwendet wird.
es: La dirección para confirmaciones debe ser la misma que la dirección para mensajes de aplicación. Compruebe que el extremo está configurado para usar el mismo URI para ambas direcciones.
fr: L'adresse pour les accusés de réception doit être la même que celle des messages d'application. Vérifiez que la configuration de votre point de terminaison utilise la même URI pour ces deux adresses.
it: L'indirizzo degli acknowledgement deve essere lo stesso indirizzo utilizzato per i messaggi dell'applicazione. Verificare che l'endpoint sia configurato per l'utilizzo dello stesso URI per questi due indirizzi.
ja: 受信確認用のアドレスは、アプリケーション メッセージのアドレスと同じである必要があります。エンドポイントが、これらの 2 つのアドレスに同じ URI を使用するように構成されていることを確認してください。
ko: 승인용 주소는 응용 프로그램 메시지용 주소와 같아야 합니다. 끝점이 이러한 두 주소에 동일한 URI를 사용하도록 구성되었는지 확인하십시오.
pl: Adres dla potwierdzeń musi być identyczny z adresem dla komunikatów aplikacji. Sprawdź, czy punkt końcowy ma skonfigurowany ten sam identyfikator URI dla obu tych adresów.
pt_br: O endereço para confirmações deve ser idêntico ao endereço para mensagens de aplicativo. Verifique se o ponto de extremidade está configurado de forma a usar o mesmo URI para esses dois endereços.
tr: Bildirimlerin adresi, uygulama iletilerinin adresiyle aynı olmalıdır. Bitiş noktanızın bu iki adres için aynı URI değerini kullanmasını sağlayın.
zh_hans: 确认的地址必须与应用程序消息的地址相同。请验证是否已将终结点配置为对这两个地址使用相同的 URI。
zh_hant: 通知位址必須與應用程式訊息位址相同。請確認將端點的這兩個位址設為使用相同的 URI。

source: Activity boundary
cs: Hranice aktivity
de: Aktivitätsgrenze
es: Límite de la actividad
fr: Limite d’activité
it: Limite dell'attività
ja: アクティビティの境界
ko: 작업 경계
pl: Granica działania
pt_br: Limite de atividade
tr: Etkinlik sınırı
zh_hans: 活动边界
zh_hant: 活動界限

# ActivityCallback
source: Executing user callback.
cs: Probíhá zpětné volání uživatele.
de: Benutzerrückruf wird ausgeführt.
es: Se está ejecutando la devolución de llamada de usuario.
fr: Exécution du rappel utilisateur.
it: Esecuzione del callback utente.
ja: ユーザー コールバックを実行しています。
ko: 사용자 콜백을 실행하는 중입니다.
pl: Wykonywanie wywołania zwrotnego użytkownika.
pt_br: Executando o retorno de chamada de usuário.
tr: Kullanıcı geri çağırma işlevi yürütülüyor.
zh_hans: 正在执行用户回调。
zh_hant: 正在執行使用者回呼。

# ActivityClose
source: Close '{0}'.
cs: Ukončete {0}.
de: "{0}" schließen.
es: Cerrar "{0}".
fr: Fermer '{0}'.
it: Chiusura di '{0}'.
ja: '{0}' を閉じます。
ko: '{0}'을(를) 닫으세요.
pl: Zamknij element „{0}”.
pt_br: Fechar '{0}'.
tr: '{0}' öğesini kapatın.
zh_hans: 关闭“{0}”。
zh_hant: 關閉 '{0}'。

# ActivityCloseClientBase
source: Close ClientBase. Contract type: '{0}'.
cs: Uzavřete třídu ClientBase. Typ kontraktu: {0}
de: ClientBase schließen. Vertragstyp: "{0}".
es: Cerrar ClientBase. Tipo de contrato: "{0}".
fr: Fermer ClientBase. Type de contrat : '{0}'.
it: Chiusura di ClientBase. Tipo di contratto: '{0}'.
ja: ClientBase を閉じます。コントラクトの種類: '{0}'。
ko: ClientBase를 닫으세요. 계약 형식은 '{0}'입니다.
pl: Zamknij element ClientBase. Typ kontraktu: „{0}”.
pt_br: Fechar ClientBase. Tipo de contrato: '{0}'.
tr: ClientBase öğesini kapatın. Anlaşma türü: '{0}'.
zh_hans: 关闭 ClientBase。协定类型:“{0}”。
zh_hant: 關閉 ClientBase。合約類型: '{0}'。

# ActivityConstructChannelFactory
source: Construct ChannelFactory. Contract type: '{0}'.
cs: Vytvořte třídu ChannelFactory. Typ kontraktu: {0}
de: ChannelFactory erstellen. Vertragstyp: "{0}".
es: Construir ChannelFactory. Tipo de contrato: "{0}".
fr: Construire ChannelFactory. Type de contrat : '{0}'.
it: Costruzione di ChannelFactory. Tipo di contratto: '{0}'.
ja: ChannelFactory を構築します。コントラクトの種類: '{0}'。
ko: ChannelFactory를 구성하세요. 계약 형식은 '{0}'입니다.
pl: Skonstruuj element ChannelFactory. Typ kontraktu: „{0}”.
pt_br: Construir ChannelFactory. Tipo de contrato: '{0}'.
tr: ChannelFactory oluşturun. Anlaşma türü: '{0}'.
zh_hans: 构造 ChannelFactory。协定类型:“{0}”。
zh_hant: 建構 ChannelFactory。合約類型: '{0}'。

# ActivityExecuteMethod
source: Execute '{0}.{1}'.
cs: Spusťte {0}.{1}.
de: "{0}.{1}" ausführen.
es: Ejecutar "{0}.{1}".
fr: Exécuter '{0}.{1}'.
it: Esecuzione di '{0}.{1}'.
ja: '{0}.{1}' を実行します。
ko: '{0}.{1}'을(를) 실행하세요.
pl: Wykonaj metodę „{0}.{1}”.
pt_br: Executar '{0}.{1}'.
tr: '{0}.{1}' öğesini yürütün.
zh_hans: 执行“{0}.{1}”。
zh_hant: 執行 '{0}.{1}'。

# ActivityOpenClientBase
source: Open ClientBase. Contract type: '{0}'.
cs: Otevřete třídu ClientBase. Typ kontraktu: {0}
de: ClientBase öffnen. Vertragstyp: "{0}".
es: Abrir ClientBase. Tipo de contrato: "{0}".
fr: Ouvrir ClientBase. Type de contrat : '{0}'.
it: Apertura di ClientBase. Tipo di contratto: '{0}'.
ja: ClientBase を開きます。コントラクトの種類: '{0}'。
ko: ClientBase를 여세요. 계약 형식은 '{0}'입니다.
pl: Otwórz element ClientBase. Typ kontraktu: „{0}”.
pt_br: Abrir ClientBase. Tipo de contrato: '{0}'.
tr: ClientBase öğesini açın. Anlaşma türü: '{0}'.
zh_hans: 打开 ClientBase。协定类型:“{0}”。
zh_hant: 開啟 ClientBase。合約類型: '{0}'。

# ActivityProcessAction
source: Process action '{0}'.
cs: Zpracujte akci {0}.
de: Aktion "{0}" verarbeiten.
es: Procese la acción "{0}".
fr: Traiter l'action '{0}'.
it: Elaborazione dell'azione '{0}'.
ja: アクション '{0}' を処理します。
ko: 동작 '{0}'을(를) 처리하세요.
pl: Przetwarzaj akcję „{0}”.
pt_br: Processar a ação '{0}'.
tr: '{0}' eylemini işleyin.
zh_hans: 处理操作“{0}”。
zh_hant: 處理動作 '{0}'。

# ActivityProcessingMessage
source: Processing message {0}.
cs: Zpracování zprávy {0}.
de: Nachricht "{0}" wird verarbeitet
es: Procesando el mensaje {0}.
fr: Traitement du message {0}.
it: Elaborazione messaggio {0}.
ja: メッセージ {0} を処理しています。
ko: '{0}' 메시지를 처리하는 중입니다.
pl: Przetwarzanie komunikatu {0}.
pt_br: Processando mensagem {0}.
tr: {0} iletisi işleniyor.
zh_hans: 正在处理消息 {0}。
zh_hant: 正在處理訊息 {0}。

# ActivitySecurityClose
source: Close Security Session.
cs: Ukončete relaci zabezpečení.
de: Sicherheitssitzung schließen.
es: Cerrar sesión de seguridad.
fr: Fermer la session de sécurité.
it: Chiusura sessione di sicurezza.
ja: セキュリティ セッションを閉じます。
ko: 보안 세션을 닫으세요.
pl: Zamknij sesję zabezpieczeń.
pt_br: Fechar Sessão de Segurança.
tr: Güvenlik Oturumunu kapatın.
zh_hans: 关闭安全会话。
zh_hant: 關閉安全性工作階段。

# AddressingExtensionInBadNS
source: The element '{0}' in namespace '{1}' is not valid. This either means that element '{0}' is a duplicate element, or that it is not a legal extension because extension elements cannot be in the addressing namespace.
cs: Element {0} v oboru názvů {1} je neplatný. To znamená, že element {0} je buď duplicitní, nebo není platnou příponou, protože elementy přípon nesmějí být v oboru názvů adresování.
de: Das Element "{0}" im Namespace "{1}" ist nicht gültig. Dies weist entweder darauf hin, dass das Element "{0}" ein doppeltes Element ist oder dass es sich nicht um eine gültige Erweiterung handelt, da Erweiterungselemente nicht im Adressierungsnamespace enthalten sein können.
es: El elemento "{0}" del espacio de nombres "{1}" no es válido. Esto significa que el elemento "{0}" está duplicado o no es una extensión legal, ya que los elementos de extensión no pueden estar en el espacio de nombres de direccionamiento.
fr: L'élément '{0}' dans l'espace de noms '{1}' est non valide. Ceci signifie que l'élément '{0}' est en double ou qu'il ne s'agit pas d'une extension conforme, car les éléments d'extension ne peuvent pas se trouver dans l'espace de noms d'adressage.
it: L'elemento '{0}' nello spazio dei nomi '{1}' non è valido. L'elemento '{0}' è un elemento duplicato oppure non è un'estensione valida perché gli elementi di estensione non possono trovarsi nello spazio dei nomi degli indirizzi.
ja: 名前空間 '{1}' の要素 '{0}' は無効です。これは、要素 '{0}' が重複する要素であるか、拡張要素がアドレス指定名前空間内にあってならないために、これが有効な拡張要素ではないことを意味します。
ko: 네임스페이스 '{1}'의 '{0}' 요소가 잘못되었습니다. 이것은 '{0}' 요소가 중복된 요소이거나 주소 지정 네임스페이스에 확장 요소가 존재할 수 없기 때문에 적합한 확장이 아니라는 것을 의미합니다.
pl: Element „{0}” w przestrzeni nazw „{1}” jest niepoprawny. Oznacza to, że element „{0}” jest zduplikowany lub jest niedozwolonym rozszerzeniem, ponieważ elementy rozszerzające nie mogą znajdować się w przestrzeni nazw adresowania.
pt_br: O elemento '{0}' no namespace '{1}' é inválido. Isso significa que o elemento '{0}' é um elemento duplicado ou que não é uma extensão válida, pois elementos de extensão não podem estar no namespace de endereçamento.
tr: '{1}' ad alanındaki '{0}' öğesi geçerli değil. Bunun anlamı, '{0}' öğesinin çoğaltılmış bir öğe olması ya da uzantı öğeleri adresleme ad alanlarında olamayacağından yasal bir uzantı olmamasıdır.
zh_hans: 命名空间“{1}”中的元素“{0}”无效。这表示元素“{0}”是重复元素，或它不是有效扩展，因为扩展元素不能位于寻址命名空间中。
zh_hant: 命名空間 '{1}' 的元素 '{0}' 無效。這表示元素 '{0}' 為重複的元素，或者不是合法的延伸模組，因為定址命名空間中不可有延伸元素。

# AddressingHeadersCannotBeAddedToAddressingVersion
source: Addressing Version '{0}' does not support adding WS-Addressing headers.
cs: Verze adresování {0} nepodporuje přidávání záhlaví elementu WS-Addressing.
de: Die Adressierungsversion "{0}" unterstützt das Hinzufügen von WS-Addressing-Headern nicht.
es: La versión de direccionamiento "{0}" no admite agregar encabezados WS-Addressing.
fr: La version d'adressage '{0}' ne prend pas en charge l'ajout d'en-têtes WS-Addressing.
it: La versione '{0}' di Addressing non supporta l'aggiunta di intestazioni WS-Addressing.
ja: アドレス指定バージョン '{0}' は WS-Addressing ヘッダーの追加をサポートしていません。
ko: 주소 지정 버전 '{0}'이(가) WS-Addressing 헤더 추가를 지원하지 않습니다.
pl: Wersja adresowania „{0}” nie obsługuje dodawania nagłówków WS-Addressing.
pt_br: A Versão de Endereçamento '{0}' não dá suporte à adição de cabeçalhos WS-Addressing.
tr: '{0}' Adresleme Sürümü, WS-Addressing üst bilgileri eklemeyi desteklemez.
zh_hans: 寻址版本“{0}”不支持添加 WS-Addressing 标头。
zh_hant: 定址版本 '{0}' 不支援新增 WS-Addressing 標頭。

# AddressingVersionNotSupported
source: Addressing Version '{0}' is not supported.
cs: Verze adresování {0} není podporována.
de: Die Adressierungsversion "{0}" wird nicht unterstützt.
es: No se admite la versión de direccionamiento "{0}".
fr: La version d'adressage '{0}' n'est pas prise en charge.
it: La versione '{0}' di Addressing non è supportata.
ja: アドレス指定バージョン '{0}' はサポートされていません。
ko: 주소 지정 버전 '{0}'이(가) 지원되지 않습니다.
pl: Wersja adresowania „{0}” jest nieobsługiwana.
pt_br: Não há suporte à Versão de Endereçamento '{0}'.
tr: '{0}' Adresleme Sürümü desteklenmiyor.
zh_hans: 不支持寻址版本“{0}”。
zh_hant: 不支援定址版本 '{0}'。

# AlgorithmAndPrivateKeyMisMatch
source: The algorithm specified and the private key do not match.
cs: Zadaný algoritmus a privátní klíč se neshodují.
de: Der angegebene Algorithmus und der private Schlüssel stimmen nicht überein.
es: El algoritmo especificado y la clave privada no coinciden.
fr: L'algorithme spécifié et la clé privée ne correspondent pas.
it: L'algoritmo specificato e la chiave privata non corrispondono.
ja: 指定されたアルゴリズムと秘密キーが一致しません。
ko: 지정된 알고리즘과 개인 키가 일치하지 않습니다.
pl: Określony algorytm i klucz prywatny są niezgodne.
pt_br: O algoritmo especificado e a chave privada não coincidem.
tr: Belirtilen algoritma ile özel anahtar eşleşmiyor.
zh_hans: 指定的算法和私钥不匹配。
zh_hant: 指定的演算法與私密金鑰不符。

# AlgorithmAndPublicKeyMisMatch
source: The algorithm specified and the public key do not match.
cs: Zadaný algoritmus a veřejný klíč se neshodují.
de: Der angegebene Algorithmus und der öffentliche Schlüssel stimmen nicht überein.
es: El algoritmo especificado y la clave pública no coinciden.
fr: L'algorithme spécifié et la clé publique ne correspondent pas.
it: L'algoritmo specificato e la chiave pubblica non corrispondono.
ja: 指定されたアルゴリズムと公開キーが一致しません。
ko: 지정된 알고리즘과 공개 키가 일치하지 않습니다.
pl: Określony algorytm i klucz publiczny są niezgodne.
pt_br: O algoritmo especificado e a chave pública não coincidem.
tr: Belirtilen algoritma ile ortak anahtar eşleşmiyor.
zh_hans: 指定的算法和公钥不匹配。
zh_hant: 指定的演算法與公開金鑰不符。

# AnonymousLogonsAreNotAllowed
source: The service does not allow you to log on anonymously.
cs: Služba nedovoluje anonymní přihlášení.
de: Der Dienst erlaubt keine anonyme Anmeldung.
es: El servicio no permite inicios de sesión anónimos.
fr: Le service ne vous autorise pas à vous connecter de façon anonyme.
it: Il servizio non consente l'accesso anonimo.
ja: このサービスでは匿名ログオンは許可されていません。
ko: 서비스에서 익명으로 로그온하는 것을 허용하지 않습니다.
pl: Usługa nie umożliwia anonimowego logowania.
pt_br: O serviço não permite fazer logon anonimamente.
tr: Hizmet, anonim olarak oturum açmanıza izin vermiyor.
zh_hans: 服务不允许匿名登录。
zh_hant: 服務不允許匿名登入。

# ArgumentCannotBeEmptyString
source: The argument must be a non-empty string.
cs: Argument musí být neprázdný řetězec.
de: Das Argument darf keine leere Zeichenfolge sein.
es: El argumento debe ser una cadena no vacía.
fr: L'argument doit être une chaîne non vide.
it: L'argomento deve essere una stringa non vuota.
ja: 引数には空でない文字列を指定する必要があります。
ko: 인수는 비어 있지 않은 문자열이어야 합니다.
pl: Argument musi być ciągiem niepustym.
pt_br: O argumento deve ser uma cadeia de caracteres não vazia.
tr: Bağımsız değişken boş olmayan bir dize olmalıdır.
zh_hans: 参数必须为非空字符串。
zh_hant: 引數必須是非空白字串。

source: Async End called on wrong channel.
cs: Asynchronní ukončení bylo voláno pro nesprávný kanál.
de: Async End wurde auf dem falschen Kanal aufgerufen.
es: Se llamó a Async End en un canal erróneo.
fr: Async End a appelé sur un canal incorrect.
it: Async End è stato chiamato sul canale errato.
ja: 非同期 End が間違ったチャネルで呼び出されました。
ko: Async End가 잘못된 채널에서 호출되었습니다.
pl: Metoda Async End wywołana dla niewłaściwego kanału.
pt_br: Final Assíncrono chamado em canal incorreto.
tr: Async End yanlış kanalda çağrıldı.
zh_hans: 在错误的通道上调用了 Async End。
zh_hant: 在錯誤的通道呼叫 Async End。

# AsyncEndCalledWithAnIAsyncResult
source: Async End called with an IAsyncResult from a different Begin method.
cs: Asynchronní metoda End byla zavolána s rozhraním IAsyncResult z jiné metody Begin.
de: Async End wurde mit einem IAsyncResult einer anderen Begin-Methode aufgerufen.
es: Se llamó a Async End con IAsyncResult desde un método Begin diferente.
fr: Async End appelé avec IAsyncResult à partir d'une autre méthode Begin.
it: Async End è stato chiamato con un elemento IAsyncResult di un metodo Begin diverso.
ja: 非同期 End が別の Begin メソッドから IAsyncResult を指定して呼び出されました。
ko: Async End가 다른 Begin 메서드의 IAsyncResult와 함께 호출되었습니다.
pl: Metoda Async End wywołana z elementem IAsyncResult z innej metody Begin.
pt_br: Final Assíncrono chamado com IAsyncResult de um método Begin diferente.
tr: Async End, IAsyncResult ile farklı bir Begin metodundan çağrıldı.
zh_hans: 使用其他 Begin 方法的 IAsyncResult 调用了 Async End。
zh_hant: 使用來自不同 Begin 方法的 IAsyncResult，呼叫了 Async End。

source: AsyncResult completed twice.
cs: Výsledek AsyncResult byl dokončen dvakrát.
de: AsyncResult wurde zweimal abgeschlossen.
es: AsyncResult completado dos veces.
fr: AsyncResult terminé deux fois.
it: AsyncResult è stato completato due volte.
ja: AsyncResult を 2 回完了しました。
ko: AsyncResult가 두 번 완료되었습니다.
pl: AsyncResult ukończono dwukrotnie.
pt_br: AsyncResult foi concluído duas vezes.
tr: AsyncResult iki kez tamamlandı.
zh_hans: AsyncResult 已完成两次。
zh_hant: AsyncResult 已完成兩次。

source: At least one fault reason must be specified.
cs: Musí být určen alespoň jeden důvod poruchy.
de: Es muss mindestens eine Fehlerursache angegeben werden.
es: Debe especificarse al menos una razón del error.
fr: Au moins une raison justifiant l'erreur doit être spécifiée.
it: È necessario specificare almeno un motivo dell'errore.
ja: フォールトの理由を少なくとも 1 つ指定する必要があります。
ko: 최소한 하나 이상의 오류 원인을 지정해야 합니다.
pl: Należy określić co najmniej jedną przyczynę błędu.
pt_br: Pelo menos um motivo de falha deve ser especificado.
tr: En az bir hata nedeni belirtilmelidir.
zh_hans: 必须至少指定一个错误原因。
zh_hant: 至少必須指定一項錯誤原因。

source: At most one reference list is supported with default policy check.
cs: Kontrola výchozí zásady podporuje nanejvýš jeden seznam odkazů.
de: In der standardmäßigen Richtlinienprüfung wird höchstens eine Verweisliste unterstützt.
es: Sólo se admite una lista de referencias con la comprobación de directivas predeterminada.
fr: Une liste de références tout au plus est prise en charge avec la vérification de la stratégie par défaut.
it: Con il controllo criteri predefinito è supportato un massimo di un elenco di riferimenti.
ja: 既定のポリシー チェックでは、最大で 1 つの参照一覧がサポートされます。
ko: 최대 하나의 참조 목록이 기본 정책 확인에서 지원됩니다.
pl: Obsługiwana jest najwyżej jedna lista odwołań z domyślnym sprawdzaniem zasad.
pt_br: Pelo menos uma lista de referências é suportada com a verificação de políticas padrão.
tr: En fazla bir başvuru listesi varsayılan ilke denetimi tarafından desteklenir.
zh_hans: 默认策略检查至多支持一个引用列表。
zh_hant: 預設規則檢查最多僅支援一個參考清單。
