Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SequenceTerminatedUnexpectedAckRequested
source: The RM source received an AckRequested message. The RM source does not process AckRequested messages.
cs: Zdroj služby RM přijal zprávu AckRequested. Zdroj služby RM nezpracovává zprávy AckRequested.
de: Die RM-Quelle hat eine AckRequested-Nachricht empfangen. Die RM-Quelle verarbeitet keine AckRequested-Nachrichten.
es: El origen RM recibió un mensaje AckRequested. El origen RM no procesa mensajes AckRequested.
fr: La source du Gestionnaire de ressources a reçu un message AckRequested. La source du Gestionnaire de ressources ne traite pas les messages AckRequested.
it: È stato ricevuto un messaggio AckRequested dall'origine RM. L'origine RM non elabora i messaggi AckRequested.
ja: RM の送信元が AckRequested メッセージを受信しました。RM の送信元は AckRequested メッセージを処理しません。
ko: RM 소스가 AckRequested 메시지를 받았습니다. RM 소스가 AckRequested 메시지를 처리하지 않습니다.
pl: Miejsce źródłowe protokołu RM otrzymało komunikat AckRequested. Miejsce źródłowe protokołu RM nie przetwarza komunikatów AckRequested.
pt_br: A origem RM recebeu uma mensagem AckRequested. A origem RM não processa mensagens AckRequested.
tr: RM kaynağı bir AckRequested iletisi aldı. RM kaynağı AckRequested iletilerini işlemez.
zh_hans: RM 源收到 AckRequested 消息。RM 源未处理 AckRequested 消息。
zh_hant: RM 來源收到 AckRequested 訊息。RM 來源不處理 AckRequested 訊息。

# SequenceTerminatedUnexpectedCS
source: The RM source received a CreateSequence request. The RM source does not process CreateSequence requests.
cs: Zdroj služby RM přijal požadavek CreateSequence. Zdroj služby RM nezpracovává požadavky CreateSequence.
de: Die RM-Quelle hat eine CreateSequence-Anforderung empfangen. Die RM-Quelle verarbeitet keine CreateSequence-Anforderungen.
es: El origen RM recibió una solicitud CreateSequence. El origen RM no procesa solicitudes CreateSequence.
fr: La source du Gestionnaire de ressources a reçu une demande CreateSequence. La source du Gestionnaire de ressources ne traite pas les demandes CreateSequence.
it: È stata ricevuta una richiesta CreateSequence dall'origine RM. L'origine RM non elabora le richieste CreateSequence.
ja: RM の送信元が CreateSequence 要求を受信しました。RM の送信元は CreateSequence 要求を処理しません。
ko: RM 소스가 CreateSequence 요청을 받았습니다. RM 소스가 CreateSequence 요청을 처리하지 않습니다.
pl: Miejsce źródłowe protokołu RM otrzymało żądanie CreateSequence. Miejsce źródłowe protokołu RM nie przetwarza żądań CreateSequence.
pt_br: A origem RM recebeu uma solicitação CreateSequence. A origem RM não processa solicitações CreateSequence.
tr: RM kaynağı bir CreateSequence isteği aldı. RM kaynağı, CreateSequence isteklerini işlemez.
zh_hans: RM 源收到 CreateSequence 请求。RM 源未处理 CreateSequence 请求。
zh_hant: RM 來源收到 CreateSequence 要求。RM 來源不處理 CreateSequence 要求。

# SequenceTerminatedUnexpectedCSROfferId
source: The RM source received multiple CreateSequenceResponse messages with different sequence identifiers over the same session.
cs: Zdroj služby RM přijal ve stejné relaci více zpráv CreateSequenceResponse s různými identifikátory sekvencí.
de: Die RM-Quelle hat mehrere CreateSequenceResponse-Nachrichten mit verschiedenen Sequenzbezeichnern innerhalb der gleichen Sitzung empfangen.
es: El origen RM recibió varios mensajes CreateSequenceResponse con diferentes identificadores de secuencia en la misma sesión.
fr: La source du Gestionnaire de ressources a reçu plusieurs messages CreateSequenceResponse avec des identificateurs de séquence différents sur la même session.
it: L'origine RM ha ricevuto più messaggi CreateSequenceResponse con identificatori di sequenza diversi nella stessa sessione.
ja: RM の送信元が、異なるシーケンス ID を持つ複数の CreateSequenceResponse メッセージを同じセッションで受信しました。
ko: RM 소스가 같은 세션에서 시퀀스 식별자 값이 서로 다른 여러 개의 CreateSequenceResponse 메시지를 받았습니다.
pl: Miejsce źródłowe protokołu RM otrzymało w ramach tej samej sesji wiele żądań CreateSequenceResponse o różnych wartościach identyfikatora sekwencji.
pt_br: A origem RM recebeu várias mensagens CreateSequenceResponse com diferentes identificadores de sequência ao longo da mesma sessão.
tr: RM kaynağı, aynı oturumda farklı sıra tanımlayıcılara sahip birden çok CreateSequenceResponse iletisi aldı.
zh_hans: RM 源收到相同会话上具有不同序列标识符的多个 CreateSequenceResponse 消息。
zh_hant: RM 來源在相同工作階段收到多個具有不同順序識別碼的 CreateSequenceResponse 訊息。

# SequenceTerminatedUnexpectedCloseSequenceResponse
source: The RM destination received an CloseSequenceResponse message. The RM destination does not process CloseSequenceResponse messages.
cs: Cíl služby RM přijal zprávu CloseSequenceResponse. Cíl služby RM nezpracovává zprávy CloseSequenceResponse.
de: Das RM-Ziel hat eine CloseSequenceResponse-Nachricht empfangen. Das RM-Ziel verarbeitet keine CloseSequenceResponse-Nachrichten.
es: El destino RM recibió un mensaje CloseSequenceResponse. El destino RM no procesa mensajes CloseSequenceResponse.
fr: La destination de messagerie fiable a reçu un message CloseSequenceResponse. Elle ne traite pas les messages CloseSequenceResponse.
it: La destinazione RM ha ricevuto un messaggio CloseSequenceResponse. La destinazione RM non elabora i messaggi CloseSequenceResponse.
ja: RM の宛先が CloseSequenceResponse メッセージを受信しました。RM の宛先は CloseSequenceResponse メッセージを処理しません。
ko: RM 대상이 CloseSequenceResponse 메시지를 받았습니다. RM 대상은 CloseSequenceResponse 메시지를 처리하지 않습니다.
pl: Miejsce docelowe protokołu RM odebrało komunikat CloseSequenceResponse. Miejsce docelowe protokołu RM nie może przetwarzać komunikatów CloseSequenceResponse.
pt_br: O destino RM recebeu uma mensagem CloseSequenceResponse. O destino RM não processa mensagens CloseSequenceResponse.
tr: RM hedefi, bir CloseSequenceResponse iletisi aldı. RM hedefi CloseSequenceResponse iletilerini işlemez.
zh_hans: RM 目标收到 CloseSequenceResponse 消息。RM 目标没有处理 CloseSequenceResponse 消息。
zh_hant: RM 目的地收到 CloseSequenceResponse 訊息。RM 目的地不處理 CloseSequenceResponse 訊息。

# SequenceTerminatedUnexpectedTerminateSequence
source: The RM source received a TerminateSequence message. The RM source does not process TerminateSequence messages.
cs: Zdroj služby RM přijal zprávu TerminateSequence. Zdroj služby RM nezpracovává zprávy TerminateSequence.
de: Die RM-Quelle hat eine TerminateSequence-Nachricht empfangen. Die RM-Quelle verarbeitet keine TerminateSequence-Nachrichten.
es: El origen RM recibió un mensaje TerminateSequence. El origen RM no procesa mensajes TerminateSequence.
fr: La source du Gestionnaire de ressources a reçu un message TerminateSequence. La source du Gestionnaire de ressources ne traite pas les messages TerminateSequence.
it: L'origine RM ha ricevuto un messaggio TerminateSequence. L'origine RM non elabora messaggi TerminateSequence.
ja: RM の送信元が TerminateSequence メッセージを受信しました。RM の送信元は TerminateSequence メッセージを処理しません。
ko: RM 소스가 TerminateSequence 메시지를 받았습니다. RM 소스가 TerminateSequence 메시지를 처리하지 않습니다.
pl: Miejsce źródłowe protokołu RM otrzymało komunikat TerminateteSequence. Miejsce źródłowe protokołu RM nie przetwarza komunikatów TerminateSequence.
pt_br: A origem RM recebeu uma mensagem TerminateSequence. A origem RM não processa mensagens TerminateSequence.
tr: RM kaynağı bir TerminateSequence iletisi aldı. RM kaynağı TerminateSequence iletilerini işlemez.
zh_hans: RM 源收到 TerminateSequence 消息。RM 源未处理 TerminateSequence 消息。
zh_hant: RM 來源收到 TerminateSequence 訊息。RM 來源不處理 TerminateSequence 訊息。

# SequenceTerminatedUnknownAddToWindowError
source: An unknown error occurred while trying to add a sequence message to the window.
cs: Během pokusu o přidání zprávy sekvence do okna došlo k neznámé chybě.
de: Unbekannter Fehler beim Hinzufügen einer Sequenznachricht zum Fenster.
es: Error desconocido al intentar agregar un mensaje de secuencia a la ventana.
fr: Une erreur inconnue s'est produite en tentant d'ajouter un message de séquence à la fenêtre.
it: Errore sconosciuto durante il tentativo di aggiungere un messaggio di sequenza alla finestra.
ja: ウィンドウにシーケンス メッセージを追加しようとしているときに不明なエラーが発生しました。
ko: 창에 시퀀스 메시지를 추가하는 동안 오류가 발생했습니다.
pl: Podczas próby dodania komunikatu sekwencji do okna wystąpił nieznany błąd.
pt_br: Erro desconhecido ao tentar adicionar uma mensagem de sequência à janela.
tr: Pencereye bir sıra iletisi eklenmeye çalışılırken bilinmeyen bir hata oluştu.
zh_hans: 尝试将序列消息添加到窗口时发生未知错误。
zh_hant: 嘗試將順序訊息新增至視窗時，發生不明的錯誤。

# SequenceTerminatedUnsupportedClose
source: The RM source does not support an RM destination initiated close since messages can be lost. The reliable session cannot continue.
cs: Zdroj služby RM nepodporuje zavření iniciované cílem služby RM, neboť může dojít ke ztrátě zpráv. Stabilní relace nemůže pokračovat.
de: Die RM-Quelle unterstützt kein vom RM-Ziel eingeleitetes Schließen, da Nachrichten verloren werden können. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: El origen RM no admite un cierre iniciado en el destino RM, ya que se pueden perder mensajes. La sesión confiable no puede continuar.
fr: La source RM ne prend pas en charge une fermeture initiée par une destination RM car les messages risquent d'être perdus. La session fiable ne peut pas continuer.
it: L'origine RM non supporta una destinazione RM avviata alla chiusura perché si può provocare la perdita dei messaggi. Impossibile continuare la sessione affidabile.
ja: メッセージが失われる可能性があるため、RM ソースは、RM 宛先によって開始された close 処理をサポートしません。信頼できるセッションは続行できません。
ko: 메시지가 손실될 수 있으므로 RM 소스는 RM 대상에서 시작된 닫기를 지원하지 않습니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Miejsce źródłowe protokołu RM nie obsługuje zamknięcia zainicjowanego przez miejsce docelowe protokołu RM, ponieważ komunikaty mogą zostać utracone. Nie można kontynuować działania niezawodnej sesji.
pt_br: A origem RM não oferece suporte a um fechamento de destino RM iniciado, pois mensagens podem ser perdidas. A sessão confiável não pode continuar.
tr: RM kaynağı, iletiler kaybolabileceğinden RM hedefi tarafından başlatılan bir kapatma işlemini desteklemez. Güvenilir oturum devam edemiyor.
zh_hans: 由于消息可能会丢失，因此 RM 源不支持 RM 目标启动的关闭。可靠会话无法继续。
zh_hant: RM 來源不支援一開始為關閉狀態的 RM 目的地，因為訊息可能會遺失。可靠工作階段無法繼續。

# SequenceTerminatedUnsupportedTerminateSequence
source: The RM source does not support an RM destination initiated termination since messages can be lost. The reliable session cannot continue.
cs: Zdroj služby RM nepodporuje ukončení iniciované cílem služby RM , neboť může dojít ke ztrátě zpráv. Stabilní relace nemůže pokračovat.
de: Die RM-Quelle unterstützt kein vom RM-Ziel eingeleitetes Beenden, da Nachrichten verloren werden können. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: El origen RM no admite una terminación iniciada en el destino RM, ya que se pueden perder mensajes. La sesión confiable no puede continuar.
fr: La source RM ne prend pas en charge un arrêt initié par une destination RM car les messages risquent d'être perdus. La session fiable ne peut pas continuer.
it: L'origine RM non supporta una destinazione RM avviata all'interruzione perché si può provocare la perdita dei messaggi. Impossibile continuare la sessione affidabile.
ja: メッセージが失われる可能性があるため、RM ソースは、RM 宛先によって開始された終了処理をサポートしません。信頼できるセッションは続行できません。
ko: 메시지가 손실될 수 있으므로 RM 소스는 RM 대상에서 시작된 종료를 지원하지 않습니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Miejsce źródłowe protokołu RM nie obsługuje zakończenia działania zainicjowanego przez miejsce docelowe protokołu RM, ponieważ komunikaty mogą zostać utracone. Nie można kontynuować działania niezawodnej sesji.
pt_br: A origem RM não oferece suporte a um término de destino RM iniciado, pois mensagens podem ser perdidas. A sessão confiável não pode continuar.
tr: RM kaynağı, iletiler kaybolabileceğinden RM hedefi tarafından başlatılan bir sonlandırma işlemini desteklemez. Güvenilir oturum devam edemiyor.
zh_hans: 由于消息可能会丢失，因此 RM 源不支持 RM 目标启动的终止。可靠会话无法继续。
zh_hant: RM 來源不支援一開始為終止狀態的 RM 目的地，因為訊息可能會遺失。可靠工作階段無法繼續。

# ServerRejectedSessionPreamble
source: The server at {0} rejected the session-establishment request.
cs: Server v {0} odmítl požadavek navázání relace.
de: Der Server bei {0} hat die Anforderung zum Einrichten einer Sitzung zurückgewiesen.
es: El servidor en {0} rechazó la solicitud de establecimiento de sesión.
fr: Le serveur à {0} a refusé la demande d'établissement de session.
it: Il server alla posizione {0} ha rifiutato la richiesta di stabilire una sessione.
ja: {0} のサーバーは、session-establishment 要求を拒否しました。
ko: {0}의 서버가 세션 연결 요청을 거부했습니다.
pl: Serwer w lokalizacji {0} odrzucił żądanie ustanowienia sesji.
pt_br: O servidor em {0} rejeitou a solicitação de estabelecimento de sessão.
tr: {0} konumundaki sunucu oturum oluşturma isteğini reddetti.
zh_hans: {0} 处的服务器拒绝了会话建立请求。
zh_hant: {0} 的伺服器拒絕工作階段建立要求。

# ServerRejectedUpgradeRequest
source: The server rejected the upgrade request.
cs: Server odmítl požadavek upgradu.
de: Der Server hat die Upgradeanforderung zurückgewiesen.
es: El servidor rechazó la solicitud de actualización.
fr: Le serveur a refusé la demande de mise à niveau.
it: Il server ha rifiutato la richiesta di aggiornamento.
ja: サーバーがアップグレード要求を拒否しました。
ko: 서버가 업그레이드 요청을 거부했습니다.
pl: Serwer odrzucił żądanie uaktualnienia.
pt_br: O servidor rejeitou a solicitação de atualização.
tr: Sunucu sürüm yükseltme isteğini reddetti.
zh_hans: 服务器拒绝了升级请求。
zh_hant: 伺服器拒絕升級要求。

# ServerTooBusy
source: Server '{0}' is too busy to process this request. Try again later.
cs: Server {0} je příliš zaneprázdněn a nemůže tento požadavek zpracovat. Opakujte akci později.
de: Der Server "{0}" ist zu ausgelastet, um diese Anforderung zu verarbeiten. Versuchen Sie es später noch mal.
es: El servidor "{0}" está demasiado ocupado para procesar esta solicitud. Inténtelo de nuevo más adelante.
fr: Le serveur '{0}' est trop occupé pour traiter cette requête. Réessayez plus tard.
it: Il server '{0}' è troppo occupato per elaborare la richiesta. Riprovare più tardi.
ja: サーバー '{0}' がビジー状態であるため、この要求を処理できません。後でやり直してください。
ko: '{0}' 서버의 사용량이 너무 많아서 이 요청을 처리할 수 없습니다. 나중에 다시 시도하세요.
pl: Serwer „{0}” Jest zbyt zajęty, aby przetworzyć to żądanie. Spróbuj ponownie później.
pt_br: O servidor '{0}' está muito ocupado para processar esta solicitação. Tente novamente mais tarde.
tr: '{0}' sunucusu bu isteği işleyemeyecek kadar meşgul. Daha sonra yeniden deneyin.
zh_hans: 服务器“{0}”太忙，无法处理此请求。请稍后重试。
zh_hant: 伺服器 '{0}' 過於忙碌，無法處理此要求。請稍後再試。

# ServiceOperationsMarkedWithIsOneWayTrueMust0
source: Operations marked with IsOneWay=true must not declare output parameters, by-reference parameters or return values.
cs: Operace označené jako IsOneWay=true nesmějí deklarovat parametry výstupu, parametry podle odkazu a vrácené hodnoty.
de: Mit "IsOneWay=true" markierte Vorgänge dürfen keine Ausgabeparameter, als Verweis zu übergebende Parameter oder Rückgabewerte deklarieren.
es: Las operaciones marcadas con IsOneWay=true no deben declarar parámetros de salida, parámetros por referencia o valores devueltos.
fr: Les opérations marquées avec IsOneWay=true ne doivent pas déclarer de paramètres de sortie, de paramètres de passage par référence ou de valeurs retournées.
it: Le operazioni contrassegnate con IsOneWay=true non devono dichiarare parametri di output, parametri per riferimento o valori restituiti.
ja: IsOneWay が true とマークされた操作では、出力パラメーター、参照渡しパラメーター、戻り値を宣言することはできません。
ko: IsOneWay=true로 표시된 작업은 출력 매개 변수, by-reference 매개 변수 또는 반환 값을 선언하지 않아야 합니다.
pl: Operacja oznaczona jako IsOneWay=true nie może deklarować parametrów wyjściowych, parametrów przekazywanych przez odwołanie ani wartości zwracanych.
pt_br: As operações marcadas com IsOneWay=true não devem declarar parâmetros de saída, parâmetros por referência nem valores retornados.
tr: IsOneWay=true olarak işaretlenen işlemler, çıkış parametresi, başvurulu parametre ya da dönüş değeri bildirmemelidir.
zh_hans: 使用 IsOneWay=true 标记的操作不得声明输出参数、引用参数或返回值。
zh_hant: 標示為 IsOneWay=true 的作業不可宣告輸出參數、傳址參數或傳回值。

# ServicesWithoutAServiceContractAttributeCan2
source: The {0} declared on method '{1}' in type '{2}' is invalid. {0}s are only valid on methods that are declared in a type that has ServiceContractAttribute. Either add ServiceContractAttribute to type '{2}' or remove {0} from method '{1}'.
cs: Třída {0} deklarovaná v metodě {1} v typu {2} je neplatná. Třídy {0} jsou platné pouze v metodách deklarovaných v typu, které mají atribut ServiceContractAttribute. Přidejte atribut ServiceContractAttribute do typu {2} nebo odeberte třídu {0} z metody {1}.
de: Der für die Methode "{1}" im Typ "{2}" deklarierte Wert {0} ist ungültig. Der Wert {0} ist nur gültig für Methoden, die in einem Typ mit dem ServiceContractAttribute deklariert sind. Fügen Sie entweder dem Typ "{2}" das ServiceContractAttribute hinzu, oder entfernen Sie {0} aus der Methode "{1}".
es: El {0} declarado en el método "{1}" en el tipo "{2}" no es válido. Los {0} solo son válidos en métodos declarados en un tipo que tenga ServiceContractAttribute. Agregue ServiceContractAttribute al tipo "{2}" o quite {0} del método "{1}".
fr: Le {0} déclaré sur la méthode '{1}' dans le type '{2}' est non valide. Les {0}s sont valides uniquement sur les méthodes qui sont déclarées dans un type contenant un attribut ServiceContractAttribute. Ajoutez ServiceContractAttribute au type '{2}' ou supprimez {0} de la méthode '{1}'.
it: L'elemento {0} dichiarato sul metodo '{1}' nel tipo '{2}' non è valido. Gli elementi {0} sono validi solo su metodi dichiarati in un tipo con ServiceContractAttribute. Aggiungere ServiceContractAttribute al tipo '{2}' o rimuovere {0} dal metodo '{1}'.
ja: 型 '{2}' のメソッド '{1}' で宣言された {0} は無効です。{0} は、ServiceContractAttribute を持つ型で宣言されたメソッドでのみ有効です。型 '{2}' に ServiceContractAttribute を追加するか、メソッド '{1}' から {0} を削除してください。
ko: '{1}' 메서드에서 '{2}' 형식으로 선언된 {0}이(가) 잘못되었습니다. {0}은(는) ServiceContractAttribute가 있는 형식으로 선언된 메서드에서만 사용할 수 있습니다. ServiceContractAttribute를 '{2}' 형식에 추가하거나 {0}을(를) '{1}' 메서드에서 제거하세요.
pl: Atrybut {0} zadeklarowany dla metody {1} w typie {2} jest nieprawidłowy. Atrybuty {0} są prawidłowe tylko dla metod zadeklarowanych w typie zawierającym atrybut ServiceContractAttribute. Dodaj atrybut ServiceContractAttribute do typu {2} albo usuń atrybut {0} z metody {1}.
pt_br: A {0} declarada no método '{1}' no tipo '{2}' é inválida. {0} só são válidas em métodos que são declarados em um tipo que tem ServiceContractAttribute. Adicione ServiceContractAttribute ao tipo '{2}' ou remova {0} do método '{1}'.
tr: '{2}' türündeki '{1}' metodunda bildirilen {0} geçersiz. {0} öznitelikleri, yalnızca ServiceContractAttribute içeren bir türde bildirilen metotlarda geçerlidir. '{2}' türüne ServiceContractAttribute ekleyin ya da '{1}' metodundan {0} özniteliğini kaldırın.
zh_hans: 针对类型“{2}”中的方法“{1}”声明的 {0} 无效。{0} 仅对在具有 ServiceContractAttribute 的类型中声明的方法有效。请将 ServiceContractAttribute 添加到类型“{2}”，或者从方法“{1}”中删除 {0}。
zh_hant: 類型 '{2}' 的方法 '{1}' 上宣告的 {0} 無效。只在具有 ServiceContractAttribute 的類型中宣告的方法上，{0} 才有效。請將 ServiceContractAttribute 新增至類型 '{2}'，或將 {0} 由方法 '{1}' 移除。

# SessionClosedBeforeDone
source: The session was closed before message transfer was complete.
cs: Relace byla ukončena před dokončením přenosu zprávy.
de: Die Sitzung wurde geschlossen, bevor die Nachrichtenübertragung abgeschlossen war.
es: La sesión se cerró antes de que se completara la transferencia de mensajes.
fr: La session a été fermée avant la fin du transfert de message.
it: La sessione è stata chiusa prima del completamento del trasferimento messaggi.
ja: メッセージの転送が完了する前にセッションが閉じられました。
ko: 메시지 전송을 마치기 전에 세션이 닫혔습니다.
pl: Sesja została zamknięta przed zakończeniem transferu komunikatów.
pt_br: A sessão foi fechada antes da transferência da mensagem ser concluída.
tr: İleti aktarma tamamlanmadan önce oturum kapatıldı.
zh_hans: 在消息传输完成以前关闭会话。
zh_hant: 在訊息傳輸完成前，工作階段已關閉。

# SessionKeyRenewalNotSupported
source: Cannot renew the security session key. Session Key Renewal is not supported.
cs: Nelze prodloužit bezpečnostní klíč relace. Prodloužení klíče relace není podporováno.
de: Der Sicherheitssitzungsschlüssel kann nicht erneuert werden. Das Erneuern des Sitzungsschlüssels wird nicht unterstützt.
es: No se puede renovar la clave de sesión de seguridad. No se admite la renovación de claves de sesión.
fr: Impossible de renouveler la clé de session de sécurité. Le renouvellement de la clé de session n'est pas pris en charge.
it: Impossibile rinnovare la chiave di sessione di sicurezza. Il rinnovo di chiavi di sessioni non è supportato.
ja: セキュリティ トークン キーを更新できません。セッション キーの更新はサポートされていません。
ko: 보안 세션 키를 갱신할 수 없습니다. 세션 키 갱신은 지원되지 않습니다.
pl: Nie można odnowić klucza sesji zabezpieczeń. Odnawianie kluczy sesji nie jest obsługiwane.
pt_br: Não é possível renovar a chave da sessão de segurança. Não existe suporte para Renovação da Chave de Sessão.
tr: Güvenlik oturumu anahtarı yenilenemiyor. Oturum Anahtarı Yenileme desteklenmiyor.
zh_hans: 无法续订安全会话密钥。不支持会话密钥续订。
zh_hant: 無法更新安全性工作階段金鑰。不支援工作階段金鑰更新。

# SessionTokenIsNotGenericXmlToken
source: The session security token provider returned a token of type '{0}'. The token type expected is '{1}'.
cs: Poskytovatel tokenu zabezpečení relace vrátil token typu {0}. Očekávaný typ tokenu je {1}.
de: Der Sicherheitstokenanbieter der Sitzung hat ein Token vom Typ "{0}" zurückgegeben. Erwartet wird der Tokentyp "{1}".
es: El proveedor de tokens de seguridad de la sesión devolvió un token de tipo '{0}'. El tipo de token esperado es '{1}'.
fr: Le fournisseur de jeton de sécurité de session a renvoyé un jeton de type '{0}'. Le type de jeton attendu est '{1}'.
it: Il provider di token di sicurezza della sessione ha restituito un token di tipo '{0}'. Tipo di token previsto: '{1}'.
ja: セッション セキュリティ トークン プロバイダーから、型が '{0}' のトークンが返されました。予期されたトークンの型は '{1}' です。
ko: 세션 보안 토큰 공급자가 '{0}' 유형의 토큰을 반환했습니다. 필요한 토큰 유형은 '{1}'입니다.
pl: Dostawca tokenu zabezpieczającego sesji zwrócił token typu „{0}”. Oczekiwany typ tokenu to „{1}”.
pt_br: O provedor de token de segurança de sessão retornou um token do tipo '{0}'. O tipo de token esperado é '{1}'.
tr: Oturum güvenliği belirteç sağlayıcısı '{0}' türünde bir belirteç döndürdü. Beklenen belirteç türü: '{1}'.
zh_hans: 会话安全令牌提供程序返回类型“{0}”的令牌。预期的令牌类型为“{1}”。
zh_hant: 工作階段安全性權杖提供者傳回類型 '{0}' 的權杖。預期的權杖類型為 '{1}'。

# SessionTokenWasNotClosed
source: The session token was not closed by the server.
cs: Token relace nebyl ukončen serverem.
de: Das Sitzungstoken wurde nicht vom Server geschlossen.
es: El servidor no cerró el token de sesión.
fr: Le jeton de session n'a pas été fermé par le serveur.
it: Token di sessione non chiuso dal server.
ja: セッション トークンはサーバーによって閉じられませんでした。
ko: 서버가 세션 토큰을 닫지 않았습니다.
pl: Token sesji nie został zamknięty przez serwer.
pt_br: O token de sessão não foi fechado pelo servidor.
tr: Oturum belirteci sunucu tarafından kapatılmadı.
zh_hans: 服务器未关闭会话令牌。
zh_hant: 工作階段權杖不是由伺服器關閉。
