Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# CSRefused
source: The request to create a reliable session has been refused by the RM Destination. {0} The channel could not be opened.
cs: Funkce RM Destination odmítla požadavek na vytvoření stabilní relace. {0} Kanál nelze otevřít.
de: Die Anforderung zum Erstellen einer zuverlässigen Sitzung wurde vom RM-Ziel zurückgewiesen. {0} Der Kanal konnte nicht geöffnet werden.
es: El destino RM rechazó la solicitud de crear una sesión confiable. {0} No se pudo abrir el canal.
fr: La demande de création d'une session fiable a été refusée par la destination RM. {0} Le canal n'a pas pu être ouvert.
it: La richiesta di creare una sessione affidabile è stata rifiutata dalla destinazione RM. {0} Impossibile aprire il canale.
ja: 信頼できるセッションを作成するための要求は RM Destination によって拒否されました。{0} チャネルを開くことができませんでした。
ko: 신뢰할 수 있는 세션을 만들라는 요청이 RM 대상에 의해 거부되었습니다. {0} 채널을 열 수 없습니다.
pl: Żądanie utworzenia niezawodnej sesji zostało odrzucone przez punkt końcowy RM Destination. {0} Nie można otworzyć kanału.
pt_br: A solicitação para criar uma sessão confiável foi recusada pelo Destino RM. {0} Não foi possível abrir o canal.
tr: Güvenilir bir oturum oluşturma isteği, RM Destination tarafından reddedildi. {0} Kanal açılamadı.
zh_hans: 创建可靠会话的请求已经被 RM Destination 拒绝。{0} 无法打开通道。
zh_hant: RM 目的地已拒絕建立可靠工作階段的要求。{0} 無法開啟通道。

# CSRefusedAcksToMustEqualEndpoint
source: The endpoint processing requests to create a reliable session only supports sessions in which the AcksTo Uri and the Endpoint Uri are the same.
cs: Koncový bod zpracovávající požadavky na vytvoření stabilní relace podporuje pouze relace, ve kterých jsou shodné identifikátory URI tříd AcksTo a Endpoint.
de: Der Endpunkt, der Anforderungen zum Erstellen von zuverlässigen Sitzungen verarbeitet, unterstützt nur Sitzungen, in denen der AcksTo-URI und der Endpunkt-URI identisch sind.
es: Las solicitudes de procesamiento de extremos para crear una sesión confiable sólo admiten sesiones en las que el URI AcksTo Uri y el URI Endpoint sean los mismos.
fr: Le point de terminaison traitant les demandes de création d'une session fiable prend en charge seulement les sessions dans lesquelles l'URI de AcksTo et l'URI du point de terminaison sont identiques.
it: L'endpoint di elaborazione delle richieste di creazione di una sessione affidabile supporta solo le sessioni in cui l'URI AcksTo e l'URI Endpoint corrispondono.
ja: 信頼できるセッションを作成するための要求を処理するエンドポイントは、AcksTo URI と Endpoint URI が同じであるセッションのみをサポートします。
ko: 신뢰할 수 있는 세션을 만들라는 요청을 처리하는 끝점은 AcksTo Uri 및 Endpoint Uri가 동일한 세션만 지원합니다.
pl: Punkt końcowy przetwarzający żądania utworzenia niezawodnej sesji obsługuje tylko te sesje, w których flagi AcksTo Uri i ReplyTo Uri są takie same.
pt_br: O ponto de extremidade que está processando solicitações para criar uma sessão confiável apenas oferece suporte para sessões em que o Uri AcksTo Uri e o Ponto de Extremidade Uri sejam os mesmos.
tr: Güvenilir bir oturum oluşturmak için istekleri işleyen bitiş noktası, yalnızca AcksTo Uri ve Endpoint Uri değerlerinin aynı olduğu oturumları destekler.
zh_hans: 用于创建可靠会话的终结点处理请求只支持其中 AcksTo URI 和终结点 URI 相同的会话。
zh_hant: 處理建立可靠工作階段要求的端點僅支援 AcksTo Uri 與 Endpoint Uri 為相同的工作階段。

# CSRefusedAcksToMustEqualReplyTo
source: The endpoint processing requests to create a reliable session only supports sessions in which the AcksTo Uri and the ReplyTo Uri are the same.
cs: Koncový bod zpracovávající požadavky na vytvoření stabilní relace podporuje pouze relace, ve kterých jsou identifikátory Uri třídy AcksTo a třídy ReplyTo shodné.
de: Der Endpunkt, der Anforderungen zum Erstellen von zuverlässigen Sitzungen verarbeitet, unterstützt nur Sitzungen, in denen der AcksTo-URI und der ReplyTo-URI identisch sind.
es: El extremo que procesa las solicitudes para crear una sesión confiable sólo admite sesiones en las que el URI AcksTo y el URI ReplyTo son iguales.
fr: Le point de terminaison traitant les demandes de création d'une session fiable prend en charge seulement les sessions dans lesquelles l'URI de AcksTo et l'URI de ReplyTo sont identiques.
it: L'endpoint di elaborazione delle richieste di creazione di una sessione affidabile supporta solo le sessioni in cui l'URI AcksTo e l'URI ReplyTo corrispondono.
ja: 信頼できるセッションを作成するための要求を処理するエンドポイントは、AcksTo URI と ReplyTo URI が同じであるセッションのみをサポートします。
ko: 신뢰할 수 있는 세션을 만들라는 요청을 처리하는 끝점은 AcksTo Uri 및 ReplyTo Uri가 동일한 세션만 지원합니다.
pl: Punkt końcowy przetwarzający żądania utworzenia niezawodnej sesji obsługuje jedynie sesje, w których flagi AcksTo Uri i ReplyTo Uri są takie same.
pt_br: O ponto de extremidade que está processando solicitações para criar uma sessão confiável apenas oferece suporte para sessões em que o Uri AcksTo Uri e o Uri ReplyTo sejam os mesmos.
tr: Güvenilir bir oturum oluşturmak için istekleri işleyen bitiş noktası, yalnızca AcksTo Uri ve ReplyTo Uri değerlerinin aynı olduğu oturumları destekler.
zh_hans: 用于创建可靠会话的终结点处理请求只支持其中的 AcksTo URI 和 ReplyTo URI 相同的会话。
zh_hant: 處理要求以建立可靠工作階段的端點僅支援 AcksTo Uri 與 ReplyTo Uri 為相同的工作階段。

# CSRefusedInvalidIncompleteSequenceBehavior
source: The request to create a reliable session contains an invalid wsrm:IncompleteSequenceBehavior value. This is a WS-ReliableMessaging protocol violation.
cs: Požadavek na vytvoření stabilní relace obsahuje neplatnou hodnotu třídy wsrm:IncompleteSequenceBehavior. To je narušení protokolu WS-ReliableMessaging.
de: Die Anforderung zum Erstellen einer zuverlässigen Sitzung enthält einen ungültigen wsrm:IncompleteSequenceBehavior-Wert. Dies ist eine WS-ReliableMessaging-Protokollverletzung.
es: La solicitud para crear una sesión confiable contiene un valor de wsrm:IncompleteSequenceBehavior que no es válido. Ésta es una infracción del protocolo WS-ReliableMessaging.
fr: La demande de création d'une session fiable contient une valeur wsrm:IncompleteSequenceBehavior non valide. Il s'agit d'une violation du protocole WS-ReliableMessaging.
it: La richiesta di creazione di una sessione affidabile contiene un valore wsrm:IncompleteSequenceBehavior non valido. Ciò costituisce una violazione del protocollo WS-ReliableMessaging.
ja: 信頼できるセッションを作成するための要求に、無効な wsrm:IncompleteSequenceBehavior 値が含まれています。これは WS-ReliableMessaging のプロトコル違反です。
ko: 신뢰할 수 있는 세션을 만들라는 요청에 잘못된 wsrm:IncompleteSequenceBehavior 값이 있습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다.
pl: Żądanie utworzenia niezawodnej sesji zawiera nieprawidłową wartość wsrm:IncompleteSequenceBehavior. Stanowi to naruszenie protokołu WS-ReliableMessaging.
pt_br: A solicitação para criar uma sessão confiável contém um valor wsrm:IncompleteSequenceBehavior inválido. Trata-se de uma violação do protocolo WS-ReliableMessaging.
tr: Güvenilir bir oturum oluşturma isteği geçersiz bir wsrm:IncompleteSequenceBehavior değeri içeriyor. Bu, WS-ReliableMessaging protokolünün ihlalidir.
zh_hans: 用于创建可靠会话的请求中包含无效的 wsrm:IncompleteSequenceBehavior 值。这违反了 WS-ReliableMessaging 协议。
zh_hant: 建立可靠工作階段的要求包含無效的 wsrm:IncompleteSequenceBehavior 值。這違反 WS-ReliableMessaging 通訊協定。

# CSRefusedNoSTRWSSecurity
source: The request to create a reliable session contains the wsse:SecurityTokenReference but does not carry a wsrm:UsesSequenceSTR header. This is a WS-ReliableMessaging protocol violation. The session could not be created.
cs: Požadavek na vytvoření stabilní relace obsahuje třídu wsse:SecurityTokenReference, ale nenese záhlaví wsrm:UsesSequenceSTR. To je narušení protokolu WS-ReliableMessaging. Relaci nelze vytvořit.
de: Die Anforderung zum Erstellen einer zuverlässigen Sitzung enthält die wsse:SecurityTokenReference, hat aber keinen wsrm:UsesSequenceSTR-Header. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die Sitzung konnte nicht erstellt werden.
es: La solicitud para crear una sesión confiable contiene el elemento wsse:SecurityTokenReference, pero no lleva ningún encabezado wsrm:UsesSequenceSTR. Ésta es una infracción del protocolo WS-ReliableMessaging. La sesión no se pudo crear.
fr: La demande de création d'une session fiable contient l'élément wsse:SecurityTokenReference mais ne comporte pas d'en-tête wsrm:UsesSequenceSTR. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session n'a pas pu être créée.
it: La richiesta di creazione di una sessione affidabile contiene il valore wsse:SecurityTokenReference, ma non contiene un'intestazione wsrm:UsesSequenceSTR. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Impossibile creare la sessione.
ja: 信頼できるセッションを作成するための要求に wsse:SecurityTokenReference が含まれていますが、wsrm:UsesSequenceSTR ヘッダーがありません。これは WS-ReliableMessaging のプロトコル違反です。セッションを作成できませんでした。
ko: 신뢰할 수 있는 세션을 만들라는 요청에 wsse:SecurityTokenReference가 있지만 wsrm:UsesSequenceSTR 헤더가 없습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 세션을 만들 수 없습니다.
pl: Żądanie utworzenia niezawodnej sesji zawiera wartość wsse:SecurityTokenReference, ale nie zawiera nagłówka wsrm:UsesSequenceSTR. Stanowi to naruszenie protokołu WS-ReliableMessaging. Nie można utworzyć sesji.
pt_br: A solicitação para criar uma sessão confiável contém o wsse:SecurityTokenReference, mas não possui um cabeçalho wsrm:UsesSequenceSTR. Trata-se de uma violação do protocolo WS-ReliableMessaging. Não foi possível criar a sessão.
tr: Güvenilir bir oturum oluşturma isteği wsse:SecurityTokenReference içeriyor ancak bir wsrm:UsesSequenceSTR üst bilgisine sahip değil. Bu, WS-ReliableMessaging protokolünün ihlalidir. Oturum oluşturulamadı.
zh_hans: 用于创建可靠会话的请求中包含 wsse:SecurityTokenReference，但未包含 wsrm:UsesSequenceSTR 头。这违反了 WS-ReliableMessaging 协议。无法创建该会话。
zh_hant: 建立可靠工作階段的要求包含 wsse:SecurityTokenReference，但並未具有 wsrm:UsesSequenceSTR 標頭。這違反 WS-ReliableMessaging 通訊協定。無法建立工作階段。

# CSRefusedRequiredSecurityElementMissing
source: The RM Destination requires the WS-SecureConversation protocol in the binding. This is likely caused by a binding mismatch.
cs: Funkce RM Destination vyžaduje ve vazbě protokol WS-SecureConversation. To je pravděpodobně způsobeno neshodou vazeb.
de: Das RM-Ziel erfordert das WS-SecureConversation-Protokoll in der Bindung. Dies wird vermutlich durch eine fehlende Bindungsübereinstimmung verursacht.
es: El destino RM requiere el protocolo WS-SecureConversation en el enlace. La causa probable es que los enlaces no coinciden.
fr: La destination RM requiert le protocole WS-SecureConversation dans la liaison. Cela est probablement provoqué par une non-correspondance de liaison.
it: La destinazione RM richiede il protocollo WS-SecureConversation nel binding. È possibile che i binding non corrispondano.
ja: RM Destination はバインドにおいて WS-SecureConversation プロトコルが必要です。これはバインドの不整合により発生する可能性があります。
ko: RM 대상은 바인딩에서 WS-SecureConversation 프로토콜이 필요합니다. 이것은 흔히 바인딩 불일치로 인해 발생합니다.
pl: Punkt końcowy RM Destination wymaga użycia protokołu WS-SecureConversation w powiązaniu. Prawdopodobnie jest to spowodowane niezgodnością powiązań.
pt_br: O Destino RM requer o protocolo WS-SecureConversation na associação. A causa mais provável é uma incompatibilidade entre associações.
tr: RM Destination için bağlamada WS-SecureConversation protokolü olması gerekir. Bu büyük olasılıkla bir bağlama uyumsuzluğundan kaynaklanıyor.
zh_hans: RM Destination 需要绑定中存在 WS-SecureConversation 协议。这可能由绑定不匹配导致。
zh_hant: RM 目的地要求繫結中必須有 WS-SecureConversation 通訊協定。這可能是因繫結不符所相造成。

# CSRefusedSSLNotSupported
source: The endpoint processing requests to create a reliable session does not support sessions that use SSL. This is likely caused by a binding mismatch. The session could not be created.
cs: Koncový bod zpracovávající požadavky na vytvoření stabilní relace nepodporuje relace používající protokol SSL. To je pravděpodobně způsobeno neshodou vazeb. Relaci nelze vytvořit.
de: Der Endpunkt, der Anforderungen zum Erstellen von zuverlässigen Sitzungen verarbeitet, unterstützt keine Sitzungen, die SSL verwenden. Dies wird vermutlich durch eine fehlende Bindungsübereinstimmung verursacht. Die Sitzung konnte nicht erstellt werden.
es: Las solicitudes de procesamiento de extremos para crear una sesión confiable no admiten sesiones que utilicen SSL. Es probable que esto se deba a que un enlace no coincide. La sesión no se pudo crear.
fr: Le point de terminaison traitant les demandes de création d'une session fiable ne prend pas en charge les sessions utilisant SSL. Cela est probablement provoqué par une non-correspondance de liaison. La session n'a pas pu être créée.
it: L'endpoint di elaborazione delle richieste di creazione di una sessione affidabile non supporta sessioni che utilizzano SSL. È possibile che i binding non corrispondano. Impossibile creare la sessione.
ja: 信頼できるセッションを作成するための要求を処理するエンドポイントは、SSL を使用するセッションをサポートしていません。これはバインドの不整合により発生する可能性があります。セッションを作成できませんでした。
ko: 신뢰할 수 있는 세션을 만들라는 요청을 처리하는 끝점은 SSL을 사용하는 세션을 지원하지 않습니다. 이것은 흔히 바인딩 불일치로 인해 발생합니다. 세션을 만들 수 없습니다.
pl: Punkt końcowy przetwarzający żądania utworzenia niezawodnej sesji nie obsługuje sesji, w których jest używany protokół SSL. Jest to prawdopodobnie spowodowane niezgodnością powiązań. Nie można utworzyć sesji.
pt_br: O ponto de extremidade que processa solicitações para criar uma sessão confiável não oferece suporte a sessões que usam SSL. A causa mais provável é uma incompatibilidade entre associações. Não foi possível criar a sessão.
tr: Güvenilir bir oturum oluşturma isteklerini işleyen bitiş noktası SSL kullanan oturumları desteklemiyor. Bunun nedeni olasılıkla bir bağlama uyuşmazlığıdır. Oturum oluşturulamadı.
zh_hans: 用于创建可靠会话的终结点处理请求不支持使用 SSL 的会话。这可能是由绑定不匹配引起的。无法创建该会话。
zh_hant: 處理建立可靠工作階段要求的端點不支援使用 SSL 的工作階段。這可能是因繫結不相符所造成。無法建立工作階段。

# CSRefusedSTRNoWSSecurity
source: The request to create a reliable session carries a wsrm:UsesSequenceSTR header, but does not contain the wsse:SecurityTokenReference. This is a WS-ReliableMessaging protocol violation. The session could not be created.
cs: Požadavek na vytvoření stabilní relace nese záhlaví wsrm:UsesSequenceSTR, ale neobsahuje element wsse:SecurityTokenReference. To je narušení protokolu WS-ReliableMessaging. Relaci nelze vytvořit.
de: Die Anforderung zum Erstellen einer zuverlässigen Sitzung hat einen wsrm:UsesSequenceSTR-Header, enthält aber keine wsse:SecurityTokenReference. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die Sitzung konnte nicht erstellt werden.
es: La solicitud para crear una sesión confiable lleva un encabezado wsrm:UsesSequenceSTR, pero no contiene el elemento wsse:SecurityTokenReference. Esta es una infracción del protocolo WS-ReliableMessaging. La sesión no se pudo crear.
fr: La demande de création d'une session fiable comporte un en-tête wsrm:UsesSequenceSTR mais ne contient pas l'élément wsse:SecurityTokenReference. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session n'a pas pu être créée.
it: La richiesta di creazione di una sessione affidabile contiene un'intestazione wsrm:UsesSequenceSTR, ma non contiene wsse:SecurityTokenReference. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Impossibile creare una sessione.
ja: 信頼できるセッションを作成するための要求に wsrm:UsesSequenceSTR ヘッダーがありますが、wsse:SecurityTokenReference が含まれていません。これは WS-ReliableMessaging のプロトコル違反です。セッションを作成できませんでした。
ko: 신뢰할 수 있는 세션을 만들라는 요청에 wsrm:UsesSequenceSTR 헤더가 있지만 wsse:SecurityTokenReference가 없습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 세션을 만들 수 없습니다.
pl: Żądanie utworzenia niezawodnej sesji zawiera nagłówek wsrm:UsesSequenceSTR, ale nie zawiera wartości wsse:SecurityTokenReference. Stanowi to naruszenie protokołu WS-ReliableMessaging. Nie można utworzyć sesji.
pt_br: A solicitação para criar uma sessão confiável possui um cabeçalho wsrm:UsesSequenceSTR, mas não contém o wsse:SecurityTokenReference. Trata-se de uma violação do protocolo WS-ReliableMessaging. Não foi possível criar a sessão.
tr: Güvenilir bir oturum oluşturma isteği wsrm:UsesSequenceSTR üst bilgisine sahip ancak bir wsse:SecurityTokenReference içermiyor. Bu bir WS-ReliableMessaging protokolü ihlalidir. Oturum oluşturulamadı.
zh_hans: 用于创建可靠会话的请求中包含 wsrm:UsesSequenceSTR 头，但未包含 wsse:SecurityTokenReference。这违反了 WS-ReliableMessaging 协议。无法创建该会话。
zh_hant: 建立可靠工作階段的要求具有 wsrm:UsesSequenceSTR 標頭，但並未包含 wsse:SecurityTokenReference。這違反 WS-ReliableMessaging 通訊協定。無法建立工作階段。

# CSRefusedUnexpectedElementAtEndOfCSMessage
source: The message is not a valid SOAP message. The body contains more than 1 root element.
cs: Toto není platná zpráva SOAP. Text obsahuje více než jeden kořenový element.
de: Die Nachricht ist keine gültige SOAP-Nachricht. Der Nachrichtentext enthält mehr als 1 Stammelement.
es: El mensaje no es un mensaje SOAP válido. El cuerpo contiene más de 1 elemento raíz.
fr: Le message n'est pas un message SOAP valide. Le corps contient plus d'un élément racine.
it: Messaggio SOAP non valido. Il corpo contiene più di un elemento radice.
ja: このメッセージは有効な SOAP メッセージではありません。本文に複数のルート要素があります。
ko: 메시지가 올바른 SOAP 메시지가 아닙니다. 본문에 둘 이상의 루트 요소가 포함되어 있습니다.
pl: Komunikat nie jest poprawnym komunikatem protokołu SOAP. Treść zawiera więcej niż jeden element główny.
pt_br: A mensagem não é uma mensagem SOAP válida. O corpo contém mais de um 1 elemento raiz.
tr: İleti, geçerli bir SOAP iletisi değil. Gövdede 1'den fazla kök öğesi var.
zh_hans: 该消息不是有效的 SOAP 消息。正文中包含多个根元素。
zh_hant: 訊息不是有效的 SOAP 訊息。本文包含 1 個以上的根元素。

# CSResponseOfferRejected
source: The remote endpoint replied to a request for a two way session with an offer for a one way session. This is likely caused by a binding mismatch. The channel could not be opened.
cs: Vzdálený koncový bod odpověděl na požadavek na obousměrnou relaci nabídkou jednosměrné relace. To je pravděpodobně způsobeno neshodou vazeb. Kanál nelze otevřít.
de: Der Remoteendpunkt hat auf eine Anforderung nach einer bidirektionalen Sitzung mit einem Angebot für eine unidirektionale Sitzung geantwortet. Dies wird vermutlich durch eine fehlende Bindungsübereinstimmung verursacht. Der Kanal konnte nicht geöffnet werden.
es: El extremo remoto respondió a una solicitud de una sesión bidireccional con una oferta de una sesión unidireccional. Es probable que esto se deba a que un enlace no coincide. El canal no se pudo abrir.
fr: Le point de terminaison distant a répondu à une demande de session bidirectionnelle par une session monodirectionnelle. Cela est probablement provoqué par une non-correspondance de liaison. Le canal n'a pas pu être ouvert.
it: L'endpoint remoto ha risposto a una richiesta di sessione bidirezionale con un'offerta di sessione unidirezionale. È possibile che i binding non corrispondano. Impossibile aprire il canale.
ja: リモート エンドポイントは、双方向セッションの要求に対して一方向セッションの提案で応答しました。これはバインドの不整合により発生する可能性があります。チャネルを開くことができませんでした。
ko: 원격 끝점이 단방향 세션 제공을 사용하여 양방향 세션에 대한 요청에 응답했습니다. 이것은 흔히 바인딩 불일치로 인해 발생합니다. 채널을 열 수 없습니다.
pl: Zdalny punkt końcowy odpowiedział na żądanie utworzenia sesji dwukierunkowej ofertą utworzenia sesji jednokierunkowej. Jest to prawdopodobnie spowodowane niezgodnością powiązań. Nie można otworzyć kanału.
pt_br: O ponto de extremidade remoto respondeu a uma solicitação de sessão bidirecional com uma oferta de uma sessão unidirecional. A causa mais provável é uma incompatibilidade entre associações. Não foi possível abrir o canal.
tr: Uzak bitiş noktası, çift yönlü oturum isteğine tek yönlü bir oturum teklifiyle yanıt verdi. Bunun nedeni olasılıkla bir bağlama uyuşmazlığıdır. Kanal açılamadı.
zh_hans: 远程终结点通过提供单向会话答复了双向会话的请求。这可能是由绑定不匹配引起的。无法打开通道。
zh_hant: 遠端端點以單向工作階段提議回覆雙向工作階段的要求。這可能是因繫結不相符所造成。無法開啟通道。

# CSResponseOfferRejectedReason
source: The client requested creation of a two way session. A one way session was created. The session cannot continue without as a one way session. This is likely caused by a binding mismatch.
cs: Klient požadoval vytvoření dvousměrné relace. Byla vytvořena jednosměrná relace. Relace nemůže pokračovat jako jednosměrná relace. To je pravděpodobně způsobeno neshodou vazeb.
de: Der Client hat die Erstellung einer bidirektionalen Sitzung angefordert. Es wurde eine unidirektionale Sitzung erstellt. Die Sitzung kann nicht als unidirektionale Sitzung fortgesetzt werden. Dies wird vermutlich durch eine fehlende Bindungsübereinstimmung verursacht.
es: El cliente solicitó la creación de una sesión bidireccional. Se creó una sesión unidireccional. La sesión no puede continuar como sesión unidireccional. Es probable que esto se deba a que un enlace no coincide.
fr: Le client a demandé la création d'une session bidirectionnelle. Une session monodirectionnelle a été créée. La session ne peut pas se poursuivre en tant que session monodirectionnelle. Cela est probablement provoqué par une non-correspondance de liaison.
it: Il client ha richiesto la creazione di una sessione bidirezionale. Creata una sessione unidirezionale. La sessione non può continuare come sessione unidirezionale. È possibile che i binding non corrispondano.
ja: クライアントは双方向セッションの作成を要求しましたが、一方向のセッションが作成されました。セッションは一方向のセッションとしては続行できません。これはバインドの不整合により発生する可能性があります。
ko: 클라이언트에서 양방향 세션을 만들도록 요청했습니다. 단방향 세션을 만들었습니다. 단방향 세션이 아니면 세션을 계속할 수 없습니다. 이것은 흔히 바인딩 불일치로 인해 발생합니다.
pl: Klient zażądał utworzenia sesji dwukierunkowej. Została utworzona sesja jednokierunkowa. Tej sesji nie można kontynuować jako sesji jednokierunkowej. Jest to prawdopodobnie spowodowane niezgodnością powiązań.
pt_br: O cliente solicitou a criação de uma sessão bidirecional. Uma sessão unidirecional foi criada. A sessão não pode continuar sem uma sessão unidirecional. A causa mais provável é uma incompatibilidade entre associações.
tr: İstemci iki yönlü bir oturum oluşturulmasını istedi. Tek yönlü bir oturum oluşturuldu. Tek yönlü bir oturum olmadan oturum devam edemez. Bu büyük olasılıkla bir bağlama uyumsuzluğundan kaynaklanıyor.
zh_hans: 客户端请求创建双向会话。创建了单向会话。该会话可以作为一个单向会话继续。这可能是由绑定不匹配引起的。
zh_hant: 用戶端要求建立雙向工作階段。已建立單向工作階段。若不使用單向工作階段，該工作階段將無法繼續。這可能是因繫結不相符所造成。

# CSResponseWithInvalidIncompleteSequenceBehavior
source: The response to the request to create a reliable session contains an invalid wsrm:IncompleteSequenceBehavior value. This is a WS-ReliableMessaging protocol violation.
cs: Odpověď na požadavek na vytvoření stabilní relace obsahuje neplatnou hodnotu wsrm:IncompleteSequenceBehavior. To je narušení protokolu WS-ReliableMessaging.
de: Die Antwort auf die Anforderung zum Erstellen einer zuverlässigen Sitzung enthält einen ungültigen wsrm:IncompleteSequenceBehavior-Wert. Dies ist eine WS-ReliableMessaging-Protokollverletzung.
es: La respuesta a la solicitud de creación de una sesión confiable contiene un valor wsrm:IncompleteSequenceBehavior que no es válido. Ésta es una infracción del protocolo WS-ReliableMessaging.
fr: La réponse à la demande de création d'une session fiable contient une valeur wsrm:IncompleteSequenceBehavior non valide. Il s'agit d'une violation du protocole WS-ReliableMessaging.
it: La risposta alla richiesta di creazione di una sessione affidabile contiene un valore wsrm:IncompleteSequenceBehavior non valido. Ciò costituisce una violazione del protocollo WS-ReliableMessaging.
ja: 信頼できるセッションを作成するための要求への応答に、無効な wsrm:IncompleteSequenceBehavior 値が含まれています。これは WS-ReliableMessaging のプロトコル違反です。
ko: 신뢰할 수 있는 세션을 만들라는 요청에 대한 응답에 잘못된 wsrm:IncompleteSequenceBehavior 값이 있습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다.
pl: Odpowiedź na żądanie utworzenia niezawodnej sesji zawiera nieprawidłową wartość wsrm:IncompleteSequenceBehavior. Stanowi to naruszenie protokołu WS-ReliableMessaging.
pt_br: A resposta à solicitação para criar uma sessão confiável contém um valor wsrm:IncompleteSequenceBehavior inválido. Trata-se de uma violação do protocolo WS-ReliableMessaging.
tr: Güvenilir bir oturum oluşturma isteğine verilen yanıt geçersiz bir wsrm:IncompleteSequenceBehavior değeri içeriyor. Bu, WS-ReliableMessaging protokolünün ihlalidir.
zh_hans: 对创建可靠会话的请求的响应中包含无效的 wsrm:IncompleteSequenceBehavior 值。这违反了 WS-ReliableMessaging 协议。
zh_hant: 要求建立可靠工作階段的回應包含無效的 wsrm:IncompleteSequenceBehavior 值。這違反 WS-ReliableMessaging 通訊協定。
