Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# HttpAddressingNoneHeaderOnWire
source: The incoming message contains a SOAP header representing the WS-Addressing '{0}', yet the HTTP transport is configured with AddressingVersion.None. As a result, the message is being dropped. If this is not desired, then update your HTTP binding to support a different AddressingVersion.
cs: Příchozí zpráva obsahuje záhlaví SOAP, které představuje element WS-Addressing {0}, přesto je přenos protokolu HTTP konfigurován s třídou AddressingVersion.None. V důsledku toho se zpráva ztrácí. Pokud k tomu nemá docházet, aktualizujte vazbu protokolu HTTP, aby podporovala jinou třídu AddressingVersion.
de: Die eingehende Nachricht enthält einen SOAP-Header, der WS-Addressing "{0}" darstellt, der HTTP-Transport ist jedoch mit AddressingVersion.None konfiguriert. Daher wird die Nachricht gelöscht. Wenn Sie dies vermeiden möchten, aktualisieren Sie die HTTP-Bindung, damit eine andere AddressingVersion unterstützt wird.
es: El mensaje entrante contiene un encabezado SOAP que representa WS-Addressing "{0}", pero el transporte HTTP está configurado con AddressingVersion.None. Como consecuencia, se quitará el mensaje. Para evitarlo, actualice el enlace HTTP para que admita AddressingVersion con un valor diferente.
fr: Le message entrant contient un en-tête SOAP représentant le WS-Addressing '{0}', alors que le transport HTTP est configuré avec AddressingVersion.None. Le message a donc été abandonné. Si cette action n'est pas souhaitée, effectuez la mise à jour de la liaison HTTP pour qu'elle prenne en charge un autre AddressingVersion.
it: Il messaggio in arrivo contiene un'intestazione SOAP che rappresenta l'elemento WS-Addressing '{0}', ma il trasporto HTTP è configurato con AddressingVersion.None, di conseguenza il messaggio verrà eliminato. Per risolvere il problema, aggiornare il binding HTTP in modo che supporti una versione diversa di AddressingVersion.
ja: 受信メッセージには WS-Addressing '{0}' を表す SOAP ヘッダーが含まれていますが、HTTP トランスポートには AddressingVersion.None が設定されています。この結果、このメッセージはドロップされています。これを防ぐには、異なる AddressingVersion をサポートするように HTTP バインディングを更新してください。
ko: 들어오는 메시지에 WS-Addressing '{0}'을(를) 나타나는 SOAP 헤더가 포함되어 있지만 HTTP 전송이 AddressingVersion.None으로 구성되었습니다. 결과적으로 메시지를 삭제하는 중입니다. 이것을 방지하려면 다른 AddressingVersion을 지원하도록 HTTP 바인딩을 업데이트하세요.
pl: Przychodząca wiadomość zawiera nagłówek SOAP reprezentujący standard adresowania WS-Addressing „{0}”, jednak przesyłanie za pośrednictwem protokołu HTTP zostało skonfigurowane przy użyciu ustawienia AddressingVersion.None. W rezultacie wiadomość została utracona. Jeśli jest to niepożądane, zaktualizuj powiązanie protokołu HTTP, aby inna wersja adresowania mogła być obsługiwana.
pt_br: A mensagem de entrada contém um cabeçalho SOAP que representa WS-Addressing '{0}', mas o transporte HTTP está configurado com AddressingVersion.None. Como resultado, a mensagem está sendo removida. Se essa não for a ação desejada, atualize a associação HTTP para dar suporte a um tipo diferente de AddressingVersion.
tr: Gelen ileti, WS-Addressing '{0}' öğesini temsil eden bir SOAP üst bilgisi bulundurur, ancak HTTP aktarımı AddressingVersion.None ile yapılandırılmamış. Bunun sonucu olarak ileti bırakılıyor. Bu istenmiyorsa, farklı bir AddressingVersion değerini desteklemesi için HTTP bağlamanızı güncelleştirin.
zh_hans: 传入消息包含表示 WS-Addressing“{0}”的 SOAP 标头，而 HTTP 传输配置为 AddressingVersion.None。因此，该消息被丢弃。如果不希望出现这种情况，请更新 HTTP 绑定以支持不同的 AddressingVersion。
zh_hant: 內送郵件包含代表 WS-Addressing '{0}' 的 SOAP 標頭，但 HTTP 傳輸設定為 AddressingVersion.None。因此導致訊息被捨棄。若不想捨棄訊息，請更新 HTTP 繫結，以支援不同的 AddressingVersion。

# HttpAuthDoesNotSupportRequestStreaming
source: HTTP request streaming cannot be used in conjunction with HTTP authentication. Either disable request streaming or specify anonymous HTTP authentication.
cs: Datový proud požadavku HTTP nelze použít společně s ověřováním protokolu HTTP. Zakažte datový proud požadavku nebo určete anonymní ověřování protokolu HTTP.
de: HTTP-Anforderungsstreaming kann nicht zusammen mit einer anderen HTTP-Authentifizierung verwendet werden. Deaktivieren Sie entweder das Anforderungsstreaming, oder geben Sie eine anonyme HTTP-Authentifizierung an.
es: La transmisión de solicitudes HTTP no se puede usar en combinación con la autenticación HTTP. Deshabilite la transmisión de solicitudes o especifique una autenticación HTTP anónima.
fr: Impossible d'utiliser un streaming de requêtes HTTP avec l'authentification HTTP. Désactivez le streaming de requêtes ou spécifiez une authentification HTTP anonyme.
it: Non è possibile usare il flusso di richiesta HTTP con all'autenticazione HTTP. Disabilitare il flusso di richiesta o specificare l'autenticazione HTTP anonima.
ja: HTTP 要求ストリームは、HTTP 認証と組み合わせて使用できません。要求ストリームを無効にするか、匿名 HTTP 認証を指定してください。
ko: HTTP 요청 스트리밍을 HTTP 인증과 함께 사용할 수 없습니다. 요청 스트리밍을 사용하지 않도록 설정하거나 익명 HTTP 인증을 지정하세요.
pl: Przesyłanie strumieniowe żądania protokołu HTTP nie może być używane w połączeniu z uwierzytelnieniem protokołu HTTP. Wyłącz strumieniowe przesyłanie żądania albo określ anonimowe uwierzytelnienie protokołu HTTP.
pt_br: Não é possível usar streaming de solicitação HTTP junto com a autenticação HTTP. Desabilite o streaming de solicitação ou especifique a autenticação HTTP anônima.
tr: HTTP istek akışı, HTTP kimlik doğrulamasıyla birlikte kullanılamaz. İstek akışını devre dışı bırakın ya da anonim HTTP kimlik denetimi belirtin.
zh_hans: HTTP 请求流无法与 HTTP 身份验证一起使用。请禁用请求流或指定匿名 HTTP 身份验证。
zh_hant: HTTP 要求資料流無法與 HTTP 驗證搭配使用。請停用要求資料流，或指定匿名 HTTP 驗證。

# HttpAuthSchemeCannotBeNone
source: The value specified for the AuthenticationScheme property on the HttpTransportBindingElement ('{0}') is not allowed when building a ChannelFactory. If you used a standard binding, ensure the ClientCredentialType is not set to HttpClientCredentialType.InheritedFromHost, a value which is invalid on a client. If you set the value to '{0}' directly on the HttpTransportBindingElement, please set it to Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication, or Anonymous.
cs: Zadaná hodnota vlastnosti AuthenticationScheme v elementu HttpTransportBindingElement ({0}) není při vytváření objektu ChannelFactory povolena. Pokud jste použili standardní vazbu, ujistěte se, zda nebyl typ ClientCredentialType nastaven na hodnotu HttpClientCredentialType.InheritedFromHost, která je na klientovi neplatná. Pokud hodnotu nastavujete na {0} přímo v elementu HttpTransportBindingElement, nastavte ji na Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication nebo Anonymous.
de: Der für die AuthenticationScheme-Eigenschaft für HttpTransportBindingElement ("{0}") angegebene Wert ist beim Erstellen einer ChannelFactory nicht zulässig. Wenn Sie eine Standardbindung verwendet haben, stellen Sie sicher, dass ClientCredentialType nicht auf HttpClientCredentialType.InheritedFromHost festgelegt ist. Dieser Wert ist auf einem Client ungültig. Wenn Sie den Wert direkt im HttpTransportBindingElement auf "{0}" festlegen, legen Sie ihn auf Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication oder Anonymous fest.
es: El valor especificado para la propiedad AuthenticationScheme en el HttpTransportBindingElement ("{0}") no está permitido al compilar un ChannelFactory. Si ha utilizado un vínculo estándar, asegúrese de que el ClientCredentialType no está establecido como HttpClientCredentialType.InheritedFromHost, un valor que no es válido en un cliente. Si establece el valor a "{0}" directamente en el HttpTransportBindingElement, establézcalo a Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication, o Anonymous.
fr: La valeur spécifiée pour la propriété AuthenticationScheme sur l'élément HttpTransportBindingElement («{0}») n'est pas autorisée durant la création d'un élément ChannelFactory. Si vous avez utilisé une liaison standard, vérifiez que la valeur de l'élément ClientCredentialType n'est pas HttpClientCredentialType.InheritedFromHost, car cette valeur est non valide sur un client. Si vous définissez la valeur de «{0}» directement sur l'élément HttpTransportBindingElement, elle doit être Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication ou Anonymous.
it: Il valore specificato per la proprietà AuthenticationScheme in HttpTransportBindingElement ('{0}') non è consentito durante la creazione di un elemento ChannelFactory. Se è stato usato un binding standard, verificare che ClientCredentialType non sia impostato su HttpClientCredentialType.InheritedFromHost, che è un valore non valido in un client. Se il valore viene impostato su '{0}' direttamente in HttpTransportBindingElement, impostarlo su Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication o Anonymous.
ja: ChannelFactory の構築時、HttpTransportBindingElement ('{0}') の AuthenticationScheme プロパティに指定された値は許可されません。標準のバインドを使用した場合は、ClientCredentialType が、クライアントで無効な値である HttpClientCredentialType.InheritedFromHost に設定されていないことをご確認ください。HttpTransportBindingElement の '{0}' に値を直接設定する場合は、Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication、または Anonymous に設定してください。
ko: HttpTransportBindingElement('{0}')에서 AuthenticationScheme 속성에 대해 지정된 값은 ChannelFactory를 작성할 때 허용되지 않습니다. 표준 바인딩을 사용한 경우 ClientCredentialType이 클라이언트에서 잘못된 값인 HttpClientCredentialType.InheritedFromHost로 설정되지 않았는지 확인하세요. HttpTransportBindingElement에서 직접 값을 '{0}'(으)로 설정한 경우 다이제스트, 협상, NTLM, 기본, IntegratedWindowsAuthentication 또는 익명으로 설정하세요.
pl: Wartość określona dla właściwości AuthenticationScheme w obiekcie HttpTransportBindingElement ("{0}") jest niedozwolona podczas tworzenia obiektu ChannelFactory. Jeśli jest używane powiązanie standardowe, upewnij się, że właściwość ClientCredentialType nie ma wartości HttpClientCredentialType.InheritedFromHost, ponieważ ta wartość jest nieprawidłowa na kliencie. Jeśli ustawiasz tę wartość na "{0}" bezpośrednio w obiekcie HttpTransportBindingElement, użyj wartości Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication lub Anonymous.
pt_br: O valor especificado para a propriedade AuthenticationScheme no HttpTransportBindingElement ('{0}') não é permitido ao construir um ChannelFactory. Se você usou uma associação padrão, certifique-se de que o ClientCredentialType não esteja definido como HttpClientCredentialType.InheritedFromHost, um valor que é inválido em um cliente. Se você definir o valor como '{0}' diretamente no HttpTransportBindingElement, defina-o como Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication ou Anonymous.
tr: AuthenticationScheme özelliği için HttpTransportBindingElement ('{0}') öğesinde belirtilen değere ChannelFactory oluşturulurken izin verilmiyor. Standart bir bağlama kullandıysanız, ClientCredentialType'ın istemcilerde geçersiz bir değer olan HttpClientCredentialType.InheritedFromHost olarak ayarlanmadığından emin olun. Değeri doğrudan HttpTransportBindingElement üzerinde '{0}' olarak ayarladıysanız, lütfen Digest, Negotiate, NTLM, Basic, IntegratedWindowsAuthentication veya Anonymous olarak ayarlayın.
zh_hans: 生成 ChannelFactory 时不允许使用为 HttpTransportBindingElement (“{0}”)上的 AuthenticationScheme 属性指定的值。如果使用了标准绑定，请确保 ClientCredentialType 未设置为 HttpClientCredentialType.InheritedFromHost (该值在客户端无效)。如果直接在 HttpTransportBindingElement 上将该值设置为“{0}”，请将其设置为 Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication 或 Anonymous。
zh_hant: 建置 ChannelFactory 時，不允許 HttpTransportBindingElement ('{0}') 上為 AuthenticationScheme 屬性指定的值。如果您使用標準繫結，請確定 ClientCredentialType 未設定為 HttpClientCredentialType.InheritedFromHost，這對用戶端而言是無效的值。如果您在 HttpTransportBindingElement 上直接將值設為 '{0}'，請將它設為 Digest、Negotiate、NTLM、Basic、IntegratedWindowsAuthentication 或 Anonymous。

# HttpAuthorizationFailed
source: The HTTP request is unauthorized with client authentication scheme '{0}'. The authentication header received from the server was '{1}'.
cs: Požadavek protokolu HTTP je neoprávněný se schématem autorizace klienta {0}. Záhlaví ověření přijaté ze serveru je {1}.
de: Die HTTP-Anforderung ist beim Clientauthentifizierungsschema "{0}" nicht autorisiert. Vom Server wurde der Authentifizierungsheader "{1}" empfangen.
es: La solicitud HTTP no está autorizada con el esquema de autenticación de cliente "{0}". El encabezado de autenticación recibido del servidor era "{1}".
fr: La requête HTTP n'est pas autorisée avec un schéma d'authentification client '{0}'. L'en-tête d'authentification reçu du serveur était '{1}'.
it: La richiesta HTTP non è autorizzata con lo schema di autenticazione client '{0}'. Intestazione di autenticazione ricevuta dal server: '{1}'.
ja: この HTTP 要求は、クライアントの認証方式 '{0}' では承認されません。サーバーから受信した認証ヘッダーは '{1}' でした。
ko: HTTP 요청이 클라이언트 인증 구성표 '{0}'(으)로 인증되지 않습니다. 서버에서 수신한 인증 헤더가 '{1}'입니다.
pl: Żądanie protokołu HTTP nie jest autoryzowane na podstawie schematu uwierzytelniania klienta „{0}”. Nagłówek uwierzytelnienia otrzymany z serwera to „{1}”.
pt_br: A solicitação HTTP não está autorizada no esquema de autenticação de cliente '{0}'. O cabeçalho de autenticação recebido do servidor foi '{1}'.
tr: HTTP isteği, istemci kimlik doğrulama düzeni '{0}' içinde yetkilendirilmemiş. Sunucudan alınan kimlik denetimi üst bilgisi: '{1}'.
zh_hans: HTTP 请求未经客户端身份验证方案“{0}”授权。从服务器收到的身份验证标头为“{1}”。
zh_hant: HTTP 要求未經用戶端驗證配置 '{0}' 的授權。接收自伺服器的驗證標頭為 '{1}'。

# HttpAuthorizationForbidden
source: The HTTP request was forbidden with client authentication scheme '{0}'.
cs: Požadavek protokolu HTTP byl zakázán se schématem autorizace klienta {0}.
de: Die HTTP-Anforderung wurde mit dem Clientauthentifizierungsschema "{0}" nicht zugelassen.
es: Se prohibió la solicitud HTTP con el esquema de autenticación de cliente "{0}".
fr: La requête HTTP a été interdite avec le schéma d'authentification client '{0}'.
it: La richiesta HTTP non è consentita con lo schema di autenticazione client '{0}'.
ja: この HTTP 要求は、クライアントの認証方式 '{0}' で許可されませんでした。
ko: HTTP 요청이 클라이언트 인증 구성표 '{0}'에서 금지되었습니다.
pl: Żądanie protokołu HTTP zostało zabronione przez schemat uwierzytelniania klienta „{0}”.
pt_br: A solicitação HTTP está proibida com o esquema de autenticação de cliente '{0}'.
tr: HTTP isteği, istemci kimlik doğrulama düzeni '{0}' içinde yasaklanmış.
zh_hans: 客户端身份验证方案“{0}”已禁止 HTTP 请求。
zh_hant: 用戶端驗證配置 '{0}' 禁止 HTTP 要求。

# HttpClientCredentialTypeInvalid
source: ClientCredentialType '{0}' can only be used on the server side, not the client side. Please use one of the following values instead 'None, Basic, Client, Digest, Ntlm, Windows'.
cs: Typ ClientCredentialType {0} může být použit pouze na straně serveru, nikoli na straně klienta. Namísto toho použijte jednu z hodnot None, Basic, Client, Digest, Ntlm, Windows.
de: Der ClientCredentialType "{0}" kann nur auf dem Server und nicht auf dem Client verwendet werden. Verwenden Sie stattdessen einen der folgenden Werte: None, Basic, Client, Digest, Ntlm, Windows.
es: Solo se puede usar ClientCredentialType "{0}" en el lado del servidor y no en el del cliente. Use en su lugar los siguientes valores: "None, Basic, Client, Digest, Ntlm, Windows".
fr: Le ClientCredentialType '{0}' peut uniquement être utilisé côté serveur, et non côté client. Utilisez une des valeurs suivantes à la place : 'None, Basic, Client, Digest, Ntlm, Windows'.
it: L'elemento ClientCredentialType '{0}' può essere usato solo per il server e non per il client. Usare uno dei valori seguenti: 'None, Basic, Client, Digest, Ntlm, Windows'.
ja: ClientCredentialType '{0}' を使用できるのはサーバー側のみで、クライアント側では使用できません。'None'、'Basic'、'Client'、'Digest'、'Ntlm'、'Windows' のいずれかの値を代わりに使用してください。
ko: ClientCredentialType '{0}'은(는) 클라이언트 쪽이 아닌 서버 쪽에서만 사용할 수 있습니다. 대신 '없음, 기본, 클라이언트, 다이제스트, NTLM, Windows' 값 중 하나를 사용하세요.
pl: Właściwości ClientCredentialType o wartości „{0}” można użyć tylko po stronie serwera, a nie po stronie klienta. Zamiast niej użyj jednej z następujących wartości: „None, Basic, Client, Digest, Ntlm, Windows”.
pt_br: ClientCredentialType '{0}' somente pode ser usado no lado do servidor, não no lado do cliente. Use um dos seguintes valores: 'None, Basic, Client, Digest, Ntlm, Windows'.
tr: ClientCredentialType '{0}' yalnızca sunucu tarafında kullanılabilir, istemci tarafında kullanılamaz. Lütfen şu değerlerden birini kullanın: 'None, Basic, Client, Digest, Ntlm, Windows'.
zh_hans: ClientCredentialType“{0}”只能在服务器端使用，而不能在客户端使用。请改用以下值之一: None、Basic、Client、Digest、Ntlm、Windows。
zh_hant: ClientCredentialType '{0}' 只能在伺服器端使用，而非用戶端。請使用下列其中一個值來取代 'None, Basic, Client, Digest, Ntlm, Windows'。

# HttpContentLengthIncorrect
source: The number of bytes available is inconsistent with the HTTP Content-Length header. There may have been a network error or the client may be sending invalid requests.
cs: Počet dostupných bajtů není konzistentní se záhlavím Content-Length protokolu HTTP. Mohlo dojít k chybě sítě nebo klient zasílá neplatné požadavky.
de: Die Anzahl verfügbarer Bytes stimmt nicht mit dem HTTP-Content-Length-Header überein. Vermutlich liegt ein Netzwerkfehler vor, oder der Client sendet ungültige Anforderungen.
es: El número de bytes disponibles no es coherente con el encabezado HTTP Content-Length. Es posible que haya un error de red o que el cliente esté enviando solicitudes no válidas.
fr: Le nombre d'octets disponibles est incohérent avec l'en-tête Content-Length HTTP. Il est possible qu'une erreur réseau se soit produite ou que le client envoie des requêtes non valides.
it: Il numero di byte disponibili non è coerente con l'intestazione Content-Length HTTP. Potrebbe essersi verificato un errore di rete oppure il client potrebbe aver inviato richieste non valide.
ja: 使用可能なバイト数が HTTP の Content-Length ヘッダーと一致していません。ネットワーク エラーが発生しているか、クライアントが無効な要求を送信している可能性があります。
ko: 사용할 수 있는 바이트 수가 HTTP Content-Length 헤더와 일치하지 않습니다. 네트워크 오류가 있거나 클라이언트가 잘못된 요청을 보내는 중일 수 있습니다.
pl: Liczba dostępnych bajtów jest niespójna z nagłówkiem Content-Length protokołu HTTP. Mógł wystąpić błąd sieciowy lub klient mógł wysłać nieprawidłowe żądania.
pt_br: O número de bytes disponíveis é inconsistente com o cabeçalho Content-Length de HTTP. Talvez haja um erro de rede ou o cliente pode estar enviando solicitações inválidas.
tr: Kullanılabilir bayt sayısı, HTTP Content-Length üst bilgisiyle tutarsız. Bir ağ hatası oluşmuş olabilir ya da istemci geçersiz istekler gönderiyor olabilir.
zh_hans: 可用的字节数与 HTTP 内容长度标头不一致。可能存在网络错误或客户端可能正在发送无效的请求。
zh_hant: 可用的位元組數與 HTTP Content-Length 標頭不一致。可能已發生網路錯誤，或是用戶端傳送無效的要求。

# HttpContentTypeFormatException
source: An error ({0}) occurred while parsing the content type of the HTTP request. The content type was: {1}.
cs: Došlo k chybě ({0}) při analýze typu obsahu požadavku protokolu HTTP. Typ obsahu byl: {1}.
de: Beim Analysieren des Inhaltstyps der HTTP-Anforderung ist ein Fehler ({0}) aufgetreten. Der Inhaltstyp war: {1}.
es: Error ({0}) al analizar el tipo de contenido de la solicitud HTTP. El tipo de contenido era: {1}.
fr: Une erreur ({0}) s'est produite durant l'analyse du type de contenu de la requête HTTP. Le type de contenu était : {1}.
it: Si è verificato un errore ({0}) durante l'analisi del tipo di contenuto della richiesta HTTP. Tipo di contenuto: {1}.
ja: HTTP 要求のコンテンツ型の解析中にエラー ({0}) が発生しました。コンテンツ型: {1}。
ko: HTTP 요청의 콘텐츠 형식을 구문 분석하는 동안 오류({0})가 발생했습니다. 콘텐츠 형식은 {1}입니다.
pl: Wystąpił błąd ({0}) podczas analizowania typu zawartości żądania protokołu HTTP. Typ zawartości to: {1}.
pt_br: Erro ({0}) ao analisar o tipo de conteúdo da solicitação HTTP. O tipo de conteúdo era: {1}.
tr: HTTP isteğinin içerik türü ayrıştırılırken bir hata ({0}) oluştu. İçerik türü: {1}.
zh_hans: 分析 HTTP 请求的内容类型时发生错误({0})。内容类型为: {1}。
zh_hant: 剖析 HTTP 要求的內容類型時發生錯誤 ({0})。內容類型為: {1}。

# HttpContentTypeHeaderRequired
source: An HTTP Content-Type header is required for SOAP messaging and none was found.
cs: Pro zasílání zpráv SOAP je vyžadováno záhlaví Content-Type protokolu HTTP a žádné nebylo nalezeno.
de: Für SOAP-Messaging ist ein HTTP-Content-Type-Header erforderlich, es wurde jedoch keiner gefunden.
es: Se necesita un encabezado HTTP Content-Type para los mensajes SOAP, pero no se encontró ninguno.
fr: L'en-tête Content-Type HTTP est obligatoire pour la messagerie SOAP mais il est introuvable.
it: Per i messaggi SOAP è richiesta un'intestazione Content-Type HTTP, ma non ne è stata trovata nessuna.
ja: SOAP メッセージングには HTTP Content-Type ヘッダーが必要ですが、見つかりませんでした。
ko: HTTP Content-Type 헤더가 SOAP 메시징에 필요하지만 찾을 수 없습니다.
pl: Nie znaleziono wymaganego do obsługi wiadomości SOAP nagłówka Content-Type protokołu HTTP.
pt_br: Um cabeçalho Content-Type HTTP é necessário para mensagens SOAP, mas nenhum foi encontrado.
tr: SOAP ileti sistemi için bir HTTP Content-Type üst bilgisi gerekir, ancak herhangi bir tane bulunamadı.
zh_hans: SOAP 消息需要 HTTP Content-Type 标头，但未找到。
zh_hant: SOAP 傳訊需要 HTTP Content-Type 標頭，但是找不到。

# HttpIfModifiedSinceParseError
source: The value specified, '{0}', for the If-Modified-Since header does not parse into a valid date. Check the property value and ensure that it is of the proper format.
cs: Určená hodnota, {0}, záhlaví Jestliže bylo upraveno se nerozloží do platného data. Zkontrolujte hodnotu vlastnosti a ujistěte se, že je ve správném formátu.
de: Der angegebene Wert für den If-Modified-Since-Header "{0}" lässt sich nicht in ein gültiges Datum auflösen. Überprüfen Sie den Eigenschaftswert, um sicherzustellen, dass er im richtigen Format angegeben ist.
es: El valor especificado, "{0}", del encabezado If-Modified-Since no se analiza en una fecha válida. Compruebe el valor de propiedad y asegúrese de que tiene el formato adecuado.
fr: La valeur spécifiée, '{0}', pour l'en-tête If-Modified-Since n'est pas une date valide. Vérifiez la valeur de propriété et son format.
it: Il valore '{0}', specificato per l'intestazione If-Modified-Since, non rappresenta una data valida. Verificare il valore della proprietà e assicurarsi che sia espresso in formato corretto.
ja: If-Modified-Since ヘッダーに対して指定された値 '{0}' は、有効な日付として解析されません。プロパティ値をチェックして、適切な形式であることを確認してください。
ko: If-Modified-Since 헤더에 대해 지정한 값 '{0}'은(는) 유효한 날짜로 구문 분석되지 않습니다. 속성 값을 확인하고 형식이 적절한지 확인하세요.
pl: Wartości „{0}” określonej dla nagłówka If-Modified-Since nie można przekształcić w prawidłową datę. Sprawdź wartość właściwości i upewnij się, że ma ona odpowiedni format.
pt_br: O valor especificado, '{0}', para o cabeçalho If-Modified-Since não é analisado como uma data válida. Verifique o valor da propriedade e se ele está no formato adequado.
tr: If-Modified-Since başlığı için belirtilen değer '{0}', geçerli tarihe ayrıştırılamıyor. Özellik değerini denetleyin ve doğru biçimde olduğundan emin olun.
zh_hans: 为 If-Modified-Since 标头指定的值“{0}”未分析为有效日期。请检查属性值，并确保其格式正确。
zh_hant: 為 If-Modified-Since 標頭指定的值 '{0}' 經分析之後並非有效的日期。請檢查該屬性值，並確定它是正確的格式。

# HttpMaxPendingAcceptsTooLargeError
source: The value of MaxPendingAccepts should not be larger than {0}.
cs: Hodnota MaxPendingAccepts by neměla být větší než {0}.
de: Der Wert von MaxPendingAccepts sollte nicht größer als {0} sein.
es: El valor de MaxPendingAccepts no debe ser mayor que {0}.
fr: La valeur de MaxPendingAccepts ne doit pas être supérieure à {0}.
it: Il valore di MaxPendingAccepts non deve essere maggiore di {0}.
ja: MaxPendingAccepts の値を {0} より大きくすることはできません。
ko: MaxPendingAccepts 값은 {0} 이하여야 합니다.
pl: Wartość MaxPendingAccepts nie może być większa niż {0}.
pt_br: O valor de MaxPendingAccepts não deve ser maior que {0}.
tr: MaxPendingAccepts değeri {0} değerinden büyük olmamalıdır.
zh_hans: MaxPendingAccepts 的值不应大于 {0}。
zh_hant: MaxPendingAccepts 的值不應該大於 {0}。
