Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxCallbackRequestReplyInOrder1
source: This operation would deadlock because the reply cannot be received until the current Message completes processing. If you want to allow out-of-order message processing, specify ConcurrencyMode of Reentrant or Multiple on {0}.
cs: Tato operace by způsobila zablokování, protože odpověď nelze přijmout, dokud aktuální zpráva nedokončí zpracování. Pokud chcete povolit zpracování zpráv mimo pořadí, zadejte třídu ConcurrencyMode pro Reentrant nebo Multiple na: {0}.
de: Dieser Vorgang würde einen Deadlock verursachen, weil die Antwort nicht empfangen werden kann, bevor die Verarbeitung der aktuellen Nachricht abgeschlossen ist. Wenn Sie die Verarbeitung von Nachrichten außerhalb der normalen Reihenfolge zulassen möchten, geben Sie den ConcurrencyMode "Reentrant" oder "Multiple" für {0} an.
es: Esta operación produciría un interbloqueo porque no se puede recibir la respuesta hasta que el mensaje actual complete el procesamiento. Si desea permitir el procesamiento de mensajes fuera de secuencia, especifique Reentrant o Multiple para ConcurrencyMode en {0}.
fr: Cette opération aboutirait à un interblocage, car la réponse ne peut pas être reçue tant que le traitement du message actuel n'est pas effectué. Pour autoriser le traitement des messages dans le désordre, spécifiez ConcurrencyMode de Reentrant ou Multiple sur {0}.
it: Si verificherà un deadlock dell'operazione perché la risposta non può essere ricevuta finché non viene completata l'elaborazione del messaggio corrente. Se si vuole consentire l'elaborazione non ordinata dei messaggi, impostare ConcurrencyMode dell'elemento Reentrant o Multiple su {0}.
ja: 現在のメッセージが処理を完了した後でないと返信を受信できないため、この操作はデッドロックとなる可能性があります。順番を無視したメッセージ処理を許可するには、{0} で Reentrant または Multiple の ConcurrencyMode を指定してください。
ko: 현재 메시지의 처리가 완료될 때까지는 응답을 받지 못하므로 이 작업은 교착 상태입니다. 순서가 맞지 않는 메시지 처리를 허용하려면 {0}에서 Reentrant 또는 Multiple의 ConcurrencyMode를 지정하세요.
pl: Ta operacja prowadzi do zakleszczenia, ponieważ nie można otrzymać odpowiedzi przed zakończeniem przetwarzania bieżącego komunikatu. Aby zezwolić na przetwarzanie komunikatów poza kolejnością, określ właściwość ConcurrencyMode elementu Reentrant lub Multiple jako {0}.
pt_br: Esta operação causará deadlock porque a resposta não pode ser recebida até que a Mensagem atual conclua o processamento. Se você quiser permitir um processamento de mensagens com problemas, especifique ConcurrencyMode do Reentrante ou do Múltiplo em {0}.
tr: Geçerli İletinin işlenmesi tamamlanıncaya kadar yanıt alınamadığından, bu işlem çıkmaz durumunda kalacak. Düzen dışı ileti işlemeye izin vermek istiyorsanız {0} üzerinde ConcurrencyMode için Reentrant veya Multiple seçeneğini belirtin.
zh_hans: 此操作会导致死锁，因为无法收到回复，除非当前消息完成处理。如果允许无序的消息处理，请在 {0} 上指定可重入的或多个 ConcurrencyMode。
zh_hant: 此作業會被鎖死，因為必須等待目前訊息處理完成後才能接收回覆。若要允許不按照順序的訊息處理，請在 {0} 將 ConcurrencyMode 指定為 Reentrant 或 Multiple。

# SFxCannotActivateCallbackInstace
source: The dispatch instance for duplex callbacks cannot be activated - you must provide an instance.
cs: Instanci odeslání pro duplexní zpětná volání nelze aktivovat - je nutné zadat instanci.
de: Die Verteilinstanz für Duplexrückrufe kann nicht aktiviert werden. Sie müssen eine Instanz angeben.
es: No se puede activar la instancia de distribución para las devoluciones de llamada dúplex. Debe proporcionar una instancia.
fr: L'instance de distribution des rappels duplex ne peut pas être activée : vous devez fournir une instance.
it: Non è possibile attivare l'istanza di invio per i callback duplex. Specificare un'istanza.
ja: 二重コールバックのディスパッチ インスタンスをアクティブにできません。インスタンスを指定する必要があります。
ko: 이중 콜백에 대한 발송 인스턴스를 활성화할 수 없습니다. 인스턴스를 제공해야 합니다.
pl: Nie można aktywować wystąpienia wysyłania dla dupleksowego wywołania zwrotnego. Należy zapewnić wystąpienie.
pt_br: A instância de expedição para retornos de chamada duplex não pode ser ativada – você deve fornecer uma instância.
tr: Çift yönlü geri çağırmalar için dağıtım örneği etkinleştirilemez, bir örnek sağlamalısınız.
zh_hans: 无法激活双工回调的调度实例 - 必须提供一个实例。
zh_hant: 無法啟動雙工回呼的分派執行個體 - 必須提供執行個體。

# SFxCannotCallAutoOpenWhenExplicitOpenCalled
source: Cannot make a call on this channel because a call to Open() is in progress.
cs: Tento kanál nelze vyvolat, protože probíhá volání na Otevřený().
de: Es kann kein Aufruf für diesen Kanal erfolgen, da derzeit ein Open()-Aufruf durchgeführt wird.
es: No se puede realizar una llamada en este canal porque hay una llamada en curso a Open().
fr: Impossible d'effectuer un appel sur ce canal, car un appel vers Open() est en cours.
it: Non è possibile effettuare una chiamata su questo canale perché è in corso una chiamata a Open().
ja: Open() の呼び出しが進行中のため、このチャネルで呼び出しを実行できません。
ko: Open()에 대한 호출이 진행 중이므로 이 채널에서 호출할 수 없습니다.
pl: Nie można wykonać wywołania w tym kanale, ponieważ wywołanie metody Open() jest w toku.
pt_br: Não é possível fazer uma chamada neste canal porque uma chamada para Open() está em andamento.
tr: Bir Open() çağrısı sürdüğünden, bu kanalda çağrı yapılamıyor.
zh_hans: 无法在此通道上进行调用，因为正在进行对 Open() 的调用。
zh_hant: 因為正在進行 Open() 的呼叫，所以無法在此通道上執行呼叫。

# SFxCannotSetExtensionsByIndex
source: This collection does not support setting extensions by index. Please consider using the InsertItem or RemoveItem methods.
cs: Tato kolekce nepodporuje nastavení rozšíření podle indexů. Zvažte použití metody InsertItem nebo RemoveItem.
de: Diese Sammlung unterstützt nicht das Festlegen von Erweiterungen nach Index. Verwenden Sie ggf. die InsertItem- oder RemoveItem-Methoden.
es: Esta colección no admite la configuración de extensiones por índice. Considere la posibilidad de usar los métodos InsertItem o RemoveItem.
fr: Cette collection ne prend pas en charge la définition d'extensions par index. Utilisez les méthodes InsertItem ou RemoveItem.
it: L'impostazione delle estensioni per indice non è supportata nella raccolta. Provare a usare i metodi InsertItem o RemoveItem.
ja: このコレクションは、インデックスによる拡張の設定をサポートしていません。InsertItem または RemoveItem メソッドを使用してください。
ko: 이 컬렉션은 인덱스를 사용한 확장명 설정을 지원하지 않습니다. InsertItem 또는 RemoveItem 메서드를 사용해 보세요.
pl: Ta kolekcja nie obsługuje ustawiania rozszerzeń według indeksów. Użyj metody InsertItem lub RemoveItem.
pt_br: Esta coleção não dá suporte para configuração de extensões por índice. Considere usar os métodos InsertItem ou RemoveItem.
tr: Bu koleksiyon uzantıları dizine göre ayarlamayı desteklemiyor. InsertItem ya da RemoveItem metotlarını kullanmayı deneyin.
zh_hans: 此集合不支持按索引设置扩展。请考虑使用 InsertItem 方法或 RemoveItem 方法。
zh_hant: 此集合不支援依索引設定延伸模組。請考慮使用 InsertItem 或 RemoveItem 方法。

# SFxChannelDispatcherNoMessageVersion
source: Cannot open ChannelDispatcher because it is does not have a MessageVersion set.
cs: Nelze otevřít třídu ChannelDispatcher, protože nemá nastavenou třídu MessageVersion.
de: Der ChannelDispatcher kann nicht geöffnet werden, da keine MessageVersion festgelegt ist.
es: No se puede abrir el elemento ChannelDispatcher porque no se estableció la propiedad MessageVersion.
fr: Impossible d'ouvrir ChannelDispatcher, car il n'a pas de MessageVersion définie.
it: Non è possibile aprire un elemento ChannelDispatcher perché non contiene un elemento MessageVersion impostato.
ja: MessageVersion のセットを持たないため、ChannelDispatcher を開けません。
ko: MessageVersion이 설정되어 있지 않으므로 ChannelDispatcher를 열 수 없습니다.
pl: Nie można otworzyć elementu ChannelDispatcher, ponieważ nie ma on ustawionej wartości MessageVersion.
pt_br: Não é possível abrir o ChannelDispatcher porque ele não tem uma MessageVersion definida.
tr: MessageVersion kümesi bulunmadığından, ChannelDispatcher açılamıyor.
zh_hans: 无法打开 ChannelDispatcher，因为它没有 MessageVersion 集。
zh_hant: 因為 ChannelDispatcher 未設定 MessageVersion，因此無法開啟。

# SFxChannelDispatcherUnableToOpen1
source: The ChannelDispatcher at '{0}' is unable to open its IChannelListener as there are no endpoints for the ChannelDispatcher.
cs: Třída ChannelDispatcher v {0} nemůže otevřít svou třídu IChannelListener, protože pro třídu ChannelDispatcher neexistují koncové body.
de: Der ChannelDispatcher bei "{0}" kann den IChannelListener nicht öffnen, da für den ChannelDispatcher keine Endpunkte vorhanden sind.
es: El elemento ChannelDispatcher en "{0}" no puede abrir su IChannelListener, ya que no hay ningún punto de conexión para ChannelDispatcher.
fr: Le ChannelDispatcher à '{0}' ne peut pas ouvrir son IChannelListener, car il n'existe aucun point de terminaison pour ChannelDispatcher.
it: L'elemento ChannelDispatcher alla posizione '{0}' non può aprire il relativo elemento IChannelListener perché non sono disponibili endpoint per l'elemento ChannelDispatcher.
ja: ChannelDispatcher のためのエンドポイントがないため、'{0}' の ChannelDispatcher はその IChannelListener を開けません。
ko: ChannelDispatcher에 대한 끝점이 없으므로 '{0}'에서 ChannelDispatcher가 자체 IChannelListener를 열 수 없습니다.
pl: Element ChannelDispatcher w „{0}” nie może otworzyć interfejsu IChannelListener, ponieważ nie zdefiniowano dla niego punktów końcowych.
pt_br: O ChannelDispatcher em '{0}' não pode abrir seu IChannelListener porque não há pontos de extremidade para o ChannelDispatcher.
tr: ChannelDispatcher için uç nokta olmadığından '{0}' konumundaki ChannelDispatcher IChannelListener öğesini açamıyor.
zh_hans: “{0}”处的 ChannelDispatcher 无法打开其 IchannelListener，因为 ChannelDispatcher 没有相应终结点。
zh_hant: 因為 ChannelDispatcher 沒有任何端點，所以位於 '{0}' 的 ChannelDispatcher 無法開啟其 IChannelListener。

# SFxChannelDispatcherUnableToOpen2
source: The ChannelDispatcher at '{0}' with contract(s) '{1}' is unable to open its IChannelListener.
cs: Třída ChannelDispatcher v {0} s kontrakty {1} nemůže otevřít svou třídu IChannelListener.
de: Der ChannelDispatcher bei "{0}" mit den Verträgen "{1}" kann den zugehörigen IChannelListener nicht öffnen.
es: El elemento ChannelDispatcher en "{0}" con los contratos "{1}" no puede abrir su objeto IChannelListener.
fr: Le ChannelDispatcher à '{0}' avec le ou les contrats '{1}' ne peut pas ouvrir son IChannelListener.
it: L'elemento ChannelDispatcher alla posizione '{0}' con contratto/i '{1}' non può aprire il relativo elemento IChannelListener.
ja: コントラクト '{1}' を持つ '{0}' の ChannelDispatcher はその IChannelListener を開けません。
ko: '{1}' 계약의 '{0}'에서 ChannelDispatcher 가 자체 IChannelListener를 열 수 없습니다.
pl: Element ChannelDispatcher w „{0}” z kontraktami „{1}” nie może otworzyć interfejsu IChannelListener.
pt_br: O ChannelDispatcher em '{0}' com contratos '{1}' não pode abrir seu IChannelListener.
tr: '{0}' konumunda '{1}' anlaşmalerina sahip ChannelDispatcher kendi IChannelListener öğesini açamıyor.
zh_hans: “{0}”处带有协定“{1}”的 ChannelDispatcher 无法打开其 IchannelListener。
zh_hant: 位於 '{0}' 具有合約 '{1}' 的 ChannelDispatcher 無法開啟其 IChannelListener。

# SFxChannelFactoryCannotCreateFactoryWithoutDescription
source: CreateFactory requires that the Endpoint property be initialized. Either provide a valid ServiceEndpoint in the CreateDescription method or override the CreateFactory method to provide an alternative implementation.
cs: Třída CreateFactory vyžaduje, aby byla vlastnost Endpoint (Koncový bod) iniciována. Zadejte platnou třídu ServiceEndpoint v metodě CreateDescription nebo přepište metodu CreateFactory a zadejte alternativní implementaci.
de: CreateFactory erfordert die Initialisierung der Endpoint-Eigenschaft. Geben Sie entweder einen gültigen ServiceEndpoint in der CreateDescription-Methode an, oder setzen Sie die CreateFactory-Methode außer Kraft, um eine alternative Implementierung bereitzustellen.
es: El método CreateFactory requiere que se inicialice la propiedad Endpoint. Proporcione un valor de ServiceEndpoint válido en el método CreateDescription o invalide el método CreateFactory para proporcionar una implementación alternativa.
fr: CreateFactory nécessite l'initialisation de la propriété Endpoint. Fournissez un ServiceEndpoint valide dans la méthode CreateDescription ou remplacez la méthode CreateFactory pour fournir une autre implémentation.
it: Con CreateFactory è richiesta l'inizializzazione della proprietà Endpoint. Fornire un elemento ServiceEndpoint valido nel metodo CreateDescription o eseguire l'override del metodo CreateFactory per fornire un'implementazione alternativa.
ja: CreateFactory では、Endpoint プロパティを初期化する必要があります。CreateDescription メソッドで有効な ServiceEndpoint を指定するか、別の実装を指定するように CreateFactory メソッドを上書きしてください。
ko: CreateFactory는 Endpoint 속성의 초기화를 필요로 합니다. CreateDescription 메서드에서 유효한 ServiceEndpoint를 제공하거나 CreateFactory 메서드를 재정의하여 대체 구현을 제공하세요.
pl: Metoda CreateFactory wymaga zainicjowanej właściwości Endpoint. Zapewnij poprawny element ServiceEndpoint w metodzie CreateDescription albo przesłoń metodę CreateFactory w celu zapewnienia alternatywnej implementacji.
pt_br: CreateFactory requer que a propriedade ponto de extremidade seja inicializada. Forneça um ServiceEndpoint válida no método CreateDescription ou substitua o método CreateFactory para fornecer uma implementação alternativa.
tr: CreateFactory, Endpoint özelliğinin başlatılmasını gerektirir. Alternatif bir uygulama sağlamak için CreateDescription metodunda geçerli bir ServiceEndpoint sağlayın ya da CreateFactory metodunu geçersiz kılın.
zh_hans: CreateFactory 要求初始化终结点属性。在 CreateDescription 方法中提供有效 ServiceEndpoint，或替代 CreateFactory 方法可提供其他实现。
zh_hant: CreateFactory 需要初始化的 Endpoint 屬性。請在 CreateDescription 方法提供有效的 ServiceEndpoint，或覆寫 CreateFactory 方法以提供替代的實作。

# SFxChannelFactoryEndpointAddressUri
source: The Address property on ChannelFactory.Endpoint was null. The ChannelFactory's Endpoint must have a valid Address specified.
cs: Vlastnost Address (Adresa) ve třídě ChannelFactory.Endpoint má hodnotu null. Koncový bod třídy ChannelFactory musí mít zadanou platnou adresu.
de: Die Address-Eigenschaft für ChannelFactory.Endpoint war NULL. Für den Endpunkt der ChannelFactory muss eine gültige Adresse angegeben werden.
es: La propiedad Address en ChannelFactory.Endpoint era nula. El punto de conexión de ChannelFactory debe tener especificado un valor Address válido.
fr: La propriété Address sur ChannelFactory.Endpoint avait une valeur null. Endpoint de ChannelFactory doit spécifier une propriété Address valide.
it: La proprietà Address su ChannelFactory.Endpoint è Null. Nell'endpoint di ChannelFactory deve essere specificata una proprietà Address valida.
ja: ChannelFactory.Endpoint の Address プロパティが null でした。ChannelFactory の Endpoint には、有効な Address を指定する必要があります。
ko: ChannelFactory.Endpoint의 Address 속성이 null입니다. ChannelFactory의 Endpoint에는 유효한 Address가 지정되어야 합니다.
pl: Właściwość Address elementu ChannelFactory.Endpoint była równa null. Wartość Endpoint elementu ChannelFactory musi określać poprawną właściwość Address.
pt_br: A propriedade Address em ChannelFactory.Endpoint era nula. O Ponto de Extremidade da ChannelFactory deve ter uma propriedade Address válida especificada.
tr: ChannelFactory.Endpoint üstündeki Address özelliği null. ChannelFactory Endpoint için geçerli bir Address değeri belirtilmelidir.
zh_hans: ChannelFactory.Endpoint 上的地址属性为 null。ChannelFactory 的终结点必须指定一个有效的地址。
zh_hant: ChannelFactory.Endpoint 上的 Address 屬性為 null。ChannelFactory 的 Endpoint 必須指定有效的 Address。

# SFxChannelFactoryNoBindingFoundInConfig1
source: The underlying channel factory could not be created because no binding information was found in the configuration file for endpoint with name '{0}'. Please check the endpoint configuration section with name '{0}' to ensure that binding information is present and correct.
cs: Nadřazený objekt pro vytváření kanálů nebylo možné vytvořit, protože v konfiguračním souboru pro koncový bod s názvem {0} nebyly nalezeny informace o vazbě. Zkontrolujte část konfigurace koncového bodu s názvem {0} a zajistěte, aby byly informace vazby přítomny a správné.
de: Die zugrunde liegende Kanalfactory konnte nicht erstellt werden, da in der Konfigurationsdatei für den Endpunkt mit dem Namen "{0}" keine Bindungsinformationen gefunden wurden. Überprüfen Sie den Endpunktkonfigurationsabschnitt mit dem Namen "{0}", um sicherzustellen, dass die Bindungsinformationen vorhanden und richtig sind.
es: No se pudo crear el generador de canales subyacente porque no se encontró información de enlace en el archivo de configuración para el punto de conexión con el nombre "{0}". Consulte la sección de configuración del punto de conexión con el nombre "{0}" para asegurarse de que contiene información de enlace y que es correcta.
fr: Impossible de créer la fabrique de canaux sous-jacente, car aucune information de liaison n'a été trouvée dans le fichier config pour le point de terminaison portant le nom '{0}'. Consultez la section de configuration du point de terminaison portant le nom '{0}' pour vérifier que les informations de liaison sont présentes et correctes.
it: Non è stato possibile creare la factory canale sottostante perché nel file di configurazione non sono state trovate informazioni di binding per l'endpoint denominato '{0}'. Controllare la sezione della configurazione dell'endpoint denominata '{0}' per verificare che le informazioni di binding siano presenti e corrette.
ja: '{0}' という名前のエンドポイントの構成ファイルにバインド情報が見つからなかったため、基盤となるチャネル ファクトリを作成できません。'{0}' という名前のエンドポイント構成セクションをチェックして、正しいバインド情報が含まれていることを確認してください。
ko: 이름이 '{0}'인 엔드포인트에 대한 구성 파일에 바인딩 정보가 없으므로 기본 채널 팩터리를 만들 수 없습니다. 이름이 '{0}'인 엔드포인트 구성 섹션을 확인하여 올바른 바인딩 정보가 있는지 확인하세요.
pl: Nie można utworzyć podstawowej fabryki kanałów, ponieważ w pliku konfiguracji dla punktu końcowego o nazwie „{0}” nie znaleziono informacji o powiązaniu. Sprawdź w sekcji konfiguracji punktu końcowego o nazwie „{0}”, czy informacje o powiązaniu występują i są poprawne.
pt_br: A fábrica de canais subjacente não pôde ser criada porque nenhuma informação de associação foi encontrada no arquivo de configuração para o ponto de extremidade com o nome '{0}'. Verifique a seção de configuração do ponto de extremidade com o nome '{0}' para garantir que essa informação de associação esteja presente e correta.
tr: '{0}' adlı uç nokta yapılandırma dosyasında bağlama bilgileri bulunamadığından arka plandaki kanal fabrikası oluşturulamadı. '{0}' adlı uç nokta yapılandırma bölümünü yeniden denetleyerek bağlama bilgilerinin bulunduğundan ve doğru olduğundan emin olun.
zh_hans: 无法创建基础通道工厂，因为在名称“{0}”的终结点配置文件中找不到绑定信息。请检查名称“{0}”的终结点配置部分，以确保绑定信息存在而且正确。
zh_hant: 無法建立基礎通道處理站，因為名稱為 '{0}' 的端點組態檔中找不到繫結資訊。請檢查名稱 '{0}' 的端點組態區段，以確定是否有繫結資訊，且資訊正確。

# SFxChannelFactoryNoBindingFoundInConfigOrCode
source: The underlying channel factory could not be created because no Binding was passed to the ChannelFactory. Please supply a valid Binding instance via the ChannelFactory constructor.
cs: Nadřazený objekt pro vytváření kanálů nebylo možné vytvořit, protože třídě ChannelFactory nebyla předána žádná vazba. Dodejte prosím platnou instanci vazby prostřednictvím konstruktoru ChannelFactory.
de: Die zugrunde liegende Kanalfactory konnte nicht erstellt werden, da an die ChannelFactory keine Binding übergeben wurde. Geben Sie über den ChannelFactory-Konstruktor eine gültige Bindungsinstanz an.
es: No se pudo crear el generador de canales subyacente porque no se pasó ningún enlace a ChannelFactory. Proporcione una instancia de enlace válida mediante el constructor ChannelFactory.
fr: Impossible de créer la fabrique de canaux sous-jacente, car aucun Binding n'a été passé à la ChannelFactory. Fournissez une instance de Binding valide via le constructeur de ChannelFactory.
it: Non è stato possibile creare la factory canale sottostante perché non è stato passato alcun elemento Binding all'elemento ChannelFactory. Fornire un'istanza di Binding valida tramite il costruttore di ChannelFactory.
ja: ChannelFactory に Binding が渡されなかったため、基盤となるチャネル ファクトリを作成できませんでした。ChannelFactory コンストラクターを介して有効な Binding インスタンスを渡してください。
ko: Binding이 ChannelFactory에 전달되지 않았으므로 기본 채널 팩터리를 만들 수 없습니다. ChannelFactory 생성자를 통해 유효한 Binding 인스턴스를 제공하세요.
pl: Nie można utworzyć podstawowej fabryki kanałów, ponieważ do konstruktora ChannelFactory nie przekazano obiektu Binding. Zapewnij poprawne wystąpienie obiektu Binding za pośrednictwem konstruktora ChannelFactory.
pt_br: A fábrica de canais subjacente não pôde ser criada porque nenhuma Associação foi passada para a ChannelFactory. Forneça uma instância de Associação válida por meio do construtor ChannelFactory.
tr: Herhangi bir Binding ChannelFactory öğesine geçirilemediğinden arka plandaki kanal fabrikası oluşturulamadı. ChannelFactory oluşturucusu yoluyla geçerli bir Binding örneği sağlayın.
zh_hans: 无法创建基础通道工厂，因为未向 ChannelFactory 传递绑定。请通过 ChannelFactory 构造函数提供有效的绑定实例。
zh_hant: 無法建立基礎通道處理站，因為未傳送任何繫結給 ChannelFactory。請透過 ChannelFactory 建構函式提供有效的繫結執行個體。

# SFxChannelFactoryTypeMustBeInterface
source: The type argument passed to the generic ChannelFactory class must be an interface type.
cs: Argument typu předaný generické třídě ChannelFactory musí být typem rozhraní.
de: Das an die generische ChannelFactory-Klasse übergebene Typargument muss ein Schnittstellentyp sein.
es: El argumento de tipo pasado a la clase ChannelFactory genérica debe ser un tipo de interfaz.
fr: L'argument de type passé à la classe générique ChannelFactory doit être un type d'interface.
it: L'argomento tipo passato alla classe ChannelFactory generica deve essere un tipo di interfaccia.
ja: 汎用の ChannelFactory クラスに渡される引数の型は、インターフェイス型であることが必要です。
ko: 제네릭 ChannelFactory 클래스에 전달된 형식 인수는 인터페이스 형식이어야 합니다.
pl: Argument typu przekazany do ogólnej klasy ChannelFactory musi być typem interfejsu.
pt_br: O argumento de tipo passado para a classe ChannelFactory genérica deve ser um tipo de interface.
tr: Genel ChannelFactory sınıfına geçirilen tür bağımsız değişkeni bir arabirim türü olmalıdır.
zh_hans: 传递给通用 ChannelFactory 类的类型参数必须是接口类型。
zh_hant: 傳至一般 ChannelFactory 類別的型別引數，必須為介面類型。
