Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# TokenRequirementDoesNotSpecifyTargetAddress
source: The token requirement '{0}' does not specify the target address. This is required by the token manager for creating the corresponding security token provider.
cs: Požadavek tokenu {0} neudává cílovou adresu. To je vyžadováno správcem tokenů pro vytvoření odpovídajícího poskytovatele tokenů zabezpečení.
de: Die Tokenanforderung "{0}" gibt keine Zieladresse an. Diese Angabe ist für den Token-Manager erforderlich, um den entsprechenden Sicherheitstokenanbieter zu erstellen.
es: El requisito de token "{0}" no especifica la dirección de destino. Se necesita para que el administrador de tokens cree el proveedor de tokens de seguridad correspondiente.
fr: L'exigence de jeton '{0}' ne spécifie pas l'adresse cible. Elle est obligatoire pour que le gestionnaire de jetons puisse créer le fournisseur de jetons de sécurité correspondant.
it: Il requisito di token '{0}' non specifica l'indirizzo di destinazione, richiesto dal gestore del token per la creazione del provider di token di sicurezza corrispondente.
ja: トークンの要件 '{0}' では、対象のアドレスが指定されていません。これは、トークン マネージャーが対応するセキュリティ トークン プロバイダーを作成するのに必要です。
ko: 토큰 요구 사항 '{0}'이(가) 대상 주소를 지정하지 않습니다. 이 주소는 토큰 관리자가 해당 보안 토큰 공급자를 만드는 데 필요합니다.
pl: Wymóg tokenu „{0}” nie określa adresu docelowego. Jest to wymagane przez menedżera tokenów do utworzenia odpowiedniego dostawcy tokenów zabezpieczających.
pt_br: O requisito de token '{0}' não especifica o endereço de destino. Ele é exigido pelo gerenciador de token para criar o provedor de token de segurança correspondente.
tr: '{0}' belirteç gereksinimi hedef adresi belirtmiyor. Bu, belirteç yöneticisinin karşılık gelen güvenlik belirteci sağlayıcısını oluşturabilmesi için gerekiyor.
zh_hans: 令牌要求“{0}”未指定目标地址。令牌管理器创建相应的安全令牌提供程序需要该地址。
zh_hant: 權杖需求 '{0}' 未指定目標位址。權杖管理員需要它才能建立相對應的安全性權杖提供者。

# TraceCodeWsrmNegativeElapsedTimeDetected
source: The reliable session infrastructure detected a system clock change. This will temporarily result in a less optimal message retry strategy.
cs: Infrastruktura spolehlivé relace rozpoznala změnu systémového času. To povede k dočasné méně optimální strategii opakování odesílání zpráv.
de: Die Infrastruktur der zuverlässigen Sitzung hat eine Änderung der Systemuhr festgestellt. Dies führt vorübergehend zu einer suboptimalen Nachrichtenwiederholungsstrategie.
es: La infraestructura de sesión de confianza detectó un cambio en el reloj del sistema. Esto dará lugar de forma provisional a una estrategia de reintento de mensaje menos eficaz.
fr: L'infrastructure de session fiable a détecté une modification de l'horloge système. Ceci affectera temporairement les performances de la stratégie de tentative de message.
it: L'infrastruttura di sessione affidabile ha rilevato una modifica dell'orologio di sistema. Di conseguenza, la strategia dei tentativi di invio dei messaggi risulterà temporaneamente meno ottimale.
ja: 信頼性の高いセッション インフラストラクチャでシステム クロックの変更が検出されました。これにより、一時的に、メッセージの再試行方法が最適ではなくなります。
ko: 신뢰할 수 있는 세션 인프라에서 시스템 시계 변경이 감지되었습니다. 이로 인해 일시적으로 덜 최적화된 메시지 재전송 전략이 사용됩니다.
pl: Infrastruktura niezawodnych sesji wykryła zmianę zegara systemowego. Spowoduje to tymczasowe używanie mniej optymalnej strategii odpowiadania na komunikaty.
pt_br: A infraestrutura de sessão confiável detectou uma alteração do relógio do sistema. Isso resultará temporariamente em uma estratégia de repetição de mensagem inferior à ideal.
tr: Güvenilir oturum altyapısı bir sistem saati değişikliği algıladı. Bu, ileti yeniden deneme stratejisi performansının geçici olarak daha kötü olmasıyla sonuçlanacak.
zh_hans: 可靠会话基础结构检测到系统时钟更改。这会暂时导致次优消息重试策略。
zh_hant: 可靠的工作階段基礎結構偵測到系統時鐘變更。這會短暫對最佳訊息重試策略造成些許影響。

# TransferModeNotSupported
source: Transfer mode {0} is not supported by {1}.
cs: {1} nepodporuje režim přenosu {0}.
de: Der Übertragungsmodus {0} wird von {1} nicht unterstützt.
es: El modo de transferencia {0} no se admite en {1}.
fr: Le mode de transfert {0} n'est pas pris en charge par {1}.
it: La modalità di trasferimento {0} non è supportata da {1}.
ja: 転送モード {0} は {1} でサポートされていません。
ko: 전송 모드 {0}을(를) {1}에서 지원하지 않습니다.
pl: Tryb transferu {0} nie jest obsługiwany przez element {1}.
pt_br: O modo de transferência {0} não tem suporte em {1}.
tr: {0} aktarma modu, {1} tarafından desteklenmiyor.
zh_hans: {1} 不支持传输模式 {0}。
zh_hant: {1} 不支援傳輸模式 {0}。

# TransportBindingElementMustBeLast
source: In Binding '{0}', TransportBindingElement '{1}' does not appear last in the BindingElementCollection. Please change the order of elements such that the TransportBindingElement is last.
cs: Element TransportBindingElement {1} se ve vazbě {0} neobjevuje jako poslední v kolekci BindingElementCollection. Změňte pořadí prvků tak, aby byl element TransportBindingElement poslední.
de: In der Bindung "{0}" ist das TransportBindingElement "{1}" nicht zuletzt in der BindingElementCollection aufgeführt. Ändern Sie die Reihenfolge der Elemente, sodass das TransportBindingElement zuletzt aufgeführt wird.
es: En el enlace "{0}", el elemento TransportBindingElement "{1}" no aparece en último lugar en BindingElementCollection. Cambie el orden de los elementos de forma que el elemento TransportBindingElement sea el último.
fr: Dans la liaison '{0}', TransportBindingElement '{1}' ne semble pas apparaître en dernier dans BindingElementCollection. Changez l'ordre des éléments de telle sorte que TransportBindingElement apparaisse en dernier.
it: Nel binding '{0}' l'elemento TransportBindingElement '{1}' non compare per ultimo in BindingElementCollection. Modificare l'ordine degli elementi in modo che TransportBindingElement sia l'ultimo elemento.
ja: バインディング '{0}' では、TransportBindingElement '{1}' は BindingElementCollection の最後に配置されていません。TransportBindingElement が最後になるように要素の順番を変更してください。
ko: Binding '{0}'에서 TransportBindingElement '{1}'이(가) BindingElementCollection에 마지막으로 나타나지 않습니다. TransportBindingElement가 마지막에 있도록 요소의 순서를 바꾸세요.
pl: W powiązaniu „{0}” element TransportBindingElement „{1}” nie jest ostatni w kolekcji BindingElementCollection. Zmień kolejność elementów, aby element TransportBindingElement był ostatni.
pt_br: Na Associação '{0}', TransportBindingElement '{1}' não é exibido por último na BindingElementCollection. Altere a ordem de elementos de forma que TransportBindingElement seja o último.
tr: '{0}' Bağlamasındaki TransportBindingElement '{1}', BindingElementCollection içinde en son görünmüyor. Lütfen TransportBindingElement en son olacak biçimde öğelerin sırasını değiştirin.
zh_hans: 在绑定“{0}”中，TransportBindingElement“{1}”不在 BindingElementCollection 的最后。请更改元素的顺序，以使 TransportBindingElement 处于最后。
zh_hant: 在繫結 '{0}' 中，TransportBindingElement '{1}' 不是 BindingElementCollection 的最後一項。請變更元素順序，讓 TransportBindingElement 成為最後一項。

# TransportBindingElementNotFound
source: The binding does not contain a TransportBindingElement.
cs: Vazba neobsahuje element TransportBindingElement.
de: Die Bindung enthält kein TransportBindingElement.
es: El enlace no contiene un elemento TransportBindingElement.
fr: La liaison ne contient pas de TransportBindingElement.
it: Il binding non contiene un elemento TransportBindingElement.
ja: バインドに TransportBindingElement がありません。
ko: 바인딩에 TransportBindingElement가 없습니다.
pl: Powiązanie nie zawiera elementu TransportBindingElement.
pt_br: A associação não contém um TransportBindingElement.
tr: Bağlama, bir TransportBindingElement öğesine sahip değil.
zh_hans: 绑定不包含 TransportBindingElement。
zh_hant: 繫結未包含 TransportBindingElement。

# TransportDoesNotSupportCompression
source: The transport configured on this binding does not appear to support the CompressionFormat specified ({0}) on the message encoder. To resolve this issue, set the CompressionFormat on the {1} to '{2}' or use a different transport.
cs: Přenos nakonfigurovaný pro tuto vazbu pravděpodobně nepodporuje formát CompressionFormat určený ({0}) v kodéru zpráv. Tento problém můžete odstranit tak, že nastavíte formát CompressionFormat v {1} na {2} nebo použijete jiný přenos.
de: Der für diese Bindung konfigurierte Transport unterstützt das für den Nachrichtenencoder angegebene CompressionFormat ({0}) anscheinend nicht. Legen Sie zum Beheben dieses Problems das CompressionFormat für {1} auf "{2}" fest, oder verwenden Sie einen anderen Transport.
es: El transporte configurado en este enlace no parece que admita el CompressionFormat ({0}) especificado en el codificador de mensajes. Para resolver este problema, establezca el elemento CompressionFormat en {1} para "{2}" o use un transporte diferente.
fr: Le transport configuré sur cette liaison ne semble pas prendre en charge le CompressionFormat spécifié ({0}) sur l'encodeur de message. Pour résoudre le problème, affectez au CompressionFormat sur {1} la valeur '{2}', ou utilisez un autre transport.
it: Il trasporto configurato in questo binding non sembra supportare l'elemento CompressionFormat ({0}) specificato nel codificatore di messaggi. Per risolvere il problema, impostare CompressionFormat in {1} su '{2}' oppure usare un trasporto diverso.
ja: このバインドに構成されたトランスポートはメッセージ エンコーダーに指定した CompressionFormat ({0}) をサポートしていない可能性があります。この問題を解決するには、{1} の CompressionFormat を '{2}' に設定するか、別のトランスポートを使用してください。
ko: 이 바인딩에 구성된 전송이 메시지 인코더에 지정된 CompressionFormat({0})을 지원하지 않습니다. 이 문제를 해결하려면 {1}에서 CompressionFormat을 '{2}'(으)로 설정하거나 다른 전송을 사용하세요.
pl: Transport skonfigurowany w tym powiązaniu prawdopodobnie nie obsługuje wartości właściwości CompressionFormat ({0}) określonej przez koder komunikatu. Aby rozwiązać ten problem, ustaw dla właściwości CompressionFormat w obiekcie {1} wartość „{2}” lub użyj innego transportu.
pt_br: O transporte configurado nessa associação não parece dar suporte ao CompressionFormat especificado ({0}) no codificador de mensagem. Para resolver esse problema, defina o CompressionFormat em {1} como '{2}' ou use um transporte diferente.
tr: Bu bağlama üzerinde yapılandırılan aktarım ileti kodlayıcısında belirtilen CompressionFormat'ı ({0}) desteklemiyor gibi görünüyor. Bu sorunu çözümlemek için, {1} üzerinde CompressionFormat'ı '{2}' olarak ayarlayın veya farklı bir aktarım kullanın.
zh_hans: 在此绑定上配置的传输似乎不支持在消息编码器上指定({0})的 CompressionFormat。要解决此问题，请将 {1} 上的 CompressionFormat 设置为“{2}”或使用其他传输。
zh_hant: 此繫結上設定的傳輸似乎不支援訊息編碼器上指定的 CompressionFormat ({0})。若要解決此問題，請將 {1} 上的 CompressionFormat 設定為 '{2}' 或使用不同傳輸。

# TransportSecuredMessageHasMoreThanOneToHeader
source: More than one 'To' header specified in a message secured by Transport Security.
cs: Ve zprávě zabezpečené zabezpečením přenosu je zadáno více záhlaví Komu.
de: In einer mit der Transportsicherheit gesicherten Nachricht wurde mehr als ein To-Header angegeben.
es: Se especificó más de un encabezado 'To' en un mensaje protegido por seguridad de transporte.
fr: Plusieurs en-têtes 'To' ont été spécifiés dans un message sécurisé par la sécurité de transport.
it: Più di un'intestazione 'To' specificata in un messaggio protetto dalla sicurezza del trasporto.
ja: トランスポート セキュリティによってセキュリティ保護されているメッセージに、複数の 'To' ヘッダーが指定されています。
ko: 전송 보안을 통해 보호하는 메시지에 둘 이상의 'To' 헤더가 지정되어 있습니다.
pl: W wiadomości uwierzytelnionej za pośrednictwem zabezpieczeń transportu określono więcej niż jeden nagłówek „Do”.
pt_br: Mais de um cabeçalho 'Para' especificado em uma mensagem protegida por Segurança de Transporte.
tr: Transport Security tarafından korunan bir iletide birden fazla 'To' üst bilgisi belirtilmiş.
zh_hans: 在传输安全所保护的消息中指定了多个“收件人”标头。
zh_hant: 由傳輸安全性所保護的訊息中，指定了多個「收件者」標頭。

# TransportSecurityRequireToHeader
source: Transport secured messages should have the 'To' header specified.
cs: U zpráv zabezpečených u přenosu by mělo být zadáno záhlaví Komu.
de: Für Nachrichten, die mit der Transportsicherheit gesichert wurden, sollte ein To-Header angegeben werden.
es: En los mensajes con seguridad de transporte debe especificarse el encabezado 'To'.
fr: L'en-tête 'To' doit être spécifié dans les messages sécurisés de transport.
it: Per i messaggi protetti tramite trasporto dovrebbe essere specificata l'intestazione 'To'.
ja: トランスポートのセキュリティで保護されたメッセージには 'To' ヘッダーを指定する必要があります。
ko: 전송 보호 메시지에는 'To' 헤더가 지정되어 있어야 합니다.
pl: Wiadomości zabezpieczone zabezpieczeniami transportu powinny posiadać nagłówek „Do”.
pt_br: As mensagens protegidas de transporte devem ter o cabeçalho 'Para' especificado.
tr: Taşıma korumalı iletilerde 'To' üst bilgisi belirtilmelidir.
zh_hans: 传输安全消息应该指定“收件人”标头。
zh_hant: 傳輸安全訊息應該指定「收件者」標頭。

# TrustDriverIsUnableToCreatedNecessaryAttachedOrUnattachedReferences
source: Unable to create Attached or Unattached reference for '{0}'.
cs: Nelze vytvořit odkaz typu Attached nebo Unattached pro objekt {0}.
de: Ein angefügter oder nicht angefügter Verweis für "{0}" konnte nicht erstellt werden.
es: No se puede crear una referencia Attached o Unattached para "{0}".
fr: Impossible de créer une référence liée ou non liée pour '{0}'.
it: Non è possibile creare il riferimento ad Attached o Unattached per '{0}'.
ja: '{0}' のアタッチされた参照またはアタッチされていない参照を作成できません。
ko: '{0}'에 대한 Attached 또는 Unattached 참조를 만들 수 없습니다.
pl: Nie można utworzyć dołączonego ani odłączonego odwołania dla „{0}”.
pt_br: Não é possível criar uma referência Conectada ou Desconectada para '{0}'.
tr: '{0}' için Attached veya Unattached başvuru oluşturulamıyor.
zh_hans: 无法为“{0}”创建附加引用或独立引用。
zh_hant: 無法為 '{0}' 建立 Attached 或 Unattached 參考。

# TrustDriverVersionDoesNotSupportIssuedTokens
source: The configured WS-Trust version does not support issued tokens. WS-Trust February 2005 or later is required.
cs: Nakonfigurovaná verze WS-Trust nepodporuje vydané tokeny. Je vyžadována verze WS-Trust February 2005 nebo novější.
de: Die konfigurierte WS-Trust-Version unterstützt keine ausgestellten Token. WS-Trust February 2005 oder höher ist erforderlich.
es: La versión de WS-Trust configurada no admite tokens emitidos. Es necesario WS-Trust February 2005 o posterior.
fr: La version de WS-Trust configurée ne prend pas en charge les jetons émis. WS-Trust (février 2005 ou une version ultérieure) est nécessaire.
it: La versione configurata di WS-Trust non supporta i token rilasciati. È necessaria la versione di WS-Trust di febbraio 2005 o una versione successiva.
ja: 構成されたバージョンの WS-Trust では、発行済みトークンがサポートされません。WS-Trust February 2005 以降が必要です。
ko: 구성된 WS-Trust 버전이 발급된 토큰을 지원하지 않습니다. WS-Trust 2005년 2월 이상 버전이 필요합니다.
pl: Skonfigurowana wersja protokołu WS-Trust nie obsługuje wystawionych tokenów. Wymagana jest wersja WS-Trust February 2005 lub nowsza.
pt_br: A versão WS-Trust configurada não dá suporte a tokens emitidos. É necessário o WS-Trust de fevereiro de 2005 ou posterior.
tr: Yapılandırılan WS-Trust sürümü, verilen belirteçleri desteklemez. WS-Trust Şubat 2005 ya da üstü gereklidir.
zh_hans: 配置的 WS-Trust 版本不支持颁发的令牌。需要 WS-Trust 2005 年 2 月版本或更高版本。
zh_hant: 設定的 WS-Trust 版本不支援發出的權杖。需要 WS-Trust February 2005 或更新版本。

# TrustDriverVersionDoesNotSupportSession
source: The configured Trust version does not support sessions. Use WSTrustFeb2005 or above.
cs: Nakonfigurovaná verze Trust nepodporuje relace. Použijte verzi WSTrustFeb2005 nebo novější.
de: Die konfigurierte Trust-Version unterstützt keine Sitzungen. Verwenden Sie WsTrustFeb2005 oder höher.
es: La versión configurada de Trust no admite sesiones. Use WSTrustFeb2005 o una versión posterior.
fr: La version de Trust configurée ne prend pas en charge les sessions. Utilisez WSTrustFeb2005 ou une version ultérieure.
it: La versione configurata di Trust non supporta le sessioni. Usare WSTrustFeb2005 o versione successiva.
ja: 構成されたバージョンの Trust では、セッションがサポートされません。WsTrustFeb2005 以上を使用してください。
ko: 구성된 트러스트 버전이 세션을 지원하지 않습니다. WSTrustFeb2005 이상 버전이 필요합니다.
pl: Skonfigurowana wersja protokołu Trust nie obsługuje sesji. Skorzystaj z wersji WSTrustFeb2005 lub nowszej.
pt_br: A versão da Confiança configurada não dá suporte a sessões. Use WSTrustFeb2005 ou posterior.
tr: Yapılandırılan Trust sürümü, oturumları desteklemez. WSTrustFeb2005 ya da üstünü kullanın.
zh_hans: 配置的 Trust 版本不支持会话。请使用 WSTrustFeb2005 或更高版本。
zh_hant: 設定的 Trust 版本不支援工作階段。請使用 WSTrustFeb2005 或更新版本。

# TrustFailure
source: Could not establish trust relationship for the SSL/TLS secure channel with authority '{0}'.
cs: Nelze navázat vztah důvěryhodnosti pro zabezpečený kanál SSL/TLS s autoritou {0}.
de: Es konnte keine Vertrauensstellung für den sicheren SSL/TLS-Kanal mit der Autorität "{0}" eingerichtet werden.
es: No se pudo establecer una relación de confianza para el canal seguro SSL/TLS con la autoridad "{0}".
fr: Impossible d'établir une relation d'approbation pour le canal sécurisé SSL/TLS avec l'autorité '{0}'.
it: Non è stato possibile stabilire la relazione di trust per il canale sicuro SSL/TLS con l'autorità '{0}'.
ja: 機関 '{0}' との SSL/TLS のセキュリティで保護されているチャネルに対する信頼関係を確立できませんでした。
ko: '{0}' 권한을 지닌 SSL/TLS 보안 채널에 대해 트러스트 관계를 설정할 수 없습니다.
pl: Nie można ustanowić relacji zaufania dla bezpiecznego kanału SSL/TLS z urzędem „{0}”.
pt_br: Não foi possível estabelecer uma relação de confiança para o canal protegido SSL/TLS com a autoridade '{0}'.
tr: '{0}' yetkisine sahip SSL/TLS güvenli kanal için güven ilişkisi kurulamadı.
zh_hans: 无法为 SSL/TLS 安全通道与颁发机构“{0}”建立信任关系。
zh_hant: 無法利用授權 '{0}' 為 SSL/TLS 安全通道建立信任關係。

# UnableToCreateHashAlgorithmFromAsymmetricCrypto
source: Unable to create a HashAlgorithm for the '{0}' algorithm from the '{1}' asymmetric crypto.
cs: Nelze vytvořit HashAlgorithm pro algoritmus {0} z asymetrického šifrování {1}.
de: Es kann kein HashAlgorithm für den Algorithmus "{0}" aus dem asymmetrischen Kryptografiesystem "{1}" erstellt werden.
es: No se pudo crear el elemento HashAlgorithm para el algoritmo '{0}' a partir del cifrado asimétrico '{1}'.
fr: Impossible de créer HashAlgorithm pour l'algorithme '{0}' à partir du chiffrement asymétrique '{1}'.
it: Non è possibile creare un elemento HashAlgorithm per l'algoritmo '{0}' dalla crittografia asimmetrica '{1}'.
ja: 非対称暗号 '{1}' からアルゴリズム '{0}' の HashAlgorithm を作成できません。
ko: '{1}' 비대칭 암호화에서 '{0}' 알고리즘에 대한 HashAlgorithm을 만들 수 없습니다.
pl: Nie można utworzyć elementu HashAlgorithm dla algorytmu „{0}” na podstawie kryptografii asymetrycznej „{1}”.
pt_br: Não é possível criar um HashAlgorithm para o algoritmo '{0}' com base na criptografia assimétrica '{1}'.
tr: Simetrik olmayan '{1}' şifresinden '{0}' algoritması için bir HashAlgorithm oluşturulamıyor.
zh_hans: 无法从“{1}”非对称加密创建“{0}”算法的 HashAlgorithm。
zh_hant: 無法從 '{1}' 非對稱式密碼編譯，為 '{0}' 演算法建立 HashAlgorithm。

# UnableToCreateKeyedHashAlgorithm
source: Unable to create a KeyedHashAlgorithm from '{0}' for the signature algorithm '{1}'.
cs: Nelze vytvořit KeyedHashAlgorithm z {0} pro algoritmus podpisu {1}.
de: Es kann kein KeyedHashAlgorithm aus "{0}" für den Signaturalgorithmus "{1}" erstellt werden.
es: No se pudo crear un elemento KeyedHashAlgorithm a partir de '{0}' para el algoritmo de signatura '{1}'.
fr: Impossible de créer KeyedHashAlgorithm à partir de '{0}' pour l'algorithme de signature '{1}'.
it: Non è possibile creare un elemento KeyedHashAlgorithm da '{0}' per l'algoritmo di firma '{1}'.
ja: 署名のアルゴリズム '{1}' の '{0}' から KeyedHashAlgorithm を作成できません。
ko: 시그니처 알고리즘 '{1}'에 대해 '{0}'에서 KeyedHashAlgorithm을 만들 수 없습니다.
pl: Nie można utworzyć elementu KeyedHashAlgorithm na podstawie elementu „{0}” dla algorytmu podpisu „{1}”.
pt_br: Não é possível criar um KeyedHashAlgorithm de '{0}' para o algoritmo de assinatura '{1}'.
tr: '{1}' imza algoritması için '{0}' öğesinden bir KeyedHashAlgorithm oluşturulamıyor.
zh_hans: 无法从“{0}”创建签名算法“{1}”的 KeyedHashAlgorithm。
zh_hant: 無法為簽章演算法 '{1}' 從 '{0}' 建立 KeyedHashAlgorithm。

source: Unable to create token reference.
cs: Nelze vytvořit odkaz tokenu.
de: Es konnte kein Tokenverweis erstellt werden.
es: No se puede crear la referencia de token.
fr: Impossible de créer la référence de jeton.
it: Non è possibile creare il riferimento al token.
ja: トークン参照を作成できません。
ko: 토큰 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania do tokenu.
pt_br: Não foi possível criar referência de token.
tr: Belirteç başvurusu oluşturulamıyor.
zh_hans: 无法创建令牌引用。
zh_hant: 無法建立權杖參考。

# UnableToDeriveKeyFromKeyInfoClause
source: KeyInfo clause '{0}' resolved to token '{1}', which does not contain a Symmetric key that can be used for derivation.
cs: Klauzule KeyInfo {0} byla přeložena jako token {1}, který neobsahuje symetrický klíč, který lze použít k odvození.
de: Die KeyInfo-Klausel "{0}" wurde in Token "{1}" aufgelöst. Dieser enthält keinen symmetrischen Schlüssel, der zur Ableitung verwendet werden kann.
es: La cláusula KeyInfo '{0}' se resolvió en el token '{1}', que no contiene una clave simétrica que se pueda usar para la derivación.
fr: La clause KeyInfo '{0}' a été résolue au jeton '{1}', qui ne contient pas de clé symétrique pouvant être utilisée pour une dérivation.
it: Clausola KeyInfo '{0}' risolta in token '{1}', che non contiene una chiave simmetrica utilizzabile per la derivazione.
ja: KeyInfo 句 '{0}' はトークン '{1}' に解決されましたが、このトークンには派生に使用できる対称キーが含まれていません。
ko: KeyInfo 절 '{0}'이(가) 파생에 사용할 수 있는 대칭 키를 포함하지 않는 '{1}' 토큰으로 확인되었습니다.
pl: Na podstawie klauzuli KeyInfo „{0}” określono token „{1}” niezawierający klucza symetrycznego, który można zastosować w operacji wyprowadzenia.
pt_br: Cláusula KeyInfo '{0}' resolvida para o token '{1}', que não contém uma chave Simétrica que possa ser usada para derivação.
tr: Elde etmek için kullanılabilecek bir Symmetric anahtar içermeyen KeyInfo ifadesi '{0}', '{1}' belirtecine çözümlendi.
zh_hans: KeyInfo 子句“{0}”解析为令牌“{1}”，该令牌不包含可用于派生的对称密钥。
zh_hant: KeyInfo 子句 '{0}' 已解析至權杖 '{1}'，但不包含可用於衍生的對稱式金鑰。
