Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SyncAsyncMatchConsistency_ReturnType5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{3}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} v typu {1} byla spojena s asynchronními metodami OperationContract {2} a {3}, protože mají stejný název operace {4}. Když je synchronní metoda OperationContract spojena s párem asynchronních metod OperationContract, dvě metody OperationContracts musejí definovat stejný návratový typ. V tomto případě se návratové typy liší. Pokud chcete situaci napravit, zajistěte, aby měly metody {0} a {3} stejný návratový typ. Je také možné zabránit spojení změnou názvu jedné z metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde den asynchronen OperationContract-Methoden "{2}" und "{3}" zugeordnet, da sie den gleichen Vorgangsnamen "{4}" besitzen. Wenn eine synchrone OperationContract-Methode einem Paar asynchroner OperationContract-Methoden zugeordnet wird, müssen die beiden OperationContracts den gleichen Rückgabetyp definieren. In diesem Fall sind die Rückgabetypen unterschiedlich. Stellen Sie sicher, dass die Methoden "{0}" und "{3}" über den gleichen Rückgabetyp verfügen. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: Se estableció la correspondencia del método OperationContract sincrónico "{0}" en el tipo "{1}" con los métodos OperationContract asincrónicos "{2}" y "{3}" porque tienen el mismo nombre de operación "{4}". Cuando se establece la correspondencia de un método OperationContract sincrónico con un par de métodos OperationContract asincrónicos, los dos métodos OperationContract deben definir el mismo tipo de valor devuelto. En este caso, los tipos de valor devueltos son diferentes. Para corregirlo, asegúrese de que el método "{0}" y el método "{3}" tienen el mismo tipo de valor devuelto. Como alternativa, puede cambiar el nombre de uno de los métodos para evitar la correspondencia.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec les méthodes OperationContract asynchrones '{2}' et '{3}', car elles contiennent le même nom d'opération '{4}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une paire de méthodes OperationContract asynchrones, les deux méthodes OperationContracts doivent définir le même type de retour. Dans ce cas, les types de retour sont différents. Pour corriger le problème, vérifiez que les méthodes '{0}' et '{3}' présentent le même type de retour. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato ai metodi OperationContract '{2}' e '{3}' asincroni perché hanno lo stesso nome di operazione '{4}'. Quando un metodo OperationContract sincrono viene abbinato a una coppia di metodi OperationContract asincroni, i due metodi OperationContract devono definire lo stesso tipo restituito. In questo caso, i tipi restituiti sono diversi. Per risolvere il problema, verificare che il metodo '{0}' e il metodo '{3}' abbiano lo stesso tipo restituito. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、非同期 OperationContract メソッド '{2}' および '{3}' と同じ操作名 '{4}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドが非同期 OperationContract メソッドのペアに対応付けられた場合は、これら 2 つの OperationContract では同じ戻り値の型を定義する必要があります。このケースでは、戻り値の型が異なります。この問題を修正するには、メソッド '{0}' とメソッド '{3}' の戻り値の型を同じにしてください。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 비동기 OperationContract 메서드 '{2}' 및 '{3}'과(와) 같은 작업 이름 '{4}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 비동기 OperationContract 메서드의 쌍과 일치하면 두 OperationContract가 같은 반환 형식을 정의해야 합니다. 이 경우에는 반환 형식이 다릅니다. 이 문제를 해결하려면 메서드 '{0}' 및 메서드 '{3}'의 반환 형식이 같은지 확인하세요. 또는 메서드 중 하나의 이름을 바꾸면 일치하지 않게 됩니다.
pl: Metoda synchroniczna klasy OperationContract „{0}” w typie „{1}” została dopasowana do metod asynchronicznych klasy OperationContract „{2}” i „{3}”, ponieważ mają tę samą nazwę operacji „{4}”. Gdy metoda synchroniczna klasy OperationContract zostanie dopasowana do pary metod asynchronicznych klasy OperationContract, w obu klasach OperationContract musi być zdefiniowany ten sam typ zwracanych wartości. W tym przypadku wartości zwracane są różnych typów. Aby to naprawić, dopilnuj, aby metody „{0}” i „{3}” miały te same typy zwracanych wartości. Ewentualnie można uniemożliwić dopasowanie, zmieniając nazwę jednej z metod.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com os métodos assíncronos OperationContract '{2}' e '{3}' porque eles têm o mesmo nome de operação '{4}'. Quando um método síncrono OperationContract coincide com um par de métodos assíncronos OperationContract, os dois OperationContracts devem definir o mesmo tipo de retorno. Nesse caso, os tipos de retorno são diferentes. Para corrigir isso, verifique se o método '{0}' e '{3}' têm o mesmo tipo de retorno. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: '{1}' türündeki '{0}' zaman uyumlu OperationContract metodu, aynı '{4}' işlem adına sahip olduklarından, asenkron OperationContract metotları '{2}' ve '{3}' ile eşleştirilmişti. Zaman uyumlu bir OperationContract metodu, asenkron bir çift OperationContract metoduyla eşleştirildiğinde, iki OperationContract metodu da aynı dönüş türünü tanımlamalıdır. Bu durumdaki dönüş türleri farklıdır. Bunu düzeltmek için '{0}' ve '{3}' metotlarının aynı dönüş türüne sahip olmasını sağlayın. Alternatif olarak metotlardan birinin adını değiştirmeniz de eşleşmeyi önleyecektir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与异步 OperationContract 方法“{2}”和“{3}”匹配，因为它们具有相同的操作名称“{4}”。当同步 OperationContract 方法与一对异步 OperationContract 方法匹配时，这两个 OperationContracts 必须定义相同的返回类型。在本例中，返回类型不同。要修复此问题，请确保方法“{0}”和方法“{3}”具有相同的返回类型。或者，更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合非同步 OperationContract 方法 '{2}' 與 '{3}'，因為它們具有相同的作業名稱 '{4}'。當同步 OperationContract 方法符合一對非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同的傳回型別。在此例中，傳回型別不同。若要修正此問題，請確認方法 '{0}' 與方法 '{3}' 具有相同的傳回型別。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# SyncTaskMatchConsistency_Attributes6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, any additional attributes must be declared on the synchronous OperationContract method. In this case, the task-based asynchronous OperationContract method '{2}' has one or more attributes of type '{4}'. To fix it, remove the '{4}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} typu {1} se shoduje s úlohově orientovanou asynchronní metodou OperationContract {2}, protože obě mají shodný název operace {3}. Pokud se synchronní metoda OperationContract shoduje s úlohově orientovanou asynchronní metodou OperationContract, musejí být jakékoli dodatečné atributy deklarovány pro synchronní metodu OperationContract. V tomto případě má úlohově orientovaná asynchronní metoda OperationContract {2} jeden nebo více atributů typu {4}. Tento problém je možné odstranit tak, že z metody {2} odeberete atributy {4}. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde der aufgabenbasierten asynchronen OperationContract-Methode "{2}" zugeordnet, da sie den gleichen Vorgangsnamen "{3}" besitzen. Wenn eine synchrone OperationContract-Methode einer aufgabenbasierten asynchronen OperationContract-Methode zugeordnet wird, müssen alle zusätzlichen Attribute in der synchronen OperationContract-Methode deklariert werden. In diesem Fall verfügt die taskbasierte asynchrone OperationContract-Methode "{2}" über mindestens ein Attribut vom Typ "{4}". Entfernen Sie das bzw. die {4}-Attribute aus der Methode "{2}", um dieses Problem zu beheben. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract sincrónico en el tipo "{1}" coincide con el método "{2}" OperationContract asincrónico basado en tareas porque tiene el mismo nombre de operación "{3}". Cuando un método OperationContract sincrónico coincide con un método OperationContract asincrónico basado en tareas, se deben declarar los atributos adicionales en el método OperationContract sincrónico. En este caso, el método "{2}" OperationContract tiene uno o más atributos de tipo "{4}". Para solucionarlo, quite el atributo o atributos "{4}" del método "{2}". También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec la méthode OperationContract asynchrone basée sur les tâches '{2}', car elles contiennent le même nom d'opération '{3}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une méthode OperationContract asynchrone basée sur les tâches, les attributs supplémentaires doivent être déclarés sur la méthode OperationContract synchrone. Dans ce cas, la méthode OperationContract '{2}' asynchrone basée sur les tâches comporte un ou plusieurs attributs de type '{4}'. Pour corriger le problème, supprimez les attributs '{4}' de la méthode '{2}'. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato al metodo OperationContract '{2}' basato su attività perché hanno lo stesso nome di operazione '{3}'. Quando un metodo OperationContract sincrono viene abbinato a un metodo OperationContract asincrono basato su attività, ogni attributo aggiuntivo deve essere dichiarato nel metodo OperationContract sincrono. In questo caso, il metodo OperationContract '{2}' asincrono basato su attività contiene uno o più attributi di tipo '{4}'. Per risolvere il problema, rimuovere l'attributo o gli attributi '{4}' dal metodo '{2}'. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、タスクベースの非同期 OperationContract メソッド '{2}' と同じ操作名 '{3}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドがタスクベースの非同期 OperationContract メソッドに対応付けられた場合は、同期 OperationContract メソッドに対して追加の属性を宣言する必要があります。このケースでは、タスクベースの非同期 OperationContract メソッド '{2}' に '{4}' 型の属性が 1 つ以上あります。この問題を修正するには、'{2}' メソッドから '{4}' 属性を削除します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 작업 기반 비동기 OperationContract 메서드 '{2}'과(와) 같은 작업 이름 '{3}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 작업 기반 비동기 OperationContract 메서드와 일치하는 경우 추가 특성은 동기 OperationContract 메서드에서 선언해야 합니다. 이 경우 작업 기반 비동기 OperationContract 메서드 '{2}'에 하나 이상의 '{4}' 형식의 특성이 포함되어 있습니다. 이를 해결하려면 메서드 '{2}'에서 '{4}' 특성을 제거하세요. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Synchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do opartej na zadaniach asynchronicznej metody klasy OperationContract „{2}”, ponieważ zawierają one operację o takiej samej nazwie „{3}”. Gdy synchroniczna metoda klasy OperationContract jest dopasowywana do opartej na zadaniach asynchronicznej metody klasy OperationContract, wszystkie dodatkowe atrybuty muszą zostać zadeklarowane w synchronicznej metodzie klasy OperationContract. W tym przypadku oparta na zadaniach asynchroniczna metoda klasy OperationContract „{2}” ma co najmniej jeden atrybut typu „{4}”. Aby rozwiązać ten problem, usuń atrybut lub atrybuty „{4}” z metody „{2}”. Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com o método assíncrono OperationContract baseado em tarefa '{2}' porque eles têm o mesmo nome de operação '{3}'. Quando um método síncrono OperationContract coincide com um método assíncrono OperationContract baseado em tarefa, os atributos adicionais devem ser declarados no método síncrono OperationContract. Nesse caso, o método assíncrono OperationContract baseado em tarefa '{2}' tem um ou mais atributos do tipo '{4}'. Para corrigir isso, remova os atributos ou o atributo '{4}' do método '{2}'. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{3}' işlem adına sahip olduklarından '{1}' türü içindeki zaman uyumlu OperationContract metodu '{0}' ile görev tabanlı asenkron OperationContract metodu '{2}' eşleştirildi. Zaman uyumlu bir OperationContract metodu görev tabanlı asenkron bir OperationContract metoduyla eşleştirildiğinde, zaman uyumlu OperationContract metodunda varsa ek özniteliklerin bildirimi yapılmalıdır. Bu durumda, görev tabanlı asenkron OperationContract metodu '{2}', '{4}' türünde bir veya daha fazla özniteliğe sahiptir. Bunu düzeltmek için, '{2}' metodundan '{4}' özniteliğini veya özniteliklerini kaldırın. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与基于任务的异步 OperationContract 方法“{2}”匹配，因为它们具有相同的操作名称“{3}”。当同步 OperationContract 方法与基于任务的异步 OperationContract 方法匹配时，必须在同步 OperationContract 方法上声明任何其他特性。在本例中，基于任务的异步 OperationContract 方法“{2}”具有一个或多个类型为“{4}”的特性。若要修复此问题，请从方法“{2}”中移除“{4}”特性。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合以工作為基礎的非同步 OperationContract 方法 '{2}'，因為它們具有相同的作業名稱 '{3}'。當同步 OperationContract 方法符合以工作為基礎的非同步 OperationContract 方法時，其他任何屬性皆必須在同步 OperationContract 方法上宣告。在此例中，以工作為基礎的非同步 OperationContract 方法 '{2}' 具有一或多個類型 '{4}' 的屬性。若要修正此問題，請移除 '{4}' 屬性，或移除方法 '{2}' 的屬性。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。

# SyncTaskMatchConsistency_Parameters5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
cs: Synchronní metoda OperationContract {0} typu {1} se shoduje s úlohově orientovanou asynchronní metodou OperationContract {2}, protože obě mají shodný název operace {3}. Pokud se synchronní metoda OperationContract shoduje s úlohově orientovanou asynchronní metodou OperationContract, musejí obě tyto metody OperationContract definovat stejný počet a typ parametrů. V tomto případě jsou některé z argumentů odlišné. Tento problém je možné odstranit tak, že obě metody OperationContract budou definovat stejný počet a typ argumentů a také ve stejném pořadí. Alternativně můžete shodě metod zabránit změnou názvu jedné z těchto metod.
de: Die synchrone OperationContract-Methode "{0}" im Typ "{1}" wurde der aufgabenbasierten asynchronen OperationContract-Methode "{2}" zugeordnet, da sie den gleichen Vorgangsnamen "{3}" besitzen. Wenn eine synchrone OperationContract-Methode einer aufgabenbasierten asynchronen OperationContract-Methode zugeordnet wird, müssen die beiden OperationContracts die gleiche Anzahl und die gleichen Typen von Parametern definieren. In diesem Fall unterscheiden sich einige der Argumente. Stellen Sie zum Beheben dieses Problems sicher, dass die OperationContracts die gleiche Anzahl und die gleichen Typen von Argumenten in der gleichen Reihenfolge definieren. Alternativ können Sie den Namen einer der Methoden ändern, um eine Zuordnung zu verhindern.
es: El método "{0}" OperationContract sincrónico en el tipo "{1}" coincide con un método "{2}" OperationContract asincrónico basado en tareas porque tienen el mismo nombre de operación "{3}". Cuando un método sincrónico OperationContract coincide con un método OperationContract asincrónico basado en tareas, los dos métodos OperationContracts deben definir el mismo número y tipo de parámetros. En este caso, algunos de los argumentos son diferentes. Para solucionarlo, asegúrese de que OperationContracts define el mismo número y tipos de argumentos y en el mismo orden. También puede cambiar el nombre de uno de los métodos para evitar que coincidan.
fr: La méthode OperationContract synchrone '{0}' dans le type '{1}' a été mise en correspondance avec la méthode OperationContract asynchrone basée sur les tâches '{2}', car elles contiennent le même nom d'opération '{3}'. Quand une méthode OperationContract synchrone est mise en correspondance avec une méthode OperationContract asynchrone basée sur les tâches, les deux méthodes OperationContracts doivent définir le même nombre et les mêmes types de paramètre. Dans ce cas, certains arguments sont différents. Pour corriger le problème, vérifiez que les OperationContracts définissent le même nombre et les mêmes types d'argument, dans un ordre identique. D'un autre côté, le changement de nom de l'une des méthodes va empêcher la correspondance.
it: Il metodo OperationContract '{0}' sincrono nel tipo '{1}' è stato abbinato al metodo OperationContract '{2}' asincrono basato su attività perché hanno lo stesso nome di operazione '{3}'. Quando un metodo OperationContract sincrono viene abbinato a un metodo OperationContract asincrono basato su attività, i due metodi OperationContract devono definire lo stesso numero e gli stessi tipi di parametri. In questo caso, alcuni argomenti sono diversi. Per risolvere il problema, assicurarsi che per i metodi OperationContract definiscano lo stesso numero e lo stesso tipo di argomenti nello stesso ordine. In alternativa, modificare il nome di uno dei metodi per evitare l'abbinamento.
ja: 型 '{1}' の同期 OperationContract メソッド '{0}' は、タスクベースの非同期 OperationContract メソッド '{2}' と同じ操作名 '{3}' を持つため、これらのメソッドに対応付けられました。同期 OperationContract メソッドがタスクベースの非同期 OperationContract メソッドに対応付けられた場合は、2 つの OperationContract で同じ数と型のパラメーターを定義する必要があります。この場合、一部の引数が異なります。この問題を修正するには、これらの OperationContract で同じ数と型の引数を同じ順序で定義します。または、これらのメソッドのいずれかの名前を変更することで対応付けを回避することもできます。
ko: '{1}' 형식의 동기 OperationContract 메서드 '{0}'이(가) 작업 기반 비동기 OperationContract 메서드 '{2}'과(와) 같은 작업 이름 '{3}'을(를) 가지므로 서로 일치합니다. 동기 OperationContract 메서드가 작업 기반 비동기 OperationContract 메서드와 일치하는 경우 두 OperationContract 모두 동일한 숫자와 형식의 매개 변수를 정의해야 합니다. 이 경우 일부 인수가 달라집니다. 이를 해결하려면 두 OperationContract가 동일한 숫자와 형식의 인수를 동일한 순서로 정의하는지 확인해야 합니다. 또는 메서드 중 하나의 이름을 변경해도 일치하지 않게 됩니다.
pl: Synchroniczna metoda klasy OperationContract „{0}” w typie „{1}” została dopasowana do opartej na zadaniach asynchronicznej metody klasy OperationContract „{2}”, ponieważ zawierają one operację o takiej samej nazwie „{3}”. Gdy synchroniczna metoda klasy OperationContract jest dopasowywana do opartej na zadaniach asynchronicznej metody klasy OperationContract, obie klasy OperationContract muszą definiować taką samą liczbę typów parametrów. W tym przypadku niektóre argumenty są różne. Aby rozwiązać ten problem, upewnij się, że klasy OperationContract definiują taką samą liczbę i typy argumentów (i w tej samej kolejności). Możesz też zmienić nazwę jednej z metod, co zapobiegnie dopasowywaniu.
pt_br: O método síncrono OperationContract '{0}' no tipo '{1}' coincidiu com os método assíncrono OperationContract baseado em tarefa '{2}' porque eles têm o mesmo nome de operação '{3}'. Quando um método síncrono OperationContract coincide com método assíncrono OperationContract baseado em tarefa, os dois OperationContracts devem definir o mesmo número e tipos de parâmetros. Nesse caso, alguns dos argumentos são diferentes. Para corrigir isso, verifique se os OperationContracts definem o mesmo número e tipos de argumentos, na mesma ordem. Como alternativa, altere o nome de um dos métodos para evitar a correspondência.
tr: Aynı '{3}' işlem adına sahip olduklarından '{1}' türü içindeki zaman uyumlu OperationContract metodu '{0}' ile görev tabanlı asenkron OperationContract metodu '{2}' eşleştirildi. Zaman uyumlu bir OperationContract metodu görev tabanlı asenkron bir OperationContract metoduyla eşleştirildiğinde, iki OperationContract tarafından aynı sayıda ve türde parametreler tanımlanmalıdır. Bu durumda, bağımsız değişkenleri bazıları farklıdır. Bunu düzeltmek için, OperationContract metotlarının bağımsız değişkenleri aynı sayıda, aynı türde ve aynı sırada tanımladığından emin olun. Alternatif olarak, bu metotlardan birinin adı değiştirildiğinde eşleşme engellenir.
zh_hans: 类型“{1}”中的同步 OperationContract 方法“{0}”与基于任务的异步 OperationContract 方法“{2}”匹配，因为它们具有相同的操作名称“{3}”。当同步 OperationContract 方法与基于任务的异步 OperationContract 方法匹配时，两个 OperationContract 必须定义相同数量和类型的形式参数。在本例中，某些实际参数不同。若要修复此问题，请确保 OperationContract 按相同顺序定义相同数量和类型的实际参数。或者，也可以更改其中一个方法的名称以阻止匹配。
zh_hant: 類型 '{1}' 的同步 OperationContract 方法 '{0}' 符合以工作為基礎的非同步 OperationContract 方法 '{2}'，因為它們具有相同的作業名稱 '{3}'。當同步 OperationContract 方法符合以工作為基礎的非同步 OperationContract 方法時，兩個 OperationContract 必須定義相同數量與類型的參數。在此例中，部分引數不同。若要修正此問題，請確認 OperationContract 定義相同數量與類型的引數，且順序也相同。另一種方式則是變更其中一種方法的名稱，便可避免相符的情況。
