Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# DuplicateTimestampInSecurityHeader
source: More than one Timestamp element was present in security header.
cs: V záhlaví zabezpečení se vyskytlo více elementů časového razítka.
de: Es ist mehr als ein Timestamp-Element im Sicherheitsheader vorhanden.
es: El encabezado de seguridad contenía más de un elemento Timestamp.
fr: Plusieurs éléments Timestamp étaient présents dans l'en-tête de sécurité.
it: Più di un elemento Timestamp presente nell'intestazione di sicurezza.
ja: セキュリティ ヘッダーに複数の Timestamp 要素がありました。
ko: 둘 이상의 Timestamp 요소가 보안 헤더에 있습니다.
pl: W nagłówku zabezpieczeń znaleziono więcej niż jeden element Timestamp.
pt_br: Estavam presentes mais de um elemento Timestamp no cabeçalho de segurança.
tr: Güvenlik üst bilgisinde birden çok Timestamp öğesi vardı.
zh_hans: 安全标题中存在多个时间戳。
zh_hant: 安全性標頭中有一個以上的 Timestamp 元素。

# EarlySecurityClose
source: The remote endpoint has closed the underlying secure session before the reliable session fully completed. The reliable session was faulted.
cs: Vzdálený koncový bod ukončil nadřazenou zabezpečenou relaci dříve, než byla zcela dokončena stabilní relace. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat die zugrunde liegende sichere Sitzung geschlossen, bevor die zuverlässige Sitzung vollständig abgeschlossen wurde. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto cerró la sesión segura subyacente antes de que se completara totalmente la sesión confiable. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a fermé la session sécurisée sous-jacente avant que la session fiable soit entièrement terminée. La session fiable a généré une erreur.
it: L'endpoint remoto ha chiuso la sessione protetta sottostante prima del completamento della sessione affidabile. Sessione affidabile non riuscita.
ja: 信頼できるセッションが完全に完了する前に、リモート エンドポイントは基盤となるセキュリティで保護されたセッションを閉じました。信頼できるセッションは途中終了されました。
ko: 신뢰할 수 있는 세션이 완전히 완료되기 전에 원격 끝점이 기본 보안 세션을 닫았습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy zamknął podstawową bezpieczną sesję przed całkowitym zakończeniem sesji niezawodnej. Sesja niezawodna została przerwana.
pt_br: O ponto de extremidade remoto fechou a sessão segura subjacente antes da conclusão total da sessão confiável. Falha na sessão confiável.
tr: Uzak bitiş noktası arka planda çalışan güvenli oturumu, güvenilir oturum tam olarak tamamlanmadan kapattı. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点在可靠会话完全完成之前关闭了基础安全会话。可靠会话出错。
zh_hant: 遠端端點在可靠工作階段全部完成之前，便已關閉基礎安全工作階段。可靠工作階段發生錯誤。

# EarlySecurityFaulted
source: The underlying secure session has faulted before the reliable session fully completed. The reliable session was faulted.
cs: V nadřazené zabezpečené relaci došlo k chybě dříve, než byla zcela dokončena stabilní relace. Ve stabilní relaci došlo k chybě.
de: Bei der zugrunde liegenden sicheren Sitzung ist ein Fehler aufgetreten, bevor die zuverlässige Sitzung vollständig abgeschlossen wurde. Die zuverlässige Sitzung war nicht erfolgreich.
es: La sesión segura subyacente generó un error antes de que se completara totalmente la sesión confiable. Se generó un error en la sesión confiable.
fr: La session sécurisée sous-jacente a généré une erreur avant que la session fiable soit entièrement terminée. La session fiable a généré une erreur.
it: Si è verificato un errore nella sessione protetta sottostante prima del completamento della sessione affidabile. Sessione affidabile non riuscita.
ja: 信頼できるセッションが完全に完了する前に、セキュリティで保護されている基盤となるセッションが途中終了しました。信頼できるセッションは途中終了されました。
ko: 신뢰할 수 있는 세션이 완전히 완료되기 전에 기본 보안 세션에 오류가 발생했습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Podstawowa bezpieczna sesja została przerwana przed całkowitym zakończeniem sesji niezawodnej. Sesja niezawodna została przerwana.
pt_br: A sessão segura subjacente foi interrompida antes da conclusão total da sessão confiável. Falha na sessão confiável.
tr: Güvenilir oturum tam olarak tamamlanmadan arka plandaki güvenli oturum hatayla kapatıldı. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 基础安全会话在可靠会话完全完成之前出错。可靠会话出错。
zh_hant: 在可靠工作階段全部完成之前，基礎安全工作階段便已失敗。可靠工作階段發生錯誤。

# EarlyTerminateSequence
source: The remote endpoint has errantly sent a TerminateSequence protocol message before the sequence finished.
cs: Vzdálený koncový bod odeslal chybně zprávu protokolu TerminateSequence dříve, než skončila sekvence.
de: Der Remoteendpunkt hat fälschlicherweise eine TerminateSequence-Protokollnachricht gesendet, bevor die Sequenz abgeschlossen wurde.
es: El extremo remoto envió erróneamente un mensaje de protocolo TerminateSequence antes de que se completara la secuencia.
fr: Le point de terminaison distant a envoyé de façon non contrôlée un message de protocole TerminateSequence avant la fin de la séquence.
it: L'endpoint remoto ha inviato erroneamente un messaggio di protocollo TerminateSequence prima del completamento della sequenza.
ja: リモート エンドポイントは、シーケンスが完了する前に TerminateSequence プロトコル メッセージを誤って送信しました。
ko: 시퀀스가 끝나기 전에 원격 끝점이 TerminateSequence 프로토콜 메시지를 잘못 보냈습니다.
pl: Zdalny punkt końcowy błędnie wysłał komunikat protokołu TerminateSequence przed zakończeniem sekwencji.
pt_br: O ponto de extremidade remoto enviou por engano uma mensagem de protocolo TerminateSequence antes da finalização da sequência.
tr: Uzak bitiş noktası, sıra tamamlanmadan hatalı biçimde bir TerminateSequence protokol iletisi gönderdi.
zh_hans: 远程终结点在序列完成之前错误地发送了 TerminateSequence 协议消息。
zh_hant: 遠端端點在順序完成前誤送 TerminateSequence 通訊協定訊息。

# EffectiveGreaterThanExpiration
source: The valid from time is greater than the valid to time.
cs: Čas počátku platnosti je větší než čas vypršení platnosti.
de: Die "Gültig ab"-Zeit ist größer als die "Gültig bis"-Zeit.
es: La hora de comienzo válida es posterior a la hora de finalización válida.
fr: Le début de validité est postérieur à la fin de validité.
it: La data di inizio validità è successiva alla data di fine validità.
ja: 有効期間の開始時刻が終了時刻よりも後の時刻に設定されています。
ko: 유효한 시작 시간이 유효한 종료 시간보다 이후입니다.
pl: Poprawna wartość czasu rozpoczęcia jest większa niż poprawna wartość czasu zakończenia.
pt_br: A hora de início válida é maior que a hora de término válida.
tr: Geçerli son zaman, geçerli ilk zamandan daha büyük.
zh_hans: 有效的开始时间大于有效的结束时间。
zh_hant: 有效的開始時間大於有效的結束時間。

source: Element to sign must have id.
cs: Element k podpisu musí mít identifikátor.
de: Das zu signierende Element muss eine ID aufweisen.
es: El elemento a firmar debe tener un id.
fr: L'élément à signer doit avoir un identificateur.
it: L'elemento da firmare deve avere un ID.
ja: 署名する要素には ID が必要です。
ko: 서명할 요소에 ID가 있어야 합니다.
pl: Podpisywany element musi mieć identyfikator.
pt_br: O elemento a ser assinado precisa de uma identificação.
tr: İmzalanacak öğenin kimliği olmalıdır.
zh_hans: 要签名的元素必须有 ID。
zh_hant: 要簽署的元素必須具有識別碼。

# EmptyBase64Attribute
source: An empty value was found for the required base-64 attribute name '{0}', namespace '{1}'.
cs: Byla nalezena prázdná hodnota pro požadovaný název atributu base-64 {0}, obor názvů {1}.
de: Für den erforderlichen Base64-Attributnamen "{0}", Namespace "{1}", wurde ein leerer Wert gefunden.
es: Se encontró un valor vacío para el atributo base64 requerido con el nombre "{0}" y el espacio de nombres "{1}".
fr: Une valeur vide a été trouvée pour le nom '{0}' et l'espace de noms '{1}' d'attribut base 64 nécessaires.
it: È stato trovato un valore vuoto per l'attributo Base 64 richiesto denominato '{0}' con spazio dei nomi '{1}'.
ja: 必須の Base 64 属性名 '{0}' の値が空です。名前空間は '{1}' です。
ko: 필수 base-64 특성 이름 '{0}', 네임스페이스 '{1}'에 대한 빈 값을 찾았습니다.
pl: Znaleziono pustą wartość dla wymaganej nazwy „{0}” atrybutu algorytmu base-64, przestrzeń nazw „{1}”.
pt_br: Um valor vazio foi encontrado para o nome de atributo necessário de Base 64 '{0}', namespace '{1}'.
tr: Gereken '{0}' adlı, '{1}' ad alanına sahip base-64 özniteliği için boş bir değer bulundu.
zh_hans: 所需的 base-64 特性名称“{0}”、命名空间“{1}”为空值。
zh_hant: 為必要的 Base-64 屬性名稱 '{0}'、命名空間 '{1}' 找到空值。

# EmptyOrNullArgumentString
source: The argument '{0}' is null or empty string.
cs: Argument {0} má hodnotu null nebo je prázdný řetězec.
de: Das Argument "{0}" ist NULL oder eine leere Zeichenfolge.
es: El argumento "{0}" es una cadena nula o vacía.
fr: L'argument '{0}' a une valeur null ou est une chaîne vide.
it: L'argomento '{0}' è una stringa Null o vuota.
ja: 引数 '{0}' が null または空の文字列です。
ko: '{0}' 인수가 null이거나 빈 문자열입니다.
pl: Argument „{0}” ma wartość null lub jest pustym ciągiem.
pt_br: O argumento '{0}' é uma cadeia de caracteres nula ou vazia.
tr: '{0}' bağımsız değişkeni null veya boş dize.
zh_hans: 参数“{0}”为 null 或空字符串。
zh_hant: 引數 '{0}' 為 null 或空字串。

# EmptyXmlElementError
source: Element {0} cannot be empty.
cs: Element {0} nesmí být prázdný.
de: Das Element {0} darf nicht leer sein.
es: El elemento {0} no puede estar vacío.
fr: L'élément {0} ne peut pas être vide.
it: L'elemento {0} non può essere vuoto.
ja: 要素 {0} を空にすることはできません。
ko: {0} 요소는 비어 있을 수 없습니다.
pl: Element {0} nie może być pusty.
pt_br: O elemento {0} não pode estar vazio.
tr: {0} öğesi boş olamaz.
zh_hans: 元素 {0} 不能为空。
zh_hant: 元素 {0} 不可為空白。

# EncoderBadContentType
source: Cannot process contentType.
cs: Nejde zpracovat contentType.
de: contentType kann nicht verarbeitet werden.
es: No se puede procesar contentType.
fr: Impossible de traiter contentType.
it: Non è possibile elaborare l'elemento contentType.
ja: contentType を処理できません。
ko: contentType을 처리할 수 없습니다.
pl: Nie można przetworzyć elementu contentType.
pt_br: Não é possível processar o contentType.
tr: contentType özniteliği işlenemiyor.
zh_hans: 无法处理 contentType。
zh_hant: 無法處理 contentType。

# EncoderEnvelopeVersionMismatch
source: The envelope version of the incoming message ({0}) does not match that of the encoder ({1}). Make sure the binding is configured with the same version as the expected messages.
cs: Verze obálky příchozí zprávy ({0}) neodpovídá verzi kodéru ({1}). Ujistěte se, že je vazba konfigurována se stejnou verzí jako očekávané zprávy.
de: Die Umschlagsversion der eingehenden Nachricht ({0}) stimmt nicht mit der des Encoders ({1}) überein. Stellen Sie sicher, dass die Bindung mit der gleichen Version konfiguriert ist wie die erwarteten Nachrichten.
es: La versión de sobre del mensaje entrante ({0}) no coincide con la del codificador ({1}). Asegúrese de que el enlace está configurado con la misma versión que los mensajes esperados.
fr: La version d'enveloppe du message entrant ({0}) ne correspond pas à celle de l'encodeur ({1}). Vérifiez que la liaison est configurée avec la même version que les messages attendus.
it: La versione envelope del messaggio in arrivo ({0}) non corrisponde a quella del codificatore ({1}). Assicurarsi che il binding sia configurato con la stessa versione dei messaggi previsti.
ja: 受信メッセージのエンベロープのバージョン ({0}) がエンコーダーのバージョン ({1}) と一致しません。バインドに構成されているバージョンが、予期されるメッセージと同じであることを確認してください。
ko: 들어오는 메시지의 봉투 버전({0})이 인코더의 봉투 버전({1})과 일치하지 않습니다. 필요한 메시지와 동일한 버전을 사용하여 바인딩이 구성되었는지 확인하세요.
pl: Wersja schematu Envelope komunikatu przychodzącego ({0}) nie pasuje do wersji kodera ({1}). Sprawdź, czy powiązanie jest skonfigurowane przy użyciu tej samej wersji, co oczekiwane komunikaty.
pt_br: A versão de envelope da mensagem de entrada ({0}) não corresponde à versão do codificador ({1}). Verifique se a associação está configurada com a mesma versão das mensagens esperadas.
tr: Gelen iletinin zarf sürümü ({0}), kodlayıcının zarf sürümüyle ({1}) eşleşmiyor. Bağlamanın, beklenen iletilerle aynı sürümle yapılandırıldığından emin olun.
zh_hans: 传入消息({0})的信封版本与编码器({1})的信封版本不匹配。请确保使用与预期消息相同的版本配置绑定。
zh_hant: 內送郵件 ({0}) 的信封版本，與編碼器 ({1}) 的信封版本不符。請確定繫結設定的版本與應有之訊息的版本相同。

# EncoderMessageVersionMismatch
source: The message version of the outgoing message ({0}) does not match that of the encoder ({1}). Make sure the binding is configured with the same version as the message.
cs: Verze odchozí zprávy ({0}) neodpovídá verzi kodéru ({1}). Ujistěte se, že je vazba konfigurována se stejnou verzí jako zpráva.
de: Die Nachrichtenversion der ausgehenden Nachricht ({0}) stimmt nicht mit der des Encoders ({1}) überein. Stellen Sie sicher, dass die Bindung mit der gleichen Version konfiguriert ist wie die Nachricht.
es: La versión de mensaje del mensaje saliente ({0}) no coincide con la del codificador ({1}). Asegúrese de que el enlace está configurado con la misma versión que el mensaje.
fr: La version de message du message sortant ({0}) ne correspond pas à celle de l'encodeur ({1}). Vérifiez que la liaison est configurée avec la même version que le message attendu.
it: La versione del messaggio in uscita ({0}) non corrisponde a quella del codificatore ({1}). Verificare che il binding sia configurato con la stessa versione del messaggio.
ja: 送信メッセージのメッセージ バージョン ({0}) がエンコーダーのバージョン ({1}) と一致しません。バインドに構成されているバージョンが、メッセージと同じであることを確認してください。
ko: 보내는 메시지의 메시지 버전({0})이 인코더의 메시지 버전({1})과 일치하지 않습니다. 메시지와 동일한 버전을 사용하여 바인딩이 구성되었는지 확인하세요.
pl: Wersja komunikatu wychodzącego ({0}) nie pasuje do wersji kodera ({1}). Sprawdź, czy powiązanie jest skonfigurowane przy użyciu tej samej wersji co komunikat.
pt_br: A versão da mensagem de saída ({0}) não corresponde à versão do codificador ({1}). Verifique se a associação está configurada com a mesma versão da mensagem.
tr: Giden iletinin zarf sürümü ({0}), kodlayıcının zarf sürümüyle ({1}) eşleşmiyor. Bağlamanın, beklenen iletiler gibi aynı sürümle yapılandırıldığından emin olun.
zh_hans: 传出消息({0})的消息版本与编码器({1})的消息版本不匹配。请确保使用与消息相同的版本配置绑定。
zh_hant: 外寄郵件 ({0}) 的訊息版本與編碼器 ({1}) 的訊息版本不相符。請確定繫結設定的版本與訊息的版本相同。

# EncoderUnrecognizedCharSet
source: Unrecognized charSet '{0}' in contentType.
cs: Ve třídě contentType je nerozpoznaná třída charSet {0}.
de: Unbekannter charSet "{0}" in contentType.
es: No se reconoce charSet "{0}" en contentType.
fr: Le charSet '{0}' est non reconnu dans contentType.
it: Elemento charSet '{0}' non riconosciuto in contentType.
ja: contentType の charSet '{0}' を認識できませんでした。
ko: contentType의 charSet '{0}'을(를) 인식할 수 없습니다.
pl: Nierozpoznany zestaw znaków „{0}” w elemencie ContentType.
pt_br: charSet '{0}' não reconhecido em contentType.
tr: contentType içinde bilinmeyen charSet '{0}'.
zh_hans: ContentType 中存在无法识别的 charSet“{0}”。
zh_hant: 無法辨識 contentType 中的 charSet '{0}'。

# EncoderUnrecognizedContentType
source: Unrecognized contentType ({0}). Expected: {1}.
cs: Nerozpoznaný typ contentType ({0}). Očekáváno: {1}
de: Unbekannter contentType ({0}). Erwartet: {1}.
es: No se reconoce contentType ({0}). Se esperaba {1}.
fr: Le contentType ({0}) est non reconnu. Attendu : {1}.
it: Elemento contentType ({0}) non riconosciuto. Previsto: {1}.
ja: contentType ({0}) を認識できませんでした。{1} が必要です。
ko: 인식할 수 없는 contentType입니다({0}). {1}이(가) 필요합니다.
pl: Nierozpoznany element contentType ({0}). Oczekiwany: {1}.
pt_br: contentType ({0}) não reconhecido. Esperado: {1}.
tr: Bilinmeyen contentType ({0}). Beklenen: {1}.
zh_hans: 无法识别的 contentType ({0})。应为: {1}。
zh_hant: 無法辨識的 contentType ({0})。預期: {1}。

# EncodingBindingElementDoesNotHandleReaderQuotas
source: Unable to obtain XmlDictionaryReaderQuotas from the Binding. If you have specified a custom EncodingBindingElement, verify that the EncodingBindingElement can handle XmlDictionaryReaderQuotas in its GetProperty<T>() method.
cs: Z vazby nelze získat třídu XmlDictionaryReaderQuotas. Pokud jste zadali vlastní třídu EncodingBindingElement, ověřte, že třída EncodingBindingElement může zpracovat třídu XmlDictionaryReaderQuotas ve své metodě GetProperty<T>().
de: Die XmlDictionaryReaderQuotas konnten nicht aus der Bindung abgerufen werden. Wenn Sie ein benutzerdefiniertes EncodingBindingElement angegeben haben, sollten Sie sicherstellen, dass das EncodingBindingElement die XmlDictionaryReaderQuotas in der GetProperty<T>()-Methode behandeln kann.
es: No se puede obtener el elemento XmlDictionaryReaderQuotas del enlace. Si especificó un elemento EncodingBindingElement personalizado, compruebe que EncodingBindingElement puede controlar XmlDictionaryReaderQuotas en su método GetProperty<T>().
fr: Impossible d'obtenir l'élément XmlDictionaryReaderQuotas de la liaison. Si vous avez spécifié un élément EncodingBindingElement personnalisé, vérifiez que l'élément EncodingBindingElement peut prendre en charge des éléments XmlDictionaryReaderQuotas dans sa méthode GetProperty<T>().
it: Non è possibile ottenere XmlDictionaryReaderQuotas dall'elemento Binding. Se è stato specificato un elemento EncodingBindingElement personalizzato, verificare che EncodingBindingElement sia in grado di gestire XmlDictionaryReaderQuotas nel relativo metodo GetProperty<T>().
ja: Binding から XmlDictionaryReaderQuotas を取得できません。カスタム EncodingBindingElement を指定している場合は、EncodingBindingElement がその GetProperty<T>() メソッド内の XmlDictionaryReaderQuotas を処理できることを確認してください。
ko: 바인딩에서 XmlDictionaryReaderQuotas를 가져올 수 없습니다. 사용자 지정 EncodingBindingElement를 지정한 경우 EncodingBindingElement가 GetProperty<T>() 메서드의 XmlDictionaryReaderQuotas를 처리할 수 있는지 확인하세요.
pl: Nie można uzyskać obiektu XmlDictionaryReaderQuotas z powiązania. Jeśli określono niestandardową wartość EncodingBindingElement, sprawdź, czy obiekt EncodingBindingElement w swojej metodzie GetProperty<T>() potrafi obsłużyć obiekt XmlDictionaryReaderQuotas.
pt_br: Não é possível obter XmlDictionaryReaderQuotas com base na Associação. Se você tiver especificado um objeto EncodingBindingElement personalizado, verifique se EncodingBindingElement poderá tratar XmlDictionaryReaderQuotas em seu método GetProperty<T>().
tr: Bağlamadan XmlDictionaryReaderQuotas alınamıyor. Özel bir EncodingBindingElement belirttiyseniz, EncodingBindingElement özniteliğinin GetProperty<T>() metodunda XmlDictionaryReaderQuotas öğesini işleyebileceğini doğrulayın.
zh_hans: 无法从绑定中获取 XmlDictionaryReaderQuota。如果已指定自定义 EncodingBindingElement，请验证 EncodingBindingElement 是否能够处理其 GetProperty<T>() 方法中的 XmlDictionaryReaderQuota。
zh_hant: 無法從繫結取得 XmlDictionaryReaderQuotas。若已指定自訂 EncodingBindingElement，請確認 EncodingBindingElement 是否可在其 GetProperty<T>() 方法中處理 XmlDictionaryReaderQuotas。

# EndMethodsCannotBeDecoratedWithOperationContractAttribute
source: When using the IAsyncResult design pattern, the End method cannot be decorated with OperationContractAttribute. Only the corresponding Begin method can be decorated with OperationContractAttribute; that attribute will apply to the Begin-End pair of methods. Method '{0}' in type '{1}' violates this.
cs: Při použití návrhového vzoru IAsyncResult nemůže být metoda End dekorována atributem OperationContractAttribute. Pouze odpovídající metoda Begin může být dekorována atributem OperationContractAttribute. Tento atribut se bude vztahovat na páry metod Begin-End. Metoda {0} v typu {1} toto porušuje.
de: Wenn das IAsyncResult-Entwurfsmuster verwendet wird, kann die End-Methode nicht mit dem OperationContractAttribute versehen werden. Nur die entsprechende Begin-Methode kann mit dem OperationContractAttribute versehen werden. Dieses Attribut wird auf das Begin-End-Paar von Methoden angewendet. Die Methode "{0}" im Typ "{1}" verstößt hiergegen.
es: Cuando se usa el patrón de diseño IAsyncResult, el método End no puede contener el atributo OperationContractAttribute. solo el método Begin correspondiente puede contener OperationContractAttribute. Dicho atributo se aplicará al par de métodos Begin-End. El método "{0}" en el tipo "{1}" infringe esta regla.
fr: Durant l'utilisation du modèle de conception IAsyncResult, la méthode End ne peut pas être décorée avec l'attribut OperationContractAttribute. Seule la méthode Begin correspondante peut être décorée avec l'attribut OperationContractAttribute ; cet attribut s'appliquera à la paire de méthodes Begin-End. La méthode '{0}' du type '{1}' contrevient à cette règle.
it: Quando si usa lo schema progettuale IAsyncResult, il metodo End non può essere decorato con OperationContractAttribute. Solo il metodo Begin corrispondente può essere decorato con OperationContractAttribute. Tale attributo verrà applicato alla coppia di metodi Begin-End. Il metodo '{0}' nel tipo '{1}' viola tale regola.
ja: IAsyncResult 設計パターンを使用する場合、OperationContractAttribute を使用して End メソッドを修飾することはできません。OperationContractAttribute を使用して修飾できるのは、対応する Begin メソッドのみです。この属性は、メソッドの Begin と End のペアに適用されます。型 '{1}' のメソッド '{0}' はこれに違反しています。
ko: IAsyncResult 디자인 패턴을 사용할 경우 End 메서드를 OperationContractAttribute로 데코레이트할 수 없습니다. 해당 Begin 메서드만 OperationContractAttribute로 데코레이트할 수 있습니다. 해당 특성은 메서드의 Begin-End 쌍에 적용됩니다. 형식 '{1}'의 '{0}' 메서드가 이를 위반합니다.
pl: Kiedy używany jest wzorzec projektowy IAsyncResult, metoda End nie może mieć atrybutu OperationContractAttribute. Jedynie odpowiednia metoda Begin może korzystać z atrybutu OperationContractAttribute; ten atrybut obowiązuje w odniesieniu do pary metod Begin-End. Metoda „{0}” w typie „{1}” narusza tę zasadę.
pt_br: Ao usar o padrão de design IAsyncResult, não é possível decorar o método End com OperationContractAttribute. Apenas o método Begin correspondente pode ser decorado com OperationContractAttribute; esse atributo será aplicado ao par de métodos Begin-End. O método '{0}' no tipo '{1}' viola essa determinação.
tr: IAsyncResult tasarım deseni kullanılırken, End metodu OperationContractAttribute ile birlikte olamaz. Yalnızca ilgili Begin metodu OperationContractAttribute ile kullanılabilir; bu öznitelik de Begin-End metot çiftine uygulanır. '{1}' türündeki '{0}' metodu bunu ihlal ediyor.
zh_hans: 使用 IAsyncResult 设计模式时，End 方法不能使用 OperationContractAttribute 进行修饰。只有相对应的 Begin 方法才能使用 OperationContractAttribute 进行修饰；该特性将应用到 Begin-End 方法对中。类型“{1}”中的方法“{0}”违反了此规则。
zh_hant: 使用 IAsyncResult 設計模式時，End 方法無法加上 OperationContractAttribute。只有對應的 Begin 方法可加上 OperationContractAttribute; 該屬性將套用至 Begin-End 方法組。類型 '{1}' 中的方法 '{0}' 違反此規則。
