Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# ExtendedProtectionNotSupported
source: Extended protection is not supported on this platform. Please install the appropriate patch or change the ExtendedProtectionPolicy on the Binding or BindingElement to a value with a PolicyEnforcement value of "Never" or "WhenSupported".
cs: Rozšířená ochrana se na této platformě nepodporuje. Instalujte odpovídající opravu nebo změňte vlastnost ExtendedProtectionPolicy objektu Binding nebo BindingElement na hodnotu s nastavením PolicyEnforcement Never nebo WhenSupported.
de: Der erweiterte Schutz wird auf dieser Plattform nicht unterstützt. Installieren Sie einen geeigneten Patch, oder ändern Sie „ExtendedProtectionPolicy“ der Bindung oder „BindingElement“ in einen Wert mit dem „PolicyEnforcement“-Wert „Never“ oder „WhenSupported“.
es: La protección extendida no se admite en esta plataforma. Instale la revisión correspondiente o cambie ExtendedProtectionPolicy en Binding o BindingElement por un valor de PolicyEnforcement "Never" o "WhenSupported".
fr: La protection étendue n’est pas prise en charge sur cette plateforme. Installez le correctif approprié ou remplacez le ExtendedProtectionPolicy sur Binding ou BindingElement en par une valeur PolicyEnforcement de « Never » ou « WhenSupported ».
it: La protezione estesa non è supportata in questa piattaforma. Installare la patch appropriata o modificare ExtendedProtectionPolicy in Binding o BindingElement in un valore con PolicyEnforcement impostato sul valore "Never"o "WhenSupported".
ja: このプラットフォームでは拡張保護はサポートされません。適切な更新プログラムをインストールするか、Binding または BindingElement に対する ExtendedProtectionPolicy を、"Never" または "WhenSupported" の PolicyEnforcement 値を持つ値に変更してください。
ko: 이 플랫폼에서는 확장된 보호가 지원되지 않습니다. 적합한 패치를 설치하거나 Binding 또는 BindingElement의 ExtendedProtectionPolicy를 PolicyEnforcement 값이 "Never" 또는 "WhenSupported"인 값으로 변경하십시오.
pl: Ochrona rozszerzona jest nieobsługiwana na tej platformie. Zainstaluj odpowiednią poprawkę lub zmień wartość właściwości ExtendedProtectionPolicy obiektu Binding lub BindingElement na właściwość PolicyEnforcement o wartości „Never” lub „WhenSupported”.
pt_br: Não há suporte para a proteção estendida nesta plataforma. Instale o patch apropriado ou altere ExtendedProtectionPolicy na Binding ou BindingElement para um valor com um valor PolicyEnforcement igual a "Never" ou "WhenSupported".
tr: Genişletilmiş koruma bu platformda desteklenmiyor. Lütfen uygun düzeltme ekini yükleyin veya Binding veya BindingElement üzerindeki ExtendedProtectionPolicy öğesini, PolicyEnforcement değeri "Never" veya "WhenSupported" olan bir değere değiştirin.
zh_hans: 此平台不支持扩展保护。请安装适当的补丁，或者将 Binding 或 BindingElement 上的 ExtendedProtectionPolicy 更改为 PolicyEnforcement 值为“Never”或“WhenSupported”的某个值。
zh_hant: 此平台上不支援延伸的保護。請安裝適當的修補程式，或者將 Binding 或 BindingElement 上的 ExtendedProtectionPolicy 變更為 PolicyEnforcement 值為 "Never" 或 "WhenSupported" 的值。

# ExtendedProtectionPolicyCustomChannelBindingNotSupported
source: CustomChannelBindings are not supported. Please remove the CustomChannelBinding from the ExtendedProtectionPolicy.
cs: Vazby CustomChannelBindings nejsou podporovány. Odeberte vazbu CustomChannelBinding ze zásady ExtendedProtectionPolicy.
de: CustomChannelBindings werden nicht unterstützt. Entfernen Sie die CustomChannelBinding aus der ExtendedProtectionPolicy.
es: Los CustomChannelBindings no son compatibles. Quite el CustomChannelBinding de la ExtendedProtectionPolicy.
fr: CustomChannelBindings ne sont pas pris en charge. Supprimez le CustomChannelBinding du ExtendedProtectionPolicy.
it: CustomChannelBinding non supportati. Rimuovere CustomChannelBinding da ExtendedProtectionPolicy.
ja: CustomChannelBinding はサポートされていません。ExtendedProtectionPolicy から CustomChannelBinding を削除してください。
ko: CustomChannelBinding은 지원되지 않습니다. ExtendedProtectionPolicy에서 CustomChannelBinding을 제거하십시오.
pl: Niestandardowe powiązania kanałów nie są obsługiwane. Usuń niestandardowe powiązanie kanałów z zasady ExtendedProtectionPolicy.
pt_br: CustomChannelBindings não são suportados. Remova CustomChannelBinding da ExtendedProtectionPolicy.
tr: CustomChannelBindings desteklenmiyor. Lütfen ExtendedProtectionPolicy'den CustomChannelBinding'i kaldırın.
zh_hans: 不支持 CustomChannelBinding。请从 ExtendedProtectionPolicy 中移除 CustomChannelBinding。
zh_hant: 不支援 CustomChannelBindings。請從 ExtendedProtectionPolicy 移除 CustomChannelBinding。

# ExtraContentIsPresentInFaultDetail
source: Additional XML content is present in the fault detail element. Only a single element is allowed.
cs: Dodatečný obsah XML se nachází v chybném detailním elementu. Je povolen pouze jeden element.
de: Weitere XML-Inhalte sind im Fehlerdetailelement vorhanden. Nur ein einzelnes Element ist zulässig.
es: Hay contenido XML adicional en el elemento de detalles de error. solo se permite un elemento.
fr: Du contenu XML supplémentaire est présent dans l'élément de détail d'erreur. Un seul élément y est autorisé.
it: Nell'elemento dettagli dell'errore è presente contenuto XML aggiuntivo. È consentito un solo elemento.
ja: fault detail 要素に追加の XML コンテンツがあります。1 つの要素のみが許可されています。
ko: 추가 XML 콘텐츠가 오류 정보 요소에 있습니다. 단일 요소만 허용됩니다.
pl: Dodatkowa zawartość XML w błędnym elemencie szczegółowym. Tylko pojedynczy element jest dozwolony.
pt_br: Existe conteúdo XML adicional no elemento de detalhes da falha. Apenas um elemento é permitido.
tr: Hata ayrıntı öğesinde ek XML içeriği bulunuyor. Yalnızca bir tek öğeye izin verilir.
zh_hans: 其他 XML 内容存在于错误详细信息元素中。仅允许一个元素。
zh_hant: 錯誤詳細資訊元素中有其他 XML 內容。只允許單一元素。

# FailToReceiveReplyFromNegotiation
source: Security negotiation failed because the remote party did not send back a reply in a timely manner. This may be because the underlying transport connection was aborted.
cs: Vyjednávání zabezpečení se nezdařilo, protože vzdálená strana neposlala odpověď včas. To mohlo být způsobeno přerušením nadřazeného přenosového připojení.
de: Bei der Sicherheitsaushandlung ist ein Fehler aufgetreten, da die Gegenseite nicht rechtzeitig eine Antwort gesendet hat. Dies kann darauf zurückzuführen sein, dass die zugrunde liegende Transportverbindung abgebrochen wurde.
es: Error de negociación de seguridad porque la parte remota no devolvió una respuesta a tiempo. Puede deberse a que se anuló la conexión de transporte subyacente.
fr: La négociation de sécurité a échoué car la partie distante n'a pas renvoyé une réponse dans le délai imparti. La raison peut en être que la connexion de transport sous-jacente a été interrompue.
it: Negoziazione di sicurezza non riuscita perché la parte remota non ha restituito una risposta nel tempo previsto. Il problema potrebbe essere dovuto all'interruzione della connessione al trasporto sottostante.
ja: セキュリティ ネゴシエーションは、リモート パーティがタイミング良く応答を返信しなかったため失敗しました。これは基盤となるトランスポート接続が中止されたことが原因の可能性があります。
ko: 원격 상대방이 적절한 시간 내에 회신을 보내지 않았기 때문에 보안 협상에 실패했습니다. 이것은 기본 전송 연결이 중단되었기 때문일 수 있습니다.
pl: Nie można wynegocjować zabezpieczeń, ponieważ strona zdalna nie odpowiedziała na czas. Przyczyną może być przerwanie podstawowego połączenia transportowego.
pt_br: Falha na negociação de segurança porque a parte remota não retornou uma resposta pontual. Isso pode ter ocorrido por causa da anulação da conexão de transporte subjacente.
tr: Uzak taraf zamanında bir yanıt göndermediği için güvenlik anlaşması başarısız oldu. Bunun nedeni arka plandaki taşıma bağlantısının iptal edilmesi olabilir.
zh_hans: 安全协商失败，因为远程方未及时发回答复。这可能是因为基础传输连接已中止。
zh_hant: 安全性交涉失敗，因為遠端的一方無法及時傳回回覆。這可能是因為基礎傳輸連線已中止所造成。

# FailedToCreateTypedProxy
source: Failed to create a typed proxy for type '{0}'
cs: Pro typ {0} nebylo možné vytvořit typové proxy.
de: Fehler beim Erstellen eines typisierten Proxys für den Typ "{0}"
es: No se pudo crear un proxy con tipo para el tipo "{0}"
fr: Échec de la création d'un proxy typé pour le type '{0}'
it: Non è stato possibile creare un proxy tipizzato per il tipo '{0}'
ja: 型 '{0}' の型指定されたプロキシを作成できませんでした
ko: '{0}' 형식에 대한 형식화된 프록시를 만들지 못했습니다.
pl: Nie udało się utworzyć typizowanego serwera proxy dla typu „{0}”
pt_br: Falha ao criar um proxy tipado do tipo '{0}'
tr: '{0}' türü için türü belirtilmiş bir proxy oluşturulamadı
zh_hans: 未能为类型“{0}”创建类型化代理
zh_hant: 無法建立類型 '{0}' 的具備類型 Proxy

# FaultConverterCreatedException
source: {0} returned false from OnTryCreateException, but returned a non-null Exception (See InnerException for details).
cs: {0} vrátil hodnotu false z OnTryCreateException, ale také vrátil výjimku, která nemá hodnotu null (podrobnosti naleznete u výjimky InnerException).
de: {0} hat für OnTryCreateException "false" zurückgegeben, jedoch eine Ausnahme zurückgegeben, die nicht NULL ist (detaillierte Informationen finden Sie unter "InnerException").
es: {0} devolvió false desde OnTryCreateException, pero devolvió una excepción que no es nula (consulte InnerException para obtener más información).
fr: {0} a retourné une valeur false de l'exception OnTryCreateException, mais a retourné une exception non null (Pour plus d'informations, consultez InnerException).
it: {0} ha restituito false da OnTryCreateException, ma ha restituito un'eccezione non Null. Per dettagli, vedere InnerException.
ja: {0} は OnTryCreateException から False を戻しましたが、null 以外の Exception を戻しました (詳細については、InnerException を参照してください)。
ko: {0}이(가) OnTryCreateException에서 false를 반환했지만 null이 아닌 예외를 반환했습니다(자세한 내용은 InnerException 참조).
pl: Element {0} zwrócił wartość false z elementu OnTryCreateException, ale zwrócił element Exception o wartości innej niż null (aby uzyskać szczegóły, sprawdź właściwość InnerException).
pt_br: {0} retornou false de OnTryCreateException, mas retornou uma Exceção não nula (consulte InnerException para obter detalhes).
tr: {0}, OnTryCreateException öğesinden false değerini döndürdü, ancak null olmayan bir Exception döndürdü (Ayrıntılar için InnerException öğesine bakın).
zh_hans: {0} 从 OnTryCreateException 返回 false，但返回了非 null 异常(有关详细信息，请参见 InnerException)。
zh_hant: {0} 從 OnTryCreateException 傳回 False，但傳回了非 null 的例外狀況 (請參閱 InnerException，以取得詳細資料)。

# FaultConverterCreatedFaultMessage
source: {0} returned false from OnTryCreateFaultMessage, but returned a non-null fault message.
cs: {0} vrátil hodnotu false z OnTryCreateFaultMessage, ale také vrátil zprávu o chybě, která nemá hodnotu null.
de: {0} hat für OnTryCreateFaultMessage "false" zurückgegeben, jedoch eine Fehlermeldung zurückgegeben, die nicht NULL ist.
es: {0} devolvió false desde OnTryCreateFaultMessage, pero devolvió un mensaje de error que no es nulo.
fr: {0} a retourné une valeur false du message OnTryCreateFaultMessage, mais a retourné un message d'erreur non null.
it: {0} ha restituito false da OnTryCreateFaultMessage, ma ha restituito un messaggio di errore non Null.
ja: {0} は OnTryCreateFaultMessage から False を戻しましたが、null 以外のフォールト メッセージを戻しました。
ko: {0}이(가) OnTryCreateFaultMessage에서 false를 반환했지만 null이 아닌 오류 메시지를 반환했습니다.
pl: Element {0} zwrócił wartość false z elementu OnTryCreateFaultMessage, ale zwrócił komunikat o błędzie inny niż null.
pt_br: {0} retornou false de OnTryCreateFaultMessage, mas retornou uma mensagem de falha não nula.
tr: {0}, OnTryCreateFaultMessage öğesinden false değerini döndürdü, ancak null olmayan bir hata mesajı döndürdü.
zh_hans: {0} 从 OnTryCreateFaultMessage 返回 false，但返回了非 null 错误消息。
zh_hant: {0} 從 OnTryCreateFaultMessage 傳回 False，但傳回了非 null 的錯誤訊息。

# FaultConverterDidNotCreateException
source: {0} returned true from OnTryCreateException, but did not return an Exception.
cs: {0} vrátil hodnotu true z třídy OnTryCreateException, ale nevrátil výjimku.
de: {0} hat für OnTryCreateException "true" zurückgegeben, jedoch keine Ausnahme zurückgegeben.
es: {0} devolvió true desde OnTryCreateException, pero no devolvió una excepción.
fr: {0} a retourné une valeur true de l'exception OnTryCreateException, mais n'a pas retourné d'exception.
it: {0} ha restituito true da OnTryCreateException, ma non ha restituito un'eccezione.
ja: {0} は OnTryCreateException から True を戻しましたが、Exception を戻しませんでした。
ko: {0}이(가) OnTryCreateException에서 true를 반환했지만 예외를 반환하지 않았습니다.
pl: Element {0} zwrócił wartość true z elementu OnTryCreateException, ale nie zwrócił elementu Exception.
pt_br: {0} retornou true de OnTryCreateException, mas não retornou uma Exceção.
tr: {0}, OnTryCreateException öğesinden true değerini döndürdü, ancak null olmayan bir Exception döndürmedi.
zh_hans: {0} 从 OnTryCreateException 返回 true，但未返回异常。
zh_hant: {0} 從 OnTryCreateException 傳回 True，但並未傳回任何 Exception。

# FaultConverterDidNotCreateFaultMessage
source: {0} returned true from OnTryCreateFaultMessage, but did not return a fault message.
cs: {0} vrátil hodnotu true z třídy OnTryCreateFaultMessage, ale nevrátil zprávu o chybě.
de: {0} hat für OnTryCreateFaultMessage "true" zurückgegeben, jedoch keine Fehlermeldung zurückgegeben.
es: {0} devolvió true desde OnTryCreateFaultMessage, pero no devolvió un mensaje de error.
fr: {0} a retourné une valeur true du message OnTryCreateFaultMessage, mais n'a pas retourné un message d'erreur.
it: {0} ha restituito true da OnTryCreateFaultMessage, ma non ha restituito un messaggio di errore.
ja: {0} は OnTryCreateFaultMessage から True を戻しましたが、フォールト メッセージを戻しませんでした。
ko: {0}이(가) OnTryCreateFaultMessage에서 true를 반환했지만 오류 메시지를 반환하지 않았습니다.
pl: Element {0} zwrócił wartość true z elementu OnTryCreateFaultMessage, ale nie zwrócił komunikatu o błędzie.
pt_br: {0} retornou true de OnTryCreateFaultMessage, mas não retornou uma mensagem de falha.
tr: {0}, OnTryCreateFaultMessage öğesinden true değerini döndürdü, ancak bir hata iletisi döndürmedi.
zh_hans: {0} 从 OnTryCreateFaultMessage 返回 true，但未返回错误消息。
zh_hant: {0} 從 OnTryCreateFaultMessage 傳回 True，但並未傳回錯誤訊息。

# FaultDoesNotHaveAnyDetail
source: The fault does not have detail information.
cs: Chyba nemá podrobné informace.
de: Für den Fehler stehen keine Detailinformationen zur Verfügung.
es: No hay información detallada para el error.
fr: L'erreur n'a pas d'informations détaillées.
it: Non sono disponibili informazioni dettagliate per l'errore.
ja: フォールトには詳細情報がありません。
ko: 오류에 세부 정보가 없습니다.
pl: Brak szczegółowych informacji o błędzie.
pt_br: A falha não inclui informações detalhadas.
tr: Hata ayrıntı bilgilerine sahip değil.
zh_hans: 错误不包含详细信息。
zh_hant: 錯誤沒有詳細資訊。

# FoundMultipleCerts
source: Found multiple X.509 certificates using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Provide a more specific find value.
cs: Bylo nalezeno více certifikátů X.509 pomocí následujících kritérií hledání: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3}. Zadejte přesnější hledanou hodnotu.
de: Mit den folgenden Suchkriterien wurden mehrere X.509-Zertifikate gefunden: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Geben Sie einen spezifischeren Wert für die Suche an.
es: Se encontraron varios certificados X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Especifique un valor de búsqueda más concreto.
fr: Plusieurs certificats X.509 ont été trouvés à partir des critères de recherche suivants : StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Indiquez une valeur de recherche plus spécifique.
it: Sono stati trovati più certificati X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Specificare un valore di ricerca più specifico.
ja: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}' という検索条件で検索した結果、複数の X.509 証明書が見つかりました。より具体的な検索条件を指定してください。
ko: 다음 검색 조건을 사용하여 여러 X.509 인증서를 찾았습니다. StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. 더 구체적인 찾기 값을 제공하세요.
pl: Znaleziono wiele certyfikatów X.509 przy użyciu następujących kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}”. Podaj dokładniejszą wartość wyszukiwania.
pt_br: Encontrados vários certificados X.509 usando os seguintes critérios de pesquisa: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Forneça um valor de localização mais específico.
tr: Aşağıdaki arama ölçütleri kullanılarak birden çok X.509 sertifikası bulundu: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Daha belirli bir arama değeri girin.
zh_hans: 使用下列搜索标准找到多个 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。请提供更具体的查找值。
zh_hant: 使用下列搜尋條件找到多個 X.509 憑證: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。請提供更精確的尋找值。

# FoundMultipleCertsForTarget
source: Found multiple X.509 certificates using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' for target '{4}'. Provide a more specific find value.
cs: Bylo nalezeno více certifikátů X.509 pomocí následujících kritérií hledání: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3} pro cíl {4}. Zadejte přesnější hledanou hodnotu.
de: Mit den folgenden Suchkriterien wurden mehrere X.509-Zertifikate gefunden: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}" für das Ziel "{4}". Geben Sie einen spezifischeren Wert für die Suche an.
es: Se encontraron varios certificados X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}" para el destino "{4}". Especifique un valor de búsqueda más concreto.
fr: Plusieurs certificats X.509 ont été trouvés en utilisant les critères de recherche suivants : StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' pour la cible '{4}'. Indiquez une valeur de recherche plus précise.
it: Sono stati trovati più certificati X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' per la destinazione '{4}'. Specificare un valore di ricerca più specifico.
ja: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}' という検索条件で '{4}' を検索した結果、複数の X.509 証明書が見つかりました。より具体的な検索条件を指定してください。
ko: 다음 검색 조건을 사용하여 여러 X.509 인증서를 찾았습니다. StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'(대상 '{4}'에 대한). 더 구체적인 찾기 값을 제공하세요.
pl: Znaleziono wiele certyfikatów X.509 przy użyciu następujących kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}” dla elementu docelowego „{4}”. Podaj dokładniejszą wartość wyszukiwania.
pt_br: Encontrados vários certificados X.509 usando os seguintes critérios de pesquisa: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' para o destino '{4}'. Forneça um valor de localização mais específico.
tr: Aşağıdaki arama ölçütleri kullanılarak birden çok X.509 sertifikası bulundu: '{4}' hedefi için StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Daha belirli bir arama değeri sağlayın.
zh_hans: 使用下列搜索标准为目标“{4}”找到多个 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。请提供更具体的查找值。
zh_hant: 使用下列搜尋條件找到多個 X.509 憑證: 目標 '{4}' 的 StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。請提供更精確的尋找值。

# FramingAtEnd
source: An attempt was made to decode a value after the framing stream was ended.
cs: Po ukončení datového streamu rámce byl proveden pokus o dekódování hodnoty.
de: Es wurde versucht, einen Wert zu decodieren, nachdem der Rahmendatenstrom beendet wurde.
es: Se intentó descodificar un valor después de finalizar la secuencia de tramas.
fr: Une tentative a été faite pour décoder une valeur après la fin du flux de tramage.
it: Si è provato a decodificare un valore dopo il termine del flusso di framing.
ja: フレーム ストリームの終了後に、値のデコードが試みられました。
ko: 프레이밍 스트림이 끝난 후에 값을 디코딩하려고 했습니다.
pl: Podjęto próbę zdekodowania wartości po zakończeniu strumienia ramek.
pt_br: Foi feita uma tentativa de decodificar um valor após a finalização do fluxo de enquadramento.
tr: Çerçeve akışı tamamlandıktan sonra bir değerin kodunu çözme denemesi yapıldı.
zh_hans: 组帧流结束之后尝试对某个值进行解码。
zh_hant: 嘗試在框架處理資料流結束後將值解碼。

# FramingContentTypeMismatch
source: Content Type {0} was not supported by service {1}. The client and service bindings may be mismatched.
cs: Typ obsahu {0} není podporován službou {1}. Vazby klienta a služby se pravděpodobně neshodují.
de: Der Inhaltstyp {0} wurde vom Dienst {1} nicht unterstützt. Möglicherweise stimmen Client- und Dienstbindungen nicht überein.
es: El tipo de contenido {0} no era compatible con el servicio {1}. Es posible que los enlaces del cliente y el servicio no coincidan.
fr: Le type de contenu {0} n'a pas été pris en charge par le service {1}. Les liaisons du client et du service risquent de ne pas correspondre.
it: Il tipo di contenuto {0} non è supportato dal servizio {1}. I binding del client e del servizio potrebbero non corrispondere.
ja: コンテンツ型 {0} はサービス {1} でサポートされていませんでした。クライアントとサービスのバインドが整合していない可能性があります。
ko: 콘텐츠 형식 {0}이(가) 서비스 {1}에서 지원되지 않습니다. 클라이언트 및 서비스 바인딩이 일치하지 않을 수 있습니다.
pl: Typ zawartości {0} nie został obsłużony przez usługę {1}. Powiązania klienta i serwera mogą się nie zgadzać.
pt_br: O Tipo de Conteúdo {0} não tinha suporte do serviço {1}. As associações de cliente e serviço talvez não sejam compatíveis.
tr: {0} İçerik Türü {1} hizmeti tarafından desteklenmiyor. İstemci ve hizmet bağlamaları eşleşmiyor olabilir.
zh_hans: 服务 {1} 不支持内容类型 {0}。客户端和服务绑定可能不匹配。
zh_hant: 服務 {1} 不支援內容類型 {0}。用戶端與服務繫結可能不符。

# FramingContentTypeTooLong
source: The framing content type size ({0}) exceeds the quota.
cs: Velikost typu rámce obsahu ({0}) přesahuje kvótu.
de: Die Größe ({0}) des Rahmeninhaltstyps überschreitet das Kontingent.
es: El tamaño del tipo de contenido de tramas ({0}) supera la cuota.
fr: La taille du type de contenu de tramage ({0}) dépasse le quota.
it: Le dimensioni ({0}) del tipo di contenuto di framing superano la quota.
ja: フレーム コンテンツ型のサイズ ({0}) がクォータを超えています。
ko: 프레이밍 콘텐츠 형식 크기({0})가 할당량을 초과합니다.
pl: Rozmiar typu zawartości ramki ({0}) przekracza limit przydziału.
pt_br: O tamanho do tipo de conteúdo de enquadramento ({0}) excede a cota.
tr: Çerçeveleme içerik türü boyutu ({0}) kotayı aşıyor.
zh_hans: 组帧内容类型大小({0})超过配额。
zh_hant: 框架處理內容類型大小 ({0}) 超出配額。

# FramingContentTypeTooLongFault
source: Content type '{0}' is too long to be processed by the remote host. See the server logs for more details.
cs: Typ obsahu {0} je pro zpracování vzdáleným hostitelem příliš dlouhý. Další informace naleznete v protokolech serveru.
de: Der Inhaltstyp "{0}" kann vom Remotehost nicht verarbeitet werden, da er zu lang ist. Weitere Details finden Sie in den Serverprotokollen.
es: El tipo de contenido "{0}" es demasiado largo para que lo procese el host remoto. Consulte los registros del servidor para obtener más información.
fr: Le type de contenu '{0}' est trop long pour être traité par l'hôte distant. Pour plus d'informations, consultez les journaux du serveur.
it: Il tipo di contenuto '{0}' è eccessivo per essere elaborato dall'host remoto. Per maggiori dettagli, vedere i log del server.
ja: コンテンツ型 '{0}' の長さが長すぎるため、リモート ホストで処理できません。詳細については、サーバー ログを参照してください。
ko: 콘텐츠 형식 '{0}'이(가) 너무 길어서 원격 호스트가 처리할 수 없습니다. 자세한 내용은 서버 로그를 참조하세요.
pl: Typ zawartości „{0}” jest za długi do przetworzenia przez hosta zdalnego. Aby uzyskać więcej informacji, zobacz dzienniki serwera.
pt_br: O tipo de conteúdo '{0}' é muito longo para ser processado pelo host remoto. Consulte os logs do servidor para obter mais detalhes.
tr: '{0}' içerik türü, uzak konak tarafından işlenemeyecek kadar uzun. Daha fazla ayrıntı için sunucu günlüklerine bakın.
zh_hans: 内容类型“{0}”过长，远程主机无法处理。有关详细信息，请参见服务器日志。
zh_hant: 內容類型 '{0}' 太長，遠端主機無法處理。請參閱伺服器記錄檔，以取得詳細資料。
