Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxRequestHasInvalidReplyToOnClient
source: The request message has ReplyTo='{0}' but IContextChannel.LocalAddress is '{1}'. When ManualAddressing is false, these values must be the same, null, or EndpointAddress.AnonymousAddress. Enable ManualAddressing or avoid setting ReplyTo on the message.
cs: U zprávy s požadavkem je hodnota ReplyTo={0}, ale adresa IContextChannel.LocalAddress je {1}. Když má vlastnost ManualAddressing hodnotu false, musejí být tyto hodnoty stejné, null nebo EndpointAddress.AnonymousAddress. Povolte vlastnost ManualAddressing nebo u zprávy nenastavujte hodnotu ReplyTo.
de: Für die Anforderungsnachricht ist ReplyTo="{0}" festgelegt, aber die IContextChannel.LocalAddress ist "{1}". Wenn ManualAddressing auf "false" festgelegt ist, müssen diese Werte identisch, NULL oder EndpointAddress.AnonymousAddress sein. Aktivieren Sie ManualAddressing, oder verwenden Sie für die Nachricht nicht die ReplayTo-Einstellung.
es: El mensaje de solicitud tiene ReplyTo="{0}" pero IContextChannel.LocalAddress es "{1}". Cuando ManualAddressing es false, estos valores deben ser Same, Null o EndpointAddress.AnonymousAddress. Habilite ManualAddressing o evite establecer ReplyTo en el mensaje.
fr: Le message de requête comporte ReplyTo='{0}', mais IContextChannel.LocalAddress est '{1}'. Quand ManualAddressing a la valeur false, ces valeurs doivent être identiques, null ou EndpointAddress.AnonymousAddress. Activez ManualAddressing ou évitez de définir ReplyTo sur le message.
it: Il messaggio di richiesta contiene ReplyTo='{0}' ma IContextChannel.LocalAddress è '{1}'. Quando ManualAddressing è false, questi valori devono essere uguali, Null o EndpointAddress.AnonymousAddress. Abilitare ManualAddressing o evitare di impostare ReplyTo sul messaggio.
ja: 要求メッセージに ReplyTo='{0}' がありますが、IContextChannel.LocalAddress が '{1}' です。ManualAddressing が False の場合は、これらの値は同じか、null か、EndpointAddress.AnonymousAddress である必要があります。ManualAddressing を有効にするか、メッセージで ReplyTo を設定しないようにしてください。
ko: 요청 메시지에 ReplyTo='{0}'이(가) 있지만 IContextChannel.LocalAddress는 '{1}'입니다. ManualAddressing이 false이면 이 값은 같거나, null 또는 EndpointAddress.AnonymousAddress이어야 합니다. ManualAddressing을 사용하거나 메시지에서 ReplyTo를 설정하지 마세요.
pl: Komunikat żądania ma parametr From=„{0}”, lecz wartość IContextChannel.LocalAddress wynosi „{1}”. Kiedy wartość ManualAddressing wynosi false, te wartości muszą być takie same, równe null albo równe wartości EndpointAddress.AnonymousAddress. Aby zapobiec ustawianiu pola ReplyTo w komunikacie, włącz opcję ManualAddressing.
pt_br: A mensagem de solicitação tem ReplyTo='{0}', mas IContextChannel.LocalAddress é '{1}'. Quando ManualAddressing é false, esses valores devem ser iguais, nulos ou EndpointAddress.AnonymousAddress. Habilite ManualAddressing ou evite configurar ReplyTo na mensagem.
tr: İstek iletisi için ReplyTo='{0}' geçerli, ancak IContextChannel.LocalAddress: '{1}'. ManualAddressing false olduğunda, bu değerlerin de aynı, null ya da EndpointAddress.AnonymousAddress olması gerekir. ManualAddressing özelliğini etkinleştirin ya da iletide ReplyTo ayarı yapmayın.
zh_hans: 请求消息具有 ReplyTo=“{0}”，但 IContextChannel.LocalAddress 是“{1}”。当 ManualAddressing 为 False 时，这些值必须相同、为 null 或为 EndpointAddress.AnonymousAddress。请启用 ManualAddressing 或避免在消息上设置 ReplyTo。
zh_hant: 要求訊息具有 ReplyTo='{0}'，但是 IContextChannel.LocalAddress 為 '{1}'。當 ManualAddressing 為 False 時，這些值必須相同、null 或為 EndpointAddress.AnonymousAddress。請啟用 ManualAddressing 或避免在訊息上設定 ReplyTo。

# SFxRequestReplyNone
source: A message was received with a WS-Addressing ReplyTo or FaultTo header targeted at the "None" address. These values are not valid for request-reply operations. Please consider using a one-way operation or enabling ManualAddressing if you need to support ReplyTo or FaultTo values of "None."
cs: Byla přijata zpráva se záhlavím elementu WS-Addressing ReplyTo nebo FaultTo s cílem na adresu "Žádná". Tyto hodnoty nejsou pro operace požadavek-odpověď platné. Použijte jednocestnou operaci nebo povolte vlastnost ManualAddressing, pokud je nutná podpora možnost "Žádná" pro hodnotu ReplyTo nebo FaultTo.
de: Es wurde eine Nachricht mit einem ReplyTo- oder FaultTo-Header der WS-Adressierung empfangen, die an die Adresse "None" gerichtet ist. Diese Werte sind für Anforderung-Antwort-Vorgänge nicht gültig. Erwägen Sie, einen unidirektionalen Vorgang zu verwenden oder ManualAddressing zu aktivieren, wenn Sie die ReplyTo- oder FaultTo-Werte von "None" unterstützen müssen.
es: Se recibió un mensaje con un encabezado WS-Addressing ReplyTo o FaultTo dirigido a la dirección "None". Estos valores no son válidos para las operaciones de solicitud-respuesta. Considere la posibilidad de usar una operación unidireccional o habilitar ManualAddressing si necesita admitir valores ReplyTo o FaultTo de "None".
fr: Un message a été reçu avec un en-tête WS-Addressing ReplyTo ou FaultTo ciblé sur l'adresse 'None'. Ces valeurs ne sont pas valides pour les opérations demande-réponse. Envisagez d'utiliser une opération monodirectionnelle ou d'activer ManualAddressing si vous devez prendre en charge les valeurs ReplyTo ou FaultTo définies sur 'None'.
it: È stato ricevuto un messaggio con un'intestazione WS-Addressing ReplyTo o FaultTo associata all'indirizzo "None". Tali valori non sono validi per le operazioni request/reply. È consigliabile utilizzare un'operazione unidirezionale o abilitare ManualAddressing se si desidera supportare i valori ReplyTo o FaultTo per "None".
ja: "None" アドレスを対象にした WS-Addressing の ReplyTo または FaultTo ヘッダーが含まれたメッセージを受信しました。これらの値は要求-応答の操作に対しては無効です。ReplyTo または FaultTo の値として "None" をサポートする必要がある場合は、一方向の操作を使用するか、ManualAddressing を有効にしてください。
ko: "None" 주소를 대상으로 하는 WS-Addressing ReplyTo 또는 FaultTo 헤더가 있는 메시지를 받았습니다. 이 값은 요청-회신 작업에 대해 올바르지 않습니다. "None"인 ReplyTo 또는 FaultTo 값을 지원하려면 단방향 작업을 사용하거나 ManualAddressing을 사용해 보십시오.
pl: Otrzymano komunikat z nagłówkiem WS-Addressing ReplyTo lub FaultTo kierowanym na adres „None”. Te wartości są nieprawidłowe dla operacji żądanie-odpowiedź. Należy rozważyć używanie operacji jednokierunkowych lub włączanie opcji ManualAddressing, jeśli wymagana jest obsługa wartości „None” w nagłówkach ReplyTo lub FaultTo.
pt_br: Uma mensagem foi recebida com um cabeçalho WS-Addressing ReplyTo ou FaultTo destinado ao endereço "Nenhum". Esses valores não são válidos para as operações de solicitação-resposta. Considere usar uma operação unidirecional ou habilitar ManualAddressing se você precisar fornecer suporte aos valores "Nenhum" para ReplyTo ou FaultTo.
tr: WS-Addressing ReplyTo ya da FaultTo üst bilgisine sahip, "None" adrese hedeflenen bir ileti alındı. Bu değerler, istek yanıt işlemlerinde geçerli değildir. "None" öğesinin ReplyTo ya da FaultTo değerlerini desteklemeniz gerektiğinde, yeni bir tek yönlü işlem kullanmayı ya da ManualAddressing işlevini etkinleştirmeyi düşünün.
zh_hans: 收到目标为 "None" 地址、标头为 WS-Addressing ReplyTo 或 FaultTo 的消息。这些值对于请求-回复操作无效。如果需要支持 "None" 的 ReplyTo 或 FaultTo 值，请考虑使用单向操作或启用 ManualAddressing。
zh_hant: 收到具有 WS-Addressing ReplyTo 或 FaultTo 標頭，目標為 "None" 位址的訊息。這些值對於要求回覆作業無效。請考慮使用單向作業。若需要支援 "None" 的 ReplyTo 或 FaultTo 值，請啟用 ManualAddressing。

# SFxRequestTimedOut1
source: This request operation did not receive a reply within the configured timeout ({0}). The time allotted to this operation may have been a portion of a longer timeout. This may be because the service is still processing the operation or because the service was unable to send a reply message. Please consider increasing the operation timeout (by casting the channel/proxy to IContextChannel and setting the OperationTimeout property) and ensure that the service is able to connect to the client.
cs: Tato operace požadavku nepřijala odpověď během nakonfigurovaného časového limitu ({0}). Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu. Může to být způsobeno tím, že služba stále zpracovává operaci, nebo tím, že služba nemohla odeslat zprávu s odpovědí. Zvyšte prosím časový limit operace (přetypováním kanálu / proxy serveru na IContextChannel a nastavením vlastnosti OperationTimeout) a zkontrolujte, jestli se služba může spojit s klientem.
de: Dieser Anforderungsvorgang hat innerhalb des konfigurierten Zeitlimits ({0}) keine Antwort empfangen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits. Mögliche Ursachen: Der Dienst verarbeitet den Vorgang noch, oder der Dienst konnte keine Antwortnachricht senden. Erwägen Sie, das Zeitlimit für den Vorgang zu erhöhen (indem Sie den Kanal/Proxy in IContextChannel umwandeln und die OperationTimeout-Eigenschaft festlegen), und stellen Sie sicher, dass der Dienst eine Verbindung mit dem Client herstellen kann.
es: Esta operación de solicitud no recibió una respuesta en el tiempo de espera configurado ({0}). El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor. La razón puede ser que el servicio sigue procesando la operación o que no pudo enviar un mensaje de respuesta. Considere la posibilidad de aumentar el tiempo de espera de la operación (convirtiendo el canal/proxy en IContextChannel y estableciendo la propiedad OperationTimeout) y asegúrese de que el servicio pueda conectarse al cliente.
fr: Cette opération de requête n'a pas reçu de réponse dans le délai imparti ({0}). Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long. Ceci peut être dû au fait que le service est toujours en train de traiter l'opération ou qu'il n'a pas pu envoyer un message de réponse. Augmentez le délai d'expiration de l'opération (en castant le canal/proxy vers IContextChannel et en définissant la propriété OperationTimeout), puis vérifiez que le service peut se connecter au client.
it: Questa operazione di richiesta non ha ricevuto una risposta entro il timeout configurato ({0}). È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo. Il problema potrebbe dipendere dal servizio che sta ancora elaborando l'operazione o che non è riuscito a inviare un messaggio di risposta. Provare ad aumentare il timeout dell'operazione, eseguendo il cast del canale/proxy su IContextChannel e impostando la proprietà OperationTimeout, quindi assicurarsi che il servizio sia in grado di connettersi al client.
ja: この要求操作は、構成されたタイムアウト時間 ({0}) 内に応答を受信しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。この原因としては、サービスがまだこの操作を処理していること、またはサービスが応答メッセージを送信できなかったことが考えられます。この操作のタイムアウト時間を増やして (チャネル/プロキシを IContextChannel にキャストして OperationTimeout プロパティを設定します)、サービスがクライアントに接続できることを確認してください。
ko: 이 요청 작업이 구성된 시간 제한({0}) 내에 회신을 받지 못했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다. 서비스가 아직 작업을 처리 중이거나 서비스가 회신 메시지를 보낼 수 없었기 때문일 수 있습니다. 채널/프록시를 IContextChannel로 캐스트하고 OperationTimeout 속성을 설정하여 작업 시간 제한을 늘리고, 서비스가 클라이언트에 연결할 수 있는지 확인해 보세요.
pl: Brak odpowiedzi na żądanie w skonfigurowanym limicie czasu ({0}). Czas wyznaczony dla tej operacji mógł być częścią dłuższego limitu czasu. Powodem może być nieukończone przetwarzanie operacji lub niezdolność usługi do wysłania komunikatu odpowiedzi. Należy rozważyć zwiększenie limitu czasu operacji (przez rzutowanie kanału/serwera proxy na element IContextChannel i ustawienie właściwości OperationTimeout) i upewnić się, że usługa może nawiązać połączenie z klientem.
pt_br: Essa operação de solicitação não recebeu nenhuma resposta no tempo limite configurado ({0}). O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior. Isso pode acontecer porque o serviço ainda está processando a operação ou porque o serviço não conseguiu enviar uma mensagem de resposta. Considere aumentar o tempo limite da operação (difundindo o canal/proxy para IContextChannel e definindo a propriedade OperationTimeout) e verificar se o serviço pode conectar-se ao cliente.
tr: Bu istek işlemi, yapılandırılan zaman aşımı süresi ({0}) içinde bir yanıt almadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir. Bunun nedeni, hizmetin işlemi hala işlemesi ya da hizmetin bir yanıt iletisi gönderememiş olması olabilir. İşlem zaman aşımını artırmayı deneyin (Kanalı/proxy'yi IContextChannel'a atayarak ve OperationTimeout özelliğini ayarlayarak) ve hizmetin istemciye bağlanabildiğinden emin olun.
zh_hans: 该请求操作在配置的超时({0})内未收到回复。分配给此操作的时间可能比超时长。这可能由于服务仍在处理操作或服务无法发送回复消息。请考虑增加操作超时(将通道/代理转换为 IContextChannel 并设置 OperationTimeout 属性)并确保服务能够连接到客户端。
zh_hant: 此要求作業未在設定的逾時 ({0}) 內收到回覆。分配給此作業的時間，可能是較長逾時的一部分。這可能是因為服務仍然在處理作業，或服務無法傳送回覆訊息。請考慮增加作業逾時 (將通道/Proxy 傳送至 IContextChannel 並設定 OperationTimeout 內容)，並確認服務可連線至用戶端。

# SFxRequestTimedOut2
source: This request operation sent to {0} did not receive a reply within the configured timeout ({1}). The time allotted to this operation may have been a portion of a longer timeout. This may be because the service is still processing the operation or because the service was unable to send a reply message. Please consider increasing the operation timeout (by casting the channel/proxy to IContextChannel and setting the OperationTimeout property) and ensure that the service is able to connect to the client.
cs: Tato operace požadavku odeslaná na {0} nepřijala odpověď během nakonfigurovaného časového limitu ({1}). Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu. Může to být způsobeno tím, že služba stále zpracovává operaci, nebo tím, že služba nemohla odeslat zprávu s odpovědí. Zvyšte prosím časový limit operace (přetypováním kanálu / proxy serveru na IContextChannel a nastavením vlastnosti OperationTimeout) a zkontrolujte, jestli se služba může spojit s klientem.
de: Dieser an {0} gesendete Anforderungsvorgang hat innerhalb des konfigurierten Zeitlimits ({1}) keine Antwort empfangen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits. Mögliche Ursachen: Der Dienst verarbeitet den Vorgang noch, oder der Dienst konnte keine Antwortnachricht senden. Erwägen Sie, das Zeitlimit für den Vorgang zu erhöhen (indem Sie den Kanal/Proxy in IContextChannel umwandeln und die OperationTimeout-Eigenschaft festlegen), und stellen Sie sicher, dass der Dienst eine Verbindung mit dem Client herstellen kann.
es: La operación de solicitud enviada a {0} no recibió una respuesta en el tiempo de espera configurado ({1}). El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor. La razón puede ser que el servicio sigue procesando la operación o que no pudo enviar un mensaje de respuesta. Considere la posibilidad de aumentar el tiempo de espera de la operación (convirtiendo el canal/proxy en IContextChannel y estableciendo la propiedad OperationTimeout) y asegúrese de que el servicio pueda conectarse al cliente.
fr: Cette opération de requête envoyée à {0} n'a pas reçu de réponse dans le délai imparti ({1}). Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long. Ceci peut être dû au fait que le service est toujours en train de traiter l'opération ou qu'il n'a pas pu envoyer un message de réponse. Augmentez le délai d'expiration de l'opération (en castant le canal/proxy vers IContextChannel et en définissant la propriété OperationTimeout), puis vérifiez que le service peut se connecter au client.
it: Questa operazione di richiesta inviata a {0} non ha ricevuto una risposta entro il timeout configurato ({1}). È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo. Il problema potrebbe dipendere dal servizio che sta ancora elaborando l'operazione o che non è riuscito a inviare un messaggio di risposta. Provare ad aumentare il timeout dell'operazione, eseguendo il cast del canale/proxy su IContextChannel e impostando la proprietà OperationTimeout, quindi assicurarsi che il servizio sia in grado di connettersi al client.
ja: {0} に送信されたこの要求操作は、構成されたタイムアウト時間 ({1}) 内に応答を受信しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。この原因としては、サービスがまだこの操作を処理していること、またはサービスが応答メッセージを送信できなかったことが考えられます。この操作のタイムアウト時間を増やして (チャネル/プロキシを IContextChannel にキャストして OperationTimeout プロパティを設定します)、サービスがクライアントに接続できることを確認してください。
ko: {0}에 보낸 이 요청 작업이 구성된 시간 제한({1}) 내에 회신을 받지 못했습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다. 서비스가 아직 작업을 처리 중이거나 서비스가 회신 메시지를 보낼 수 없었기 때문일 수 있습니다. 채널/프록시를 IContextChannel로 캐스트하고 OperationTimeout 속성을 설정하여 작업 시간 제한을 늘리고, 서비스가 클라이언트에 연결할 수 있는지 확인하세요.
pl: Brak odpowiedzi na wysłane żądanie {0} w skonfigurowanym limicie czasu ({1}). Czas wyznaczony dla tej operacji mógł być częścią dłuższego limitu czasu. Powodem może być nieukończone przetwarzanie operacji lub niezdolność usługi do wysłania komunikatu odpowiedzi. Należy rozważyć zwiększenie limitu czasu operacji (przez rzutowanie kanału/serwera proxy na element IContextChannel i ustawienie właściwości OperationTimeout) i upewnić się, że usługa może nawiązać połączenie z klientem.
pt_br: Essa operação de solicitação para enviar para {0} não recebeu nenhuma resposta no tempo limite configurado ({1}). O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior. Isso pode acontecer porque o serviço ainda está processando a operação ou porque o serviço não conseguiu enviar uma mensagem de resposta. Considere aumentar o tempo limite da operação (difundindo o canal/proxy para IContextChannel e definindo a propriedade OperationTimeout) e verificar se o serviço pode conectar-se ao cliente.
tr: {0} öğesine gönderilen bu istek işlemi, yapılandırılan zaman aşımı süresi ({1}) içinde bir yanıt almadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir. Bunun nedeni, hizmetin işlemi hala işlemesi ya da hizmetin bir yanıt iletisi gönderememiş olması olabilir. İşlem zaman aşımını artırmayı deneyin (Kanalı/proxy'yi IContextChannel'a atayarak ve OperationTimeout özelliğini ayarlayarak) ve hizmetin istemciye bağlanabildiğinden emin olun.
zh_hans: 发送到 {0} 的请求操作在配置的超时({1})内未收到回复。分配给此操作的时间可能比超时长。这可能由于服务仍在处理操作或服务无法发送回复消息。请考虑增加操作超时(将通道/代理转换为 IContextChannel 并设置 OperationTimeout 属性)并确保服务能够连接到客户端。
zh_hant: 此傳送至 {0} 的要求作業未在設定的逾時 ({1}) 內收到回覆。分配給此作業的時間，可能是較長逾時的一部分。這可能是因為服務仍然在處理作業，或服務無法傳送回覆訊息。請考慮增加作業逾時 (將通道/Proxy 傳送至 IContextChannel 並設定 OperationTimeout 內容)，並確認服務可連線至用戶端。

# SFxResultMustBeMessage
source: The 'result' argument must be of type Message.
cs: Argument výsledek musí být typu Zpráva.
de: Das result-Argument muss vom Typ "Message" sein.
es: El argumento "result" debe ser de tipo Message.
fr: L'argument 'result' doit être de type Message.
it: L'argomento 'result' deve essere di tipo Message.
ja: 'result' 引数は Message 型であることが必要です。
ko: 'result' 인수는 메시지 형식이어야 합니다.
pl: Argument „result” musi być typu Message.
pt_br: O argumento 'result' deve ser do tipo Message.
tr: 'Result' bağımsız değişkeni Message türünde olmalıdır.
zh_hans: "result" 参数的类型必须是 Message。
zh_hant: 'result' 引數必須是類型 Message。

# SFxRpcMessageBodyPartNameInvalid
source: RPC Message {1} in operation {0} has an invalid body name {2}. It must be {3}
cs: Zpráva RPC {1} v operaci {0} má neplatný název těla {2}. Musí být {3}
de: Die RPC-Nachricht {1} im Vorgang {0} hat einen ungültigen Textkörpernamen {2}. Der Name muss {3} lauten.
es: El mensaje RPC {1} de la operación {0} tiene un nombre de cuerpo no válido {2}. Debe ser {3}
fr: Le message RPC {1} de l'opération {0} contient un nom de corps {2} non valide. Il doit être {3}
it: Il messaggio RCP {1} nell'operazione {0} contiene un nome di corpo non valido {2}. Deve essere {3}
ja: 操作 {0} の RPC メッセージ {1} には、無効な本文名 {2} があります。本文名は {3} である必要があります。
ko: {0} 작업의 RPC 메시지 {1}에 잘못된 본문 이름 {2}이(가) 있습니다. 이름이 {3}이어야 합니다.
pl: Komunikat zdalnego wywołania procedury {1} w operacji {0} ma nieprawidłową nazwę treści {2}. Powinno być: {3}
pt_br: A Mensagem RPC {1} na operação {0} tem um nome de corpo inválido {2}. Ele deve ser {3}
tr: {0} işlemindeki RPC Message {1}, geçersiz bir gövde adına sahip: {2}. Olması gereken: {3}
zh_hans: 操作 {0} 中的 RPC 消息 {1} 具有无效的正文名称 {2}。必须为 {3}
zh_hant: 作業 {0} 中的 RPC Message {1} 具有無效的內文名稱 {2}。其必須是 {3}

# SFxRpcMessageMustHaveASingleBody
source: RPC Message {1} in operation {0} must have a single MessageBodyMember.
cs: Zpráva RPC {1} v operaci {0} musí mít jeden člen MessageBodyMember.
de: Die RPC-Nachricht "{1}" im Vorgang "{0}" muss einen einzigen MessageBodyMember haben.
es: El mensaje RPC {1} de la operación {0} debe tener un único MessageBodyMember.
fr: Le message RPC {1} de l'opération {0} doit contenir un seul MessageBodyMember.
it: Il messaggio RCP {1} nell'operazione {0} deve avere un singolo MessageBodyMember.
ja: 操作 {0} の RPC メッセージ {1} には、単一の MessageBodyMember が含まれている必要があります。
ko: {0} 작업의 RPC 메시지 {1}에는 단일 MessageBodyMember가 있어야 합니다.
pl: Komunikat RPC {1} w operacji {0} musi mieć jeden element MessageBodyMember.
pt_br: A Mensagem RPC {1} na operação {0} deve ter uma única MessageBodyMember.
tr: {0} işlemindeki RPC Message {1} içinde bir tek MessageBodyMember olmalıdır.
zh_hans: 操作 {0} 中的 RPC Message {1} 必须具有单个 MessageBodyMember。
zh_hant: 作業 {0} 中的 RPC Message {1} 必須具有單一 MessageBodyMember。

# SFxServerDidNotReply
source: The server did not provide a meaningful reply; this might be caused by a contract mismatch, a premature session shutdown or an internal server error.
cs: Server neposkytl smysluplnou odpověď. Může to být způsobeno neshodou kontraktů, předčasným ukončením relace nebo vnitřní chybou serveru.
de: Der Server hat keine sinnvolle Antwort gegeben. Dies kann auf einen nicht übereinstimmenden Vertrag, ein vorzeitiges Herunterfahren der Sitzung oder durch einen internen Serverfehler zurückzuführen sein.
es: El servidor no proporcionó una respuesta significativa; la causa puede ser un contrato que no coincide, el apagado prematuro de una sesión o un error interno del servidor.
fr: Le serveur n'a pas fourni de réponse pertinente ; ceci peut être causé par des contrats qui ne correspondent pas, un arrêt prématuré de la session ou une erreur de serveur interne.
it: Il server non ha fornito una risposta significativa. Questo problema potrebbe dipendere da un contratto non corrispondente, un arresto prematuro della sessione o un errore interno del server.
ja: サーバーが意味のある応答をしませんでした。これは、コントラクトの不一致、セッションの完了前のシャットダウン、または内部サーバー エラーによって発生した可能性があります。
ko: 서버가 의미 있는 회신을 제공하지 않았습니다. 계약 불일치, 세션 도중 종료 또는 내부 서버 오류 때문일 수 있습니다.
pl: Serwer nie dostarczył sensownej odpowiedzi; może to być spowodowane niezgodnością kontraktu, przedwczesnym zamknięciem sesji lub wewnętrznym błędem serwera.
pt_br: O servidor não forneceu uma resposta significativa; isso pode ser causado por uma incompatibilidade de contrato, um fechamento prematuro da sessão ou um erro de servidor interno.
tr: Sunucu anlamlı bir yanıt sağlamadı; bunun nedeni, bir anlaşma uyumsuzluğu, zamanından önce kapatılan bir oturum veya bir iç sunucu hatası olabilir.
zh_hans: 服务器未提供有意义的回复；这可能是由协定不匹配、会话过早关闭或内部服务器错误引起的。
zh_hant: 伺服器未提供有意義的回覆; 這可能是因為合約不符、工作階段過早關閉，或是內部伺服器錯誤。
