Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SFxInvalidStreamInResponse
source: For response in operation {0} to be a stream the operation must have a single out parameter or return value whose type is Stream.
cs: Má-li být odpověď v operaci {0} datovým proudem, musí mít operace jeden parametr nebo vrácenou hodnotu typu datový proud.
de: Damit die Antwort im Vorgang {0} ein Datenstrom sein kann, muss der Vorgang über einen einzelnen out-Parameter oder Rückgabewert mit dem Typ "Stream" verfügen.
es: Para que la respuesta de la operación {0} sea una secuencia, la operación debe tener un único parámetro out o valor devuelto cuyo tipo sea Stream.
fr: Pour que la réponse dans l'opération {0} soit un flux, l'opération doit contenir uniquement un paramètre out ou une valeur retournée dont le type est Stream.
it: La risposta nell'operazione {0} può essere un flusso solo se l'operazione contiene un unico parametro o valore restituito di tipo Stream.
ja: 操作 {0} における応答をストリームにするには、この操作は Stream 型の単一の out パラメーターまたは戻り値を持つ必要があります。
ko: {0} 작업의 응답이 스트림이 되려면 이 작업은 Stream 형식의 단일 out 매개 변수 또는 반환 값이 있어야 합니다.
pl: Aby odpowiedź w operacji {0} była strumieniem, operacja musi mieć pojedynczy parametr out lub wartość zwrotną typu Stream.
pt_br: Para a resposta na operação {0} ser um fluxo, a operação deve ter um único parâmetro out ou um valor retornado cujo tipo é Stream.
tr: {0} işlemindeki yanıtın bir akış olabilmesi için işlemin, türü Stream olan bir tek parametresi ya da dönüş değeri olması gerekir.
zh_hans: 要使操作 {0} 中的响应成为流，该操作必须具有其类型为 Stream 的单个 out 参数或返回值。
zh_hant: 若作業 {0} 中的回應為資料流，作業必須具有類型為 Stream 的單一參數或傳回值。

# SFxInvalidStreamInTypedMessage
source: In order to use Streams with the MessageContract programming model, the type {0} must have a single member with MessageBodyMember attribute and the member type must be Stream.
cs: Chcete-li používat datové proudy s programovacím modelem MessageContract, typ {0} musí mít jeden člen s atributem MessageBodyMember a typ členu musí být datový proud.
de: Um für das MessageContract-Programmiermodell Datenströme verwenden zu können, muss der Typ {0} über einen einzelnen Member mit dem MessageBodyMember-Attribut verfügen, und der Membertyp muss "Stream" sein.
es: Para poder usar Streams con el modelo de programación MessageContract, el tipo {0} debe tener un único miembro con el atributo MessageBodyMember y el tipo de miembro debe ser Stream.
fr: Pour utiliser des flux avec le modèle de programmation MessageContract, le type {0} doit contenir un membre unique avec l'attribut MessageBodyMember et le type du membre doit être Stream.
it: Per usare gli elementi Stream con il modello di programmazione MessageContract, il tipo {0} deve contenere un singolo membro con attributo MessageBodyMember e il tipo di membro deve essere Stream.
ja: MessageContract プログラミング モデルで Stream を使用するには、型 {0} は MessageBodyMember 属性が含まれた単一のメンバーを持つ必要があり、メンバー型は Stream である必要があります。
ko: MessageContract 프로그래밍 모델의 스트림을 사용하려면 {0} 형식에 MessageBodyMember 특성의 단일 멤버가 있어야 하며 멤버 형식이 스트림이어야 합니다.
pl: Aby użyć strumieni z modelem programowania MessageContract, typ {0} musi mieć pojedynczą składową typu Stream z atrybutem MessageBodyMember.
pt_br: Para usar Streams com o modelo de programação MessageContract, o tipo {0} deve ter um único membro com atributo MessageBodyMember e o tipo de membro deve ser Stream.
tr: Akışları MessageContract programlama modeliyle kullanabilmek için {0} türünün, MessageBodyMember özniteliğinde bir tek üyeye sahip olması ve üye türünün Stream olması gerekir.
zh_hans: 要将 Stream 与 MessageContract 编程模型共同使用，类型 {0} 必须具有带有 MessageBodyMember 属性的单个成员，且成员类型必须为 Stream。
zh_hant: 若要在 MessageContract 程式設計模型中使用 Stream，類型 {0} 必須要有一個具有 MessageBodyMember 屬性的單一成員，且該成員類型必須是 Stream。

# SFxInvalidStreamOffsetLength
source: Buffer size must be at least {0} bytes.
cs: Velikost vyrovnávací paměti musí být alespoň {0} bajtů.
de: Die Puffergröße muss mindestens {0} Bytes betragen.
es: El tamaño del búfer debe ser de {0} bytes como mínimo.
fr: La taille de la mémoire tampon doit être au moins {0} octets.
it: Le dimensioni del buffer devono essere pari ad almeno {0} byte.
ja: バッファー サイズは {0} バイト以上である必要があります。
ko: 버퍼 크기는 최소한 {0}바이트 이상이어야 합니다.
pl: Rozmiar buforu musi wynosić co najmniej {0} B.
pt_br: O tamanho do buffer deve ser de pelo menos {0} bytes.
tr: Arabellek boyutu en az {0} bayt olmalıdır.
zh_hans: 缓冲区大小至少必须为 {0} 字节。
zh_hant: 緩衝區大小至少必須 {0} 個位元組。

# SFxInvalidUseOfPrimitiveOperationFormatter
source: The PrimitiveOperationFormatter was given a parameter or return type which it does not support.
cs: Třídě PrimitiveOperationFormatter byl zadán parametr nebo vrácená hodnota, kterou nepodporuje.
de: An den PrimitiveOperationFormatter wurde ein Parameter oder Rückgabetyp übergeben, den er nicht unterstützt.
es: PrimitiveOperationFormatter recibió un parámetro o tipo de valor devuelto que no admite.
fr: PrimitiveOperationFormatter ne prend pas en charge un paramètre ou un type de retour qui lui a été attribué.
it: A PrimitiveOperationFormatter è stato assegnato un parametro o un tipo restituito che non è supportato.
ja: PrimitiveOperationFormatter に、サポートされていないパラメーターまたは戻り値の型が指定されました。
ko: 지원하지 않는 매개 변수 또는 반환 형식을 PrimitiveOperationFormatter에 제공했습니다.
pl: Metodzie PrimitiveOperationFormatter przekazano nieobsługiwany parametr lub zwracany typ.
pt_br: Não há suporte para um parâmetro ou tipo de retorno fornecido para PrimitiveOperationFormatter.
tr: PrimitiveOperationFormatter öğesine desteklemediği bir parametre ya da dönüş türü aktarıldı.
zh_hans: PrimitiveOperationFormatter 不支持为其指定的参数或返回类型。
zh_hant: 給與 PrimitiveOperationFormatter 不支援的參數或傳回型別。

# SFxInvalidXmlAttributeInBare
source: XmlSerializer attribute {0} is not valid in {1}. Only XmlElement, XmlArray, XmlArrayItem and XmlAnyElement attributes are supported in MessageContract when IsWrapped is false.
cs: Atribut XmlSerializer {0} není platný v {1}. Když je atribut IsWrapped nastaven na hodnotu nepravda, jsou v kontraktu MessageContract podporovány pouze atributy XmlElement, XmlArray, XmlArrayItem a XmlAnyElement.
de: Das XmlSerializer-Attribut {0} ist in {1} nicht gültig. Nur die Attribute XmlElement, XmlArray, XmlArrayItem und XmlAnyElement werden in MessageContract unterstützt, wenn IsWrapped auf "false" gesetzt wurde.
es: El atributo XmlSerializer {0} no es válido en {1}. solo se admiten los atributos XmlElement, XmlArray, XmlArrayItem y XmlAnyElement en MessageContract cuando IsWrapped es false.
fr: L'attribut XmlSerializer {0} est non valide dans {1}. Seuls les attributs XmlElement, XmlArray, XmlArrayItem et XmlAnyElement sont pris en charge dans MessageContract quand IsWrapped a la valeur false.
it: L'attributo XmlSerializer {0} non è valido in {1}. In MessageContract sono supportati solo gli attributi XmlElement, XmlArray, XmlArrayItem e XmlAnyElement quando IsWrapped è false.
ja: XmlSerializer 属性 {0} は、{1} 内では有効ではありません。IsWrapped が false の場合、MessageContract でサポートされているのは、XmlElement、XmlArray、XmlArrayItem、および XmlAnyElement 属性だけです。
ko: XmlSerializer 특성 {0}이(가) {1}에서 잘못되었습니다. IsWrapped가 false일 경우 XmlElement, XmlArray, XmlArrayItem 및 XmlAnyElement 특성만 MessageContract에서 지원합니다.
pl: Atrybut {0} obiektu XmlSerializer nie jest prawidłowy w {1}. Kiedy atrybut IsWrapped ma wartość false, w elemencie MessageContract obsługiwane są tylko atrybuty XmlElement, XmlArray, XmlArrayItem i XmlAnyElement.
pt_br: O atributo XmlSerializer {0} é inválido em {1}. Somente há suporte para os atributos XmlElement, XmlArray, XmlArrayItem e XmlAnyElement em MessageContract quando IsWrapped é false.
tr: XmlSerializer özniteliği {0}, {1} içinde geçerli değil. IsWrapped false olduğunda MessageContract içinde yalnızca XmlElement, XmlArray, XmlArrayItem ve XmlAnyElement öznitelikleri desteklenir.
zh_hans: XmlSerializer 属性 {0} 在 {1} 中无效。当 IsWrapped 为 False 时，在 MessageContract 中仅支持 XmlElement、XmlArray、XmlArrayItem 以及 XmlAnyElement 属性。
zh_hant: XmlSerializer 屬性 {0} 在 {1} 中無效。當 IsWrapped 為 false 時，MessageContract 中僅支援 XmlElement、XmlArray、XmlArrayItem 和 XmlAnyElement 屬性。

# SFxInvalidXmlAttributeInWrapped
source: XmlSerializer attribute {0} is not valid in {1}. Only XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute and XmlAnyElement attributes are supported when IsWrapped is true.
cs: Atribut XmlSerializer {0} není platný v {1}. Když je atribut IsWrapped nastaven na hodnotu true, jsou podporovány pouze atributy XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute a XmlAnyElement.
de: Das XmlSerializer-Attribut {0} ist in {1} nicht gültig. Nur die Attribute XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute und XmlAnyElement werden unterstützt, wenn IsWrapped auf "true" gesetzt wurde.
es: El atributo XmlSerializer {0} no es válido en {1}. solo se admiten los atributos mlElement, XmlArray, XmlArrayItem, XmlAnyAttribute y XmlAnyElement cuando IsWrapped es true.
fr: L'attribut XmlSerializer {0} est non valide dans {1}. Seuls les attributs XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute et XmlAnyElement sont pris en charge quand IsWrapped a la valeur true.
it: L'attributo XmlSerializer {0} non è valido in {1}. Quando IsWrapped è true, sono supportati solo gli attributi Only XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute e XmlAnyElement.
ja: XmlSerializer 属性 {0} は、{1} 内では有効ではありません。IsWrapped が true の場合、サポートされているのは、XmlElement、XmlArray、XmlArrayItem、XmlAnyAttribute、および XmlAnyElement 属性だけです。
ko: XmlSerializer 특성 {0}이(가) {1}에서 잘못되었습니다. IsWrapped가 true일 경우 XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute 및 XmlAnyElement 특성만 지원합니다.
pl: Atrybut {0} obiektu XmlSerializer nie jest prawidłowy w {1}. Kiedy atrybut IsWrapped ma wartość true, obsługiwane są tylko atrybuty XmlElement, XmlArray, XmlArrayItem i XmlAnyElement.
pt_br: O atributo XmlSerializer {0} é inválido em {1}. Somente há suporte para os atributos XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute e XmlAnyElement quando IsWrapped é true.
tr: XmlSerializer özniteliği {0}, {1} içinde geçerli değil. IsWrapped true olduğunda yalnızca XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute ve XmlAnyElement öznitelikleri desteklenir.
zh_hans: XmlSerializer 属性 {0} 在 {1} 中无效。当 IsWrapped 为 True 时，仅支持 XmlElement、XmlArray、XmlArrayItem、XmlAnyAttribute 以及 XmlAnyElement 属性。
zh_hant: XmlSerializer 屬性 {0} 在 {1} 中無效。當 IsWrapped 為 true 時，僅支援 XmlElement、XmlArray、XmlArrayItem、XmlAnyAttribute 和 XmlAnyElement 屬性。

# SFxKnownTypeAttributeInvalid1
source: {0} must contain either a single ServiceKnownTypeAttribute that refers to a method or a set of ServiceKnownTypeAttributes, each specifying a valid type
cs: {0} musí obsahovat jednu třídu ServiceKnownTypeAttribute, která odkazuje na metodu nebo na sadu tříd ServiceKnownTypeAttributes, z nichž každá určuje platný typ
de: {0} muss entweder ein einzelnes ServiceKnownTypeAttribute enthalten, das auf eine Methode verweist, oder eine Gruppe von ServiceKnownTypeAttributes, die jeweils einen gültigen Typ angeben.
es: {0} debe contener un único atributo ServiceKnownTypeAttribute que haga referencia a un método o a un conjunto de atributos ServiceKnownTypeAttributes, cada uno de los cuales especifique un tipo válido
fr: {0} doit contenir un seul ServiceKnownTypeAttribute qui fait référence à une méthode ou à un ensemble d'attributs ServiceKnownTypeAttributes, chacun spécifiant un type valide
it: {0} deve contenere un singolo elemento ServiceKnownTypeAttribute che fa riferimento a un metodo oppure un set di elementi ServiceKnownTypeAttribute, ognuno dei quali specifica un tipo valido
ja: {0} には、メソッドを参照する単一の ServiceKnownTypeAttribute か、または有効な型が指定されている ServiceKnownTypeAttributes のセットのいずれかが含まれている必要があります。
ko: {0}에는 메서드를 참조하는 단일 ServiceKnownTypeAttribute 또는 각각 적합한 형식을 지정하는 ServiceKnownTypeAttributes 세트가 있어야 합니다.
pl: Element {0} musi zawierać pojedynczy atrybut ServiceKnownTypeAttribute odwołujący się do metody lub zestawu atrybutów ServiceKnownTypeAttributes, z których każdy określa prawidłowy typ
pt_br: {0} deve conter um único ServiceKnownTypeAttribute que se refere a um método ou a um conjunto de ServiceKnownTypeAttributes, cada uma deles especificando um tipo válido
tr: {0}, her biri geçerli tür belirten, bir metoda başvuran bir tek ServiceKnownTypeAttribute öğesi ya da bir ServiceKnownTypeAttributes kümesi içermelidir
zh_hans: {0} 必须包含引用方法的单个 ServiceKnownTypeAttribute 或包含一组 ServiceKnownTypeAttribute 并为每个指定一个有效类型
zh_hant: {0} 必須包含參考方法的單一 ServiceKnownTypeAttribute，或是一組 ServiceKnownTypeAttribute，兩者皆必須指定有效的類型

# SFxKnownTypeAttributeReturnType3
source: The return type of method {1} in type {2} must be IEnumerable<Type> to be used by ServiceKnownTypeAttribute in {0}
cs: Vrácený typ metody {1} v typu {2} musí být třídou IEnumerable<Type>, aby jej mohla použít třída ServiceKnownTypeAttribute v {0}
de: Der Rückgabetyp der Methode {1} im Typ {2} muss IEnumerable<Type> sein, um vom ServiceKnownTypeAttribute in {0} verwendet werden zu können.
es: El tipo de valor devuelto del método {1} en el tipo {2} debe ser IEnumerable<Type> para que lo use el atributo ServiceKnownTypeAttribute en {0}
fr: Le type de retour de la méthode {1} dans le type {2} doit être un IEnumerable<Type> à utiliser par ServiceKnownTypeAttribute dans {0}
it: Il tipo restituito del metodo {1} nel tipo {2} deve essere IEnumerable<Type> per poter essere usato da ServiceKnownTypeAttribute in {0}
ja: 型 {1} のメソッド {2} の戻り値の型は、{0} の ServiceKnownTypeAttribute で使用できるように、IEnumerable<Type>> の形式である必要があります
ko: {0}의 ServiceKnownTypeAttribute에서 사용하려면 {2} 형식인 {1} 메서드의 반환 형식이 IEnumerable<Type>이어야 합니다.
pl: Zwracanym typem metody {1} w typie {2} musi być typ IEnumerable<Type>, aby mógł zostać użyty przez element ServiceKnownTypeAttribute w {0}
pt_br: O tipo de retorno do método {1} no tipo {2} deve ser IEnumerable<Type> para ser usado por ServiceKnownTypeAttribute em {0}
tr: {2} türündeki {1} dönüş türünün, {0} içinde ServiceKnownTypeAttribute tarafından kullanılabilmesi için IEnumerable<Type> olması gerekir
zh_hans: 类型 {2} 中方法 {1} 的返回类型必须是由 {0} 中的 ServiceKnownTypeAttribute 使用的 IEnumerable<Type>
zh_hant: 類型 {2} 中方法 {1} 的傳回型別必須是 IEnumerable<Type>，{0} 中的 ServiceKnownTypeAttribute 才能使用它

# SFxKnownTypeAttributeUnknownMethod3
source: ServiceKnownTypeAttribute in {0} refers to a method {1} that does not exist in type {2}
cs: Třída ServiceKnownTypeAttribute v {0} odkazuje na metodu {1}, která neexistuje v typu {2}.
de: ServiceKnownTypeAttribute in {0} verweist auf eine Methode {1}, die nicht im Typ {2} vorhanden ist.
es: El atributo ServiceKnownTypeAttribute en {0} hace referencia a un método {1} que no existe en el tipo {2}
fr: ServiceKnownTypeAttribute dans {0} fait référence à une méthode {1} qui n'existe pas dans le type {2}
it: L'elemento ServiceKnownTypeAttribute in {0} fa riferimento a un metodo {1} che non esiste nel tipo {2}
ja: {0} の ServiceKnownTypeAttribute は、型 {2} に存在しないメソッド {1} を参照しています
ko: {0}의 ServiceKnownTypeAttribute가 {2} 형식에 없는 {1} 메서드를 참조합니다.
pl: Element ServiceKnownTypeAttribute w elemencie {0} odwołuje się do metody {1}, która nie występuje w typie {2}
pt_br: O ServiceKnownTypeAttribute em {0} refere-se a um método {1} que não existe no tipo {2}
tr: {0} içindeki ServiceKnownTypeAttribute, {2} türünde mevcut olmayan bir {1} metoduna başvuruyor
zh_hans: {0} 中的 ServiceKnownTypeAttribute 引用了类型 {2} 中不存在的方法 {1}
zh_hant: {0} 中的 ServiceKnownTypeAttribute 所參考的方法 {1} 不存在於類型 {2} 中

# SFxKnownTypeNull
source: KnownType cannot be null in operation {0}
cs: Třída KnownType nesmí mít hodnotu NULL v operaci {0}
de: KnownType darf im Vorgang {0} nicht NULL sein.
es: El valor de KnownType no puede ser nulo en la operación {0}
fr: KnownType ne peut pas avoir une valeur null dans l'opération {0}
it: KnownType non può essere Null nell'operazione {0}
ja: KnownType は操作 {0} では null にできません
ko: KnownType은 {0} 작업에서 null일 수 없습니다.
pl: Element KnownType w operacji {0} nie może być równy null
pt_br: KnownType não pode ser nulo na operação {0}
tr: KnownType, {0} işleminde null olamaz
zh_hans: KnownType 在操作 {0} 中不能为 null
zh_hant: 作業 {0} 中的 KnownType 不可為 null

# SFxMessageContractAttributeRequired
source: Cannot create a typed message from type '{0}'. The functionality only valid for types decorated with MessageContractAttribute.
cs: Nelze vytvořit zadanou zprávu z typu {0}. Funkce je platná pouze pro typy dekorované třídou MessageContractAttribute.
de: Eine typisierte Nachricht vom Typ "{0}" kann nicht erstellt werden. Die Funktion ist nur gültig für Typen, die über das MessageContractAttribute verfügen.
es: No se puede crear un mensaje con tipo a partir del tipo '{0}'. La funcionalidad sólo es válida para los tipos que contienen el atributo MessageContractAttribute.
fr: Impossible de créer un message typé à partir du type '{0}'. La fonctionnalité est valide uniquement pour les types décorés avec MessageContractAttribute.
it: Impossibile creare un messaggio tipizzato dal tipo '{0}'. La funzionalità è valida solo per i tipi decorati con MessageContractAttribute.
ja: 型 '{0}' の型指定されたメッセージを作成できません。この機能は、MessageContractAttribute で修飾された型でのみ有効です。
ko: '{0}' 유형에서 형식화된 메시지를 만들 수 없습니다. 이 기능은 MessageContractAttribute로 데코레이트된 유형에 대해서만 사용할 수 있습니다.
pl: Nie można utworzyć komunikatu o określonym typie z typu „{0}”. Funkcjonalność prawidłowa jedynie dla typów oznaczonych atrybutem MessageContractAttribute.
pt_br: Não é possível criar uma mensagem tipada a partir do tipo '{0}'. A funcionalidade só é válida para tipos decorados com MessageContractAttribute.
tr: '{0}' türünden yazılı bir ileti oluşturulamaz. İşlev yalnızca MessageContractAttribute bulunan türler için geçerlidir.
zh_hans: 无法从类型“{0}”创建键入的消息。该功能仅对使用 MessageContractAttribute 修饰的类型有效。
zh_hant: 無法從類型 '{0}' 建立類型訊息。只有針對具有 MessageContractAttribute 的類型，此功能才有效。

# SFxMessageContractBaseTypeNotValid
source: The type {1} defines a MessageContract but also derives from a type {0} that does not define a MessageContract. All of the objects in the inheritance hierarchy of {1} must defines a MessageContract.
cs: Typ {1} definuje třídu MessageContract, ale také se odvozuje od typu {0}, který nedefinuje třídu MessageContract. Všechny objekty v hierarchii dědičnosti pro {1} musejí definovat třídu MessageContract.
de: Der Typ {1} definiert einen MessageContract, wird aber auch von einem Typ {0} abgeleitet, der keinen MessageContract definiert. Alle Objekte in der Vererbungshierarchie von {1} müssen als MessageContract definiert sein.
es: El tipo {1} define MessageContract, pero también se deriva de un tipo {0} que no define MessageContract. Todos los objetos de la jerarquía de herencia de {1} deben definir MessageContract.
fr: Le type {1} définit un MessageContract mais dérive également d'un type {0} qui ne définit pas de MessageContract. Tous les objets de la hiérarchie d'héritage de {1} doivent définir un MessageContract.
it: Il tipo {1} definisce un elemento MessageContract, ma deriva da un tipo {0} che non definisce un tale elemento. Tutti gli oggetti nella gerarchia di ereditarietà di {1} devono definire un elemento MessageContract.
ja: 型 {1} は MessageContract を定義していますが、その派生元である型 {0} は MessageContract を定義していません。{1} の継承階層内のすべてのオブジェクトは MessageContract を定義している必要があります。
ko: {1} 형식은 MessageContract를 정의하며, MessageContract를 정의하지 않는 {0} 형식에서도 파생됩니다. {1}의 상속 계층 구조에 속한 모든 개체가 MessageContract를 정의해야 합니다.
pl: Typ {1} definiuje kontrakt MessageContract, ale również jest wyliczany z typu {0}, który nie definiuje kontraktu MessageContract. Wszystkie obiekty w hierarchii dziedziczenia {1} muszą definiować kontrakt MessageContract.
pt_br: O tipo {1} define uma MessageContract, mas também deriva de um tipo {0} que não define uma MessageContract. Todos os objetos na hierarquia de herança de {1} devem definir um MessageContract.
tr: {1} türü bir MessageContract tanımlıyor, ancak aynı zamanda bir MessageContract tanımlamayan bir {0} türünden türetiliyor. {1} devralma hiyerarşisinde bulunan tüm nesnelerin bir MessageContract tanımlaması gerekir.
zh_hans: 类型 {1} 定义了 MessageContract，但它是从未定义 MessageContract 的类型 {0} 派生的。{1} 的继承层次结构中的所有对象都必须定义 MessageContract.
zh_hant: 類型 {1} 定義 MessageContract，但也衍生自未定義 MessageContract 的類型 {0}。{1} 繼承階層中的所有物件，皆必須定義 MessageContract。

# SFxMessageContractRequiresDefaultConstructor
source: The message cannot be deserialized into MessageContract type {0} since it does not have a default (parameterless) constructor.
cs: Zprávu nelze rekonstruovat do typu MessageContract {0}, protože nemá výchozí konstruktor (bez parametrů).
de: Die Nachricht kann nicht in den MessageContract-Typ {0} deserialisiert werden, da sie nicht über einen (parameterlosen) Standardkonstruktor verfügt.
es: El mensaje no se puede deserializar en el tipo de MessageContract {0} porque no tiene un constructor predeterminado (sin parámetros).
fr: Impossible de désérialiser le message en type MessageContract {0}, car il n'a pas de constructeur par défaut (sans paramètre).
it: Non è possibile deserializzare il messaggio nel tipo {0} di MessageContract perché non contiene un costruttore predefinito (senza parametri).
ja: このメッセージは、既定の (パラメーターのない) コンストラクターを持たないため、シリアル化解除して MessageContract 型 {0} に変換できません。
ko: 매개 변수가 없는 기본 생성자가 없으므로 MessageContract 형식 {0}(으)로 메시지를 deserialize할 수 없습니다.
pl: Nie można zdeserializować komunikatu do typu {0} kontraktu MessageContract, ponieważ nie ma domyślnego konstruktora (bez parametrów).
pt_br: A mensagem não pode ser desserializada no MessageContract tipo {0} porque ela não tem um construtor (sem parâmetros) padrão.
tr: Varsayılan (parametresiz) bir oluşturucuya sahip olmadığından iletinin {0} MessageContract türüne serileştirme dağıtımı yapılamaz.
zh_hans: 消息无法反序列化到 MessageContract 类型 {0} 中，因为它没有默认(无参数)构造函数。
zh_hant: 訊息沒有預設 (無參數) 建構函式，因此無法還原序列化成為 MessageContract 類型 {0}。

# SFxMessagePartDescriptionMissingType
source: Instance of MessagePartDescription Name='{0}' Namespace='{1}' cannot be used in this context: required 'Type' property was not set.
cs: Instanci Název={0} Obor názvů={1} třídy MessagePartDescription nelze použít v tomto kontextu: požadovaná vlastnost Typ nebyla nastavena.
de: Die Instanz von MessagePartDescription Name="{0}", Namespace="{1}" kann nicht in diesem Kontext verwendet werden: Die erforderliche Type-Eigenschaft wurde nicht festgelegt.
es: La instancia de MessagePartDescription Name="{0}" Namespace="{1}" no se puede usar en este contexto: no se estableció la propiedad "Type" requerida.
fr: L'instance de MessagePartDescription Name='{0}' Namespace='{1}' ne peut pas être utilisée dans ce contexte : la propriété 'Type' nécessaire n'est pas définie.
it: Non è possibile usare l'istanza di MessagePartDescription Name='{0}' Namespace='{1}' in questo contesto: la proprietà obbligatoria 'Type' non è stata impostata.
ja: MessagePartDescription Name='{0}' Namespace='{1}' のインスタンスは、このコンテキストでは使用できません。必要な 'Type' プロパティが設定されませんでした。
ko: 이름이 '{0}'이고 네임스페이스가 '{1}'인 MessagePartDescription의 인스턴스를 이 컨텍스트에서 사용할 수 없습니다. 필수 'Type' 속성이 설정되지 않았습니다.
pl: Wystąpienie elementu MessagePartDescription o nazwie Name=„{0}” i przestrzeni nazw Namespace=„{1}” nie może zostać użyte w tym kontekście: wymagana właściwość „Type” nie została ustawiona.
pt_br: A instância de MessagePartDescription Nome='{0}' Namespace='{1}' não pode ser usada neste contexto: a propriedade 'Type' necessária não foi definida.
tr: MessagePartDescription Name='{0}' Namespace='{1}' örneği bu bağlamda kullanılamaz: Gereken 'Type' özelliği ayarlanmamış.
zh_hans: MessagePartDescription Name=“{0}”Namespace=“{1}”的实例无法用于此上下文: 未设置所需的 "Type" 属性。
zh_hant: MessagePartDescription Name='{0}' Namespace='{1}' 的執行個體無法用於此內容中: 未設定必要的 'Type' 屬性。
