Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# ReceivedResponseBeforeRequestExceptionString
source: The remote endpoint returned a {0}Response when the {0} request had not been sent. This is a WS-ReliableMessaging protocol violation. The reliable session was faulted.
cs: Vzdálený koncový bod vrátil odpověď {0}Response, i když požadavek {0} nebyl odeslán. To je narušení protokolu WS-ReliableMessaging. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt hat eine {0}Response zurückgegeben, als die {0}-Anforderung noch nicht gesendet war. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto devolvió una {0}respuesta cuando la solicitud {0} no se había enviado. Ésta es una infracción del protocolo WS-ReliableMessaging. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant a renvoyé une {0}Response alors que la demande {0} n'avait pas été envoyée. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session fiable a généré une erreur.
it: L'endpoint remoto ha restituito {0}Response quando la richiesta {0} non era stata inviata. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、{0} 要求が送信されなかったにもかかわらず {0}Response を返しました。これは WS-ReliableMessaging のプロトコル違反です。信頼できるセッションは途中終了されました。
ko: {0} 요청을 보내지 않았을 때 원격 끝점이 {0}Response를 반환했습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy zwrócił odpowiedź {0}Response, mimo że żądanie {0} nie zostało wysłane. Stanowi to naruszenie protokołu WS-ReliableMessaging. Wystąpił błąd niezawodnej sesji.
pt_br: O ponto de extremidade remoto retornou um {0}Response quando a solicitação de {0} não foi enviada. Trata-se de uma violação do protocolo WS-ReliableMessaging. Falha na sessão confiável.
tr: {0} isteği gönderilmediğinde uzak bitiş noktası bir {0}Response döndürdü. Bu, WS-ReliableMessaging protokolünün ihlalidir. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: {0} 请求尚未发送时，远程终结点即返回了 {0}Response。这违反了 WS-ReliableMessaging 协议。可靠会话出错。
zh_hant: 遠端端點在 {0} 要求尚未傳送之前傳回 {0}Response。這違反 WS-ReliableMessaging 通訊協定。可靠工作階段發生錯誤。

# ReceivedResponseBeforeRequestFaultString
source: The {0}Response was received when the {0} request had not been sent. This is a WS-ReliableMessaging protocol violation. The reliable session cannot continue.
cs: Byla přijata odpověď {0} Response, i když požadavek {0} nebyl odeslán. To je narušení protokolu WS-ReliableMessaging. Stabilní relace nemůže pokračovat.
de: Die {0}Response wurde empfangen, als die {0}-Anforderung noch nicht gesendet war. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: La {0}respuesta se recibió cuando la solicitud {0} no se había enviado. Esta es una infracción del protocolo WS-ReliableMessaging. La sesión confiable no puede continuar.
fr: La {0}Response a été reçue alors que la demande {0} n'avait pas été envoyée. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session fiable ne peut pas continuer.
it: {0}Response ricevuta quando la richiesta {0} non era stata inviata. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Impossibile continuare la sessione.
ja: {0} 要求が送信されなかったにもかかわらず {0}Response が受信されました。これは WS-ReliableMessaging のプロトコル違反です。信頼できるセッションは続行できません。
ko: {0} 요청을 보내지 않았을 때 {0}Response를 받았습니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Odebrano odpowiedź {0}Response, mimo że żądanie {0} nie zostało wysłane. Stanowi to naruszenie protokołu WS-ReliableMessaging. Nie można kontynuować działania niezawodnej sesji.
pt_br: O {0}Response foi recebido quando a solicitação {0} não foi enviada. Trata-se de uma violação do protocolo WS-ReliableMessaging. A sessão confiável não pode continuar.
tr: {0} isteği gönderilmediğinde {0}Response alındı. Bu, WS-ReliableMessaging protokolünün ihlalidir. Güvenilir oturum devam edemiyor.
zh_hans: {0} 请求尚未发送时，即收到了 {0}Response。这违反了 WS-ReliableMessaging 协议。可靠会话无法继续。
zh_hant: 在 {0} 要求尚未傳送之前收到 {0}Response。這違反 WS-ReliableMessaging 通訊協定。可靠工作階段無法繼續。

# RemoteIdentityFailedVerification
source: The following remote identity failed verification: '{0}'.
cs: Ověření následující vzdálené identity se nezdařilo: {0}.
de: Fehler bei der Überprüfung der folgenden Remoteidentität: "{0}".
es: No se pudo comprobar la siguiente identidad remota: "{0}".
fr: Échec de l'identité distante suivante durant la vérification : '{0}'.
it: La verifica non è riuscita per l'identità remota seguente: '{0}'.
ja: 次のリモート ID を確認できませんでした。'{0}'。
ko: 다음 원격 ID를 확인하지 못했습니다. '{0}'.
pl: Nie można zweryfikować następującej tożsamości zdalnej: „{0}”.
pt_br: Falha na verificação da seguinte identidade remota: '{0}'.
tr: Aşağıdaki uzak kimlik, kimlik doğrulamasında başarısız oldu: '{0}'.
zh_hans: 未能确认以下远程标识:“{0}”。
zh_hant: 下列遠端身分識別驗證失敗: '{0}'。

# Remoting_SOAPInteropxsdInvalid
source: Soap Parse error, xsd:type '{0}' invalid {1}
cs: Chyba při analýze Soap. Typ XSD: {0}, neplatné: {1}
de: Soap-Verarbeitungsfehler, xsd:type "{0}" ungültig {1}.
es: Error de análisis de Soap, xsd:tipo '{0}' no válido {1}
fr: Erreur d'analyse soap, xsd:type '{0}' {1} non valide
it: Errore di analisi di Soap, xsd:type '{0}' non valido {1}
ja: SOAP 解析エラーです。xsd:type '{0}' 無効な {1}
ko: SOAP 구문 분석 오류입니다. xsd:type '{0}'이(가) 올바르지 않습니다. {1}
pl: Błąd analizy Soap, xsd:typ '{0}' nieprawidłowy {1}
pt_br: Erro de análise de SOAP, xsd:type '{0}' inválido {1}
tr: Soap ayrıştırma hatası, xsd:type '{0}' geçersiz {1}
zh_hans: Soap 分析错误，xsd:type“{0}”无效的 {1}
zh_hant: Soap 剖析錯誤，xsd:type '{0}' 無效的 {1}

# ReplyAlreadySent
source: A reply has already been sent from this RequestContext.
cs: Z této třídy RequestContext již byla odeslána odpověď.
de: Es wurde bereits eine Antwort von diesem RequestContext gesendet.
es: Ya se envió una respuesta desde este RequestContext.
fr: Une réponse a déjà été envoyée à partir de ce RequestContext.
it: È già stata inviata una richiesta da questo elemento RequestContext.
ja: この RequestContext からは、既に返信が送信されています。
ko: 이 RequestContext에서 회신이 이미 보내졌습니다.
pl: Z tego elementu RequestContext już wysłano odpowiedź.
pt_br: Uma resposta já foi enviada do RequestContext.
tr: Bu RequestContext öğesinden zaten bir yanıt gönderilmiş.
zh_hans: 已经从此 RequestContext 中发送了回复。
zh_hant: 已從此 RequestContext 傳送回覆。

# ReplyMissingAcknowledgement
source: The remote endpoint failed to include a required SequenceAcknowledgement header on a reliable reply message. The reliable session was faulted.
cs: Koncovému bodu se nezdařilo zahrnout požadované záhlaví SequenceAcknowledgement do důvěryhodné zprávy odpovědi. Ve stabilní relaci došlo k chybě.
de: Der Remoteendpunkt konnte einen erforderlichen SequenceAcknowledgement-Header nicht in eine zuverlässige Antwortnachricht einschließen. Die zuverlässige Sitzung war nicht erfolgreich.
es: El extremo remoto no pudo incluir un encabezado SequenceAcknowledgement requerido en un mensaje de respuesta confiable. Se generó un error en la sesión confiable.
fr: Le point de terminaison distant n'a pas réussi à inclure un en-tête SequenceAcknowledgement sur un message de réponse fiable. La session fiable a généré une erreur.
it: L'endpoint remoto non ha restituito un'intestazione SequenceAcknowledgement richiesta su un messaggio di risposta affidabile. Sessione affidabile non riuscita.
ja: リモート エンドポイントは、必要な SequenceAcknowledgement ヘッダーを信頼性の高い応答メッセージに組み込むことができませんでした。信頼できるセッションは途中終了されました。
ko: 원격 끝점이 신뢰할 수 있는 회신 메시지에서 필수 SequenceAcknowledgement 헤더를 포함하지 못했습니다. 신뢰할 수 있는 세션에 오류가 발생했습니다.
pl: Zdalny punkt końcowy nie dołączył wymaganego nagłówka SequenceAcknowledgement do komunikatu niezawodnej odpowiedzi. Wystąpił błąd w niezawodnej sesji.
pt_br: Falha do ponto de extremidade remoto ao incluir um cabeçalho SequenceAcknowledgement necessário em uma mensagem de resposta confiável. Falha na sessão confiável.
tr: Uzak bitiş noktası, güvenilir bir yanıt iletisine gereken bir SequenceAcknowledgement üst bilgisi ekleyemedi. Güvenilir oturum hatayla sonlandırıldı.
zh_hans: 远程终结点无法在可靠的答复消息上包括需要的 SequenceAcknowledgement 标头。可靠的会话出错。
zh_hant: 遠端端點無法在可靠回覆訊息中包含必要的 SequenceAcknowledgement 標頭。可靠工作階段發生錯誤。

# RequestChannelSendTimedOut
source: The request channel timed out attempting to send after {0}. Increase the timeout value passed to the call to Request or increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
cs: Kanálu požadavku skončila platnost při pokusu o odeslání po {0}. Zvyšte hodnotu časového limitu předanou volání požadavku, nebo zvyšte hodnotu SendTimeout na vazbě. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Anforderungskanal ist während eines Sendeversuchs nach {0} ein Timeout aufgetreten. Erhöhen Sie den an den Aufruf von "Request" übergebenen Zeitlimitwert, oder erhöhen Sie den SendTimeout-Wert für die Bindung. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: El canal de solicitud agotó el tiempo de espera para intentar enviar después de {0}. Aumente el valor de tiempo de espera pasado a la llamada a Request, o bien aumente el valor de SendTimeout en el enlace. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Le canal de requête a dépassé le délai imparti en tentant d'envoyer après {0}. Augmentez la valeur du délai d'expiration passée à l'appel de Request ou augmentez la valeur SendTimeout sur Binding. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout del canale di richiesta dopo {0} durante il tentativo di invio. Aumentare il valore del timeout passato alla chiamata a Request o aumentare il valore di SendTimeout nell'elemento Binding. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 要求チャネルは、送信を試行してから {0} 後にタイムアウトしました。Request の呼び出しに渡すタイムアウト値を増やすか、Binding の SendTimeout 値を増やしてください。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 요청 채널이 보내기를 시도하는 동안 {0} 이후에 시간 초과되었습니다. Request의 호출에 전달되는 시간 제한 값을 늘리거나 바인딩에서 SendTimeout 값을 늘리세요. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Kanał żądania przekroczył limit czasu, próbując wysłać po {0}. Zwiększ wartość limitu czasu podawaną do wywołania elementu Request lub zwiększ wartość właściwości SendTimeout w powiązaniu. Czas przeznaczony na tę operację może być częścią większego limitu czasu.
pt_br: O canal de solicitação atingiu o tempo limite ao tentar o envio após {0}. Aumente o valor de tempo limite passado à chamada para Request ou aumente o valor de SendTimeout na Associação. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: İstek kanalı, göndermeyi denerken {0} sonra zaman aşımına uğradı. Request çağrısına geçirilen zaman aşımı değerini artırın ya da Binding üstündeki SendTimeout değerini artırın. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 请求通道在 {0} 以后尝试发送超时。增加传递给请求调用的超时值，或增加绑定上的 SendTimeout 值。分配给此操作的时间可能比超时长。
zh_hant: 要求通道在嘗試傳送時於 {0} 之後逾時。請增加傳送至要求呼叫的逾時值，或增加繫結上的 SendTimeout 值。分配給此作業的時間可能是較長逾時的一部分。

# RequestChannelWaitForReplyTimedOut
source: The request channel timed out while waiting for a reply after {0}. Increase the timeout value passed to the call to Request or increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
cs: Kanálu požadavku vypršel časový limit při čekání na odpověď po {0}. Zvyšte hodnotu časového limitu předanou volání požadavku nebo zvyšte hodnotu SendTimeout na vazbě. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Anforderungskanal ist während des Wartens auf eine Antwort nach {0} ein Timeout aufgetreten. Erhöhen Sie den an den Aufruf von "Request" übergebenen Zeitlimitwert, oder erhöhen Sie den SendTimeout-Wert für die Bindung. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: El canal de solicitud agotó el tiempo de espera mientras esperaba una respuesta después de {0}. Aumente el valor de tiempo de espera pasado a la llamada a Request, o bien aumente el valor de SendTimeout en el enlace. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Le canal de requête a dépassé le délai imparti en attendant une réponse après {0}. Augmentez la valeur du délai d'expiration passée à l'appel de Request ou augmentez la valeur SendTimeout sur Binding. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout del canale di richiesta dopo {0} durante l'attesa di una risposta. Aumentare il valore del timeout passato alla chiamata a Request o aumentare il valore di SendTimeout nell'elemento Binding. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: 要求チャネルは、応答を待機してから {0} 後にタイムアウトしました。Request の呼び出しに渡すタイムアウト値を増やすか、Binding の SendTimeout 値を増やしてください。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 요청 채널이 회신을 기다리는 동안 {0} 이후에 시간 초과되었습니다. Request의 호출에 전달되는 시간 제한 값을 늘리거나 바인딩에서 SendTimeout 값을 늘리세요. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Kanał żądania przekroczył limit czasu, próbując odpowiedzieć po {0}. Zwiększ wartość limitu czasu podawaną do wywołania elementu Request lub zwiększ wartość właściwości SendTimeout w powiązaniu. Czas przeznaczony na tę operację może być częścią większego limitu czasu.
pt_br: O canal de solicitação atingiu o tempo limite ao aguardar uma resposta após {0}. Aumente o valor de tempo limite passado à chamada para Request ou aumente o valor de SendTimeout na Associação. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: İstek kanalı, yanıt beklerken {0} sonra zaman aşımına uğradı. Request çağrısına geçirilen zaman aşımı değerini artırın ya da Binding üstündeki SendTimeout değerini artırın. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 请求通道在等待 {0} 以后回复时超时。增加传递给请求调用的超时值，或增加绑定上的 SendTimeout 值。分配给此操作的时间可能比超时长。
zh_hant: 要求通道在等待回覆時於 {0} 之後逾時。請增加傳送至要求呼叫的逾時值，或增加繫結上的 SendTimeout 值。分配給此作業的時間可能是較長逾時的一部分。

# RequestContextAborted
source: The requestContext has been aborted.
cs: Třída requestContext byla přerušena.
de: Der requestContext wurde abgebrochen.
es: Se anuló requestContext.
fr: requestContext a été abandonné.
it: L'elemento RequestContext è stato interrotto.
ja: requestContext は中止されました。
ko: RequestContext가 중단되었습니다.
pl: Przerwano wykonywanie metody requestContext.
pt_br: O requestContext foi anulado.
tr: requestContext iptal edildi.
zh_hans: requestContext 已中止。
zh_hant: 已中止 requestContext。

# RequestMessageDoesNotHaveAMessageID
source: A reply message cannot be created because the request message does not have a MessageID.
cs: Nelze vytvořit zprávu odpovědi, protože zpráva požadavku nemá identifikátor MessageID.
de: Es kann keine Antwortnachricht erstellt werden, weil die Anforderungsnachricht keine MessageID enthält.
es: No se puede crear un mensaje de respuesta porque el mensaje de solicitud no tiene MessageID.
fr: Aucun message de réponse ne peut être créé, car le message de requête ne contient pas de MessageID.
it: Non è possibile creare un messaggio di risposta perché il messaggio di richiesta non contiene un elemento MessageID.
ja: 要求メッセージに MessageID がないため、返信メッセージを作成できません。
ko: 요청 메시지에 MessageID가 없기 때문에 회신 메시지를 만들 수 없습니다.
pl: Nie można utworzyć komunikatu odpowiedzi, ponieważ komunikat żądania nie ma identyfikatora komunikatu.
pt_br: Não é possível criar uma mensagem de resposta porque a mensagem de solicitação não tem uma MessageID.
tr: İstek iletisinin bir MessageID öğesi bulunmadığından, yanıt iletisi oluşturulamıyor.
zh_hans: 无法创建回复消息，因为请求消息没有 MessageID。
zh_hant: 因為要求訊息沒有 MessageID，所以無法建立回覆訊息。

# RequestTimedOutEstablishingTransportSession
source: Request timed out after {0} while establishing a transport connection to {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Požadavku skončila platnost po {0} během navazování připojení přenosu k {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Bei der Anforderung ist nach {0} eine Zeitüberschreitung aufgetreten, während versucht wurde, eine Transportverbindung mit {1} herzustellen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La solicitud agotó el tiempo de espera después de {0} mientras establecía una conexión de transporte a {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La demande a dépassé le délai imparti après {0} pendant l'établissement d'une connexion de transport vers {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Timeout della richiesta dopo {0} durante il tentativo di stabilire una connessione del trasporto a {1}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: {1} へのトランスポート接続を確立中に、要求が {0} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: {1}에 대한 전송 연결을 설정하는 동안 {0} 이후에 요청이 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Żądanie przekroczyło limit czasu po upływie {0} podczas nawiązywania połączenia transportowego z elementem {1}. Czas przeznaczony na tę operację może być częścią większego limitu czasu.
pt_br: Tempo limite da solicitação atingido depois de {0} ao estabelecer uma conexão de transporte com {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {1} öğesine bir taşıma bağlantısı kurulurken, {0} sonra istek zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 建立到 {1} 的传输连接时，请求在 {0} 以后超时。分配给此操作的时间可能已经是更长超时的一部分。
zh_hant: 建立 {1} 的傳輸連線時，要求於 {0} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# RequiredAttributeMissing
source: Attribute '{0}' is required on element '{1}'.
cs: V elementu {1} je vyžadován atribut {0}.
de: Das Attribut "{0}" ist für das Element "{1}" erforderlich.
es: El elemento "{1}" requiere el atributo "{0}".
fr: L'attribut '{0}' est obligatoire sur l'élément '{1}'.
it: L'attributo '{0}' è obbligatorio nell'elemento '{1}'.
ja: 要素 '{1}' には属性 '{0}' が必要です。
ko: '{0}' 특성이 '{1}' 요소에서 필요합니다.
pl: Atrybut „{0}” jest wymagany w elemencie „{1}”.
pt_br: O atributo '{0}' é necessário no elemento '{1}'.
tr: '{1}' öğesinde '{0}' özniteliği gerekiyor.
zh_hans: 元素“{1}”上需要特性“{0}”。
zh_hant: 元素 '{1}' 上需要屬性 '{0}'。

# RequiredSecurityHeaderElementNotSigned
source: The security header element '{0}' with the '{1}' id must be signed.
cs: Element záhlaví zabezpečení {0} s identifikátorem {1} musí být podepsán.
de: Das Sicherheitsheaderelement "{0}" mit der {1}-ID muss signiert sein.
es: El elemento de encabezado de seguridad '{0}' con el id. '{1}' debe estar firmado.
fr: L'élément d'en-tête de sécurité '{0}' dont l'ID vaut '{1}' doit être signé.
it: L'elemento intestazione di sicurezza '{0}' con ID '{1}' id deve essere firmato.
ja: ID '{1}' のセキュリティ ヘッダー要素 '{0}' は署名されている必要があります。
ko: ID가 '{1}'인 보안 헤더 요소 '{0}'에 서명해야 합니다.
pl: Element nagłówka zabezpieczeń „{0}” o identyfikatorze „{1}” musi być podpisany.
pt_br: O elemento de cabeçalho de segurança '{0}' com identificação '{1}' deve estar assinado.
tr: '{1}' kimliğine sahip güvenlik üst bilgisi öğesi '{0}' imzalanmalıdır.
zh_hans: 具有“{1}”ID 的安全标头元素“{0}”必须签名。
zh_hant: 識別碼為 '{1}' 的安全性標頭元素 '{0}' 必須經過簽署。

# RequiredSecurityTokenNotEncrypted
source: The '{0}' security token with the '{1}' attachment mode must be encrypted.
cs: Token zabezpečení {0} s režimem přílohy {1} musí být zašifrován.
de: Das Sicherheitstoken "{0}" mit dem {1}-Anfügemodus muss verschlüsselt sein.
es: El token de seguridad '{0}' con el modo de datos adjuntos '{1}' debe estar cifrado, pero no lo estaba.
fr: Le jeton de sécurité '{0}' dont le mode d'attache est '{1}' doit être chiffré.
it: Il token di sicurezza '{0}' con la modalità di associazione '{1}' deve essere crittografato.
ja: 添付モード '{1}' のセキュリティ トークン '{0}' は暗号化されている必要があります。
ko: '{1}' 첨부 모드를 가진 '{0}' 보안 토큰을 암호화해야 합니다.
pl: Token zabezpieczający „{0}” z trybem załączników „{1}” musi być zaszyfrowany.
pt_br: O token de segurança '{0}' com modo de anexo '{1}' deve estar criptografado.
tr: '{1}' ek moduna sahip güvenlik belirteci '{0}' şifrelenmelidir.
zh_hans: 具有“{1}”附件模式的“{0}”安全令牌必须加密。
zh_hant: 附件模式為 '{1}' 的安全性權杖 '{0}' 必須加密。

# RequiredSecurityTokenNotSigned
source: The '{0}' security token with the '{1}' attachment mode must be signed.
cs: Token zabezpečení {0} s režimem přílohy {1} musí být podepsán.
de: Das Sicherheitstoken "{0}" mit dem {1}-Anfügemodus muss signiert sein.
es: El token de seguridad '{0}' con el modo de datos adjuntos '{1}' debe estar firmado.
fr: Le jeton de sécurité '{0}' dont le mode d'attache est '{1}' doit être signé.
it: Il token di sicurezza '{0}' con la modalità di associazione '{1}' deve essere firmato.
ja: 添付モード '{1}' のセキュリティ トークン '{0}' は署名されている必要があります。
ko: '{1}' 첨부 모드를 가진 '{0}' 보안 토큰에 서명해야 합니다.
pl: Token zabezpieczający „{0}” z trybem załączników „{1}” musi być podpisany.
pt_br: O token de segurança '{0}' com modo de anexo '{1}' deve estar assinado.
tr: '{1}' ek moduna sahip güvenlik belirteci '{0}' imzalanmalıdır.
zh_hans: 具有“{1}”附件模式的“{0}”安全令牌必须签名。
zh_hant: 附件模式為 '{1}' 安全性權杖 '{0}' 必須經過簽署。

# ResolvingExternalTokensRequireSecurityTokenParameters
source: Resolving an External reference token requires appropriate SecurityTokenParameters to be specified.
cs: Rozpoznávání tokenu externího odkazu vyžaduje určení odpovídající třídy SecurityTokenParameters.
de: Zum Auflösen eines External-Verweistokens ist die Angabe geeigneter SecurityTokenParameters erforderlich.
es: La resolución de un token de referencia External requiere que se especifiquen parámetros SecurityTokenParameters apropiados.
fr: La résolution d'un jeton de référence External impose la spécification correcte de SecurityTokenParameters.
it: La risoluzione di un token di riferimento External richiede la specifica di SecurityTokenParameter appropriati.
ja: 外部参照トークンを解決するためには、適切な SecurityTokenParameters が指定されている必要があります。
ko: 외부 참조 토큰을 확인하려면 적절한 SecurityTokenParameters를 지정해야 합니다.
pl: Rozpoznawanie tokenu odwołania zewnętrznego wymaga określenia odpowiedniego elementu SecurityTokenParameters.
pt_br: A resolução de um token de referência Externa requer a especificação de SecurityTokenParameters apropriados.
tr: Bir External başvuru belirteci, uygun SecurityTokenParameters belirtilmesini gerektirir.
zh_hans: 解析外部引用令牌要求指定适当的 SecurityTokenParameter。
zh_hant: 解析外部參照權杖需要指定適當的 SecurityTokenParameters。
