Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# UnableToFindSecurityHeaderInMessage
source: Security processor was unable to find a security header with actor '{0}' in the message. This might be because the message is an unsecured fault or because there is a binding mismatch between the communicating parties. This can occur if the service is configured for security and the client is not using security.
cs: Procesor zabezpečení nenalezl záhlaví zabezpečení s aktorem {0} ve zprávě. Může to být způsobeno tím, že je zpráva nezabezpečená chyba nebo tím, že existuje neshoda ve vazbě mezi komunikujícími stranami. Může k tomu dojít, když je služba nakonfigurována pro zabezpečení a klient zabezpečení nepoužívá.
de: Der Sicherheitsprozessor konnte keinen Sicherheitsheader mit Darsteller "{0}" in der Nachricht finden. Mögliche Ursache: Die Nachricht ist ein nicht gesicherter Fehler, oder es besteht keine Bindungsübereinstimmung zwischen den kommunizierenden Teilnehmern. Dies kann auftreten, wenn der Dienst für Sicherheit konfiguriert ist, und der Client keine Sicherheit verwendet.
es: El procesador de seguridad no encontró un encabezado de seguridad con el actor '{0}' en el mensaje. La causa puede ser que el mensaje sea un error no protegido o que no coincidan los enlaces entre las partes de la comunicación. Esto puede suceder si el servicio está configurado para seguridad y el cliente no usa seguridad.
fr: Le processeur de sécurité n'a pas pu trouver un en-tête de sécurité avec l'acteur '{0}' dans le message. Cet incident peut se produire parce que le message est une faute non sécurisée ou en raison d'une non-correspondance de liaison entre les parties communicantes. Cet incident peut se produire si le service est configuré pour la sécurité et que le client n'utilise pas la sécurité.
it: Il processore di sicurezza non è stato in grado di trovare un'intestazione di sicurezza con attore '{0}' nel messaggio. È possibile che il messaggio sia un errore non protetto o che i binding delle parti in comunicazione non corrispondano. Ciò può verificarsi se il servizio è configurato per la sicurezza e il client non utilizza la sicurezza.
ja: セキュリティ プロセッサは、メッセージ内にアクター '{0}' を持つセキュリティ ヘッダーを検出できませんでした。この原因としては、このメッセージがセキュリティで保護されていないフォールトであること、または通信する双方の間でバインドが整合していないことが考えられます。これは、サービスがセキュリティ向けに構成されており、クライアントでセキュリティが使用されていない場合に発生します。
ko: 보안 프로세서가 메시지에서 '{0}' 행위자의 보안 헤더를 찾을 수 없습니다. 메시지가 보호되지 않는 오류가 있거나 통신 당사자 간에 바인딩 불일치가 있기 때문입니다. 서비스가 보안 구성되어 있는데 클라이언트가 보안을 사용하지 않는 경우에 이러한 현상이 일어납니다.
pl: Procesor zabezpieczeń nie mógł odnaleźć nagłówka zabezpieczeń z aktorem „{0}” w wiadomości. Może to być spowodowane niezgodnością powiązania pomiędzy komunikującymi się stronami lub faktem, że wiadomość jest niezabezpieczonym błędem. Ta sytuacja może wystąpić, gdy usługa jest skonfigurowana do korzystania z zabezpieczeń, natomiast klient z nich nie korzysta.
pt_br: O processador de segurança não encontrou um cabeçalho de segurança com o ator '{0}' na mensagem. Talvez isso ocorra porque a mensagem é uma falha não protegida ou porque há uma incompatibilidade de associação entre as partes em comunicação. Isso poderá ocorrer se o serviço estiver configurado para segurança e o cliente não estiver usando segurança.
tr: Güvenlik işlemcisi iletide '{0}' etkinleştiricili bir güvenlik üst bilgisini bulamadı. Bunun nedeni, iletinin korumalı olmayan bir hata oluşu ya da iletişim kuran tarafların arasında bir bağlama eşleşmemesi olması olabilir. Bu, hizmet güvenlik için yapılandırıldığında ve istemci güvenliği kullanmadığında oluşabilir.
zh_hans: 安全处理器无法在消息中找到操作者为“{0}”的安全标头。这可能是因为该消息是一个非安全错误，或者因为在通信方之间存在绑定不匹配。如果针对安全对该服务进行了配置，而客户端未使用安全，则可能发生这种情况。
zh_hant: 安全性處理器在訊息中找不到安全性標題，Actor '{0}'。這可能是因為訊息是不安全的錯誤，或是因為通訊雙方之間有繫結不符的狀況。如果服務針對安全性設定，但用戶端並未使用安全性，就會發生此問題。

# UnableToFindSecurityHeaderInMessageNoActor
source: Security processor was unable to find a security header in the message. This might be because the message is an unsecured fault or because there is a binding mismatch between the communicating parties. This can occur if the service is configured for security and the client is not using security.
cs: Procesor zabezpečení nenalezl ve zprávě záhlaví zabezpečení. Může to být způsobeno tím, že je zpráva nezabezpečená chyba nebo tím, že existuje neshoda ve vazbě mezi komunikujícími stranami. Může k tomu dojít, když je služba nakonfigurována pro zabezpečení a klient zabezpečení nepoužívá.
de: Der Sicherheitsprozessor konnte keinen Sicherheitsheader in der Nachricht finden. Mögliche Ursache: Die Nachricht ist ein nicht gesicherter Fehler, oder es besteht keine Bindungsübereinstimmung zwischen den kommunizierenden Teilnehmern. Dies kann auftreten, wenn der Dienst für Sicherheit konfiguriert ist, und der Client keine Sicherheit verwendet.
es: El procesador de seguridad no encontró un encabezado de seguridad en el mensaje. La causa puede ser que el mensaje sea un error no protegido o que no coincidan los enlaces entre las partes de la comunicación. Esto puede suceder si el servicio está configurado para seguridad y el cliente no usa seguridad.
fr: Le processeur de sécurité n'a pas pu trouver d'en-tête de sécurité dans le message. Cela pourrait se produire parce que le message est une faute non sécurisée ou en raison d'une non-correspondance de liaison entre les parties communicantes. Cet incident peut se produire si le service est configuré pour la sécurité et que le client n'utilise pas la sécurité.
it: Il processore di sicurezza non è stato in grado di trovare un'intestazione di sicurezza nel messaggio. È possibile che il messaggio sia un errore non protetto o che i binding delle parti in comunicazione non corrispondano. Ciò può verificarsi se il servizio è configurato per la sicurezza e il client non utilizza la sicurezza.
ja: セキュリティ プロセッサは、メッセージでセキュリティ ヘッダーを検出できませんでした。この原因としては、メッセージがセキュリティで保護されていないフォールトであること、または通信相手との間でバインドが一致していないことが考えられます。これは、サービスがセキュリティ向けに構成されており、クライアントがセキュリティを使用していない場合に起こる場合があります。
ko: 보안 프로세서가 메시지에서 보안 헤더를 찾을 수 없습니다. 메시지가 보호되지 않는 오류가 있거나 통신 당사자 간에 바인딩 불일치가 있기 때문입니다. 서비스가 보안 구성되어 있는데 클라이언트가 보안을 사용하지 않는 경우에 이러한 현상이 일어납니다.
pl: Procesor zabezpieczeń nie mógł odnaleźć nagłówka zabezpieczeń w wiadomości. Może to być spowodowane niezgodnością powiązania pomiędzy komunikującymi się stronami lub faktem, że wiadomość jest niezabezpieczonym błędem. Ta sytuacja może wystąpić, gdy usługa jest skonfigurowana do korzystania z zabezpieczeń, natomiast klient z nich nie korzysta.
pt_br: O processador de segurança não encontrou um cabeçalho de segurança na mensagem. Talvez isso ocorra porque a mensagem é uma falha não protegida ou porque há uma incompatibilidade de associação entre as partes em comunicação. Isso poderá ocorrer se o serviço estiver configurado para segurança e o cliente não estiver usando segurança.
tr: Güvenlik işlemcisi iletide bir güvenlik üst bilgisini bulamadı. Bunun nedeni, iletinin korumalı olmayan bir hata oluşu ya da iletişim kuran tarafların arasında bir bağlama eşleşmemesi olması olabilir. Bu, hizmet güvenlik için yapılandırıldığında ve istemci güvenliği kullanmadığında oluşabilir.
zh_hans: 安全处理器无法在消息中找到安全标头。这可能是因为该消息是一个非安全错误，或者因为在通信方之间存在绑定不匹配。如果针对安全对该服务进行了配置，而客户端未使用安全，则可能发生这种情况。
zh_hant: 安全性處理器在訊息中找不到安全性標題。這可能是因為訊息是不安全的錯誤，或是因為通訊雙方之間有繫結不符的狀況。如果服務針對安全性設定，但用戶端並未使用安全性，就會發生此問題。

# UnableToFindTokenAuthenticator
source: Cannot find a token authenticator for the '{0}' token type. Tokens of that type cannot be accepted according to current security settings.
cs: Nelze nalézt ověřovací data tokenů pro typ tokenu {0}. Podle aktuálního nastavení zabezpečení nelze tokeny tohoto typu přijmout.
de: Es wurde kein Tokenauthentifizierer für den Tokentyp "{0}" gefunden. Token dieses Typs können gemäß den aktuellen Sicherheitseinstellungen nicht akzeptiert werden.
es: No se encuentra un autenticador de tokens para el tipo de token '{0}'. No se pueden aceptar los tokens de ese tipo según la configuración de seguridad actual.
fr: Impossible de trouver un authentificateur de jeton pour le type de jeton '{0}'. Les jetons de ce type ne peuvent pas être acceptés conformément aux paramètres de sécurité actuels.
it: Impossibile trovare un autenticatore del token per il tipo di token '{0}'. I token di tale tipo non possono essere accettati in base alle impostazioni di sicurezza correnti.
ja: '{0}' というトークンの型のトークン認証システムが見つかりません。現在のセキュリティ設定により、この型のトークンは承認できません。
ko: '{0}' 토큰 유형에 대한 토큰 인증자를 찾을 수 없습니다. 현재 보안 설정에 따라 해당 유형의 토큰을 수락할 수 없습니다.
pl: Nie można odnaleźć wystawcy uwierzytelnienia tokenu typu „{0}”. Zgodnie z bieżącymi ustawieniami zabezpieczeń tokeny tego typu nie mogą być akceptowane.
pt_br: Não é possível encontrar um autenticador de token para o tipo de token '{0}'. Tokens desse tipo não podem ser aceitos de acordo com as configurações de segurança atuais.
tr: '{0}' belirteç türü için bir belirteç kimlik doğrulayıcısı bulunamıyor. Geçerli güvenlik ayarlarına göre bu tür belirteçler kabul edilemez.
zh_hans: 找不到“{0}”令牌类型的令牌身份验证器。根据当前安全设置，无法接受该类型的令牌。
zh_hant: 找不到 '{0}' 權杖類型的權杖驗證器。根據目前的安全性設定，無法接受該類型的權杖。

# UnableToRenewSessionKey
source: Cannot renew the security session key.
cs: Nelze obnovit klíč relace zabezpečení.
de: Der Sicherheitssitzungsschlüssel kann nicht erneuert werden.
es: No se puede renovar la clave de sesión de seguridad.
fr: Impossible de renouveler la clé de session de sécurité.
it: Impossibile rinnovare la chiave di sessione di sicurezza.
ja: セキュリティ セッション キーを更新できません。
ko: 보안 세션 키를 갱신할 수 없습니다.
pl: Nie można odnowić tego klucza sesji zabezpieczeń.
pt_br: Não é possível renovar chave de sessão de segurança.
tr: Güvenlik oturumu anahtarı yenilenemiyor.
zh_hans: 无法续订安全会话密钥。
zh_hant: 無法更新安全性工作階段金鑰。

# UnableToResolveKeyInfoClauseInDerivedKeyToken
source: Cannot resolve KeyInfo in derived key token for resolving source token: KeyInfoClause '{0}'.
cs: Nelze vyřešit informace KeyInfo v tokenu s odvozeným klíčem k vyřešení zdroje tokenu: KeyInfoClause {0}.
de: Die KeyInfo im abgeleiteten Schlüsseltoken für das Auflösen des Quelltokens kann nicht aufgelöst werden: KeyInfoClause "{0}".
es: No se puede resolver KeyInfo en el token de clave derivada para la resolución del token de origen: KeyInfoClause '{0}'.
fr: Impossible de résoudre KeyInfo dans le jeton de clé dérivé pour la résolution du jeton source : KeyInfoClause '{0}'.
it: Impossibile risolvere KeyInfo nel token della chiave derivata per la risoluzione del token di origine: KeyInfoClause '{0}'.
ja: ソース トークンの解決に必要な、派生キー トークンに含まれる KeyInfo を解決できません。KeyInfoClause は '{0}' です。
ko: 소스 토큰을 확인하기 위해 파생 키 토큰에서 KeyInfo를 확인할 수 없습니다. KeyInfoClause '{0}'.
pl: Nie można ustalić wartości KeyInfo w wyprowadzonym tokenie klucza wymaganej do ustalenia tokenu źródłowego: KeyInfoClause „{0}”.
pt_br: Não é possível resolver KeyInfo no token de chave derivada para resolver token de origem: KeyInfoClause '{0}'.
tr: Kaynak belirtecini çözümlemek için alınan anahtar belirtecindeki KeyInfo çözümlenemiyor: KeyInfoClause '{0}'.
zh_hans: 无法为解析源令牌 KeyInfoClause“{0}”解析派生的密钥令牌中的 KeyInfo。
zh_hant: 無法解析衍生金鑰權杖中的 KeyInfo 以解析來源權杖: KeyInfoClause '{0}'。

# UnableToResolveKeyReference
source: The token resolver is unable to resolve the security key reference '{0}'.
cs: Překladač tokenů nemůže přeložit odkaz na klíč zabezpečení {0}.
de: Der Tokenresolver kann den Sicherheitsschlüsselverweis "{0}" nicht auflösen.
es: La resolución de tokens no puede resolver la referencia de la clave de seguridad "{0}".
fr: Le programme de résolution de jetons ne peut pas résoudre la référence de clé de sécurité '{0}'.
it: Il resolver dei token non riesce a risolvere il riferimento '{0}' alla chiave di sicurezza.
ja: トークン リゾルバーは、セキュリティ キーへの参照 '{0}' を解決できません。
ko: 토큰 확인자가 보안 키 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Program rozpoznawania tokenów nie może rozpoznać odwołania klucza zabezpieczającego „{0}”.
pt_br: O resolvedor de token não pode resolver a referência da chave de segurança '{0}'.
tr: Belirteç çözümleyici, '{0}' güvenlik anahtarı başvurusunu çözümleyemiyor.
zh_hans: 令牌解析程序无法解析安全密钥引用“{0}”。
zh_hant: 權杖解析程式無法解析安全性金鑰參考 '{0}'。

# UnableToResolveTokenReference
source: The token resolver is unable to resolve the token reference '{0}'.
cs: Překladač tokenů nemůže přeložit odkaz na token {0}.
de: Der Tokenresolver kann den Tokenverweis "{0}" nicht auflösen.
es: La resolución de tokens no puede resolver la referencia del token "{0}".
fr: Le programme de résolution de jetons ne peut pas résoudre la référence de jeton '{0}'.
it: Il resolver dei token non riesce a risolvere il riferimento '{0}' al token.
ja: トークン リゾルバーは、トークンへの参照 '{0}' を解決できません。
ko: 토큰 확인자가 토큰 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Program rozpoznawania tokenów nie może rozpoznać odwołania tokenu „{0}”.
pt_br: O resolvedor de token não pode resolver a referência de token '{0}'.
tr: Belirteç çözümleyici, '{0}' belirteç başvurusunu çözümleyemiyor.
zh_hans: 令牌解析程序无法解析令牌引用“{0}”。
zh_hant: 權杖解析程式無法解析權杖參考 '{0}'。

# UnauthorizedAccess_MemStreamBuffer
source: MemoryStream's internal buffer cannot be accessed.
cs: Vnitřní vyrovnávací paměť typu MemoryStream není k dispozici.
de: Auf den internen Puffer des MemoryStream kann nicht zugegriffen werden.
es: No se puede obtener acceso al búfer interno de MemoryStream.
fr: Impossible d'accéder à la mémoire tampon interne de MemoryStream.
it: Non è possibile accedere al buffer interno di MemoryStream.
ja: MemoryStream の内部バッファーにアクセスできません。
ko: MemoryStream의 내부 버퍼에 액세스할 수 없습니다.
pl: Nie można uzyskać dostępu do wewnętrznego buforu elementu MemoryStream.
pt_br: Buffer interno de MemoryStream não pode ser acessado.
tr: MemoryStream iç arabelleğine erişilemiyor.
zh_hans: 无法访问 MemoryStream 的内部缓冲区。
zh_hant: 無法存取 MemoryStream 的內部緩衝。

# UnboundPrefixInQName
source: Unbound prefix used in qualified name '{0}'.
cs: V určeném názvu {0} je použita nevázaná předpona.
de: Im qualifizierten Namen "{0}" wurde ein ungebundenes Präfix verwendet.
es: Se usó un prefijo no enlazado en el nombre completo "{0}".
fr: Préfixe indépendant utilisé dans le nom complet '{0}'.
it: Nel nome qualificato '{0}' è stato usato il prefisso Unbound.
ja: バインドされていないプレフィックスが修飾名 '{0}' で使用されています。
ko: 정규화된 이름 '{0}'에 언바운드 접두사를 사용했습니다.
pl: W kwalifikowanej nazwie „{0}” użyto niezwiązanego prefiksu.
pt_br: Prefixo não associado usado no nome qualificado '{0}'.
tr: '{0}' tam adında bağlı olmayan ön ek kullanılıyor.
zh_hans: 在合格名称“{0}”中使用了未绑定前缀。
zh_hant: 限定名稱 '{0}' 中使用了未繫結的前置詞。

# UnexpectedAckRequested
source: The remote endpoint sent an unexpected request for an ack. Simplex clients do not send acks and do not process requests for acks.
cs: Vzdálený koncový bod odeslal neočekávaný požadavek na potvrzení. Jednoduší klienti neodesílají potvrzení a nezpracovávají požadavky na potvrzení.
de: Der Remoteendpunkt hat eine unerwartete Bestätigungsanforderung gesendet. Die Simplex-Clients senden keine Bestätigungen und verarbeiten keine Bestätigungsanforderungen.
es: El extremo remoto envió una solicitud de confirmación inesperada. Los clientes símplex no envían confirmaciones ni procesan solicitudes de confirmación.
fr: Le point de terminaison distant a envoyé une demande inattendue pour un accusé de réception. Les clients simplex n'envoient pas d'accusés de réception et ne traitent pas de demandes d'accusés de réception.
it: L'endpoint remoto ha inviato una richiesta imprevista per un acknowledgement. I client simplex non inviano acknowledgement e non elaborano richieste di acknowledgement.
ja: リモート エンドポイントは、予期しない受信確認要求を送信しました。シンプレックス クライアントは受信確認を送信せず、受信確認要求を処理しません。
ko: 원격 끝점이 승인에 대해 필요하지 않은 요청을 보냈습니다. 단면 서버가 승인을 보내지 않으며 승인에 대한 요청을 처리하지 않습니다.
pl: Zdalny punkt końcowy wysłał nieoczekiwane żądanie potwierdzenia. Jednostronni klienci nie wysyłają potwierdzeń ani nie przetwarzają żądań potwierdzenia.
pt_br: O ponto de extremidade remoto enviou uma solicitação inesperada para uma confirmação. Os clientes simplex não enviam confirmações e não processam solicitações de confirmação.
tr: Uzak bitiş noktası bildirim için beklenmeyen bir istek gönderdi. Simpleks istemciler yanıt göndermezler ve yanıt isteklerini de işlemezler.
zh_hans: 远程终结点发送了意外的 Ack 请求。单工客户端未发送 Ack 且未处理 Ack 请求。
zh_hant: 遠端端點傳送未預期的認可要求。Simplex 用戶端不傳送認可，也不處理認可要求。

# UnexpectedBinarySecretType
source: Expected binary secret of type {0} but got secret of type {1}.
cs: Bylo očekáváno binární tajemství typu {0}, ale bylo obdrženo tajemství typu {1}.
de: Es wurde ein binäres Geheimnis vom Typ {0} erwartet, aber ein Geheimnis vom Typ {1} empfangen.
es: Se esperaba un secreto binario de tipo {0} pero se obtuvo un secreto de tipo {1}.
fr: Secret binaire de type {0} attendu, mais obtention d'un secret de type {1}.
it: È previsto il segreto binario di tipo {0}, ma è stato ottenuto il segreto di tipo {1}.
ja: 型 {0} のバイナリ シークレットが必要ですが、型 {1} のシークレットが取得されました。
ko: {0} 형식의 이진 비밀이 필요하지만 {1} 형식의 비밀을 받았습니다.
pl: Oczekiwano binarnego wpisu tajnego typu {0}, a uzyskano wpis tajny typu {1}.
pt_br: É esperado um segredo binário do tipo {0} mas um segredo do tipo {1} foi obtido.
tr: {0} türünde ikili gizli dizi beklenirken {1} türünde ikili gizli dizi alındı.
zh_hans: 预期为类型 {0} 的二进制机密，但得到的是类型为 {1} 的机密。
zh_hant: 應要有類型 {0} 的二進位祕密，但收到類型 {1} 的祕密。

# UnexpectedCS
source: The remote endpoint sent an unexpected request to create a sequence. Clients do not process requests for a sequence.
cs: Vzdálený koncový bod odeslal neočkávaný požadavek na vytvoření sekvence. Klienti nezpracovávají požadavky na sekvenci.
de: Der Remoteendpunkt hat eine unerwartete Anforderung zum Erstellen einer Sequenz gesendet. Die Simplex-Clients senden keine Bestätigungen und verarbeiten keine Sequenzanforderungen.
es: El extremo remoto envió una solicitud inesperada para crear una secuencia. Los clientes no procesan solicitudes de secuencia.
fr: Le point de terminaison distant a envoyé une demande inattendue de création d'une séquence. Les clients ne traitent pas les demandes d'une séquence.
it: L'endpoint remoto ha inviato una richiesta imprevista per la creazione di una sequenza. I client non elaborano le richieste per una sequenza.
ja: リモート エンドポイントは、予期しないシーケンス作成要求を送信しました。クライアントはシーケンス要求を処理しません。
ko: 원격 끝점이 시퀀스를 만드는 필요하지 않은 요청을 보냈습니다. 클라이언트가 시퀀스에 대한 요청을 처리하지 않습니다.
pl: Zdalny punkt końcowy wysłał nieoczekiwane żądanie utworzenia sekwencji. Klienci nie przetwarzają żądań sekwencji.
pt_br: O ponto de extremidade remoto enviou uma solicitação inesperada para criar uma sequência. Clientes não processam solicitações para uma sequência.
tr: Uzak bitiş noktası bir sıra oluşturmak için beklenmeyen bir istek gönderdi. İstemciler sıra isteklerini işlemez.
zh_hans: 远程终结点发送了创建序列的意外请求。客户端不能处理序列请求。
zh_hant: 遠端端點傳送未預期的建立順序要求。用戶端不處理順序要求。

# UnexpectedCSROfferId
source: The remote endpoint sent inconsistent responses to the same create sequence request. The sequence identifiers are not identical.
cs: Vzdálený koncový bod odeslal nekonzistentní odpovědi na stejný požadavek na vytvoření sekvence. Identifikátory sekvence nejsou stejné.
de: Der Remoteendpunkt hat inkonsistente Antworten für die gleiche Sequenzerstellungsanforderung gesendet. Die Sequenzbezeichner sind nicht identisch.
es: El extremo remoto envió respuestas incoherentes a la misma solicitud de creación de secuencia. Los identificadores de secuencia no son idénticos.
fr: Le point de terminaison distant a envoyé des réponses incohérentes à la même demande de création de séquence. Les identificateurs de séquence ne sont pas identiques.
it: L'endpoint remoto ha inviato richieste incoerenti alla stessa richiesta di creazione di sequenza. Gli identificatori di sequenza non sono identici.
ja: リモート エンドポイントは、同じシーケンス作成要求に対して矛盾する応答を送信しました。シーケンス ID が同じではありません。
ko: 원격 끝점이 같은 시퀀스 만들기 요청에 대해 일관되지 않은 응답을 보냈습니다. 시퀀스 식별자가 같지 않습니다.
pl: Zdalny punkt końcowy wysłał niezgodne odpowiedzi na to samo żądanie utworzenia sekwencji. Identyfikatory sekwencji nie są identyczne.
pt_br: O ponto de extremidade remoto enviou respostas inconsistentes à mesma solicitação de criação de sequência. Os identificadores de sequência não são idênticos.
tr: Uzak bitiş noktası aynı sıra oluşturma isteğine tutarsız yanıtlar gönderdi. Sıra tanımlayıcıları özdeş değil.
zh_hans: 远程终结点发送了创建相同序列的不一致响应。序列标识符不相同。
zh_hant: 遠端端點對相同的建立順序要求傳送不一致的回應。順序識別項不一致。

# UnexpectedCloseSequenceResponse
source: The remote endpoint sent an unexpected close sequence response message. Simplex servers do not process this message.
cs: Vzdálený koncový bod odeslal zprávu odpovědi na neočekávané zavření sekvence. Jednoduché servery nezpracovávají tuto zprávu.
de: Der Remoteendpunkt hat eine unerwartete Antwortnachricht zum Schließen der Sequenz gesendet. Simplex-Server verarbeiten diese Nachricht nicht.
es: El extremo remoto envió un mensaje de respuesta a la secuencia de cierre inesperado. Los servidores símplex no procesan este mensaje.
fr: Le point de terminaison distant a envoyé un message de réponse de fermeture de séquence inattendu. Les serveurs simplex ne traitent pas ce message.
it: L'endpoint remoto ha inviato in risposta un messaggio di chiusura sequenza non previsto. I client simplex non elaborano il messaggio.
ja: リモート エンドポイントは、予期しないシーケンス クローズ応答メッセージを送信しました。シンプレックス サーバーはこのメッセージを処理しません。
ko: 원격 끝점이 필요하지 않은 시퀀스 닫기 응답 메시지를 보냈습니다. 단면 서버가 이 메시지를 처리하지 않습니다.
pl: Zdalny punkt końcowy wysłał nieoczekiwany komunikat odpowiedzi na zamknięcie sekwencji. Jednostronne serwery nie mogą przetwarzać tego komunikatu.
pt_br: O ponto de extremidade remoto enviou uma mensagem de resposta de fechamento de sequência inesperada. Os servidores Simplex não processam essa mensagem.
tr: Uzak bitiş noktası beklenmeyen kapatma sırası yanıt iletisi gönderdi. Tek yönlü sunucular bu iletiyi işlemez.
zh_hans: 远程终结点发送了意外的关闭序列响应消息。单工服务器无法处理此消息。
zh_hant: 遠端端點傳送未預期的關閉順序回應訊息。Simplex 伺服器不處理此訊息。

# UnexpectedDuplicateElement
source: '{0}' from namespace '{1}' is not expected to appear more than once
cs: Není očekáván vícenásobný výskyt elementu {0} z oboru názvů {1}.
de: "{0}" aus dem Namespace "{1}" wird nur einmal erwartet.
es: No se espera que "{0}" del espacio de nombres "{1}" aparezca más de una vez
fr: '{0}' de l'espace de noms '{1}' n'est pas censé apparaître plusieurs fois
it: L'elemento '{0}' dello spazio dei nomi '{1}' è previsto una sola volta
ja: 名前空間 '{1}' からの '{0}' が複数回表示されることは予期されていません
ko: '{1}' 네임스페이스에서의 '{0}'은(는) 두 번 이상 나타날 수 없습니다.
pl: Nie oczekiwano więcej niż jednokrotnego wystąpienia elementu „{0}” z przestrzeni nazw „{1}”
pt_br: Não se espera que '{0}' do namespace '{1}' seja exibido mais de uma vez
tr: '{1}' ad alanından gelen '{0}' öğesinin, birden fazla görünmesi beklenmiyor
zh_hans: 不应多次出现来自命名空间“{1}”的“{0}”
zh_hant: 命名空間 '{1}' 的 '{0}' 應只出現一次

# UnexpectedElementExpectingElement
source: '{0}' from namespace '{1}' is not expected. Expecting element '{2}' from namespace '{3}'
cs: Element {0} z oboru názvů {1} není očekáván. Je očekáván element {2} z oboru názvů {3}.
de: "{0}" aus dem Namespace "{1}" wird nicht erwartet. Es wird das Element "{2}" aus dem Namespace "{3}" erwartet.
es: No se espera "{0}" del espacio de nombres "{1}". Se espera el elemento "{2}" del espacio de nombres "{3}"
fr: '{0}' de l'espace de noms '{1}' n'est pas attendu. Attente de l'élément '{2}' de l'espace de noms '{3}'
it: L'elemento '{0}' dello spazio dei nomi '{1}' non è previsto. È previsto l'elemento '{2}' dello spazio dei nomi '{3}'
ja: 名前空間 '{1}' からの '{0}' は予期されていません。名前空間 '{3}' からの要素 '{2}' が必要です
ko: '{1}' 네임스페이스에서의 '{0}'은(는) 필요하지 않습니다. '{3}' 네임스페이스에서의 '{2}' 요소가 필요합니다.
pl: Nie oczekiwano elementu „{0}” z przestrzeni nazw „{1}”. Oczekiwany element to „{2}” z przestrzeni nazw „{3}”
pt_br: '{0}' do namespace '{1}' não é esperado. É esperado o elemento '{2}' do namespace '{3}'
tr: '{1}' ad alanından '{0}' beklenmiyor. Beklenen: '{3}' ad alanından '{2}' öğesi
zh_hans: 来自命名空间“{1}”的“{0}”不是预期的。应为来自命名空间“{3}”的元素“{2}”
zh_hant: 不應有命名空間 '{1}' 的 '{0}'。應為命名空間 '{3}' 的元素 '{2}'
