Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Primitives/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# SecurityTokenRequirementDoesNotContainProperty
source: The token requirement does not contain a property '{0}'.
cs: Požadavek tokenu neobsahuje vlastnost {0}.
de: Die Tokenanforderung enthält keine Eigenschaft "{0}".
es: El requisito de token no contiene una propiedad "{0}".
fr: L'exigence du jeton ne contient aucune propriété '{0}'.
it: Il requisito di token non contiene alcuna proprietà '{0}'.
ja: トークンの要件に、プロパティ '{0}' が含まれていません。
ko: 토큰 요구 사항에 '{0}' 속성이 없습니다.
pl: Wymaganie tokenu nie zawiera właściwości „{0}”.
pt_br: O requisito de token não contém uma propriedade '{0}'.
tr: Belirteç gereksinimi '{0}' özelliğini içermiyor.
zh_hans: 令牌要求不包含属性“{0}”。
zh_hant: 權杖需求不包含屬性 '{0}'。

# SecurityTokenRequirementHasInvalidTypeForProperty
source: The token requirement has an unexpected type '{1}' for property '{0}'. The expected property type is '{2}'.
cs: Požadavek tokenu má pro vlastnost {1} neočekávaný typ {0}. Očekávaný typ vlastnosti je {2}.
de: Die Tokenanforderung enthält einen unerwarteten Typ "{1}" für die Eigenschaft "{0}". Erwartet wurde der Eigenschaftentyp "{2}" .
es: El requisito de token tiene un tipo no esperado "{1}" para la propiedad "{0}". El tipo de propiedad esperado es "{2}".
fr: L'exigence du jeton présente un type '{1}' inattendu pour la propriété '{0}'. Le type de propriété attendu est '{2}'.
it: Il tipo '{1}' della proprietà '{0}' non è previsto per il requisito del token. Il tipo previsto della proprietà è '{2}'.
ja: トークンの要件に、プロパティ '{0}' では予期されていない型 '{1}' が含まれています。予期されたプロパティの型は '{2}' です。
ko: 토큰 요구 사항에서 '{0}' 속성에 대해 예기치 않은 형식 '{1}'이(가) 있습니다. 필요한 속성 형식은 '{2}'입니다.
pl: Wymaganie tokenu ma nieoczekiwany typ „{1}” dla właściwości „{0}”. Oczekiwanym typem właściwości jest „{2}”.
pt_br: O requisito de token tem um tipo inesperado '{1}' para a propriedade '{0}'. O tipo de propriedade esperado é '{2}'.
tr: Belirteç gereksiniminin '{0}' özelliği için beklenmeyen bir '{1}' türü var. Beklenen özellik türü: '{2}'.
zh_hans: 令牌要求对于属性“{0}”具有意外类型“{1}”。预期的属性类型为“{2}”。
zh_hant: 權杖需求的屬性 '{0}' 出現非預期的類型 '{1}'。屬性類型應為 '{2}'。

# SeekNotSupportedOnStream
source: Seek not supported on stream '{0}'.
cs: Hledání není u streamu {0} podporované.
de: Für den Datenstrom "{0}" wird Suche nicht unterstützt.
es: No se admite la búsqueda en la secuencia '{0}'.
fr: La recherche n'est pas prise en charge sur le flux '{0}'.
it: Ricerca non supportata sul flusso '{0}'.
ja: ストリーム '{0}' では、シークはサポートされていません。
ko: 스트림 '{0}'에서 찾기가 지원되지 않습니다.
pl: Wyszukiwanie nie jest obsługiwane w strumieniu „{0}”.
pt_br: Não há suporte para busca no fluxo '{0}'.
tr: '{0}' akışında Seek desteklenmez.
zh_hans: 流“{0}”不支持查找。
zh_hant: 資料流 '{0}' 上不支援搜尋。

# SendCannotBeCalledAfterCloseOutputSession
source: You cannot Send messages on a channel after CloseOutputSession has been called.
cs: Nelze odesílat zprávy v kanálu po vyvolání třídy CloseOutputSession.
de: Sie können keine Nachrichten über einen Kanal senden, nachdem CloseOutputSession aufgerufen wurde.
es: No se pueden enviar mensajes en un canal después de llamar a CloseOutputSession.
fr: Vous ne pouvez pas envoyer de message sur un canal après l'appel de CloseOutputSession.
it: Non è possibile chiamare Send sui messaggi in un canale dopo aver chiamato CloseOutputSession.
ja: CloseOutputSession の呼び出し後にチャネルでメッセージを送信することはできません。
ko: CloseOutputSession이 호출된 후에 채널에서 메시지를 보낼 수 없습니다.
pl: Nie można wysyłać komunikatów za pośrednictwem kanału po wywołaniu metody CloseOutputSession.
pt_br: Não é possível Enviar mensagens em um canal após CloseOutputSession ter sido chamado.
tr: CloseOutputSession çağrıldıktan sonra, bir kanalda ileti Gönderemezsiniz.
zh_hans: 调用 CloseOutputSession 以后，无法在通道上发送消息。
zh_hant: 呼叫 CloseOutputSession 之後，無法在通道上傳送訊息。

# SendToViaTimedOut
source: Sending to via {0} timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Odeslání do cesty {0} skončila platnost po {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Beim Senden an die Umleitung {0} ist nach {1} ein Timeout aufgetreten. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Zeitlimits.
es: El envío a la vía {0} agotó el tiempo de espera después de {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'envoi via {0} a dépassé le délai imparti après {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'expiration plus long.
it: Timeout di invio tramite {0} dopo {1}. È possibile che il tempo allocato a questa operazione fosse incluso in un timeout più lungo.
ja: VIA {0} への送信は {1} 後にタイムアウトしました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: via {0}에 보내기가 {1} 이후에 시간 초과되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Wysyłanie komunikatu do punktu pośredniego {0} przekroczyło limit czasu po {1}. Czas przeznaczony dla tej operacji może być częścią większego limitu czasu.
pt_br: O envio via {0} atingiu o tempo limite após {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
tr: {0} ile gönderme {1} sonra zaman aşımına uğradı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 通过 {0} 发送在 {1} 以后超时。分配给此操作的时间可能比超时长。
zh_hant: 傳送至 via {0} 於 {1} 之後逾時。分配給此作業的時間可能是較長逾時的一部分。

# SenderSideSupportingTokensMustSpecifySecurityTokenParameters
source: Security token parameters must be specified with supporting tokens for each message.
cs: Parametry tokenu zabezpečení musejí být určeny s podpůrnými tokeny pro každou zprávu.
de: Für jede Nachricht müssen Sicherheitstokenparameter mit unterstützenden Token angegeben werden.
es: Los parámetros de token de seguridad debe especificarse con tokens auxiliares para cada mensaje.
fr: Les paramètres de jeton de sécurité doivent être spécifiés avec les jetons associés pour chaque message.
it: È necessario specificare i parametri token di sicurezza con i token di supporto per ogni messaggio.
ja: セキュリティ トークン パラメーターは、各メッセージのサポート トークンを使用して指定する必要があります。
ko: 각 메시지에 대해 지원 토큰을 사용하여 보안 토큰 매개 변수를 지정해야 합니다.
pl: Parametry tokenu zabezpieczającego muszą być określone z tokenami pomocniczymi dla każdego komunikatu.
pt_br: Os parâmetros de token de segurança devem ser especificados com os tokens de suporte para cada mensagem.
tr: Her ileti için destekleme belirteçleriyle birlikte güvenlik belirteci parametreleri belirtilmelidir.
zh_hans: 必须使用支持的令牌为每条消息指定安全令牌参数。
zh_hant: 每一訊息均必須設定安全性權杖參數及支援權杖。

# SequenceClosedFaultString
source: The Sequence is closed and cannot accept new messages.
cs: Sekvence je zavřená a nemůže přijímat nové zprávy.
de: Die Sequenz ist geschlossen und kann keine neuen Nachrichten annehmen.
es: La secuencia está cerrada y no puede aceptar mensajes nuevos.
fr: La séquence est fermée et ne peut pas accepter de nouveaux messages.
it: La sessione è chiusa e non può accettare nuovi messaggi.
ja: シーケンスは閉じていて、新しいメッセージを受け付けることができません。
ko: 시퀀스가 닫혔으므로 새 메시지를 수락할 수 없습니다.
pl: Sekwencja została zamknięta i nie może akceptować nowych komunikatów.
pt_br: A Sequência está fechada e não aceita mensagens novas.
tr: Sıra kapalı ve yeni ileti kabul edemez.
zh_hans: 该序列已关闭，无法接受新消息。
zh_hant: 順序已關閉，且無法接受新訊息。

# SequenceTerminatedAddLastToWindowTimedOut
source: The RM Source could not transfer the last message within the timeout the user specified.
cs: Zdroj RM nemohl přenést poslední zprávu v časovém limitu určeném uživatelem.
de: Die RM-Quelle konnte die letzte Meldung nicht innerhalb des vom Benutzer angegebenen Zeitlimits übertragen.
es: El origen RM no pudo transferir el último mensaje en el tiempo de espera que especificó el usuario.
fr: La source du Gestionnaire de ressources n'a pas pu transférer le dernier message dans le délai imparti spécifié par l'utilisateur.
it: L'origine RM non è stata in grado di trasferire l'ultimo messaggio entro il timeout specificato dall'utente.
ja: RM ソースは、ユーザーが指定したタイムアウト時間内に最後のメッセージを転送できませんでした。
ko: RM 원본이 사용자가 지정한 시간 제한 이내에 마지막 메시지를 전송할 수 없습니다.
pl: Miejsce źródłowe protokołu RM nie mogło przesłać ostatniego komunikatu w limicie czasu określonym przez użytkownika.
pt_br: O RM Source não pôde transferir a última mensagem no tempo limite que o usuário especificou.
tr: RM Source, kullanıcının belirttiği zaman aşımı süresi içinde son iletiyi aktaramadı.
zh_hans: RM 源无法在用户指定的超时内传输最后一条消息。
zh_hant: RM 來源無法在使用者指定的逾時內，傳輸最後的訊息。

# SequenceTerminatedEarlyTerminateSequence
source: The wsrm:TerminateSequence protocol message was transmitted before the sequence was successfully completed.
cs: Zpráva protokolu wsrm:TerminateSequence byla vyslána před úspěšným dokončením sekvence.
de: Die wsrm:TerminateSequence-Protokollnachricht wurde übertragen, bevor die Sequenz erfolgreich abgeschlossen wurde.
es: El mensaje de protocolo wsrm:TerminateSequence se transmitió antes de que la secuencia se completara correctamente.
fr: Le message de protocole wsrm:TerminateSequence a été émis avant la fin de la séquence.
it: Messaggio di protocollo wsrm:TerminateSequence trasmesso prima del completamento della sequenza.
ja: wsrm:TerminateSequence プロトコル メッセージは、シーケンスが正常に完了する前に送信されました。
ko: 시퀀스를 완료하기 전에 wsrm:TerminateSequence 프로토콜 메시지가 전송되었습니다.
pl: Przekazano komunikat protokołu wsrm:TerminateSequence przed poprawnym zakończeniem sekwencji.
pt_br: A mensagem de protocolo wsrm:TerminateSequence foi transmitida antes da sequência ter sido concluída com êxito.
tr: wsrm:TerminateSequence protokolü iletisi, sıralama başarıyla tamamlanmadan önce aktarıldı.
zh_hans: 在序列成功完成以前传输 wsrm:TerminateSequence 协议消息。
zh_hant: 在順序順利完成之前，已傳輸 wsrm:TerminateSequence 通訊協定訊息。

# SequenceTerminatedInactivityTimeoutExceeded
source: The inactivity timeout of ({0}) has been exceeded.
cs: Časový limit neaktivity ({0}) byl překročen.
de: Das Zeitlimit für Inaktivität von ({0}) wurde überschritten.
es: Se superó el tiempo de espera de inactividad de ({0}).
fr: Le délai d'inactivité de ({0}) a été dépassé.
it: Superato il timeout di inattività di ({0}).
ja: 無通信タイムアウト時間 ({0}) が経過しました。
ko: 비활성 시간 제한({0})을 초과했습니다.
pl: Przekroczono limit czasu nieaktywności ({0}).
pt_br: O tempo limite de inatividade de ({0}) foi excedido.
tr: Boş durma zaman aşımı ({0}) değeri aşıldı.
zh_hans: 已超过({0})的非活动超时。
zh_hant: 已超出無活動逾時 ({0})。

# SequenceTerminatedInconsistentLastMsgNumber
source: Two different wsrm:LastMsgNumber values were specified. Because of this the reliable session cannot complete.
cs: Byly zadány dvě rozdílné hodnoty wsrm:LastMsgNumber. Z tohoto důvodu nelze stabilní relaci dokončit.
de: Es wurden zwei verschiedene Werte für "wsrm:LastMsgNumber" angegeben. Daher kann die zuverlässige Sitzung nicht abgeschlossen werden.
es: Se especificaron dos valores de wsrm:LastMsgNumber diferentes. Debido a ello, la sesión confiable no se pudo completar.
fr: Deux valeurs différentes de wsrm:LastMsgNumber ont été spécifiées. Pour cette raison, la session fiable ne peut pas être exécutée.
it: Sono stati specificati due diversi valori wsrm:LastMsgNumber. Impossibile continuare la sessione affidabile.
ja: 2 つの異なる wsrm:LastMsgNumber 値が指定されました。このため、信頼できるセッションを完了できません。
ko: 두 개의 서로 다른 wsrm:LastMsgNumber 값을 지정했습니다. 이로 인해 신뢰할 수 있는 세션을 완료할 수 없습니다.
pl: Określono dwie różne wartości wsrm:LastMsgNumber. Z tego powodu nie można ukończyć niezawodnej sesji.
pt_br: Dois valores wsrm:LastMsgNumber diferentes foram especificados. Por causa disso, a sessão confiável não pode ser concluída.
tr: İki farklı wsrm:LastMsgNumber değeri belirtildi. Bu nedenle güvenli oturum tamamlanamıyor.
zh_hans: 指定了两个不同的 wsrm:LastMsgNumber 值，所以可靠会话无法完成。
zh_hant: 指定了兩個不同的 wsrm:LastMsgNumber 值。因此，無法完成可靠工作階段。

# SequenceTerminatedMaximumRetryCountExceeded
source: The user specified maximum retry count for a particular message has been exceeded. Because of this the reliable session cannot continue.
cs: Uživatelem určený maximální počet opakování konkrétní zprávy byl překročen. Stabilní relace proto nemůže pokračovat.
de: Die vom Benutzer angegebene maximale Wiederholungsanzahl für eine bestimmte Nachricht wurde überschritten. Daher kann die zuverlässige Sitzung nicht fortgesetzt werden.
es: Se superó el número máximo de reintentos que especificó el usuario para un mensaje determinado. Por esa razón, la sesión confiable no puede continuar.
fr: Le nombre maximal de nouvelles tentatives spécifié par l'utilisateur pour un message particulier a été dépassé. La session fiable ne peut pas continuer.
it: Superato il numero di tentativi massimo specificato per un particolare messaggio. Impossibile continuare la sessione affidabile.
ja: 特定のメッセージについてユーザーが指定した最大再試行回数を超えました。このため、信頼できるセッションを継続できません。
ko: 특정 메시지에 대한 사용자 지정 최대 재 시도 횟수를 초과했습니다. 이로 인해 신뢰 세션을 계속할 수 없습니다.
pl: Przekroczono określoną przez użytkownika maksymalną liczbę ponownych prób dla danego komunikatu. Z tego powodu niezawodna sesja nie może być kontynuowana.
pt_br: O usuário especificou o contador de tentativas máximo para uma mensagem específica ter sido excedida. Por isso, a sessão confiável não pode continuar.
tr: Kullanıcı tarafından belirlenen belirli bir iletiyi en fazla deneme sayısı aşıldı. Bu nedenle bu güvenilir oturuma devam edilemiyor.
zh_hans: 已超过用户指定的特定消息的最大重试计数。因此，可靠的会话无法继续。
zh_hant: 已超出使用者為特定訊息指定的重試計數上限。因此，此可靠工作階段無法繼續。

# SequenceTerminatedMissingFinalAck
source: The CloseSequence request's reply message must carry a final acknowledgement. This is a violation of the WS-ReliableMessaging protocol. The reliable session cannot continue.
cs: Zpráva odpovědi na požadavek CloseSequence musí nést závěrečné potvrzení. To je narušení protokolu WS-ReliableMessaging. Stabilní relace nemůže pokračovat.
de: Die Antwortnachricht der CloseSequence-Anforderung muss eine abschließende Bestätigung enthalten. Dies ist eine WS-ReliableMessaging-Protokollverletzung. Die zuverlässige Sitzung kann nicht fortgesetzt werden.
es: El mensaje de respuesta de la solicitud CloseSequence debe llevar una confirmación final. Esta es una infracción del protocolo WS-ReliableMessaging. La sesión confiable no puede continuar.
fr: Le message de réponse à la demande CloseSequence doit comporter un accusé de réception final. Il s'agit d'une violation du protocole WS-ReliableMessaging. La session fiable ne peut pas continuer.
it: Il messaggio di risposta alla richiesta CloseSequence deve contenere un acknowledgement finale. Ciò costituisce una violazione del protocollo WS-ReliableMessaging. Impossibile continuare la sessione affidabile.
ja: CloseSequence 要求に対する応答メッセージには、最終受信確認が含まれる必要があります。これは WS-ReliableMessaging のプロトコル違反です。信頼できるセッションは続行できません。
ko: CloseSequence 요청의 회신 메시지에 최종 승인이 있어야 합니다. 이것은 WS-ReliableMessaging 프로토콜 위반입니다. 신뢰할 수 있는 세션을 계속할 수 없습니다.
pl: Komunikat odpowiedzi na żądanie CloseSequence musi zawierać ostateczne potwierdzenie. Stanowi to naruszenie protokołu WS-ReliableMessaging. Nie można kontynuować działania niezawodnej sesji.
pt_br: A mensagem de resposta da solicitação CloseSequence deve ter uma confirmação final. Trata-se de uma violação do protocolo WS-ReliableMessaging. A sessão confiável não pode continuar.
tr: CloseSequence isteğinin yanıt iletisi son bir alındı bildirimi içermelidir. Bu, WS-ReliableMessaging protokolünün ihlalidir. Güvenilir oturum devam edemiyor.
zh_hans: CloseSequence 请求的答复消息必须带有最终确认。这违反了 WS-ReliableMessaging 协议。可靠会话无法继续。
zh_hant: CloseSequence 要求的回覆訊息必須具有最終確認。這違反 WS-ReliableMessaging 通訊協定。可靠工作階段無法繼續。

# SequenceTerminatedOnAbort
source: Due to a user abort the reliable session cannot continue.
cs: Stabilní relace nemůže pokračovat, protože ji uživatel přerušil.
de: Aufgrund eines Abbruchs durch einen Benutzer kann die zuverlässige Sitzung nicht fortgesetzt werden.
es: La sesión confiable no puede continuar porque un usuario la anuló.
fr: En raison d'un abandon de l'utilisateur, la session fiable ne peut pas continuer.
it: Impossibile continuare la sessione affidabile a causa di un'interruzione dell'utente.
ja: ユーザーが中止したため、信頼できるセッションを継続できません。
ko: 사용자 중단 때문에 신뢰 세션을 계속할 수 없습니다.
pl: Niezawodna sesja nie może być kontynuowana z powodu przerwania przez użytkownika.
pt_br: A sessão confiável não pode continuar devido à anulação feita pelo usuário.
tr: Kullanıcı iptali nedeniyle, güvenilir oturuma devam edilemiyor.
zh_hans: 由于用户中止，可靠的会话无法继续。
zh_hant: 由於使用者中止，可靠工作階段無法繼續。

# SequenceTerminatedQuotaExceededException
source: The necessary size to buffer a sequence message has exceeded the configured buffer quota. Because of this the reliable session cannot continue.
cs: Nezbytná velikost pro uložení zprávy sekvence do vyrovnávací paměti překročila nakonfigurovanou kvótu vyrovnávací paměti. Stabilní relace proto nemůže pokračovat.
de: Die erforderliche Größe zum Puffern einer Sequenznachricht hat das konfigurierte Pufferkontingent überschritten. Daher kann die zuverlässige Sitzung nicht fortgesetzt werden.
es: El tamaño necesario para almacenar en búfer un mensaje de secuencia superó la cuota de búfer configurada. Por esta razón, la sesión confiable no puede continuar.
fr: La taille nécessaire pour mettre un message de séquence en mémoire tampon a dépassé le quota configuré. La session fiable ne peut pas continuer.
it: Le dimensioni necessarie per memorizzare nel buffer un messaggio di sequenza hanno superato la quota di buffer configurata. Impossibile continuare la sessione affidabile.
ja: シーケンス メッセージのバッファリングに必要なサイズが、構成されたバッファー クォータを超えました。このため、信頼できるセッションを継続できません。
ko: 시퀀스 메시지의 버퍼링에 필요한 크기가 구성된 버퍼 할당량을 초과했습니다. 이로 인해 신뢰 세션을 계속할 수 없습니다.
pl: Ilość miejsca koniecznego do zbuforowania kolejnego komunikatu sekwencji przekroczyła skonfigurowany przydział buforu. Z tego powodu niezawodna sesja nie może być kontynuowana.
pt_br: O tamanho necessário para armazenar uma mensagem de sequência em buffer excedeu à cota de buffer configurada. Por isso, a sessão confiável não pode continuar.
tr: Bir sıra iletisini arabelleğe alabilmek için gerekli boyut, yapılandırılmış arabellek kotasını aştı. Bu nedenle bu güvenilir oturuma devam edilemiyor.
zh_hans: 缓存序列消息必需的大小已超过配置的缓冲区配额。因此，可靠的会话无法继续。
zh_hant: 緩衝處理順序訊息的所需大小已超出設定的緩衝區配額。因此，可靠工作階段無法繼續。

# SequenceTerminatedReliableRequestThrew
source: The session has stopped waiting for a particular reply. Because of this the reliable session cannot continue.
cs: Relace ukončila čekání na určitou odpověď. Stabilní relace proto nemůže pokračovat.
de: Die Sitzung wartet nicht mehr auf eine bestimmte Antwort. Daher kann die zuverlässige Sitzung nicht fortgesetzt werden.
es: La sesión dejó de esperar una respuesta determinada. Por esta razón, la sesión confiable no puede continuar.
fr: La session a arrêté d'attendre une réponse particulière. La session fiable ne peut pas continuer.
it: La sessione ha arrestato l'attesa per una risposta particolare. Impossibile continuare la sessione affidabile.
ja: セッションは特定の応答を待つことを中止しました。このため、信頼できるセッションを継続できません。
ko: 세션이 특정 응답의 수신 대기를 중단했습니다. 이로 인해 신뢰 세션을 계속할 수 없습니다.
pl: Oczekiwanie sesji na określoną odpowiedź zostało zatrzymane. Z tego powodu niezawodna sesja nie może być kontynuowana.
pt_br: A sessão parou de esperar uma resposta específica. Por isso, a sessão confiável não pode continuar.
tr: Oturum, belirli bir yanıt beklerken durduruldu. Bu nedenle güvenilir oturuma devam edilemiyor.
zh_hans: 会话已停止等待特定答复。因此，可靠的会话无法继续。
zh_hant: 工作階段已停止等待特定回覆。因此，可靠工作階段無法繼續。

# SequenceTerminatedReplyMissingAcknowledgement
source: A reply message was received with no acknowledgement.
cs: Zpráva odpovědi byla přijata bez potvrzení.
de: Es wurde eine Antwortnachricht ohne Bestätigung empfangen.
es: Se recibió un mensaje de respuesta sin confirmación.
fr: Un message de réponse a été reçu sans accusé de réception.
it: Ricevuto un messaggio di risposta senza acknowledgement.
ja: 受信確認が含まれていない応答メッセージを受信しました。
ko: 승인 없이 회신 메시지를 받았습니다.
pl: Otrzymano komunikat odpowiedzi bez potwierdzenia.
pt_br: Uma mensagem de resposta foi recebida sem confirmação.
tr: Bildirimsiz bir yanıt iletisi alındı.
zh_hans: 已接收答复消息，但未确认。
zh_hant: 收到回覆訊息，但無認可。

# SequenceTerminatedSessionClosedBeforeDone
source: The user of the remote endpoint's reliable session expects no more messages and a new message arrived. Due to this the reliable session cannot continue.
cs: Uživatel stabilní relace vzdáleného koncového bodu neočekává další zprávy a nová zpráva byla doručena. Stabilní relace proto nemůže pokračovat.
de: Der Benutzer der zuverlässigen Sitzung des Remoteendpunkts erwartet keine weiteren Nachrichten, und eine neue Nachricht ist eingegangen. Daher kann die zuverlässige Sitzung nicht fortgesetzt werden.
es: El usuario de la sesión confiable del extremo remoto no esperaba más mensajes y llegó un mensaje nuevo. Por esta razón, la sesión confiable no puede continuar.
fr: L'utilisateur de la session fiable du point de terminaison distant n'attend plus de message, mais un nouveau message est arrivé. La session fiable ne peut pas continuer.
it: L'utente della sessione affidabile dell'endpoint remoto non prevede altri messaggi, ma ne è arrivato uno. Impossibile continuare la sessione affidabile.
ja: リモート エンドポイントの信頼できるセッションのユーザーは、追加のメッセージを期待していませんが、新しいメッセージが届きました。このため、信頼できるセッションは継続できません。
ko: 원격 끝점 신뢰 세션의 사용자가 추가 메시지를 예상하지 않았지만 새 메시지가 도착했습니다. 이로 인해 신뢰 세션을 계속할 수 없습니다.
pl: Użytkownik niezawodnej sesji zdalnego punktu końcowego nie oczekiwał kolejnych komunikatów, a otrzymał nowy komunikat. Z tego powodu niezawodna sesja nie może być kontynuowana.
pt_br: O usuário da sessão confiável de ponto de extremidade remoto não esperava mais mensagens e uma nova mensagem chegou. Por isso, essa sessão confiável não pode continuar.
tr: Uzak bitiş noktasının güvenilir oturum kullanıcısı başka ileti beklemiyorken, yeni bir ileti geldi. Bu nedenle güvenli oturuma devam edilemiyor.
zh_hans: 远程终结点可靠会话的用户不再需要有消息和新消息到达。因此，可靠的会话无法继续。
zh_hant: 遠端端點可靠工作階段的使用者未預期任何其他訊息，但有新訊息到達。因此，可靠工作階段無法繼續。

# SequenceTerminatedSmallLastMsgNumber
source: The wsrm:LastMsgNumber value is too small. A message with a larger sequence number has already been received.
cs: Hodnota wsrm:LastMsgNumber je příliš malá. Již byla přijata zpráva s vyšším pořadovým číslem.
de: Der Wert für "wsrm:LastMsgNumber" ist zu klein. Es wurde bereits eine Nachricht mit einer höheren Sequenznummer empfangen.
es: El valor wsrm:LastMsgNumber es demasiado pequeño. Ya se ha recibido un mensaje con un número de secuencia mayor.
fr: La valeur wsrm:LastMsgNumber est trop faible. Un message avec un numéro de séquence plus élevé a déjà été reçu.
it: Valore wsrm:LastMsgNumber troppo piccolo. È già stato ricevuto un messaggio con un numero di sequenza superiore.
ja: wsrm:LastMsgNumber 値が小さすぎます。さらに大きなシーケンス番号を持つメッセージが、既に受信されています。
ko: wsrm:LastMsgNumber 값이 너무 작습니다. 더 큰 시퀀스 번호가 있는 메시지를 이미 수신했습니다.
pl: Wartość wsrm:LastMsgNumber jest zbyt mała. Odebrano już komunikat o większym numerze sekwencji.
pt_br: O valor wsrm:LastMsgNumber é muito pequeno. Uma mensagem com um número de sequência maior já foi recebida.
tr: wsrm:LastMsgNumber değeri çok küçük. Daha büyük sıra numarasına sahip bir ileti zaten alındı.
zh_hans: wsrm:LastMsgNumber 值过小。已收到包含较大序列号的消息。
zh_hant: wsrm:LastMsgNumber 值太小。已收到具有較大序號的訊息。
