Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IXmlSerializableCannotHaveDataContract
source: Type '{0}' cannot be IXmlSerializable and have DataContractAttribute attribute.
cs: Typ {0} nemůže být IXmlSerializable a mít atribut DataContractAttribute.
de: Der Typ "{0}" kann nicht IXmlSerializable sein und zugleich das Attribut DataContractAttribute aufweisen.
es: El tipo "{0}" no puede ser IXmlSerializable y tener el atributo DataContractAttribute.
fr: Le type '{0}' ne peut pas être IXmlSerializable et avoir l'attribut DataContractAttribute.
it: Il tipo '{0}' non può essere IXmlSerializable e contenere l'attributo DataContractAttribute.
ja: 型 '{0}' は IXmlSerializable であってはならず、DataContractAttribute 属性を含んでいてはいけません。
ko: '{0}' 형식은 IXmlSerializable일 수 없으며 DataContractAttribute 특성을 가질 수 없습니다.
pl: Typ „{0}” nie może implementować interfejsu IXmlSerializable i mieć jednocześnie przypisany atrybut DataContractAttribute.
pt_br: O tipo '{0}' não pode ser IXmlSerializable e ter um atributo DataContractAttribute.
ru: Тип "{0}" не может быть IXmlSerializable и иметь атрибут DataContractAttribute.
tr: '{0}' türü IXmlSerializable olamaz ve DataContractAttribute özniteliğine sahip olamaz.
zh_hans: 类型“{0}”不能为 IXmlSerializable，且不能具有 DataContractAttribute 特性。
zh_hant: 類型 '{0}' 不可以是 IXmlSerializable，也不能具有 DataContractAttribute 屬性。

# IXmlSerializableIllegalOperation
source: This method cannot be called from IXmlSerializable implementations.
cs: Tuto metodu nelze volat z implementací IXmlSerializable.
de: Diese Methode kann nicht von IXmlSerializable-Implementierungen aufgerufen werden.
es: No se puede llamar a este método desde las implementaciones de IXmlSerializable.
fr: Cette méthode ne peut pas être appelée à partir des implémentations IXmlSerializable.
it: Non è possibile chiamare questo metodo da implementazioni di IXmlSerializable.
ja: このメソッドを IXmlSerializable 実装から呼び出すことはできません。
ko: 이 메서드를 IXmlSerializable 구현에서 호출할 수 없습니다.
pl: Tej metody nie można wywoływać z implementacji interfejsu IXmlSerializable.
pt_br: Este método não pode ser chamado de implementações IXmlSerializable.
ru: Этот метод не может быть вызван из реализаций IXmlSerializable.
tr: Bu metot, IXmlSerializable uygulamalarından çağrılamaz.
zh_hans: 此方法不能从 IXmlSerializable 实现来调用。
zh_hant: 無法從 IXmlSerializable 實作呼叫此方法。

# IXmlSerializableMissingEndElements
source: IXmlSerializable.WriteXml method of type '{0}' did not close all open tags. Verify that the IXmlSerializable implementation is correct.
cs: Metoda IXmlSerializable.WriteXml typu {0} nezavřela všechny otevřené značky. Ověřte, že implementace IXmlSerializable je správná.
de: Die IXmlSerializable.WriteXml-Methode vom Typ "{0}" hat nicht alle offenen Tags geschlossen. Stellen Sie sicher, dass die IXmlSerializable-Implementierung korrekt ist.
es: El método IXmlSerializable.WriteXml del tipo "{0}" no cerró todas las etiquetas abiertas. Compruebe que la implementación de IXmlSerializable es correcta.
fr: La méthode IXmlSerializable.WriteXml de type '{0}' n'a pas fermé toutes les balises ouvertes. Vérifiez que l'implémentation IXmlSerializable est correcte.
it: Il metodo IXmlSerializable.WriteXml di tipo '{0}' non ha chiuso tutti i tag aperti. Verificare che l'implementazione di IXmlSerializable sia corretta.
ja: 型 '{0}' の IXmlSerializable.WriteXml メソッドは、すべての開いているタグを閉じませんでした。IXmlSerializable の実装が正しいことを確認してください。
ko: '{0}' 형식의 IXmlSerializable.WriteXml 메서드가 열려 있는 모든 태그를 닫지 않았습니다. IXmlSerializable 구현이 올바른지 확인하세요.
pl: Metoda IXmlSerializable.WriteXml typu „{0}” nie zamknęła wszystkich otwartych tagów. Upewnij się, że implementacja interfejsu IXmlSerializable jest prawidłowa.
pt_br: O método IXmlSerializable.WriteXml do tipo '{0}' não fechou todas as marcações abertas. Verifique se a implementação do IXmlSerializable está correta.
ru: Метод XmlSerializable.WriteXml типа "{0}" не закрыл все открытые теги. Проверьте правильность реализации IXmlSerializable.
tr: '{0}' türü IXmlSerializable.WriteXml metodu tüm açık etiketleri kapatmadı. IXmlSerializable uygulamasının doğru olduğundan emin olun.
zh_hans: 类型“{0}”的 IXmlSerializable.WriteXml 方法未关闭所有打开的标记。请验证 IXmlSerializable 实现是否正确。
zh_hant: 類型 '{0}' 的 IXmlSerializable.WriteXml 方法並未關閉所有開放式標記。請確定 IXmlSerializable 的實作正確。

# IXmlSerializableMustHaveDefaultConstructor
source: IXmlSerializable Type '{0}' must have default constructor.
cs: Typ IXmlSerializable {0} musí mít výchozí konstruktor.
de: Der IXmlSerializable-Typ "{0}" muss einen Standardkonstruktor aufweisen.
es: El tipo IXmlSerializable "{0}" debe tener un constructor predeterminado.
fr: Le type IXmlSerializable '{0}' doit avoir le constructeur par défaut.
it: Il tipo IXmlSerializable '{0}' deve contenere il costruttore predefinito.
ja: IXmlSerializable 型 '{0}' には、既定のコンストラクターが含まれている必要があります。
ko: IXmlSerializable 형식 '{0}'에 기본 생성자가 있어야 합니다.
pl: Typ „{0}” implementujący interfejs IXmlSerializable musi mieć domyślnego konstruktora.
pt_br: IXmlSerializable tipo '{0}' deve ter um construtor padrão.
ru: Тип IXmlSerializable "{0}" должен иметь конструктор по умолчанию.
tr: IXmlSerializable Type '{0}', varsayılan oluşturucuya sahip olmalıdır.
zh_hans: IXmlSerializable 类型“{0}”必须具有默认的构造函数。
zh_hant: IXmlSerializable 類型 '{0}' 必須具有預設的建構函式。

# IXmlSerializableWritePastSubTree
source: IXmlSerializable.WriteXml method of type '{0}' attempted to close too many tags. Verify that the IXmlSerializable implementation is correct.
cs: Metoda IXmlSerializable.WriteXml typu {0} se pokusila zavřít příliš mnoho značek. Zkontrolujte, jestli je implementace IXmlSerializable správná.
de: Die IXmlSerializable.WriteXml-Methode vom Typ "{0}" hat versucht, zu viele Tags zu schließen. Stellen Sie sicher, dass die IXmlSerializable-Implementierung korrekt ist.
es: El método IXmlSerializable.WriteXml del tipo "{0}" intentó cerrar demasiadas etiquetas. Compruebe que la implementación de IXmlSerializable es correcta.
fr: La méthode IXmlSerializable.WriteXml de type '{0}' a tenté de fermer trop de balises. Vérifiez que l'implémentation IXmlSerializable est correcte.
it: Il metodo IXmlSerializable.WriteXml di tipo '{0}' ha cercato di chiudere troppi tag. Verificare che l'implementazione di IXmlSerializable sia corretta.
ja: 型 '{0}' の IXmlSerializable.WriteXml メソッドが閉じようとしたタグが多すぎます。IXmlSerializable の実装が正しいことを確認してください。
ko: '{0}' 형식의 IXmlSerializable.WriteXml 메서드가 너무 많은 태그를 닫으려고 했습니다. IXmlSerializable 구현이 올바른지 확인하세요.
pl: Metoda IXmlSerializable.WriteXml typu „{0}” próbowała zamknąć zbyt wiele tagów. Upewnij się, że implementacja interfejsu IXmlSerializable jest prawidłowa.
pt_br: O método IXmlSerializable.WriteXml do tipo '{0}' tentou fechar muitas marcações. Verifique se a implementação do IXmlSerializable está correta.
ru: Метод XmlSerializable.WriteXml типа "{0}" пытался закрыть слишком много тегов. Проверьте правильность реализации IXmlSerializable.
tr: '{0}' türü IXmlSerializable.WriteXml metodu çok fazla etiket kapatmayı denedi. IXmlSerializable uygulamasının doğru olduğundan emin olun.
zh_hans: 类型为“{0}”的 IXmlSerializable.WriteXml 方法试图关闭过多的标记。请验证 IXmlSerializable 实现是否正确。
zh_hant: 類型 '{0}' 的 IXmlSerializable.WriteXml 方法嘗試關閉太多標記。請確定 IXmlSerializable 的實作正確。

# InconsistentIsReference
source: The IsReference setting for type '{0}' is '{1}', but the same setting for its parent class '{2}' is '{3}'. Derived types must have the same value for IsReference as the base type. Change the setting on type '{0}' to '{3}', or on type '{2}' to '{1}', or do not set IsReference explicitly.
cs: Nastavení IsReference typu {0} je {1}. Toto nastavení pro nadřazenou třídu {2} je však {3}. Odvozené typy musí mít stejnou hodnotu nastavení IsReference jako základní typ. Změňte nastavení typu {0} na {3} (nebo nastavení typu {2} na {1}) nebo nenastavujte explicitně IsReference.
de: Die IsReference-Einstellung für den Typ "{0}" ist "{1}", die gleiche Einstellung für seine übergeordnete Klasse "{2}" ist jedoch "{3}". Abgeleitete Typen müssen für IsReference den gleichen Wert besitzen wie ihr Basistyp. Ändern Sie die Einstellung für den Typ "{0}" in "{3}" bzw. für den Typ "{2}" in "{1}", oder legen Sie IsReference nicht explizit fest.
es: El valor IsReference del tipo "{0}" es "{1}", pero el mismo valor para su clase primaria "{2}" es "{3}". Los tipos derivados deben tener el mismo valor IsReference que el tipo base. Cambie el valor del tipo "{0}" a "{3}", o del tipo "{2}" a "{1}", o bien no establezca IsReference de manera explícita.
fr: Le paramètre IsReference du type '{0}' est '{1}', mais le même paramètre pour sa classe parente '{2}' est '{3}'. Les types dérivés doivent avoir la même valeur pour IsReference comme type de base. Remplacez le paramètre du type '{0}' par '{3}' ou du type '{2}' par '{1}', ou ne définissez pas IsReference explicitement.
it: L'impostazione IsReference per il tipo '{0}' è '{1}', ma la stessa impostazione per la classe padre '{2}' è '{3}'. Il valore di IsReference dei tipi derivati deve essere uguale a quello del tipo di base. Modificare l'impostazione del tipo '{0}' in '{3}' o del tipo '{2}' in '{1}' oppure non impostare IsReference in modo esplicito.
ja: 型 '{0}' の IsReference 設定が '{1}' ですが、その親クラス '{2}' の同じ設定は '{3}' です。派生型の IsReference は基本データ型と同じ値に設定する必要があります。型 '{0}' を '{3}' に変更するか、型 '{2}' を '{1}' に変更するか、IsReference を明示的に設定しないようにしてください。
ko: '{0}' 형식의 IsReference 설정은 '{1}'이지만 부모 클래스 '{2}'에 대한 설정은 '{3}'입니다. 파생 형식의 IsReference에 대해서는 기본 형식과 같은 값을 사용해야 합니다. '{0}' 형식의 설정을 '{3}'(으)로, '{2}' 형식의 설정을 '{1}'(으)로 변경하거나 IsReference를 명시적으로 설정하지 마세요.
pl: Ustawienie IsReference dla typu „{0}” jest równe „{1}”, ale to samo ustawienie dla jego klasy nadrzędnej „{2}” jest równe „{3}”. Typy pochodne muszą mieć tę samą wartość ustawienia IsReference, co typ bazowy. Zmień to ustawienie w typie „{0}” na „{3}” lub w typie „{2}” na „{1}” albo nie ustawiaj jawnie wartości IsReference.
pt_br: A configuração IsReference para o tipo '{0}' é '{1}', mas a mesma configuração para a classe pai '{2}' é '{3}'. Os tipos derivados devem ter o mesmo valor de IsReference que o tipo base. Altere a configuração no tipo '{0}' para '{3}' ou no tipo '{2}' para '{1}' ou não defina IsReference explicitamente.
ru: Параметром IsReference для типа "{0}" является "{1}", однако таким же параметром для его родительского класса "{2}" является "{3}". Производные типы должны иметь такое же значение для параметра IsReference, что и базовый тип. Измените параметр для типа "{0}" на "{3}" или для типа "{2}" на "{1}" или не устанавливайте параметр IsReference явно.
tr: '{0}' türünün IsReference ayarı '{1}', ancak üst sınıfı olan '{2}' için aynı ayar '{3}'. Türetilmiş türlerin IsReference değeri temel türle aynı olmalıdır. Ayarı '{0}' türünde '{3}' olarak veya '{2}' türünde '{1}' olarak değiştirin ya da IsReference değerini açıkça ayarlamayın.
zh_hans: 类型“{0}”的 IsReference 设置是“{1}”，但其父类“{2}”的同一个设置是“{3}”。派生类型必须具有与基类型相同的 IsReference 值。请将类型“{0}”的此设置改为“{3}”，或将类型“{2}”的此设置改为“{1}”，或者不要显式设置 IsReference。
zh_hant: 類型 '{0}' 的 IsReference 設定為 '{1}'，但其父類別 '{2}' 的同一設定為 '{3}'。衍生類型的 IsReference 值必須和基底類型相同。請將類型 '{0}' 的設定變更為 '{3}'，或將類型 '{2}' 的設定變更為 '{1}'，或不要明確設定 IsReference。

# IndexedPropertyCannotBeSerialized
source: Property '{1}' in type '{0}' cannot be serialized because serialization of indexed properties is not supported.
cs: Vlastnost {1} v typu {0} nelze serializovat, protože serializace indexovaných vlastností není podporována.
de: Die {1}-Eigenschaft im Typ "{0}" kann nicht serialisiert werden, da die Serialisierung von indizierten Eigenschaften nicht unterstützt wird.
es: La propiedad "{1}" del tipo "{0}" no se puede serializar, ya que no se admite la serialización de las propiedades indizadas.
fr: Impossible de sérialiser la propriété '{1}' dans le type '{0}', car la sérialisation des propriétés indexées n'est pas prise en charge.
it: Non è possibile serializzare la proprietà '{1}' del tipo '{0}'. La serializzazione delle proprietà indicizzate non è supportata.
ja: インデックス付きプロパティのシリアル化はサポートされていないため、型 '{0}' のプロパティ '{1}' をシリアル化できません。
ko: 인덱스 속성의 serialization이 지원되지 않으므로 형식 '{0}'의 '{1}' 속성을 직렬화할 수 없습니다.
pl: Nie można zserializować właściwości „{1}” w typie „{0}”, ponieważ serializowanie właściwości indeksowanych jest nieobsługiwane.
pt_br: A propriedade '{1}' no tipo '{0}' não pode ser serializada porque não há suporte para a serialização de propriedades indexadas.
ru: Свойство "{1}" в типе "{0}" не может быть сериализовано, так как сериализация индексированных свойств не поддерживается.
tr: Dizinlenmiş özelliklerin serileştirilmesi desteklenmediğinden, '{0}' türündeki '{1}' özelliği serileştirilemiyor.
zh_hans: 无法序列化类型“{0}”中的属性“{1}”，因为不支持对索引属性进行序列化。
zh_hant: 無法序列化類型 '{0}' 中的屬性 '{1}'，因為不支援將索引屬性序列化。

# InvalidAnnotationExpectingText
source: Annotation '{0}' from namespace '{1}' has an invalid element '{2}' from namespace '{3}'. Expecting text.
cs: Poznámka {0} z oboru názvů {1} má neplatný element {2} z oboru názvů {3}. Očekává se text.
de: Die Anmerkung "{0}" aus dem Namespace "{1}" enthält ein ungültiges Element "{2}" aus dem Namespace "{3}". Erwartet wird Text.
es: La anotación "{0}" del espacio de nombres "{1}" tiene un elemento "{2}" no válido del espacio de nombres "{3}". Se espera texto.
fr: L'annotation '{0}' provenant de l'espace de noms '{1}' comporte un élément '{2}' non valide provenant de l'espace de noms '{3}'. Texte attendu.
it: L'annotazione '{0}' dello spazio dei nomi '{1}' contiene un elemento non valido '{2}' dello spazio dei nomi '{3}'. È previsto testo.
ja: 名前空間 '{1}' の注釈 '{0}' に、名前空間 '{3}' の無効な要素 '{2}' が含まれています。テキストを指定してください。
ko: 네임스페이스 '{1}'의 주석 '{0}'에 네임스페이스 '{3}'의 잘못된 '{2}' 요소가 있습니다. 텍스트가 필요합니다.
pl: Adnotacja „{0}” z przestrzeni nazw „{1}” ma nieprawidłowy element „{2}” z przestrzeni nazw „{3}”. Oczekiwany tekst.
pt_br: A anotação '{0}' do namespace '{1}' tem um elemento inválido '{2}' do namespace '{3}'. Espera-se texto.
ru: Пометка "{0}" из пространства имен "{1}" имеет недопустимый элемент "{2}" из пространства имен "{3}". Ожидается текст.
tr: '{1}' ad alanındaki '{0}' açıklaması, '{3}' ad alanından gelen geçersiz bir '{2}' öğesine sahip. Metin bekleniyordu.
zh_hans: 来自命名空间“{1}”的注释“{0}”具有来自命名空间“{3}”的无效元素“{2}”。应为文本。
zh_hant: 命名空間 '{1}' 的註釋 '{0}' 有來自命名空間 '{3}' 的無效元素 '{2}'。其應為文字。

# InvalidAsyncResult
source: The asynchronous result object used to end this operation was not the object that was returned when the operation was initiated.
cs: Asynchronní objekt výsledku použitý k ukončení této operace nebyl objektem vráceným při inicializaci operace.
de: Das zum Beenden dieses Vorgangs verwendete asynchrone Ergebnisobjekt war nicht mit dem Objekt identisch, das beim Initiieren des Vorgangs zurückgegeben wurde.
es: El objeto de resultado asincrónico usado para finalizar esta operación no era el objeto devuelto cuando se inició la operación.
fr: L'objet de résultat asynchrone utilisé pour terminer cette opération n'était pas l'objet retourné quand l'opération a démarré.
it: L'oggetto del risultato asincrono usato per terminare questa operazione non è l'oggetto restituito all'avvio dell'operazione.
ja: この操作を終了させるために使用された非同期結果オブジェクトは、この操作が開始されたときに返されたオブジェクトではありませんでした。
ko: 이 작업을 끝내는 데 사용된 비동기 결과 개체가 작업을 시작할 때 반환된 개체가 아닙니다.
pl: Asynchroniczny obiekt wyniku użyty do zakończenia tej operacji nie był obiektem, który został zwrócony w momencie zainicjowania tej operacji.
pt_br: O objeto de resultado assíncrono usado para encerrar essa operação não era o objeto retornado quando a operação foi iniciada.
ru: Объект асинхронного результата, использовавшийся для завершения этой операции, не совпадает с объектом, возвращенным в начале операции.
tr: Bu işlemi bitirmek için kullanılan asenkron sonuç nesnesi, işlem başlatıldığında döndürülen nesne değil.
zh_hans: 用于结束此操作的异步结果对象不是启动该操作时返回的对象。
zh_hant: 用於結束此作業的非同步結果物件，並非作業初始化時所傳回的物件。

# InvalidCharacterEncountered
source: Encountered invalid character '{0}'.
cs: Byl zjištěn neplatný znak {0}.
de: Ein ungültiges Zeichen "{0}" wurde gefunden.
es: Carácter no válido "{0}".
fr: Caractère non valide '{0}'.
it: È stato rilevato il carattere '{0}' non valido.
ja: 無効な文字 '{0}' が見つかりました。
ko: 잘못된 문자 '{0}'이(가) 발견되었습니다.
pl: Napotkano nieprawidłowy znak „{0}”.
pt_br: Caractere inválido encontrado '{0}'.
ru: Обнаружен недопустимый символ "{0}".
tr: Geçersiz '{0}' karakteriyle karşılaşıldı.
zh_hans: 遇到无效的字符“{0}”。
zh_hant: 出現了無效的字元 '{0}'。

# InvalidClassDerivation
source: Type '{0}' in namespace '{1}' cannot be used as the base type of a data contract type, because it itself does not have a data contract. Consider marking type '{0}' with the DataContractAttribute attribute.
cs: Typ {0} v oboru názvů {1} nelze použít jako základní typ typu kontraktu dat, protože nemá kontrakt dat. Označte typ {0} atributem DataContractAttribute.
de: Der Typ "{0}" im Namespace "{1}" kann nicht als Basistyp eines Datenvertragstyps verwendet werden, da er selbst keinen Datenvertrag enthält. Markieren Sie den Typ "{0}" ggf. mit dem Attribut DataContractAttribute.
es: El tipo "{0}" del espacio de nombres "{1}" no se puede usar como tipo base de un tipo de contrato de datos porque no tiene un contrato de datos. Pruebe a marcar el tipo "{0}" con el atributo DataContractAttribute.
fr: Impossible d'utiliser le type '{0}' dans l'espace de noms '{1}' comme type de base d'un type de contrat de données, car il n'a pas lui-même de contrat de données. Marquez le type '{0}' avec l'attribut DataContractAttribute.
it: Non è possibile usare il tipo '{0}' dello spazio dei nomi '{1}' come tipo di base di un tipo di contratto di dati perché non contiene un contratto di dati. Provare a contrassegnare il tipo '{0}' con l'attributo DataContractAttribute.
ja: 名前空間 '{1}' の型 '{0}' は、それ自体はデータ コントラクトを持たないため、データ コントラクト型の基本データ型としては使用できません。型 '{0}' に DataContractAttribute 属性を設定してください。
ko: 네임스페이스 '{1}'의 '{0}' 형식은 데이터 계약이 없기 때문에 데이터 계약 형식의 기본 형식으로 사용할 수 없습니다. '{0}' 형식을 DataContractAttribute 특성으로 표시해 보세요.
pl: Nie można użyć typu „{0}” w przestrzeni nazw „{1}” jako typu podstawowego typu kontraktu danych, ponieważ nie ma on kontraktu danych. Oznacz typ „{0}” atrybutem DataContractAttribute.
pt_br: O tipo '{0}' no namespace '{1}' não pode ser usado como o tipo base de um tipo de contrato de dados, porque ele próprio não tem um contrato de dados. Considere marcar o tipo '{0}' com o atributo DataContractAttribute.
ru: Тип "{0}" в пространстве имен "{1}" не может использоваться как базовый тип некоторого типа контракта данных, так как он сам не имеет контракта данных. Пометьте тип "{0}" с помощью атрибута DataContractAttribute.
tr: Kendisi bir veri anlaşmasına sahip olmadığından, '{1}' ad alanındaki '{0}' türü, bir veri anlaşması türünün temel türü olarak kullanılamıyor. '{0}' türünü DataContractAttribute özniteliğiyle işaretlemeyi deneyin.
zh_hans: 命名空间“{1}”中的类型“{0}”无法用作数据协定类型的基类型，因为它本身不具有数据协定。请考虑使用 DataContractAttribute 特性标记类型“{0}”。
zh_hant: 命名空間 '{1}' 中的類型 '{0}' 無法用來作為資料合約類型的基底類型，因為該類型自身沒有資料合約。請考慮建立具有 DataContractAttribute 屬性的類型 '{0}'。
