Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ReferencedTypesCannotContainNull
source: ReferencedTypes specified via ImportOptions must contain valid types. Cannot contain null.
cs: Typy ReferencedTypes určené možnostmi ImportOptions musejí obsahovat platné typy. Nemohou obsahovat hodnotu null.
de: Die über ImportOptions angegebene ReferencedTypes-Liste muss gültige Typen enthalten. Ein NULL-Wert ist nicht zulässig.
es: El elemento ReferencedTypes especificado mediante ImportOptions debe contener tipos válidos. No puede contener valores nulos.
fr: L'entité ReferencedTypes spécifiée via ImportOptions doit contenir des types valides. Elle ne peut pas contenir une valeur null.
it: L'elemento ReferencedTypes specificato tramite ImportOptions deve contenere tipi validi. Non può contenere Null.
ja: ImportOptions を介して指定された ReferencedTypes には、有効な型を含める必要があります。null を含むことはできません。
ko: ImportOptions를 통해 지정된 ReferencedTypes는 적합한 형식을 포함해야 합니다. null을 포함할 수 없습니다.
pl: Właściwość ReferencedTypes określona za pomocą elementu ImportOptions musi zawierać prawidłowe typy. Nie może zawierać wartości null.
pt_br: O ReferencedTypes especificado via ImportOptions deve conter tipos válidos. Não pode conter nulos.
ru: ReferencedTypes, указанные в параметре ImportOptions, должны содержать допустимые типы и не могут включать в себя null.
tr: ImportOptions ile belirtilen ReferencedTypes öğeleri geçerli tür bulundurmalıdır. null içeremez.
zh_hans: 通过 ImportOptions 指定的 ReferencedTypes 必须包含有效的类型。不能包含 Null 类型。
zh_hant: 透過 ImportOptions 指定的 ReferencedTypes 必須包含有效的類型。不可以包含 Null。

# RequiredMemberMustBeEmitted
source: Member {0} in type {1} cannot be serialized. This exception is usually caused by trying to use a null value where a null value is not allowed. The '{0}' member is set to its default value (usually null or zero). The member's EmitDefault setting is 'false', indicating that the member should not be serialized. However, the member's IsRequired setting is 'true', indicating that it must be serialized. This conflict cannot be resolved. Consider setting '{0}' to a non-default value. Alternatively, you can change the EmitDefaultValue property on the DataMemberAttribute attribute to true, or changing the IsRequired property to false.
cs: Člen {0} v typu {1} nelze serializovat. Tato výjimka je obvykle způsobena pokusem o použití hodnoty null, když hodnota null není povolena. Člen {0} je nastaven na výchozí hodnotu (obvykle hodnota null nebo nula). Nastavení EmitDefault členu má hodnotu false, což znamená, že by člen neměl být serializován. Ovšem nastavení členu IsRequired má hodnotu true, což znamená, že serializován být musí. Tento konflikt nelze vyřešit. Nastavte {0} na hodnotu jinou než výchozí. Můžete také změnit vlastnost EmitDefaultValue u atributu DataMemberAttribute na hodnotu true, nebo změnit vlastnost IsRequired na hodnotu false.
de: Der Member {0} im Typ {1} kann nicht serialisiert werden. Diese Ausnahme ist normalerweise darauf zurückzuführen, dass versucht wurde, einen NULL-Wert an einer Stelle zu verwenden, an der dies nicht zulässig ist. Der Member "{0}" ist auf den Standardwert (normalerweise NULL oder Null) eingestellt. Die EmitDefault-Einstellung des Members ist auf "false" gesetzt. Dies bedeutet, dass der Member nicht serialisiert werden sollte. Die IsRequired-Einstellung des Member lautet jedoch "true", d. h. der Member muss serialisiert werden. Dieser Konflikt kann nicht gelöst werden. Legen Sie "{0}" ggf. auf einen anderen Wert als den Standardwert fest. Alternativ können Sie die EmitDefaultValue-Eigenschaft des Attributs "DataMemberAttribute" in "true" ändern oder die IsRequired-Eigenschaft auf "false" setzen.
es: El miembro {0} del tipo {1} no se puede serializar. La causa de esta excepción suele ser un intento de usar un valor nulo sin que ello esté permitido. El miembro "{0}" tiene asignado su valor predeterminado (normalmente nulo o cero). La opción EmitDefault del miembro tiene el valor "false", lo cual indica que no se debe serializar. Sin embargo, la opción IsRequired del miembro tiene el valor "true", que indica que debe serializarse. No es posible resolver este conflicto. Pruebe a asignar un valor no predeterminado a "{0}". Otra opción es cambiar la propiedad el valor de la propiedad EmitDefaultValue del atributo DataMemberAttribute a "true", o bien cambiar el valor de la propiedad IsRequired a "false".
fr: Impossible de sérialiser le membre {0} dans le type {1}. Cette exception est en général provoquée par une tentative d'utilisation d'une valeur null alors qu'elle est proscrite. La valeur du membre '{0}' est définie par défaut (habituellement null ou zéro). La valeur du paramètre EmitDefault du membre est 'false', indiquant ainsi que le membre ne doit pas être sérialisé. Toutefois, la valeur du paramètre IsRequired est 'true', indiquant ainsi qu'il doit être sérialisé. Impossible de résoudre ce conflit. Affectez au paramètre '{0}' une autre valeur que la valeur par défaut. Vous pouvez également changer la propriété EmitDefaultValue de l'attribut DataMemberAttribute en lui affectant la valeur true, ou changer la propriété IsRequired en lui affectant la valeur false.
it: Non è possibile serializzare il membro {0} nel tipo {1}. Questa eccezione si verifica in genere quando si prova a usare un valore Null nei casi in cui non è consentito. Il membro '{0}' è impostato sul relativo valore predefinito (in genere Null o zero). L'impostazione EmitDefault del membro è 'false', per indicare che il membro non deve essere serializzato. L'impostazione IsRequired del membro è tuttavia 'true', per indicare che può essere serializzato. Questo conflitto non è risolvibile. Provare a impostare '{0}' su un valore non predefinito. In alternativa, impostare la proprietà EmitDefaultValue dell'attributo DataMemberAttribute su true o impostare la proprietà IsRequired su false.
ja: 型 {1} のメンバー {0} をシリアル化できません。この例外は一般に、null 値が許可されていない場所で null を使用しようとしたときに発生します。'{0}' メンバーは既定値に設定されています (通常は null または 0)。このメンバーの EmitDefault 設定は 'False' であり、これはこのメンバーをシリアル化してはいけないことを示しますが、このメンバーの IsRequired 設定は 'True' であり、これはこのメンバーをシリアル化する必要があることを示します。この競合は解決できません。'{0}' を既定値以外の値に設定してください。または、DataMemberAttribute 属性の EmitDefaultValue プロパティを True に変更するか、IsRequired プロパティを False に変更するという方法でも対処できます。
ko: 형식 {1}의 {0} 멤버를 직렬화할 수 없습니다. 일반적으로 이 예외는 null 값이 허용되지 않는 곳에서 null 값을 사용하려고 할 경우에 발생합니다. '{0}' 멤버는 해당 기본값(일반적으로 null 또는 0)으로 설정됩니다. 멤버의 EmitDefault 설정이 'false'이며 이것은 멤버를 직렬화하면 안 된다는 것을 나타냅니다. 그러나 멤버의 IsRequired 설정이 'true'이며 이것은 멤버를 직렬화해야 한다는 것을 나타냅니다. 이 충돌은 해결할 수 없습니다. '{0}' 설정을 기본값이 아닌 값으로 설정해 보세요. 또는 DataMemberAttribute 특성에서 EmitDefaultValue 속성을 true로 변경하거나 IsRequired 속성을 false로 변경할 수 있습니다.
pl: Nie można serializować składowej {0} w typie {1}. Ten wyjątek jest zazwyczaj spowodowany próbą użycia wartości null w niedozwolonym miejscu. Składowa „{0}” ma wartość domyślną (zazwyczaj wartość null lub zerową). Ustawienie EmitDefault składowej ma wartość „false”, co oznacza, że nie można serializować tej składowej. Jednak ustawienie IsRequired składowej ma wartość „true”, co oznacza, że musi ona być serializowana. Nie można rozwiązać tego konfliktu. Rozważ ustawienie dla składowej „{0}” wartości innej niż domyślna. Możesz również zmienić wartość właściwości EmitDefaultValue w atrybucie DataMemberAttribute na „true” lub zmienić wartość właściwości IsRequired na „false”.
pt_br: O membro {0} no tipo {1} não pode ser serializado. Essa exceção normalmente é causada pela tentativa de usar um valor nulo quando ele não é permitido. O membro '{0}' é definido como seu valor padrão (normalmente nulo ou zero). A configuração de EmitDefault do membro é 'false', indicando que ele não deve ser serializado. Entretanto, a configuração de IsRequired do membro é 'true', indicando que ele deve ser serializado. Esse conflito não pode ser resolvido. Considere configurar '{0}' como um valor não padrão. Como alternativa, você pode alterar a propriedade EmitDefaultValue no atributo DataMemberAttribute para true ou alterar a propriedade IsRequired para false.
ru: Член {0} в типе {1} не может быть сериализован. Причиной этого исключения обычно является попытка использования значения null там, где значение null является недопустимым. Для члена "{0}" устанавливается значение по умолчанию (обычно null или нуль). Параметр EmitDefault члена имеет значение false, указывающее, что член не может быть сериализован. С другой стороны, параметр IsRequired члена имеет значение true, указывающее, что он должен быть сериализован. Этот конфликт неразрешим. Можно установить значение "{0}", отличное от значения по умолчанию. Кроме того, можно изменить свойство EmitDefaultValue в атрибуте DataMemberAttribute на true или изменить свойство IsRequired на false.
tr: {1} türündeki {0} üyesi serileştirilemiyor. Bu özel durum genellikle kullanımına izin verilmeyen yerlerde bir null değer kullanılmaya çalışılmasıyla oluşur. '{0}' üyesi varsayılan değerine ayarlanmış durumda (genellikle null ya da sıfır). Üyenin EmitDefault ayarı 'false', bu da üyenin serileştirilmemesi gerektiğini gösteriyor. Ancak üyenin IsRequired ayarı 'true', bu ise üyenin serileştirilmesi gerektiğini gösteriyor. Bu çakışma çözülemez. '{0}' değerini varsayılan dışında bir değere ayarlamayı deneyin. Alternatif olarak DataMemberAttribute özniteliğindeki EmitDefaultValue özelliğini true olarak ya da IsRequired özelliğini false olarak değiştirebilirsiniz.
zh_hans: 无法序列化类型 {1} 中的成员 {0}。此异常通常是由于尝试使用了不允许的 null 值而导致的。“{0}”成员已设置为其默认值(通常为 null 或零)。该成员的 EmitDefault 设置为 "False"，表示不应序列化该成员。但该成员的 IsRequired 设置为 "True"，表示必须进行序列化。此冲突无法解决。可以考虑将“{0}”设置为非默认值。或者，将 DataMemberAttribute 特性中的 EmitDefaultValue 属性更改为 True，或将 IsRequired 属性更改为 False。
zh_hant: 無法序列化類型 {1} 中的成員 {0}。此例外狀況通常是因為嘗試在不允許 Null 值的位置使用了 Null 所造成。請將該 '{0}' 成員設定為其預設值 (通常為 Null 或零)，若該成員的 EmitDefault 設定是 'false'，表示不應該序列化該成員。但是，若該成員的 IsRequired 設定是 'false'，則表示必須要序列化該成員。目前尚無法解決此一衝突情況。請考慮將 '{0}' 設定成非預設的值。此外，可將 DataMemberAttribute 屬性上的 EmitDefaultValue 屬性變更為 true，或是將 IsRequired 屬性變更為 false。

# ResolveTypeReturnedFalse
source: An object of type '{0}' which derives from DataContractResolver returned false from its TryResolveType method when attempting to resolve the name for an object of type '{1}', indicating that the resolution failed. Change the TryResolveType implementation to return true.
cs: Metoda TryResolveType objektu typu {0} (odvozeného od třídy DataContractResolver) vrátila při pokusu o získání názvu objektu typu {1} hodnotu false, což znamená, že získání názvu selhalo. Změňte implementaci metody TryResolveType tak, aby se vracela hodnota true.
de: Ein aus DataContractResolver abgeleitetes Objekt vom Typ "{0}" hat bei dem Versuch, den Namen für ein Objekt vom Typ "{1}" aufzulösen, "false" für seine TryResolveType-Methode zurückgegeben. Dies gibt an, dass bei der Auflösung ein Fehler aufgetreten ist. Ändern Sie die TryResolveType-Implementierung, sodass "true" zurückgegeben wird.
es: Un objeto de tipo "{0}" que deriva de DataContractResolver devolvió false de su método TryResolveType al intentar resolver el nombre para un objeto de tipo "{1}", indicando un error de la resolución. Cambie la implementación TryResolveType para que devuelva true.
fr: Un objet de type '{0}'qui dérive de DataContractResolver a retourné false à partir de sa méthode TryResolveType durant la tentative de résolution du nom d'un objet de type '{1}', ce qui indique l'échec de la résolution. Changez l'implémentation de TryResolveType pour retourner true.
it: Il metodo TryResolveType di un oggetto di tipo '{0}' che deriva da DataContractResolver ha restituito false durante il tentativo di risolvere il nome per un oggetto di tipo '{1}', indicando che la risoluzione non è riuscita. Modificare l'implementazione di TryResolveType in modo che restituisca true.
ja: DataContractResolver から派生した型 '{0}' のオブジェクトは、型 '{1}' のオブジェクトの名前を解決しようとしたときに TryResolveType メソッドから False を返し、解決は失敗しました。True を返すように、TryResolveType の実装を変更してください。
ko: DataContractResolver에서 파생되는 '{0}' 형식의 개체가 '{1}' 형식의 개체에 대한 이름을 확인하려고 할 때 해당 TryResolveType 메서드에서 false를 반환했습니다. 이는 확인 작업에 실패했음을 의미합니다. true를 반환하도록 TryResolveType 구현을 변경하세요.
pl: Obiekt typu „{0}” pochodzący od obiektu DataContractResolver zwrócił wartość False w wyniku wykonania metody TryResolveType podczas próby rozpoznania nazwy obiektu typu „{1}”, co wskazuje niepowodzenie rozpoznawania. Zmień implementację metody TryResolveType, tak aby zwracała wartość true.
pt_br: Um objeto do tipo '{0}', que deriva de DataContractResolver, retornou false de seu método TryResolveType ao tentar resolver o nome de um objeto do tipo '{1}', indicando a falha na resolução. Altere a implementação de TryResolveType para retornar true.
ru: Для объекта типа "{0}", производного от DataContractResolver, получено значение false из метода TryResolveType при попытке разрешить имя для объекта типа "{1}", что указывает на неуспешное разрешение имени. Измените реализацию метода TryResolveType для получения значения true.
tr: DataContractResolver'dan türetilmiş '{0}' türündeki bir nesne, '{1}' türündeki bir nesnenin adını çözümlemeye çalışırken TryResolveType metodundan false döndürdü ve bu, çözümlemenin başarısız olduğunu gösteriyor. TryResolveType uygulamasını true döndürecek şekilde değiştirin.
zh_hans: 尝试解析“{1}”类型对象的名称时，从 DataContractResolver 派生的“{0}”类型对象在从其 TryResolveType 方法返回了 False，这表明解析失败。请更改 TryResolveType 实现，以返回 True。
zh_hant: 嘗試解析類型 '{1}' 物件的名稱時，衍生自 DataContractResolver 的類型 '{0}' 物件從其 TryResolveType 方法傳回了 false，表示解析失敗。請變更 TryResolveType 實作以傳回 true。

# ResolveTypeReturnedNull
source: An object of type '{0}' which derives from DataContractResolver returned a null typeName or typeNamespace but not both from its TryResolveType method when attempting to resolve the name for an object of type '{1}'. Change the TryResolveType implementation to return non-null values, or to return null values for both typeName and typeNamespace in order to serialize as the declared type.
cs: Metoda TryResolveType objektu typu {0} (odvozeného od třídy DataContractResolver) vrátila při pokusu o získání názvu objektu typu {1} jednu z vlastností typeName nebo typeNamespace s hodnotou null. Pokud chcete provést serializaci deklarovaného typu, změňte implementaci metody TryResolveType tak, aby nevracela hodnoty typu null, nebo aby tyto hodnoty vracela pro vlastnosti typeName a typeNamespace shodně.
de: Ein aus DataContractResolver abgeleitetes Objekt vom Typ "{0}" hat bei dem Versuch, den Namen für ein Objekt vom Typ "{1}" aufzulösen, für typeName oder typeNamespace, jedoch nicht für beide, den Wert NULL für seine TryResolveType-Methode zurückgegeben. Ändern Sie die TryResolveType-Implementierung, sodass Werte ungleich NULL oder sowohl für typeName als auch typeNamespace NULL-Werte zur Serialisierung als deklarierter Typ zurückgegeben werden.
es: Un objeto de tipo "{0}" derivado de DataContractResolver devolvió un elemento typeNamespace o typeName nulo (pero no ambos) de su método TryResolveType al intentar resolver el nombre de un objeto de tipo "{1}". Cambie la implementación de TryResolveType de forma que devuelva valores no nulos, o que devuelva valores nulos tanto para typeName como para typeNamespace para poder serializar como tipo declarado.
fr: Un objet de type '{0}' qui dérive de DataContractResolver a retourné soit un typeName null soit un typeNamespace null, mais pas les deux à la fois, à partir de sa méthode TryResolveType durant la tentative de résolution du nom d'un objet de type '{1}'. Changez l'implémentation de TryResolveType afin que des valeurs non null soient retournées, ou que des valeurs null soient retournées à la fois pour typeName et pour typeNamespace afin de les sérialiser en tant que type déclaré.
it: Il metodo TryResolveType di un oggetto di tipo '{0}' che deriva da DataContractResolver ha restituito un typeName o typeNamespace Null, ma non entrambi, durante il tentativo di risolvere il nome per un oggetto di tipo '{1}'. Modificare l'implementazione di TryResolveType in modo che restituisca valori non Null o valori Null sia per typeName che per typeNamespace in modo da eseguire la serializzazione come tipo dichiarato.
ja: DataContractResolver から派生した型 '{0}' のオブジェクトが、型 '{1}' のオブジェクトの名前を解決しようとしたときに、TryResolveType メソッドから null の typeName または typeNamespace のいずれかを返しました。null でない値を返すか、宣言型としてシリアル化するために typeName および typeNamespace の両方に null 値を返すように、TryResolveType の実装を変更してください。
ko: DataContractResolver에서 파생되는 '{0}' 형식의 개체가 '{1}' 형식의 개체에 대한 이름을 확인하려고 할 때 해당 TryResolveType 메서드에서 null typeName 또는 typeNamespace 중 하나만 반환했습니다. 선언된 형식으로 직렬화하려면 null이 아닌 값을 반환하거나 typeName 및 typeNamespace 모두에 대해 null을 반환하도록 TryResolveType 구현을 변경하세요.
pl: Obiekt typu „{0}” pochodzący od obiektu DataContractResolver zwrócił właściwość typeName lub typeNamespace o wartości null (ale nie obie te właściwości) w wyniku wykonania metody TryResolveType podczas próby rozpoznania nazwy obiektu typu „{1}”. Zmień implementację metody TryResolveType, tak aby zwracała wartości inne niż null albo zwracała wartości null zarówno dla właściwości typeName, jak i właściwości typeNamespace, co umożliwi serializowanie deklarowanego typu.
pt_br: Um objeto do tipo '{0}', que deriva de DataContractResolver, retornou um typeName ou typeNamespace nulo, mão não ambos, de seu método TryResolveType ao tentar resolver o nome de um objeto do tipo '{1}'. Altere a implementação de TryResolveType para retornar valores não nulos ou nulos de typeName e de typeNamespace para serializar como o tipo declarado.
ru: Объект типа "{0}", производного от DataContractResolver, возвратил значение null для typeName или typeNamespace, но не одновременно для обоих из своего метода TryResolveType при попытке разрешить имя для объекта типа "{1}". Чтобы сериализовать тип в соответствии с объявлением, измените реализацию метода TryResolveType таким образом, чтобы возвращалось значение, отличное от null, либо чтобы возвращалось значение null как для typeName, так и для typeNamespace.
tr: DataContractResolver'dan türetilmiş '{0}' türündeki bir nesne, '{1}' türündeki bir nesnenin adını çözümlemeye çalışırken TryResolveType metodundan null bir typeName ve typeNamespace döndürdü, ikisini de null döndürmedi. Bildirilen tür olarak serileştirmek için TryResolveType uygulamasını null olmayan değerler döndürecek veya hem typeName hem de typeNamespace için null değerler döndürecek şekilde değiştirin.
zh_hans: 尝试解析“{1}”类型对象的名称时，从 DataContractResolver 派生的“{0}”类型对象从其 ResolveType 方法返回了值为 null 的 typeName 或 typeNamespace (并非两者同时)。请更改 ResolveType 实现，以返回非 null 值，或者，为了序列化为声明的类型，为 typeName 和 typeNamespace 都返回 null 值。
zh_hant: 嘗試解析類型 '{1}' 物件的名稱時，衍生自 DataContractResolver 的類型 '{0}' 物件，傳回了 Null 的 typeName 或 typeNamespace，但兩者並非來自其 TryResolveType 方法。請變更 TryResolveType 實作，以傳回非 Null 值，或是同時為 typeName 與 typeNamespace 傳回 Null 值，以序列化為宣告的類型。

# RootParticleMustBeSequence
source: The root particle must be a sequence.
cs: Kořenová částice musí být sekvence.
de: Der Stammpartikel muss eine Sequenz sein.
es: La partícula de raíz debe ser una secuencia.
fr: La particule racine doit être une séquence.
it: La particella radice deve essere una sequenza.
ja: ルート パーティクルは 1 つのシーケンスである必要があります。
ko: 루트 파티클은 시퀀스여야 합니다.
pl: Cząstka główna musi być sekwencją.
pt_br: A partícula da raiz deve ser uma sequência.
ru: Корневая часть должна быть последовательностью.
tr: Kök parçacık bir sıra olmalıdır.
zh_hans: 根粒子必须为序列。
zh_hant: 根物件必須是一個序列。

# RootSequenceMaxOccursMustBe
source: 'maxOccurs' on the root sequence must be 1.
cs: Hodnota vlastnosti maxOccurs u kořenové sekvence musí být 1.
de: "maxOccurs" für die Stammsequenz muss 1 sein.
es: El valor de "maxOccurs" en la secuencia raíz debe ser 1.
fr: La valeur de 'maxOccurs' sur la séquence racine doit être 1.
it: Il valore di 'maxOccurs' nella sequenza radice deve essere 1.
ja: ルート シーケンスの 'maxOccurs' は 1 である必要があります。
ko: 루트 시퀀스의 'maxOccurs'는 1이어야 합니다.
pl: Wartość parametru „maxOccurs” w głównej sekwencji musi wynosić 1.
pt_br: 'maxOccurs' na sequência raiz deve ser 1.
ru: Параметр maxOccurs в корневой последовательности должен быть равен 1.
tr: Kök sırasındaki 'maxOccurs' değeri 1 olmalı.
zh_hans: 根序列上的 "maxOccurs" 必须为 1。
zh_hant: 根序列上的 'maxOccurs' 必須是 1。

# RootSequenceMustBeRequired
source: 'minOccurs' on the root sequence must be 1.
cs: Hodnota vlastnosti minOccurs u kořenové sekvence musí být 1.
de: "minOccurs" für die Stammsequenz muss 1 sein.
es: El valor de "minOccurs" en la secuencia raíz debe ser 1.
fr: La valeur de 'minOccurs' sur la séquence racine doit être 1.
it: Il valore di 'minOccurs' nella sequenza radice deve essere 1.
ja: ルート シーケンスの 'minOccurs' は 1 である必要があります。
ko: 루트 시퀀스의 'minOccurs'는 1이어야 합니다.
pl: Wartość parametru „minOccurs” w głównej sekwencji musi wynosić 1.
pt_br: 'minOccurs' na sequência raiz deve ser 1.
ru: Параметр minOccurs в корневой последовательности должен быть равен 1.
tr: Kök sırasındaki 'minOccurs' değeri 1 olmalı.
zh_hans: 根序列上的 "minOccurs" 必须为 1。
zh_hant: 根序列上的 'minOccurs' 必須是 1。

# SerializationCodeIsMissingForType
source: Type '{0}' cannot be serialized, serialization code for the type is missing. Consult the SDK documentation for adding it as a root serialization type.
cs: Typ {0} nelze serializovat, chybí jeho serializační kód. Přečtěte si v dokumentaci k sadě SDK informace o tom, jak tento typ přidat jako kořenový typ serializace.
de: Der Typ "{0}" kann nicht serialisiert werden. Der Serialisierungscode für den Typ fehlt. Informationen zum Hinzufügen des Typs als Stammserialisierungstyp finden Sie in der SDK-Dokumentation.
es: El tipo "{0}" no se puede serializar, falta el código de serialización para el tipo. Consulte la documentación del SDK para agregarlo como tipo de serialización raíz.
fr: Le type '{0}' ne peut pas être sérialisé, le code de sérialisation du type est manquant. Consultez la documentation du SDK pour l'ajouter en tant que type de sérialisation racine.
it: Non è possibile serializzare il tipo '{0}' perché manca il codice di serializzazione per il tipo. Per aggiungerlo come tipo di serializzazione radice, consultare la documentazione dell'SDK.
ja: 型のシリアル化コードがないため、型 '{0}' をシリアル化できません。SDK ドキュメントを参照して、ルート シリアル化の種類として追加してください。
ko: '{0}' 형식을 직렬화할 수 없습니다. 해당 형식에 대한 serialization 코드가 없습니다. 루트 serialization 형식으로 추가하는 방법은 SDK 설명서를 참조하세요.
pl: Typu „{0}” nie można serializować, ponieważ brak kodu serializacji dla tego typu. Zapoznaj się z dokumentacją zestawu SDK w celu dodania go jako głównego typu serializacji.
pt_br: O tipo '{0}' não pode ser serializado. O código de serialização do tipo está ausente. Consulte a documentação do SDK para adicioná-lo como um tipo de serialização raiz.
ru: Невозможно сериализовать тип "{0}": для типа отсутствует код сериализации. Обратитесь к документации пакета SDK, чтобы узнать, как добавить его в качестве корневого типа сериализации.
tr: '{0}' türü serileştirilemiyor, türe yönelik serileştirme kodu eksik. Bunu bir kök serileştirme türü olarak eklemek için SDK belgelerine başvurun.
zh_hans: 类型“{0}”无法序列化，因为缺少该类型的序列化代码。有关将其添加作为根序列化类型的信息，请参阅 SDK 文档。
zh_hant: 無法將類型 '{0}' 序列化，遺漏此類型的序列化程式碼。請參閱 SDK 文件，以將它新增為根序列化類型。
