Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AttributeNotFound
source: XML '{2}' '{3}:{4}' does not contain expected attribute '{0}:{1}'. The deserializer has no knowledge of which type to deserialize. Check that the type being serialized has the same contract as the type being deserialized.
cs: XML {2} {3}:{4} neobsahuje očekávaný atribut {0}:{1}. Deserializátor nezná typ, který se má deserializovat. Zkontrolujte, jestli má serializovaný typ stejný kontrakt jako deserializovaný typ.
de: Das XML "{2}" "{3}:{4}" enthält das erwartete Attribut "{0}:{1}" nicht. Das Deserialisierungsmodul kennt den zu deserialisierenden Typ nicht. Vergewissern Sie sich, dass der serialisierte Typ denselben Vertrag wie der deserialisierte Typ besitzt.
es: Los datos XML "{2}" "{3}:{4}" no contienen el atributo "{0}:{1}" esperado. El deserializador no sabe qué tipo tiene que deserializar. Compruebe que el tipo que se está serializando tiene el mismo contrato que el tipo que se está deserializando.
fr: XML '{2}' '{3}:{4}' ne contient pas l'attribut attendu '{0}:{1}'. Le désérialiseur n'a aucune information sur le type à désérialiser. Vérifiez que le type en cours de sérialisation présente le même contrat que le type qui est désérialisé.
it: '{3}:{4}' '{2}' XML non contiene l'attributo previsto '{0}:{1}'. Il deserializzatore non può determinare il tipo da deserializzare. Verificare che il tipo serializzato abbia lo stesso contratto del tipo deserializzato.
ja: XML '{2}' '{3}:{4}' には、必要な属性 '{0}:{1}' が含まれていません。デシリアライザーでは、どの型をシリアル化解除するのかが不明です。シリアル化される型とシリアル化が解除される型のコントラクトが同じであることを確認してください。
ko: XML '{2}' '{3}:{4}'에 필요한 '{0}:{1}' 특성이 없습니다. 역직렬 변환기가 deserialize할 형식을 알지 못합니다. 직렬화할 형식에 deserialize할 형식과 동일한 계약이 있는지 확인하세요.
pl: Polecenie XML „{2}” „{3}:{4}” nie zawiera oczekiwanego atrybutu „{0}:{1}”. Deserializator nie wie, jaki typ ma być poddany deserializacji. Sprawdź, czy typ poddany serializacji ma ten sam kontrakt co typ poddawany deserializacji.
pt_br: O XML '{2}' '{3}:{4}' não contém o atributo esperado '{0}:{1}'. O desserializador não sabe que tipo desserializar. Verifique se o tipo sendo serializado tem o mesmo contrato do tipo sendo desserializado.
ru: XML "{2}" "{3}:{4}" не содержит ожидаемый атрибут "{0}:{1}". В десериализаторе отсутствует информация о типе для десериализации. Убедитесь, что сериализуемый и десериализуемый типы имеют одинаковый контракт.
tr: XML '{2}' '{3}:{4}' beklenen '{0}:{1}' özniteliğine sahip değil. Seri durumdan çıkarıcı işlenecek tür hakkında bilgiye sahip değil. Serileştirilmekte olan türün seri durumdan çıkarılmakta olanla aynı anlaşmaya sahip olup olmadığını denetleyin.
zh_hans: XML“{2}”“{3}:{4}”不包含所需特性“{0}:{1}”。反序列化程序不知道何种类型需要进行反序列化。请检查正在序列化的类型是否与正在反序列化的类型具有相同的协定。
zh_hant: XML '{2}' '{3}:{4}' 未包含必要的屬性 '{0}:{1}'。還原序列化程式不知道要還原序列化的類型。請檢查序列化的類型與要還原序列化的類型是否擁有相同的合約。

# AttributedTypesCannotInheritFromNonAttributedSerializableTypes
source: Type '{0}' cannot inherit from a type that is not marked with DataContractAttribute or SerializableAttribute. Consider marking the base type '{1}' with DataContractAttribute or SerializableAttribute, or removing them from the derived type.
cs: Typ {0} nemůže dědit od typu, který není označen atributem DataContractAttribute nebo SerializableAttribute. Označte základní typ {1} atributem DataContractAttribute nebo SerializableAttribute, případně odeberte tyto atributy od odvozeného typu.
de: Der Typ "{0}" kann nur von einem Typ erben, der mit DataContractAttribute oder SerializableAttribute markiert ist. Sie sollten den Basistyp "{1}" mit DataContractAttribute oder SerializableAttribute markieren oder diese aus dem abgeleiteten Typ entfernen.
es: El tipo "{0}" no se puede heredar de un tipo que no está marcado con DataContractAttribute o SerializableAttribute. Considere marcar el tipo base "{1}" con DataContractAttribute o SerializableAttribute, o bien quitarlos del tipo derivado.
fr: Le type '{0}' ne peut pas hériter d'un type qui n'est pas marqué avec DataContractAttribute ou SerializableAttribute. Marquez le type de base '{1}' avec DataContractAttribute ou SerializableAttribute, ou supprimez ces derniers du type dérivé.
it: Il tipo '{0}' non può ereditare da un tipo non contrassegnato con DataContractAttribute o SerializableAttribute. Provare a contrassegnare il tipo di base '{1}' con DataContractAttribute o SerializableAttribute o a rimuovere tale tipo dal tipo derivato.
ja: 型 '{0}' は DataContractAttribute または SerializableAttribute が設定されていない型からは、継承できません。基本データ型 '{1}' に DataContractAttribute か SerializableAttribute を設定するか、またはこれらを派生型から削除することを検討してください。
ko: DataContractAttribute 또는 SerializableAttribute로 표시되지 않은 형식에서 '{0}' 형식을 상속할 수 없습니다. 기본 형식 '{1}'을(를) DataContractAttribute 또는 SerializableAttribute로 표시하거나 파생 형식에서 제거해 보세요.
pl: Typ „{0}” nie może dziedziczyć z typu, który nie jest oznaczony atrybutem DataContractAttribute ani SerializableAttribute. Rozważ oznaczenie typu podstawowego „{1}” atrybutem DataContractAttribute lub SerializableAttribute albo usunięcie ich z typu pochodnego.
pt_br: O tipo '{0}' não pode herdar de um tipo que não está marcado com DataContractAttribute ou SerializableAttribute. Considere marcar o tipo base '{1}' com DataContractAttribute ou SerializableAttribute ou removê-los do tipo derivado.
ru: Тип "{0}" не может быть производным от типа, который не отмечен с помощью атрибута DataContractAttribute или SerializableAttribute. Отметьте базовый тип "{1}" с помощью атрибута DataContractAttribute или SerializableAttribute либо удалите их из производного типа.
tr: '{0}' türü DataContractAttribute veya SerializableAttribute ile işaretlenmemiş bir türden devralamaz. '{1}' temel türünü DataContractAttribute veya SerializableAttribute ile işaretlemeyi ya da bunları türetilen türden kaldırmayı deneyin.
zh_hans: 类型“{0}”不能自未用 DataContractAttribute 或 SerializableAttribute 标记的类型继承。请考虑用 DataContractAttribute 或 SerializableAttribute 标记基类型“{1}”，或者从派生类型中移除这两个特性。
zh_hant: 類型 '{0}' 無法繼承自未標示有 DataContractAttribute 或 SerializableAttribute 的類型。請考慮以 DataContractAttribute 或 SerializableAttribute 標記基底類型 '{1}'，或由衍生類型將它們移除。

# BaseTypeNotISerializable
source: One of its base types, '{0}' from namespace '{1}' is not ISerializable.
cs: Jeden z jeho základních typů, {0} z oboru názvů {1}, není typu ISerializable.
de: Einer der Basistypen "{0}" aus dem Namespace "{1}" ist nicht ISerializable.
es: Uno de los tipos base, "{0}", del espacio de nombres "{1}", no es ISerializable.
fr: L'un de ses types de base, '{0}' provenant de l'espace de noms '{1}', n'est pas ISerializable.
it: Uno dei tipi di base '{0}' dello spazio dei nomi '{1}' non è ISerializable.
ja: 基本データ型の 1 つである名前空間 '{1}' の '{0}' が ISerializable ではありません。
ko: 네임스페이스 '{1}'의 기본 형식 중 하나인 '{0}'이(가) ISerializable 상태가 아닙니다.
pl: Jeden z typów podstawowych: „{0}” z przestrzeni nazw „{1}” nie jest typem ISerializable.
pt_br: Um de seus tipos base, '{0}' do namespace '{1}' não é ISerializable.
ru: Один из его базовых типов, "{0}" из пространства имен "{1}", не является ISerializable.
tr: '{1}' ad alanındaki '{0}' temel türlerin biri ISerializable değil.
zh_hans: ISerializable 不是来自命名空间“{1}”的“{0}”的基类型之一。
zh_hant: 來自命名空間 '{1}' 的 '{0}'，其中一個基底類型不是 ISerializable。

# CLRNamespaceMappedMultipleTimes
source: CLR namespace '{2}' has already been mapped to data contract namespace '{0}'. It cannot be mapped to another data contract namespace '{1}'.
cs: Obor názvů CLR {2} už je namapovaný na obor názvů kontraktu dat {0}. Nedá se namapovat na další obor názvů kontraktu dat {1}.
de: Der CLR-Namespace "{2}" wurde bereits dem Datenvertragsnamespace "{0}" zugeordnet. Er kann daher keinem weiteren Datenvertragsnamespace "{1}" zugeordnet werden.
es: El espacio de nombres CLR "{2}" ya se asignó al espacio de nombres de contrato de datos "{0}". No se puede asignar a otro espacio de nombres de contrato de datos "{1}".
fr: L'espace de noms CLR '{2}' a déjà été mappé à l'espace de noms de contrat de données '{0}'. Il est impossible de le mapper à un autre espace de noms de contrat de données '{1}'.
it: È già stato eseguito il mapping dello spazio dei nomi '{2}' di CLR allo spazio dei nomi del contratto di dati '{0}'. Non è possibile eseguirne il mapping anche allo spazio dei nomi del contratto di dati '{1}'.
ja: CLR 名前空間 '{2}' は、既にデータ コントラクト名前空間 '{0}' に割り当てられています。この名前空間を別のデータ コントラクト名前空間 '{1}' に割り当てることはできません。
ko: CLR 네임스페이스 '{2}'이(가) 데이터 계약 네임스페이스 '{0}'에 이미 매핑되었습니다. 다른 데이터 계약 네임스페이스 '{1}'에 매핑될 수 없습니다.
pl: Przestrzeń nazw CLR „{2}” została już zamapowana na przestrzeń nazw kontraktu danych „{0}”. Nie można zamapować jej na inną przestrzeń nazw kontraktu danych „{1}”.
pt_br: O namespace CLR {2}' já foi mapeado para o namespace de contrato de dados '{0}'. Ele não pode ser mapeado para outro namespace de contrato de dados '{1}'.
ru: Пространство имен CLR "{2}" уже сопоставлено пространству имен контрактов данных "{0}". Оно не может быть сопоставлено с другим пространством имен контрактов данных "{1}".
tr: CLR ad alanı '{2}', zaten '{0}' veri anlaşması ad alanıyla eşlendi. Başka bir '{1}' veri anlaşması ad alanıyla eşlenemez.
zh_hans: 已将 CLR 命名空间“{2}”映射到数据协定命名空间“{0}”。无法将其映射到另一个数据协定命名空间“{1}”。
zh_hant: CLR 命名空間 '{2}' 已經對應到資料合約命名空間 '{0}'。它無法對應到另一個資料合約命名空間 '{1}'。

# CallbackMustReturnVoid
source: Serialization Callback '{1}' in type '{0}' must return void.
cs: Zpětné volání serializace {1} v typu {0} musí vrátit typ void.
de: Der Serialisierungsrückruf "{1}" im Typ "{0}" muss "void" zurückgeben.
es: La devolución de llamada de serialización "{1}" del tipo "{0}" debe devolver un valor nulo.
fr: Le rappel de sérialisation '{1}' dans le type '{0}' doit retourner void.
it: Il callback di serializzazione '{1}' nel tipo '{0}' deve restituire void.
ja: 型 '{0}' のシリアル化コールバック '{1}' は void を返す必要があります。
ko: 형식 '{0}'의 serialization 콜백 '{1}'에서 void를 반환해야 합니다.
pl: Serializacja wywołania zwrotnego „{1}” w typie „{0}” musi zwracać typ void.
pt_br: O Retorno de Chamada de Serialização '{1}' no tipo '{0}' deve retornar nulo.
ru: Обратный вызов сериализации "{1}" в типе "{0}" должен вернуть значение void.
tr: '{0}' türündeki '{1}' Serileştirme Geri Çağırma İşlevi boş değer döndürmelidir.
zh_hans: 类型“{0}”中的序列化回调“{1}”必须返回 void。
zh_hant: 類型 '{0}' 中的序列化回呼 '{1}' 必須傳回 void。

# CallbackParameterInvalid
source: Serialization Callback '{1}' in type '{0}' must have a single parameter of type '{2}'.
cs: Zpětné volání serializace {1} v typu {0} musí mít jeden parametr typu {2}.
de: Der Serialisierungsrückruf "{1}" im Typ "{0}" darf nur einen Parameter vom Typ "{2}" enthalten.
es: La devolución de llamada de serialización "{1}" del tipo "{0}" debe tener un único parámetro del tipo "{2}".
fr: Le rappel de sérialisation '{1}' dans le type '{0}' doit comporter un paramètre unique de type '{2}'.
it: Il callback di serializzazione '{1}' nel tipo '{0}' deve contenere un solo parametro di tipo '{2}'.
ja: 型 '{0}' のシリアル化コールバック '{1}' には、型 '{2}' の単一のパラメーターが含まれている必要があります。
ko: 형식 '{0}'의 serialization 콜백 '{1}'에 '{2}' 형식의 단일 매개 변수가 있어야 합니다.
pl: Serializacja wywołania zwrotnego „{1}” w typie „{0}” musi mieć pojedynczy parametr typu „{2}”.
pt_br: O Retorno de Chamada de Serialização '{1}' no tipo '{0}' deve ter um único parâmetro do tipo '{2}'.
ru: Обратный вызов сериализации "{1}" в типе "{0}" должен иметь один параметр типа "{2}".
tr: '{0}' türündeki '{1}' Serileştirme Geri Çağırma İşlevi, '{2}' türünde tek bir parametreye sahip olmalıdır.
zh_hans: 类型“{0}”中的序列化回调“{1}”必须具有单个类型为“{2}”的参数。
zh_hant: 類型 '{0}' 的序列化回呼 '{1}' 必須擁有類型 '{2}' 的單一參數。

# CallbacksCannotBeVirtualMethods
source: Virtual Method '{0}' of type '{1}' cannot be marked with '{2}' attribute.
cs: Virtuální metoda {0} typu {1} nemůže být označena atributem {2}.
de: Die virtuelle Methode "{0}" vom Typ "{1}" kann nicht mit dem Attribut "{2}" markiert werden.
es: El método virtual "{0}" del tipo "{1}" no se puede marcar con el atributo "{2}".
fr: Il est impossible de marquer la méthode virtuelle '{0}' de type '{1}' avec l'attribut '{2}'.
it: Il metodo virtuale '{0}' di tipo '{1}' non può essere contrassegnato con l'attributo '{2}'.
ja: 型 '{1}' の仮想メソッド '{0}' に '{2}' 属性を設定できません。
ko: 형식 '{1}'의 가상 메서드 '{0}'을(를) '{2}' 특성으로 표시할 수 없습니다.
pl: Metoda wirtualna „{0}” typu „{1}” nie może być oznaczona atrybutem „{2}”.
pt_br: O Método Virtual '{0}' do tipo '{1}' não pode ser marcado com o atributo '{2}'.
ru: Виртуальный метод "{0}" типа "{1}" не может быть помечен атрибутом "{2}".
tr: '{1}' türündeki '{0}' Sanal Metot, '{2}' özniteliği ile işaretlenemez.
zh_hans: 类型“{1}”的虚方法“{0}”不能使用“{2}”特性进行标记。
zh_hant: 類型 '{1}' 的 Virtual 方法 '{0}' 不可標示有 '{2}' 屬性。

# CanOnlyStoreIntoArgOrLocGot0
source: An internal error has occurred. Data can only be stored into ArgBuilder or LocalBuilder. Got: {0}.
cs: Došlo k vnitřní chybě. Data lze uložit jen do oblasti ArgBuilder nebo LocalBuilder. Obdrženo: {0}
de: Ein interner Fehler ist aufgetreten. Daten können nur in ArgBuilder oder LocalBuilder gespeichert werden. Erhalten: {0}.
es: Error interno. Los datos solo se pueden almacenar en ArgBuilder o en LocalBuilder. Valor obtenido: {0}.
fr: Une erreur interne s'est produite. Les données ne peuvent être stockées que dans ArgBuilder ou dans LocalBuilder. Obtenu : {0}.
it: Si è verificato un errore interno. I dati possono essere archiviati solo in ArgBuilder o LocalBuilder. Risultato: {0}.
ja: 内部エラーが発生しました。データは、ArgBuilder または LocalBuilder にのみ格納できます。取得: {0}。
ko: 내부 오류가 발생했습니다. 데이터를 ArgBuilder 또는 LocalBuilder에만 저장할 수 있습니다. 오류 코드: {0}.
pl: Wystąpił błąd wewnętrzny. Dane mogą być przechowywane tylko w zmiennych ArgBuilder lub LocalBuilder. Otrzymano: {0}.
pt_br: Erro interno. Os dados só podem ser armazenados em ArgBuilder ou em LocalBuilder. Obtido: {0}.
ru: Произошла внутренняя ошибка. Имеется возможность сохранения данных только в ArgBuilder или LocalBuilder. Получено: {0}.
tr: Bir iç hata oluştu. Veriler yalnızca ArgBuilder veya LocalBuilder içinde depolanabilir. Elde edilen: {0}.
zh_hans: 出现内部错误。数据仅可以存储到 ArgBuilder 或 LocalBuilder。已得到: {0}。
zh_hant: 發生內部錯誤。只能將資料儲存到 ArgBuilder 或 LocalBuilder。已收到: {0}。

# CannotComputeUniqueName
source: A unique name cannot be computed for '{0}' because there are already Int32.MaxValue types of with the same name.
cs: Pro {0} není možné vypočítat jedinečný název, protože již existují typy Int32.MaxValue se stejným názvem.
de: Für "{0}" kann kein eindeutiger Name berechnet werden, da bereits Int32.MaxValue-Typen mit demselben Namen vorhanden sind.
es: No se puede calcular un nombre único para "{0}" porque ya hay tipos Int32.MaxValue con el mismo nombre.
fr: Impossible de calculer un nom unique pour '{0}', car il existe déjà des types Int32.MaxValue avec le même nom.
it: Non è possibile calcolare un nome univoco per '{0}' perché sono già presenti tipi Int32.MaxValue con lo stesso nome.
ja: 同じ名前の Int32.MaxValue 型が既に存在するため、'{0}' の一意の名前を計算できません。
ko: 같은 이름의 Int32.MaxValue 형식이 이미 있으므로 '{0}'에 대해 고유한 이름을 계산할 수 없습니다.
pl: Unikatowa nazwa nie może być obliczona dla „{0}”, ponieważ istnieją typy Int32.MaxValue o tej samej nazwie.
pt_br: Um nome exclusivo não pode ser computado para '{0}' porque já existem tipos de Int32.MaxValue com o mesmo nome.
ru: Не удается вычислить уникальное имя для "{0}", поскольку уже имеются типы Int32.MaxValue с таким именем.
tr: Aynı ada sahip Int32.MaxValue türleri zaten bulunduğundan, '{0}' için benzersiz bir ad hesaplanamıyor.
zh_hans: 无法为“{0}”计算唯一的名称，因为已经存在多个具有相同名称的 Int32.MaxValue 类型。
zh_hant: 因為已有同名的 Int32.MaxValue 類型，所以無法對 '{0}' 計算唯一的名稱。

# CannotDeriveFromSealedReferenceType
source: Type with data contract name '{0}' in namespace '{1}' cannot be imported. Cannot derive from sealed referenced type '{2}'.
cs: Typ s názvem kontraktu dat {0} v oboru názvů {1} nejde importovat. Nedá se odvodit od odkazovaného sealed typu {2}.
de: Der Typ mit dem Datenvertragsnamen "{0}" im Namespace "{1}" kann nicht importiert werden. Eine Ableitung von dem referenzierten sealed-Typ "{2}" ist nicht möglich.
es: No se puede importar el tipo con el nombre de contrato de datos "{0}" del espacio de nombres "{1}". No se puede derivar del tipo sealed "{2}" al que se hace referencia.
fr: Impossible d'importer le type portant le nom de contrat de données '{0}' dans l'espace de noms '{1}'. Dérivation impossible à partir du type référencé sealed '{2}'.
it: Non è possibile importare il tipo con il nome di contratto di dati '{0}' nello spazio dei nomi '{1}'. La derivazione dal tipo sealed '{2}' di riferimento non è consentita.
ja: 名前空間 '{1}' のデータ コントラクト名 '{0}' を持つ型をインポートできません。sealed の参照型 '{2}' から派生することはできません。
ko: 네임스페이스 '{1}'의 데이터 계약 이름 '{0}'을(를) 가진 형식을 가져올 수 없습니다. 참조된 sealed 형식 '{2}'에서 파생시킬 수 없습니다.
pl: Nie można zaimportować typu o nazwie kontraktu danych „{0}” w przestrzeni nazw „{1}”. Nie można utworzyć pochodnej z typu „{2}” oznaczonego jako sealed, do którego istnieje odwołanie.
pt_br: Não é possível importar o tipo com o nome de contrato de dados '{0}' no namespace '{1}'. Não é possível derivar de um tipo referenciado sealed '{2}'.
ru: Невозможно импортировать тип с именем контракта данных "{0}" в пространстве имен "{1}". Не удается наследовать из типа sealed "{2}", на который указывает ссылка.
tr: '{1}' ad alanında veri anlaşması adı '{0}' olan tür içeri aktarılamıyor. '{2}' adlı sealed başvuru türünden türetilemiyor.
zh_hans: 无法导入命名空间“{1}”中数据协定名称为“{0}”的类型。无法从 sealed 引用的类型“{2}”派生。
zh_hant: 無法匯入命名空間 '{1}' 中資料合約名稱為 '{0}' 的類型。無法衍生自 sealed 參考類型 '{2}'。

# CannotDeserializeRefAtTopLevel
source: Cannot deserialize since root element references unrecognized object with id '{0}'.
cs: Nelze deserializovat, protože kořenový element odkazuje na nerozpoznaný objekt s identifikátorem {0}.
de: Eine Deserialisierung ist nicht möglich, da das Stammelement auf ein unbekanntes Objekt mit der ID "{0}" verweist.
es: No se puede deserializar, ya que el elemento raíz hace referencia a un objeto no reconocido con el id. "{0}".
fr: Désérialisation impossible : l'élément racine référence un objet non reconnu avec l'ID '{0}'.
it: Non è possibile eseguire la deserializzazione perché l'elemento radice fa riferimento a un oggetto non riconosciuto con ID '{0}'.
ja: ルート要素が ID '{0}' を持つ不明なオブジェクトを参照しているため、シリアル化を解除できません。
ko: 루트 요소에서 ID가 '{0}'인 인식할 수 없는 개체를 참조하므로 deserialize할 수 없습니다.
pl: Nie można przeprowadzić serializacji, gdyż element główny odwołuje się do nierozpoznanego obiektu o identyfikatorze „{0}”.
pt_br: Não é possível desserializar porque as referências do elemento raiz não reconheceram o objeto com a ID '{0}'.
ru: Не удается десериализовать, так как корневой элемент ссылается на неопознанный объект с идентификатором "{0}".
tr: Kök öğe '{0}' kimlikli bilinmeyen nesneye başvuru yaptığından seri durumdan çıkarılamıyor.
zh_hans: 由于根元素引用了 ID 为“{0}”的无法识别的对象，因此无法进行反序列化。
zh_hant: 因為根項目參考無法辨識識別碼為 '{0}' 的物件，所以無法還原序列化。

# CannotHaveDuplicateAttributeNames
source: The type contains two attributes with the same name '{0}'. Multiple attributes with the same name in one type are not supported.
cs: Tento typ obsahuje dva atributy se stejným názvem {0}. Není podporováno více atributů se stejným názvem v jednom typu.
de: Der Typ enthält zwei Attribute mit demselben Namen "{0}". In einem Typ werden mehrere Attribute mit demselben Namen nicht unterstützt.
es: El tipo contiene dos atributos con el mismo nombre ("{0}"). No se admiten varios atributos con el mismo nombre en un tipo.
fr: Le type contient deux attributs du même nom '{0}'. La prise en charge de plusieurs attributs portant le même nom dans un type n'est pas assurée.
it: Il tipo contiene due attributi con lo stesso nome '{0}'. In un tipo non sono supportati più attributi con lo stesso nome.
ja: この型には、同じ名前 '{0}' を持つ 2 つの属性が含まれています。1 つの型に同じ名前の複数の属性を含めることはできません。
ko: 형식에 같은 이름 '{0}'을(를) 사용하는 특성이 두 개 있습니다. 한 형식에는 같은 이름의 특성을 여러 개 사용할 수 없습니다.
pl: Typ zawiera dwa atrybuty o tej samej nazwie „{0}”. Program nie obsługuje wielu atrybutów o tej samej nazwie w jednym typie.
pt_br: O tipo contém dois atributos com o mesmo nome '{0}'. Não há suporte para vários atributos com o mesmo nome em um tipo.
ru: Тип содержит два атрибута с одинаковым именем "{0}". Несколько атрибутов с одинаковым именем в одном типе не поддерживаются.
tr: Tür, aynı ada ('{0}') sahip iki öznitelik içeriyor. Bir türde aynı ada sahip birden fazla öznitelik desteklenmez.
zh_hans: 类型包含两个具有相同名称“{0}”的特性。不支持在一个类型下有多个同名特性。
zh_hant: 類型中包含兩個名稱相同的屬性 '{0}'。不支援在單一類型中包含多個名稱相同的屬性。

# CannotHaveDuplicateElementNames
source: The type contains two elements with the same name '{0}'. Multiple elements with the same name in one type are not supported because members marked with DataMemberAttribute attribute must have unique names.
cs: Typ obsahuje dva elementy se stejným názvem {0}. Více elementů se stejným názvem v jednom typu není podporováno, protože členy označené atributem DataMemberAttribute musí mít jedinečné názvy.
de: Der Typ enthält zwei Elemente mit demselben Namen "{0}". Mehrere Elemente mit demselben Namen in einem Typ werden nicht unterstützt, da mit dem Attribut DataMemberAttribute markierte Member eindeutige Namen besitzen müssen.
es: El tipo contiene dos elementos con el mismo nombre: "{0}". No se admite la presencia de varios elementos con el mismo nombre en un tipo porque los miembros marcados con el atributo DataMemberAttribute deben tener nombres exclusivos.
fr: Le type contient deux éléments ayant le même nom '{0}'. Plusieurs éléments portant le même nom dans un type ne sont pas pris en charge, car les membres marqués avec l'attribut DataMemberAttribute doivent avoir des noms uniques.
it: Il tipo contiene due elementi con lo stesso nome '{0}'. In un tipo non sono supportati più elementi con lo stesso nome perché i membri contrassegnati con l'attributo DataMemberAttribute devono avere nomi univoci.
ja: この型には、同じ名前 '{0}' を持つ 2 つの要素が含まれています。DataMemberAttribute 属性が設定されたメンバーには一意の名前を付ける必要があるため、1 つの型に同じ名前の複数の要素を含めることはできません。
ko: 동일한 이름 '{0}'을(를) 가진 두 개의 요소가 형식에 있습니다. DataMemberAttribute 특성이 표시된 멤버는 고유한 이름을 가져야 하므로 하나의 형식에 이름이 같은 여러 요소가 지원되지 않습니다.
pl: Typ zawiera dwa elementy o tej samej nazwie „{0}”. Sytuacja z wieloma elementami o tej samej nazwie w jednym typie nie jest obsługiwana, ponieważ składowe oznaczone atrybutem DataMemberAttribute muszą mieć unikatowe nazwy.
pt_br: O tipo contém dois elementos com o mesmo nome '{0}'. Não há suporte para vários elementos com o mesmo nome em um tipo porque os membros marcados com o atributo DataMemberAttribute devem ter nomes exclusivos.
ru: Тип содержит два элемента с одинаковым именем "{0}". Несколько элементов с одинаковыми именами в одном типе не поддерживаются, поскольку члены, отмеченные атрибутом DataMemberAttribute, должны иметь уникальные имена.
tr: Tür, aynı '{0}' adına sahip iki öğe içeriyor. DataMemberAttribute özniteliğiyle işaretlenen üyelerin benzersiz adları olması gerektiğinden, bir tür içinde aynı ada sahip birden çok öğe desteklenmez.
zh_hans: 该类型包含两个名称均为“{0}”的元素。多个具有相同名称并属于一个类型的元素不受支持，因为使用 DataMemberAttribute 特性标记的成员必须具有唯一的名称。
zh_hant: 此類型包含兩個名稱同為 '{0}' 的元素。因為標示有 DataMemberAttribute 屬性的成員必須要有唯一的名稱，所以不支援多個同名的元素為同一類型。
