Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JsonMustSpecifyDataType
source: You must write an attribute '{0}'='{1}' after writing the attribute with local name '{2}'.
cs: Atribut {0}={1} musíte zapsat po zápisu atributu s místním názvem {2}.
de: Nach dem Schreiben des Attributs mit dem lokalen Namen "{2}" müssen Sie ein Attribut "{0}"="{1}" schreiben.
es: Debe escribir un atributo "{0}"="{1}" después de escribir el atributo con el nombre local "{2}".
fr: Après avoir écrit l'attribut comportant le nom local '{2}', vous devez écrire un attribut '{0}'='{1}'.
it: È necessario scrivere un attributo '{0}'='{1}' dopo la scrittura dell'attributo con nome locale '{2}'.
ja: ローカル名 '{2}' の属性の書き込み後に属性 '{0}'='{1}' を書き込む必要があります。
ko: 로컬 이름이 '{2}'인 특성을 쓴 뒤에는 반드시 '{0}'='{1}' 특성을 써야 합니다.
pl: Należy zapisać atrybut „{0}”=„{1}” po zapisaniu atrybutu o nazwie lokalnej „{2}”.
pt_br: Você deve gravar um atributo '{0}'='{1}' após gravar o atributo com o nome do local '{2}'.
ru: Атрибут "{0}"="{1}" необходимо записывать после записи атрибута с локальным именем "{2}".
tr: '{2}' yerel adı özniteliği yazdıktan sonra '{0}'='{1}' özniteliğinizi yazmalısınız.
zh_hans: 在写入本地名称为“{2}”的特性后必须写入“{0}”=“{1}”的特性。
zh_hant: 在寫入本機名稱 '{2}' 的屬性之後，您必須寫入屬性 '{0}'='{1}'。

# JsonMustUseWriteStringForWritingAttributeValues
source: To write attribute values with this XmlDictionaryWriter implementation, you must write either string or char[] values.
cs: Pokud chcete zapisovat hodnoty atributů pomocí této implementace XmlDictionaryWriter, musíte zapisovat hodnoty typu string nebo char[].
de: Um mit dieser XmlDictionaryWriter-Implementierung Attributwerte zu schreiben, müssen Sie entweder string- oder char[]-Werte schreiben.
es: Para escribir valores de atributo con esta implementación de XmlDictionaryWriter, debe escribir valores de cadena o char[].
fr: Pour écrire des valeurs d'attribut avec cette implémentation de XmlDictionaryWriter, vous devez écrire soit des valeurs de chaîne, soit des valeurs char[].
it: Per scrivere i valori dell'attributo con questa implementazione di XmlDictionaryWriter, è necessario scrivere valori char[] o string.
ja: この XmlDictionaryWriter 実装で属性値を書き込むには、文字列または char[] 値を書き込む必要があります。
ko: 이 XmlDictionaryWriter 구현으로 특성 값을 쓰려면 문자열 또는 문자[] 값을 써야 합니다.
pl: Aby zapisać wartości atrybutu za pomocą tej implementacji obiektu XmlDictionaryWriter, należy zapisać wartości typu string lub char[].
pt_br: Para gravar valores de atributo com essa implementação XmlDictionaryWriter, é necessário gravar a cadeia de caracteres ou os valores char[].
ru: Для записи значений атрибутов с этой реализацией XmlDictionaryWriter необходимо записывать значения string или char[].
tr: Bu XmlDictionaryWriter uygulamasıyla öznitelik değerlerini yazmak için, dize veya char[] değerleri yazmalısınız.
zh_hans: 若要使用此 XmlDictionaryWriter 实现写入特性值，必须写入字符串或 char[] 值。
zh_hant: 若要利用這個 XmlDictionaryWriter 實作寫入屬性值，您必須寫入字串或 char[] 值。

# JsonNamespaceMustBeEmpty
source: Encountered unexpected namespace '{0}'. The namespace must be empty.
cs: Byl zjištěn neočekávaný obor názvů {0}. Obor názvů musí být prázdný.
de: Ein unerwarteter Namespace "{0}" wurde gefunden. Der Namespace muss leer sein.
es: Espacio de nombres inesperado "{0}". El espacio de nombres debe estar vacío.
fr: Espace de noms '{0}' inattendu. L'espace de noms doit être vide.
it: Lo spazio dei nomi '{0}' rilevato è imprevisto. Lo spazio dei nomi deve essere vuoto.
ja: 予期しない名前空間 '{0}' が見つかりました。名前空間は空でなければなりません。
ko: 예기치 않은 네임스페이스 '{0}'이(가) 발견되었습니다. 네임스페이스가 비어 있어야 합니다.
pl: Napotkano nieoczekiwaną przestrzeń nazw „{0}”. Przestrzeń nazw musi być pusta.
pt_br: Namespace inesperado encontrado '{0}'. O namespace deve ser vazio.
ru: Обнаружено непредвиденное пространство имен "{0}". Пространство имен должно быть пустым.
tr: Beklenmeyen '{0}' ad alanıyla karşılaşıldı. Ad alanı boş olmalıdır.
zh_hans: 遇到意外的命名空间“{0}”。该命名空间必须为空。
zh_hant: 出現不應出現的命名空間 '{0}'。命名空間必須是空的。

# JsonNestedArraysNotSupported
source: Nested arrays are not supported.
cs: Vnořená pole nejsou podporována.
de: Geschachtelte Arrays werden nicht unterstützt.
es: No se admiten las matrices anidadas.
fr: Les tableaux imbriqués ne sont pas pris en charge.
it: Le matrici annidate non sono supportate.
ja: 入れ子にされた配列はサポートされていません。
ko: 중첩 배열이 지원되지 않습니다.
pl: Tablice zagnieżdżone są nieobsługiwane.
pt_br: Não há suporte para matrizes aninhadas.
ru: Вложенные массивы не поддерживаются.
tr: İç içe geçen diziler desteklenmez.
zh_hans: 不支持嵌套的数组。
zh_hant: 不支援巢狀陣列。

# JsonNoMatchingStartAttribute
source: There is no open attribute.
cs: Nebyl nalezen žádný otevřený atribut.
de: Es ist kein offenes Attribut vorhanden.
es: No hay ningún atributo abierto.
fr: Aucun attribut n'est ouvert.
it: Non sono presenti attributi aperti.
ja: open 属性がありません。
ko: 열린 특성이 없습니다.
pl: Brak otwartych atrybutów.
pt_br: Não há um atributo aberto.
ru: Отсутствует открытый атрибут.
tr: Açık öznitelik yok.
zh_hans: 没有打开的特性。
zh_hant: 沒有開放的屬性。

# JsonNodeTypeArrayOrObjectNotSpecified
source: WriteStartElement cannot be called immediately after WriteStartElement without writing the 'type'='array' or 'type='object' attribute.
cs: Metodu WriteStartElement nelze volat bezprostředně po metodě WriteStartElement bez zápisu atributu type=array nebo type=object.
de: Damit WriteStartElement sofort nach WriteStartElement aufgerufen werden kann, muss das Attribut "type"="array" oder "type"="object" geschrieben werden.
es: WriteStartElement no se puede llamar inmediatamente después de WriteStartElement sin escribir el atributo "type"="array" o "type="object".
fr: L'élément WriteStartElement ne peut pas être appelé immédiatement après l'élément WriteStartElement sans avoir écrit l'attribut 'type'='array' ou 'type='object'.
it: Non è possibile chiamare WriteStartElement subito dopo WriteStartElement senza scrivere l'attributo 'type'='array' o 'type='object'.
ja: 'type'='array' または 'type='object' 属性を書き込まずに WriteStartElement の直後に WriteStartElement を呼び出すことはできません。
ko: 'type'='array' 또는 'type='object' 특성을 쓰지 않으면 WriteStartElement 직후에 WriteStartElement를 호출할 수 없습니다.
pl: Nie można wywołać metody WriteStartElement natychmiast po wywołaniu metody WriteStartElement bez zapisania atrybutu „type”=„array” lub „type”=„object”.
pt_br: WriteStartElement não pode ser chamado imediatamente após WriteStartElement sem gravar o atributo 'type'='array' ou 'type='object'.
ru: Метод WriteStartElement не может быть вызван сразу после метода WriteStartElement без записи атрибутов "type"="array" или "type"="object".
tr: WriteStartElement, 'type'='array' veya r 'type='object' özniteliği yazılmadan WriteStartElement öğesinden hemen sonra çağrılamaz.
zh_hans: 除非写入 "type"="array" 或 "type"="object" 特性，否则，在 WriteStartElement 之后不能立即调用 WriteStartElement。
zh_hant: 在未寫入 'type'='array' 或 'type='object' 屬性時，無法在 WriteStartElement 之後立即呼叫 WriteStartElement。

# JsonOffsetExceedsBufferSize
source: The specified offset exceeds the buffer size ({0} bytes).
cs: Zadaný posun překračuje velikost vyrovnávací paměti (počet bajtů: {0}).
de: Der angegebene Offset überschreitet die Puffergröße ({0} Bytes).
es: El desplazamiento especificado supera el tamaño del búfer ({0} bytes).
fr: Le décalage spécifié est supérieur à la taille de la mémoire tampon ({0} octets).
it: L'offset specificato supera le dimensioni del buffer ({0} byte).
ja: 指定したオフセットは、バッファー サイズ ({0} バイト) を超えています。
ko: 지정된 오프셋이 버퍼 크기({0}바이트)를 초과합니다.
pl: Określone przesunięcie przekracza rozmiar buforu ({0} B).
pt_br: O deslocamento especificado excede o tamanho do buffer ({0} bytes).
ru: Заданное смещение превышает размер буфера ({0} байт).
tr: Belirtilen uzaklık arabellek boyutunu ({0} bayt) aşıyor.
zh_hans: 指定的偏移量超出了缓冲区大小({0} 个字节)。
zh_hant: 指定的位移超過緩衝區大小 ({0} 個位元組)。

# JsonOneRequiredMemberNotFound
source: The data contract type '{0}' cannot be deserialized because the required data member '{1}' was not found.
cs: Typ kontraktu dat {0} nelze deserializovat, protože nebyl nalezen povinný datový člen {1}.
de: Der Datenvertragstyp "{0}" kann nicht deserialisiert werden, da der erforderliche Datenmember "{1}" nicht gefunden wurde.
es: El tipo de contrato de datos "{0}" no se puede deserializar porque no se encontró el miembro de datos requerido "{1}".
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé, car les données membres obligatoires '{1}' sont introuvables.
it: Non è possibile deserializzare il tipo di contratto di dati '{0}' perché non è stato trovato il membro dati '{1}' richiesto.
ja: 必要なデータ メンバー '{1}' が見つからなかったため、データ コントラクト型 '{0}' は逆シリアル化できません。
ko: 필요한 데이터 멤버 '{1}'을(를) 찾을 수 없어 데이터 계약 형식 '{0}'을(를) deserialize할 수 없습니다.
pl: Nie można deserializować typu kontraktu danych „{0}”, ponieważ nie można znaleźć wymaganej składowej danych „{1}”.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado porque o membro de dados necessário '{1}' não foi encontrado.
ru: Тип контракта данных "{0}" не может быть десериализован, поскольку не удалось найти необходимый элемент данных "{1}".
tr: Gerekli veri üyesi '{1}' bulunamadığından, '{0}' veri anlaşması türü seri durumdan çıkarılamıyor.
zh_hans: 数据协定类型“{0}”无法反序列化，因为未找到必需的数据成员“{1}”。
zh_hant: 因為找不到必要的資料成員 '{1}'，所以資料合約類型 '{0}' 無法還原序列化。

# JsonOnlyWhitespace
source: Unexpected character '{0}'. '{1}' can write only white space characters.
cs: Neočekávaný znak {0}. Metoda {1} může zapisovat pouze prázdné znaky.
de: Unerwartetes Zeichen "{0}". "{1}" kann nur Leerraumzeichen schreiben.
es: Carácter inesperado "{0}". "{1}" solo puede escribir caracteres de espacio en blanco.
fr: Caractère '{0}' inattendu. '{1}' peut écrire uniquement des espaces blancs.
it: Carattere '{0}' imprevisto. '{1}' può scrivere solo spazi vuoti.
ja: 予期しない文字 '{0}' が見つかりました。'{1}' は空白のみ書き込むことができます。
ko: '{0}'은(는) 예기치 않은 문자입니다. '{1}'은(는) 공백 문자만 쓸 수 있습니다.
pl: Nieoczekiwany znak „{0}”. „{1}” może zapisywać tylko białe znaki.
pt_br: Caractere inesperado '{0}'. '{1}' pode gravar somente caracteres de espaço em branco.
ru: Непредвиденный символ "{0}". "{1}" может записывать только пробельные символы.
tr: Beklenmeyen '{0}' karakteri. '{1}' yalnızca boşluk karakterleri yazabilir.
zh_hans: 意外的字符“{0}”。“{1}”只能写入空格字符。
zh_hant: 未預期的字元 '{0}'。'{1}' 只可寫入空白字元。

# JsonOpenAttributeMustBeClosedFirst
source: Cannot call {0} while an attribute is being written.
cs: Metodu {0} nelze volat v průběhu zapisování atributu.
de: Während des Schreibens eines Attributs kann {0} nicht aufgerufen werden.
es: No se puede llamar a {0} mientras se escribe un atributo.
fr: Impossible d'appeler {0} quand un attribut est en cours d'écriture.
it: Non è possibile chiamare {0} durante la scrittura di un attributo.
ja: 属性の書き込み中は、{0} を呼び出せません。
ko: 특성을 쓰는 동안에는 {0}을(를) 호출할 수 없습니다.
pl: Nie można wywołać metody {0}, gdy trwa zapisywanie atrybutu.
pt_br: Não é possível chamar {0} enquanto um atributo está sendo gravado.
ru: Нельзя вызвать {0} во время записи атрибута.
tr: Bir öznitelik yazılırken {0} çağrılamaz.
zh_hans: 写入特性时无法调用 {0}。
zh_hant: 寫入屬性的同時，無法呼叫 {0}。

# JsonPrefixMustBeNullOrEmpty
source: Encountered unexpected prefix '{0}'. The prefix must be null or empty.
cs: Byla nalezena neočekávaná předpona {0}. Předpona musí mít hodnotu null nebo musí být prázdná.
de: Ein unerwartetes Präfix "{0}" wurde gefunden. Das Präfix muss NULL oder leer sein.
es: Prefijo inesperado"{0}". El prefijo debe ser nulo o estar vacío.
fr: Préfixe '{0}' inattendu. Le préfixe ne doit pas avoir une valeur null ou être vide.
it: Il prefisso '{0}' rilevato è imprevisto. Il prefisso deve essere Null o vuoto.
ja: 予期しないプレフィックス '{0}' が見つかりました。プレフィックスは、null または空でなければなりません。
ko: 예기치 않은 접두사 '{0}'이(가) 발견되었습니다. 접두사는 Null이거나 비어 있어야 합니다.
pl: Napotkano nieoczekiwany prefiks „{0}”. Prefiks musi mieć wartość null lub musi być pusty.
pt_br: Prefixo inesperado encontrado '{0}'. O prefixo deve ser nulo ou vazio.
ru: Обнаружен непредвиденный префикс "{0}". Префикс должен иметь значение NULL или быть пустым.
tr: Beklenmeyen '{0}' önekiyle karşılaşıldı. Önek null veya boş olmalıdır.
zh_hans: 遇到意外的前缀“{0}”。该前缀必须为 Null 或为空。
zh_hant: 出現非預期的前置詞 '{0}'。前置詞必須是 null 或空的。

# JsonRequiredMembersNotFound
source: The data contract type '{0}' cannot be deserialized because the required data members '{1}' were not found.
cs: Typ kontraktu dat {0} nelze deserializovat, protože nebyly nalezeny požadované datové členy {1}.
de: Der Datenvertragstyp "{0}" kann nicht deserialisiert werden, da die erforderlichen Datenmember "{1}" nicht gefunden wurden.
es: El tipo de contrato de datos "{0}" no se puede deserializar porque no se encontraron los miembros de datos requeridos "{1}".
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé, car les données membres obligatoires '{1}' sont introuvables.
it: Non è possibile deserializzare il tipo di contratto di dati '{0}' perché non sono stati trovati i membri dati '{1}' richiesti.
ja: 必要なデータ メンバー '{1}' が見つからなかったため、データ コントラクト型 '{0}' は逆シリアル化できません。
ko: 필요한 데이터 멤버 '{1}'을(를) 찾을 수 없어 데이터 계약 형식 '{0}'을(를) deserialize할 수 없습니다.
pl: Nie można deserializować typu kontraktu danych „{0}”, ponieważ nie można znaleźć wymaganych składowych danych „{1}”.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado porque os membros de dados necessários '{1}' não foram encontrados.
ru: Тип контракта данных "{0}" не может быть десериализован, поскольку не удалось найти необходимые элементы данных "{1}".
tr: Gerekli veri üyeleri '{1}' bulunamadığından, '{0}' veri anlaşması türü seri durumdan çıkarılamıyor.
zh_hans: 数据协定类型“{0}”无法反序列化，因为未找到必需的数据成员“{1}”。
zh_hant: 因為找不到必要的資料成員 '{1}'，所以資料合約類型 '{0}' 無法還原序列化。

# JsonServerTypeSpecifiedForInvalidDataType
source: Attempted to write an attribute with local name '{0}' after writing the attribute '{1}'='{2}'. An attribute with local name '{0}' may be written only after writing the attribute '{1}'='{3}'.
cs: Byl proveden pokus o zápis atributu s místním názvem {0} po zápisu atributu {1}={2}. Atribut s místním názvem {0} lze zapsat pouze po zápisu atributu {1}={3}.
de: Es wurde versucht, ein Attribut mit dem lokalen Namen "{0}" zu schreiben, nachdem das Attribut "{1}"="{2}" geschrieben wurde. Ein Attribut mit dem lokalen Namen "{0}" darf nur nach dem Schreiben des Attributs "{1}"="{3}" geschrieben werden.
es: Se intentó escribir un atributo con el nombre local "{0}" después de escribir el atributo "{1}"="{2}". Solo se puede escribir un atributo con el hombre local "{0}" después de escribir el atributo "{1}"="{3}".
fr: Tentative d'écriture d'un attribut comportant le nom local '{0}' après l'écriture de l'attribut '{1}'='{2}'. Il est possible d'écrire un attribut comportant le nom local '{0}' uniquement après avoir écrit l'attribut '{1}'='{3}'.
it: Si è provato a scrivere un attributo con nome locale '{0}' dopo la scrittura dell'attributo '{1}'='{2}'. Un attributo con nome locale '{0}' può essere scritto solo dopo che è stato scritto l'attributo '{1}'='{3}'.
ja: 属性 '{1}'='{2}' の書き込み後にローカル名 '{0}' の属性を書き込もうとしました。ローカル名 '{0}' の属性は、属性 '{1}'='{3}' の書き込み後にのみ書き込めます。
ko: '{1}'='{2}' 특성을 쓴 뒤 로컬 이름이 '{0}'인 특성을 쓰려고 했습니다. 로컬 이름이 '{0}'인 특성은 '{1}'='{3}' 특성을 쓴 뒤에만 쓸 수 있습니다.
pl: Podjęto próbę zapisania atrybutu o nazwie lokalnej „{0}” po zapisaniu atrybutu „{1}”=„{2}”. Atrybut o nazwie lokalnej „{0}” można zapisać tylko po zapisaniu atrybutu „{1}”=„{3}”.
pt_br: Tentou gravar um atributo com o nome local '{0}' após gravar o atributo '{1}'='{2}'. Um atributo com o nome local '{0}' pode ser gravado somente após gravar o atributo '{1}'='{3}'.
ru: Попытка записи атрибута с локальным именем "{0}" после записи атрибута "{1}"="{2}". Запись атрибута с локальным именем "{0}" может быть выполнена только после записи атрибута "{1}"="{3}".
tr: '{1}'='{2}' özniteliği yazıldıktan sonra '{0}' yerel adlı bir öznitelik yazılmaya çalışıldı. '{0}' yerel adlı bir öznitelik yalnızca '{1}'='{3}' özniteliği yazıldıktan sonra yazılabilir.
zh_hans: 试图在写入特性“{1}”=“{2}”后写入本地名称为“{0}”的特性。只能在写入特性“{1}”=“{3}”后写入本地名称为“{0}”的特性。
zh_hant: 在寫入屬性 '{1}'='{2}' 之後，嘗試寫入本機名稱 '{0}' 的屬性。但只有在寫入屬性 '{1}'='{3}' 之後，才可寫入本機名稱 '{0}' 的屬性。

# JsonSizeExceedsRemainingBufferSpace
source: The specified size exceeds the remaining buffer space ('{0}' bytes).
cs: Zadaná velikost překračuje zbývající prostor vyrovnávací paměti (počet bajtů: {0}).
de: Die angegebene Größe überschreitet den verbleibenden Pufferspeicher ("{0}" Bytes).
es: El tamaño especificado supera el espacio restante del búfer ("{0}" bytes).
fr: La taille spécifiée est supérieure à l'espace de la mémoire tampon restant ('{0}' octets).
it: Le dimensioni specificate superano lo spazio buffer rimanente ('{0}' byte).
ja: 指定されたサイズは、残りのバッファー領域 ('{0}' バイト) を超えています。
ko: 지정된 크기가 남아 있는 버퍼 공간('{0}'바이트)을 초과합니다.
pl: Określony rozmiar przekracza ilość wolnego miejsca w buforze („{0}” B).
pt_br: O tamanho especificado excede o espaço em buffer restante ('{0}' bytes).
ru: Указанный размер превышает оставшееся пространство буфера ("{0}" байт).
tr: Belirtilen boyut kalan arabellek alanını ('{0}' bayt) aşıyor.
zh_hans: 指定的大小超出了剩余缓冲区空间(“{0}”个字节)。
zh_hant: 指定的大小超過剩餘的緩衝區空間 ('{0}' 個位元組)。

# JsonTypeNotSupportedByDataContractJsonSerializer
source: DataContractJsonSerializer does not support objects of type '{0}'.
cs: Metoda DataContractJsonSerializer nepodporuje objekty typu {0}.
de: DataContractJsonSerializer unterstützt keine Objekte vom Typ "{0}".
es: DataContractJsonSerializer no admite los objetos de tipo "{0}".
fr: DataContractJsonSerializer ne prend pas en charge les objets de type '{0}'.
it: DataContractJsonSerializer non supporta oggetti di tipo '{0}'.
ja: DataContractJsonSerializer は、型 '{0}' のオブジェクトをサポートしていません。
ko: DataContractJsonSerializer는 '{0}' 형식의 개체를 지원하지 않습니다.
pl: Klasa DataContractJsonSerializer nie obsługuje obiektów typu „{0}”.
pt_br: DataContractJsonSerializer não dá suporte a objetos do tipo '{0}'.
ru: DataContractJsonSerializer не поддерживает объекты типа "{0}".
tr: DataContractJsonSerializer, '{0}' türünde nesneleri desteklemez.
zh_hans: DataContractJsonSerializer 不支持类型为“{0}”的对象。
zh_hant: DataContractJsonSerializer 不支援類型 '{0}' 的物件。

# JsonUnexpectedAttributeLocalName
source: Encountered unexpected attribute local name '{0}'. 'type' and '__type' are the only allowed local names for attributes. 'type' can be used to influence how data is written; its valid values are 'object', 'string', 'number', 'null', 'boolean', and 'array'. '__type' can be used to provide type hint information to the writer.
cs: Byl zjištěn atribut s neočekávaným místním názvem {0}. Pro atributy jsou povoleny pouze místní názvy type a __type. Název type má vliv na způsob zápisu dat a platnými hodnotami jsou object, string, number, null, boolean a array. Použitím názvu __type můžete sdělit zapisovacímu modulu pomocné informace o typu.
de: Ein unerwarteter lokaler Attributname "{0}" wurde gefunden. "type" und "__type" sind die einzigen zulässigen lokalen Namen für Attribute. Mit "type" kann beeinflusst werden, wie Daten geschrieben werden. Gültige Werte sind "object", "string", "number", "null", "boolean" und "array". Mit "__type" können Hinweise zum Typ für den Writer bereitgestellt werden.
es: Nombre local de atributo inesperado "{0}". "type" y "__type" son los únicos nombres locales permitidos para los atributos. "type" se puede usar para influir en el modo en que se escriben los datos; sus valores válidos son "object", "string", "number", "null", "boolean" y "array". "__type" se puede usar para proporcionar información de tipo al escritor.
fr: Nom local '{0}' de l'attribut inattendu. 'type' et '__type' sont les seuls noms locaux autorisés pour les attributs. 'type' peut être utilisé pour avoir une influence sur la manière dont les données sont écrites ; ses valeurs valides sont 'object', 'string', 'number', 'null', 'boolean' et 'array'. '__type' peut être utilisé pour fournir des informations clés sur le type à l'enregistreur.
it: Il nome locale '{0}' dell'attributo rilevato è imprevisto. 'type' e '__type' sono gli unici nomi locali dell'attributo consentiti. 'type' può essere usato per influire sulla scrittura dei dati; i valori validi sono 'object', 'string', 'number', 'null', 'boolean' e 'array'. '__type' può essere usato per fornire suggerimenti al writer.
ja: 予期しない属性ローカル名 '{0}' が見つかりました。属性のローカル名としては 'type' および '__type' のみが許可されています。'type' を使用すると、データの書き込み方法に影響を与えることができます。有効な値は、'object'、'string'、'number'、'null'、'boolean'、および 'array' です。'__type' を使用すると、型に関するヒント情報をライターに提供することができます。
ko: 예기치 않은 특성 로컬 이름 '{0}'이(가) 발견되었습니다. 특성에 사용할 수 있는 로컬 이름은 'type' 및 '__type'뿐입니다. 'type'은 데이터의 쓰기 방식을 조정하는 데 사용되며 유효한 값은 'object', 'string', 'number', 'null', 'boolean' 및 'array'입니다. '__type'은 형식에 대한 정보를 기록기에 알리는 데 사용됩니다.
pl: Napotkano nieoczekiwaną nazwę lokalną atrybutu „{0}”. Jedynymi dozwolonymi nazwami lokalnymi atrybutów są nazwy type i __type. Nazwy type można użyć, aby mieć wpływ na sposób zapisywania danych; jej prawidłowe wartości to object, string, number, null, boolean i array. Nazwy __type można użyć w celu dostarczenia składnikowi zapisywania wskazówki dotyczącej typu.
pt_br: Encontrou um nome de local do atributo inesperado '{0}'. 'tipo' e '__tipo' são os únicos nomes de local permitidos para atributos. O 'tipo' pode ser usado para influenciar como os dados são gravados; seus valores válidos são 'objeto', 'cadeia de caracteres', 'número', 'nulo', 'booliano' e 'matriz'. '__tipo' pode ser usado para fornecer informação de dica de tipo para o gravador.
ru: Обнаружено непредвиденное локальное имя атрибута "{0}". Для атрибутов разрешены только локальные имена "type" и "__type". Атрибут "type" может быть использован для изменения способа записи данных. Допустимыми значениями для него являются object, string, number, NULL, boolean и array. Атрибут "__type" позволяет предоставить модулю записи сведения о подсказке типа.
tr: Beklenmeyen '{0}' öznitelik yerel adıyla karşılaşıldı. Öznitelikler için yalnızca 'type' ve '__type' yerel adlarına izin verilir. 'type' verilerin yazılışını etkilemek için kullanılabilir; geçerli değerleri 'object', 'string', 'number', 'null', 'boolean' ve 'array'dır. '__type', yazıcıya tür ipucu sağlamak için kullanılabilir.
zh_hans: 遇到意外的特性本地名称“{0}”。特性的本地名称只能为 "type" 和 "__type"。"type" 可用于影响数据写入的方式；其有效值是 "object"、"string"、"number"、"null"、"boolean" 和 "array"。"__type" 可用于向编写器提供类型提示信息。
zh_hant: 出現了未預期的屬性本機名稱 '{0}'。對屬性只允許 'type' 與 '__type' 這兩個本機名稱。'type' 可用於影響寫入資料的方式; 其有效值為 'object'、'string'、'number'、'null'、'boolean' 以及 'array'。'__type' 可用於為寫入器提供類型提示資訊。
