Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PartialTrustDataContractPropertyGetNotPublic
source: The data contract type '{0}' cannot be serialized in partial trust because the property '{1}' does not have a public getter.
cs: Typ kontraktu dat {0} nemůže být serializován v částečném vztahu důvěryhodnosti, protože vlastnost {1} nemá veřejnou metodu getter.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert sein, weil die Eigenschaft "{1}" keinen öffentlichen Getter hat.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque la propiedad "{1}" no tiene ningún captador público.
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé en confiance partielle, car la propriété '{1}' n'a aucune méthode getter publique.
it: Il tipo di contratto di dati '{0}' non può essere serializzato in attendibilità parziale perché la proprietà '{1}' non contiene un getter pubblico.
ja: プロパティ '{1}' にパブリックなゲッターがないため、部分的な信頼でデータ コントラクト型 '{0}' をシリアル化できません。
ko: '{1}' 속성에 public getter가 없기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ właściwość „{1}” nie ma publicznej metody pobierającej.
pt_br: O tipo de contrato de dados '{0}' não pode ser serializado em confiança parcial, pois a propriedade '{1}' não tem um getter público.
ru: Тип контракта данных "{0}" не может быть сериализован при отношении частичного доверия, поскольку свойство "{1}" не имеет общего метода получения.
tr: '{1}' özelliğinin genel bir alıcısı olmadığından, '{0}' veri anlaşması türü kısmi güvende serileştirilemiyor.
zh_hans: 无法在部分信任中序列化数据协定类型“{0}”，因为属性“{1}”没有公共 Getter。
zh_hant: 因為屬性 '{1}' 沒有公用 getter，所以資料合約類型 '{0}' 無法在部分信任中序列化。

# PartialTrustDataContractPropertySetNotPublic
source: The data contract type '{0}' cannot be deserialized in partial trust because the property '{1}' does not have a public setter.
cs: Typ kontraktu dat {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože vlastnost {1} nemá veřejnou metodu setter.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil die Eigenschaft "{1}" keinen öffentlichen Setter hat.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque la propiedad "{1}" no tiene ningún establecedor público.
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé en confiance partielle, car la propriété '{1}' n'a aucun setter public.
it: Il tipo di contratto di dati '{0}' non può essere deserializzato in attendibilità parziale perché la proprietà '{1}' non contiene un setter pubblico.
ja: プロパティ '{1}' にパブリックな setter がないため、部分的な信頼でデータ コントラクト型 '{0}' のシリアル化を解除できません。
ko: '{1}' 속성에 public setter가 없기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ właściwość „{1}” nie ma publicznej metody ustawiającej.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado em confiança parcial, pois a propriedade '{1}' não tem um setter público.
ru: Тип контракта данных "{0}" не может быть десериализован при отношении частичного доверия, поскольку свойство "{1}" не имеет общего метода задания.
tr: '{1}' özelliğinin genel bir ayarlayıcısı olmadığından, '{0}' veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化数据协定类型“{0}”，因为属性“{1}”没有公共 setter。
zh_hant: 因為屬性 '{1}' 沒有公用 setter，所以資料合約類型 '{0}' 無法在部分信任中還原序列化。

# PartialTrustDataContractTypeNotPublic
source: The data contract type '{0}' is not serializable in partial trust because it is not public.
cs: Typ kontraktu dat {0} není serializovatelný v částečném vztahu důvěryhodnosti, protože není veřejný.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert werden, weil er nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque no es público.
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé en confiance partielle, car il n'est pas public.
it: Il tipo di contratto di dati '{0}' non può essere serializzato in attendibilità parziale perché non è pubblico.
ja: パブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' をシリアル化できません。
ko: 데이터 계약 형식 '{0}'이(가) public이 아니기 때문에 해당 형식을 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ nie jest on publiczny.
pt_br: O tipo de contrato de dados '{0}' não é serializável em confiança parcial, pois não é público.
ru: Тип контракта данных "{0}" не может быть сериализован при отношении частичного доверия, поскольку он не является общим.
tr: Genel olmadığından, '{0}' veri anlaşması türü kısmi güvende serileştirilebilir değil.
zh_hans: 无法在部分信任中序列化数据约定类型“{0}”，因为它不是公共类型。
zh_hant: 因為資料合約類型 '{0}'不是公用的，所以無法在部分信任中序列化。

# PartialTrustIXmlSerializableTypeNotPublic
source: The IXmlSerializable type '{0}' is not serializable in partial trust because it is not public.
cs: Typ IXmlSerializable {0} není serializovatelný v částečném vztahu důvěryhodnosti, protože není veřejný.
de: Der IXmlSerializable-Typ "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert werden, weil er nicht öffentlich ist.
es: El tipo IXmlSerializable "{0}" no se puede serializar en una confianza parcial porque no es público.
fr: Le type IXmlSerializable '{0}' ne peut pas être sérialisé en confiance partielle, car il n'est pas public.
it: Il tipo '{0}' di IXmlSerializable non è serializzabile in attendibilità parziale perché non è pubblico.
ja: パブリックでないため、部分的な信頼で IXmlSerializable 型 '{0}' をシリアル化できません。
ko: IXmlSerializable 형식 '{0}'이(가) public이 아니기 때문에 해당 형식을 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu IXmlSerializable „{0}” w częściowej relacji zaufania, ponieważ nie jest on publiczny.
pt_br: O tipo IXmlSerializable '{0}' não é serializável em confiança parcial, pois não é público.
ru: Тип IXmlSerializable "{0}" не может быть сериализован при отношении частичного доверия, поскольку он не является общим.
tr: Genel olmadığından, '{0}' IXmlSerializable türü kısmi güvende serileştirilebilir değil.
zh_hans: 无法在部分信任中序列化 IXmlSerializable 类型“{0}”，因为它不是公共类型。
zh_hant: IXmlSerializable 類型 '{0}' 無法在部分信任中序列化，因為它不是公用的。

# PartialTrustIXmlSerialzableNoPublicConstructor
source: The IXmlSerializable type '{0}' cannot be deserialized in partial trust because it does not have a public parameterless constructor.
cs: Typ IXmlSerializable {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože nemá veřejný konstruktor bez parametrů.
de: Der IXmlSerializable-Typ "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil er keinen öffentlichen parameterlosen Konstruktor hat.
es: El tipo IXmlSerializable "{0}" no se puede deserializar en una confianza parcial porque no tiene ningún constructor público sin parámetros.
fr: Le type IXmlSerializable '{0}' ne peut pas être désérialisé en confiance partielle, car il n'a pas de constructeur sans paramètre public.
it: Il tipo '{0}' di IXmlSerializable non può essere deserializzato in attendibilità parziale perché non contiene un costruttore pubblico senza parametri.
ja: パブリックなパラメーターなしのコンストラクターがないため、部分的な信頼で IXmlSerializable 型 '{0}' を逆シリアル化できません。
ko: IXmlSerializable 형식 '{0}'에 매개 변수가 없는 public 생성자가 없기 때문에 해당 형식을 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu IXmlSerializable „{0}” w częściowej relacji zaufania, ponieważ nie ma on publicznego konstruktora bez parametrów.
pt_br: O tipo IXmlSerializable '{0}' não pode ser desserializado em confiança parcial, pois ele não tem um construtor público sem parâmetros.
ru: Тип IXmlSerializable "{0}" не может быть десериализован при отношении частичного доверия, поскольку не содержит общий конструктор без параметров.
tr: Genel parametresiz oluşturucusu olmadığından, '{0}' IXmlSerializable türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化 IXmlSerializable 类型“{0}”，因为它没有公共的无参数构造函数。
zh_hant: IXmlSerializable 類型 '{0}' 無法在部分信任中還原序列化，因為它沒有公用的無參數建構函式。

# PartialTrustNonAttributedSerializableTypeNoPublicConstructor
source: The type '{0}' cannot be deserialized in partial trust because it does not have a public parameterless constructor.
cs: Typ {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože nemá veřejný konstruktor bez parametrů.
de: Der Typ "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil er keinen öffentlichen parameterlosen Konstruktor hat.
es: El tipo "{0}" no se puede deserializar con confianza parcial porque no tiene un constructor sin parámetros público.
fr: Le type '{0}' ne peut pas être désérialisé en confiance partielle, car il n'a pas de constructeur sans paramètre public.
it: Il tipo '{0}' non può essere deserializzato in attendibilità parziale perché non contiene un costruttore pubblico senza parametri.
ja: パブリックなパラメーターなしのコンストラクターがないため、部分的な信頼で型 '{0}' のシリアル化を解除できません。
ko: '{0}' 형식은 매개 변수가 없는 public 생성자를 포함하지 않으므로 부분 신뢰에서 deserialize될 수 없습니다.
pl: Typu „{0}” nie można zdeserializować w częściowej relacji zaufania, ponieważ nie ma on publicznego konstruktora bez parametrów.
pt_br: O tipo '{0}' não pode ser desserializado com confiança parcial, pois ele não tem um construtor público sem parâmetros.
ru: Не удалось десериализовать тип "{0}" при отношении частичного доверия, поскольку он не содержит общий конструктор без параметров.
tr: Genel parametresiz oluşturucusu olmadığından, '{0}' türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化类型“{0}”，因为它没有公共的无参数构造函数。
zh_hant: 在部分信任的情況下，無法將類型 '{0}' 還原序列化，因為沒有公用的無參數建構函式。

# QuotaCopyReadOnly
source: Cannot copy XmlDictionaryReaderQuotas. Target is readonly.
cs: Nelze kopírovat kvóty XmlDictionaryReaderQuotas. Cíl je určen jen pro čtení.
de: XmlDictionaryReaderQuotas kann nicht kopiert werden. Das Ziel ist schreibgeschützt.
es: No se puede copiar XmlDictionaryReaderQuotas. El destino es de solo lectura.
fr: Impossible de copier XmlDictionaryReaderQuotas. La cible est en lecture seule.
it: Non è possibile copiare XmlDictionaryReaderQuotas. La destinazione è di sola lettura.
ja: XmlDictionaryReaderQuotas をコピーできません。コピー対象が読み取り専用です。
ko: XmlDictionaryReaderQuotas를 복사할 수 없습니다. 대상이 읽기 전용입니다.
pl: Nie można skopiować elementu XmlDictionaryReaderQuotas. Docelowy element jest tylko od odczytu.
pt_br: Não é possível copiar XmlDictionaryReaderQuotas. O destino é somente leitura.
ru: Не удалось скопировать XmlDictionaryReaderQuotas. Целевая квота предназначена только для чтения.
tr: XmlDictionaryReaderQuotas kopyalanamıyor. Hedef salt okunur.
zh_hans: 无法复制 XmlDictionaryReaderQuotas。目标为只读。
zh_hant: 無法複製 XmlDictionaryReaderQuotas。目標是唯讀的。

# QuotaIsReadOnly
source: The '{0}' quota is readonly.
cs: Kvóta {0} je určena jen pro čtení.
de: Das Kontingent "{0}" ist schreibgeschützt.
es: La cuota "{0}" es de solo lectura.
fr: Le quota '{0}' est en lecture seule.
it: La quota '{0}' è di sola lettura.
ja: '{0}' クォータは読み取り専用です。
ko: '{0}' 할당량이 읽기 전용입니다.
pl: Przydział „{0}” jest tylko do odczytu.
pt_br: A cota '{0}' é somente leitura.
ru: Квота "{0}" предназначена только для чтения.
tr: '{0}' kotası salt okunur.
zh_hans: “{0}”配额为只读。
zh_hant: '{0}' 配額是唯讀配額。

# QuotaMustBePositive
source: Quota must be a positive value.
cs: Kvóta musí být pozitivní hodnota.
de: Für das Kontingent muss ein positiver Wert angegeben werde.
es: La cuota debe ser un valor positivo.
fr: Le quota doit être une valeur positive.
it: La quota deve essere un valore positivo.
ja: クォータは正の値である必要があります。
ko: 할당량은 양의 값이어야 합니다.
pl: Przydział musi być wartością dodatnią.
pt_br: A cota deve ser um valor positivo.
ru: Значение квоты должно быть положительным числом.
tr: Kota pozitif bir değer olmalı.
zh_hans: 配额必须为正数值。
zh_hant: 配額必須是正數值。

# RecursiveCollectionType
source: Type '{0}' is a recursive collection data contract which is not supported. Consider modifying the definition of collection '{0}' to remove references to itself.
cs: Typ {0} je datový kontrakt rekurzivní kolekce, který není podporován. Zvažte úpravu definice kolekce {0} tak, aby došlo k odebrání odkazů na samotnou kolekci.
de: Typ "{0}" ist ein rekursiver Sammlungsdatenvertrag, der nicht unterstützt wird. Ändern Sie ggf. die Definition der Sammlung "{0}", um Verweise auf sich selbst zu entfernen.
es: El tipo "{0}" es un contrato de datos de colección recursiva que no se admite. Considere la posibilidad de modificar la definición de la colección "{0}" para quitar las referencias a sí misma.
fr: Le type '{0}' est un contrat de données de collection récursive non pris en charge. Changez la définition de collection '{0}' pour supprimer les autoréférences.
it: Il tipo '{0}' è un contratto di dati della raccolta ricorsiva non supportato. Provare a modificare la definizione della raccolta '{0}' per rimuovere i riferimenti a se stessa.
ja: 型 '{0}' は、サポートされていない再帰的なコレクション データ コントラクトです。コレクション '{0}' の定義を変更して、自身への参照の削除を検討してください。
ko: '{0}' 형식은 지원되지 않는 재귀 컬렉션 데이터 계약입니다. 컬렉션 '{0}'의 정의를 수정하여 자신에 대한 참조를 제거하세요.
pl: Typ {0} jest kontraktem danych kolekcji cyklicznej, który nie jest obsługiwany. Rozważ zmodyfikowanie definicji kolekcji {0} w celu usunięcia jej odwołań do samej siebie.
pt_br: O tipo '{0}' é um contrato de dados de coleção recursivo, para o qual não há suporte. Considere modificar a definição da coleção '{0}' para remover as referências a ela mesma.
ru: Тип "{0}" является контрактом коллекции рекурсивных данных, который не поддерживается. Попробуйте изменить определение коллекции "{0}", чтобы удалить ссылки на себя.
tr: '{0}' türü desteklenmeyen bir özyinelemeli koleksiyon veri anlaşmasıdır. Kendine başvuruları kaldırmak için '{0}' koleksiyonun tanımını değiştirmeyi deneyin.
zh_hans: 类型“{0}”是不支持的递归集合数据协定。请考虑修改集合“{0}”的定义，移除对其自身的引用。
zh_hant: 類型 '{0}' 是不支援的遞迴集合資料合約。請考慮修改集合 '{0}' 的定義，移除自我參考。

# RedefineNotSupported
source: Redefine is not supported.
cs: Předefinování není podporováno.
de: Neudefinieren wird nicht unterstützt.
es: No se admite la redefinición.
fr: Redéfinition non prise en charge.
it: La ridefinizione non è supportata.
ja: 再定義はサポートされていません。
ko: 다시 정의가 지원되지 않습니다.
pl: Ponowne definiowanie nie jest obsługiwane.
pt_br: Não há suporte para redefinição.
ru: Переопределение не поддерживается.
tr: Redefine desteklenmiyor.
zh_hans: 不支持重新定义。
zh_hant: 不支援重新定義。

# ReferencedBaseTypeDoesNotExist
source: Collection type cannot be generated for type '{0}' from namespace '{1}'. Rename the type to '{2}' in namespace '{3}' or reference an existing collection type that implements '{4}' or '{5}' which can be used as a base type for the generated collection.
cs: Pro typ {0} z oboru názvů {1} nelze generovat typ kolekce. Přejmenujte typ na {2} v oboru názvů {3} nebo odkažte na stávající typ kolekce implementující {4} nebo {5}, který lze použít jako základní typ pro generované kolekce.
de: Für den Typ "{0}" aus dem Namespace "{1}" kann kein Sammlungstyp generiert werden. Benennen Sie den Typ in "{2}" im Namespace "{3}" um, oder verweisen Sie auf einen vorhandenen Sammlungstyp, der "{4}" oder "{5}" implementiert und als Basistyp für die generierte Sammlung verwendet werden kann.
es: No se puede generar el tipo de colección para el tipo "{0}" del espacio de nombres "{1}". Cambie el tipo a "{2}" en el espacio de nombres "{3}" o cree una referencia a un tipo de colección existente que implemente "{4}" o "{5}" y que se pueda usar como tipo base para la colección generada.
fr: Impossible de générer le type de collection pour le type '{0}' provenant de l'espace de noms '{1}'. Renommez le type en '{2}' dans l'espace de noms '{3}' ou référencez un type de collection existant qui implémente '{4}' ou '{5}' et qui peut être utilisé comme type de base pour la collection générée.
it: Non è possibile generare il tipo di raccolta per il tipo '{0}' dello spazio dei nomi '{1}'. Rinominare il tipo in '{2}' nello spazio dei nomi '{3}' o fare riferimento a un tipo di raccolta esistente che implementi '{4}' o '{5}' affinché possa essere usato come tipo di base per la raccolta generata.
ja: 名前空間 '{1}' の型 '{0}' に対して、コレクション型を生成できません。名前空間 '{3}' で '{2}' に対する型の名前を変更するか、または生成されたコレクションに対して基本データ型として使用できる '{4}' または '{5}' を実装している、既存のコレクション型を参照してください。
ko: 네임스페이스 '{1}'의 형식 '{0}'에 대해 컬렉션 형식을 생성할 수 없습니다. 형식의 이름을 네임스페이스 '{3}'의 '{2}'(으)로 바꾸거나 생성된 컬렉션에 대한 기본 형식으로 사용할 수 있는 '{4}' 또는 '{5}'을(를) 구현하는 기존 컬렉션 형식을 참조하세요.
pl: Nie można wygenerować kolekcji dla typu „{0}” z przestrzeni nazw „{1}”. Zmień nazwę typu na „{2}” w przestrzeni nazw „{3}” albo wskaż istniejący typ kolekcji implementujący element „{4}” lub „{5}”, który może zostać użyty jako typ podstawowy generowanej kolekcji.
pt_br: Não é possível gerar o tipo de coleção para o tipo '{0}' do namespace '{1}'. Renomeie o tipo para '{2}' no namespace '{3}' ou referencie um tipo de coleção existente que implementa '{4}' ou '{5}' que pode ser usado como um tipo base para a coleção gerada.
ru: Тип коллекции не может быть сгенерирован для типа "{0}" из пространства имен "{1}". Переименуйте данный тип в "{2}" из пространства имен "{3}" или сделайте ссылку на существующий тип коллекции, реализующий "{4}" или "{5}", который может использоваться в качестве базового типа для сгенерированной коллекции.
tr: '{1}' ad alanındaki '{0}' türü için koleksiyon türü oluşturulamıyor. '{3}' ad alanındaki '{2}' türünü yeniden adlandırın ya da oluşturulan koleksiyon için bir temel tür olarak kullanılabilen '{4}' veya '{5}' öğesini uygulayan mevcut bir koleksiyona başvurun.
zh_hans: 无法为命名空间“{1}”中的类型“{0}”生成集合类型。在命名空间“{3}”中将类型重命名为“{2}”，或引用实现“{4}”或“{5}”(其可用作生成集合的基类型)的现有集合类型。
zh_hant: 無法為來自命名空間 '{1}' 的類型 '{0}' 產生集合類型。請將類型重新命名成命名空間 '{3}' 中的 '{2}'，或參考現有集合類型，而該類型實行可用作為產生之集合的基底類型的 '{4}' 或 '{5}'。

# ReferencedCollectionTypesCannotContainNull
source: ReferencedCollectionTypes specified via ImportOptions must contain valid types. Cannot contain null.
cs: Typy ReferencedCollectionTypes určené možnostmi ImportOptions musejí obsahovat platné typy. Nemohou obsahovat hodnotu null.
de: Die über ImportOptions angegebene ReferencedCollectionTypes-Liste muss gültige Typen enthalten. Ein NULL-Wert ist nicht zulässig.
es: El elemento ReferencedCollectionTypes especificado mediante ImportOptions debe contener tipos válidos. No puede contener valores nulos.
fr: L'entité ReferencedCollectionTypes spécifiée via ImportOptions doit contenir des types valides. Elle ne peut pas contenir une valeur null.
it: L'elemento ReferencedCollectionTypes specificato tramite ImportOptions deve contenere tipi validi. Non può contenere Null.
ja: ImportOptions を介して指定された ReferencedCollectionTypes には、有効な型を含める必要があります。null を含むことはできません。
ko: ImportOptions를 통해 지정된 ReferencedCollectionTypes는 유효한 형식을 포함해야 합니다. null을 포함할 수 없습니다.
pl: Właściwość ReferencedCollectionTypes określona za pomocą elementu ImportOptions musi zawierać prawidłowe typy. Nie może zawierać wartości null.
pt_br: O ReferencedCollectionTypes especificado via ImportOptions deve conter tipos válidos. Ele não pode conter nulos.
ru: ReferencedCollectionTypes, указанный в параметре ImportOptions, должен содержать допустимые типы и не может включать в себя null.
tr: ImportOptions ile belirtilen ReferencedCollectionTypes öğeleri geçerli tür bulundurmalıdır. null içeremez.
zh_hans: 通过 ImportOptions 指定的 ReferencedCollectionTypes 必须包含有效的类型。不能包含 Null 类型。
zh_hant: 透過 ImportOptions 指定的 ReferencedCollectionTypes 必須包含有效的類型。不可以包含 Null。

# ReferencedTypeDoesNotMatch
source: Referenced type '{0}' with data contract name '{1}' in namespace '{2}' cannot be used since it does not match imported DataContract. Need to exclude this type from referenced types.
cs: Odkazovaný typ {0} s názvem kontraktu dat {1} v oboru názvů {2} nelze použít, protože se neshoduje s importovaným kontraktem dat DataContract. Tento typ je nutné vyřadit z odkazovaných typů.
de: Der referenzierte Typ "{0}" mit dem Datenvertragsnamen"{1}" im Namespace "{2}" kann nicht verwendet werden, da er nicht mit dem importierten DataContract übereinstimmt. Dieser Typ muss von den Typen, auf die verwiesen wird, ausgeschlossen werden.
es: El tipo al que se hace referencia "{0}" con el nombre de contrato de datos "{1}" en el espacio de nombres "{2}" no se puede usar, ya que no coincide con el elemento DataContract importado. Es necesario excluirlo de los tipos a los que se hace referencia.
fr: Impossible d'utiliser le type référencé '{0}' comportant le nom de contrat de données '{1}' dans l'espace de noms '{2}', car il ne correspond pas au DataContract importé. Ce type doit être exclu des types référencés.
it: Non è possibile usare il tipo '{0}' di riferimento con il nome di contratto di dati '{1}' nello spazio dei nomi '{2}' perché non corrisponde all'elemento DataContract importato. È necessario escludere questo tipo dai tipi di riferimento.
ja: 名前空間 '{2}' でデータ コントラクト名 '{1}' を持つ参照された型 '{0}' は、インポートされた DataContract と異なるため使用できません。参照された型からこの型を除外する必要があります。
ko: 네임스페이스 '{2}'의 데이터 계약 이름 '{1}'을(를) 가진 참조된 형식 '{0}'은(는) 가져온 DataContract와 일치하지 않으므로 사용할 수 없습니다. 이 형식을 참조된 형식에서 제외해야 합니다.
pl: Nie można użyć określonego w odwołaniu typu „{0}” o nazwie kontraktu danych „{1}” w przestrzeni nazw „{2}”, ponieważ nie jest zgodny z zaimportowanym elementem DataContract. Należy wykluczyć ten typ z typów, do których następują odwołania.
pt_br: O tipo referenciado '{0}' com nome de contrato de dados '{1}' no namespace '{2}' não pode ser usado porque não corresponde ao DataContract importado. É necessário excluir esse tipo dos tipos referenciados.
ru: Ссылочный тип "{0}" с именем контракта данных "{1}" в пространстве имен "{2}" не может использоваться, так как он не совпадает с импортированным DataContract. Этот тип необходимо исключить из ссылочных типов.
tr: İçeri aktarılan DataContract ile eşleşmediğinden, '{2}' ad alanında '{1}' veri anlaşması adına sahip '{0}' başvurulan türü kullanılamıyor. Bu tür, başvurulan türlerden çıkarılmalıdır.
zh_hans: 由于命名空间“{2}”中具有数据协定名称“{1}”的引用类型“{0}”与导入的 DataContract 不匹配，因此无法使用。需要从引用的类型中排除此类型。
zh_hant: 無法使用命名空間 '{2}' 中資料合約名稱為 '{1}' 的參考類型 '{0}'，因為它與匯入的 DataContract 不相符。必須從參考的類型排除此類型。

# ReferencedTypeMatchingMessage
source: (matching)
cs: (shodné)
de: (übereinstimmend)
es: (coinciden)
fr: (correspondance)
it: (corrispondente)
ja: (一致)
ko: (일치)
pl: (zgodne)
pt_br: (correspondente)
ru: (совпадает)
tr: (eşleşen)
zh_hans: (匹配)
zh_hant: (相符)

# ReferencedTypeNotMatchingMessage
source: (not matching)
cs: (neshodné)
de: (nicht übereinstimmend)
es: (no coinciden)
fr: (aucune correspondance)
it: (non corrispondente)
ja: (一致しない)
ko: (일치 안 함)
pl: (niezgodne)
pt_br: (não correspondente)
ru: (не совпадает)
tr: (eşleşmeyen)
zh_hans: (不匹配)
zh_hant: (不相符)
