Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SimpleContentNotSupported
source: Complex types with simple content extension are not supported.
cs: Komplexní typy s jednoduchým rozšířením obsahu nejsou podporovány.
de: Komplexe Typen mit einfacher Inhaltserweiterung werden nicht unterstützt.
es: No se admiten los tipos complejos con extensión de contenido simple.
fr: Les types complexes dotés d'une extension de contenu simple ne sont pas pris en charge.
it: I tipi complessi con estensione di contenuto semplice non sono supportati.
ja: 単純コンテンツ拡張を持つ複合型はサポートされていません。
ko: 단순 콘텐츠 확장을 가진 복합 형식이 지원되지 않습니다.
pl: Typy złożone o prostym rozszerzeniu zawartości nie są obsługiwane.
pt_br: Não há suporte para tipos complexos com extensão de conteúdo simples.
ru: Составные типы с простым расширением содержимого не поддерживаются.
tr: Basit kapsam uzantılı karmaşık türler desteklenmez.
zh_hans: 不支持那些具有简单内容扩展的复杂类型。
zh_hant: 不支援具有簡單內容延伸模組的複雜類型。

# SimpleTypeRestrictionDoesNotSpecifyBase
source: Simple type restriction must specify a base type.
cs: Omezení jednoduchých typů musí určovat základní typ.
de: Bei der Beschränkung auf den einfachen Typ muss ein Basistyp angegeben werden.
es: La restricción de tipo simple debe especificar un tipo base.
fr: Une restriction de type simple doit spécifier un type de base.
it: La restrizione di tipo semplice deve specificare un tipo di base.
ja: 単純な型制限では、基本データ型を指定する必要があります。
ko: 단순 형식 제한은 기본 형식을 지정해야 합니다.
pl: Ograniczenie prostego typu musi określać typ podstawowy.
pt_br: A restrição de tipo simples deve especificar um tipo base.
ru: Ограничение простого типа должно указывать базовый тип.
tr: Basit türde sınırlama bir temel tür belirtmelidir.
zh_hans: 简单类型限制必须指定一个基类型。
zh_hant: 簡單型別限制必須指定基底類型。

# SimpleTypeUnionNotSupported
source: Simple types with <union> content are not supported.
cs: Jednoduché typy s obsahem <union> nejsou podporovány.
de: Einfache Typen mit <union>-Inhalt werden nicht unterstützt.
es: No se admiten los tipos simples con el contenido <union>.
fr: Les types simples dotés de contenu <union> ne sont pas pris en charge.
it: I tipi semplici con contenuto <union> non sono supportati.
ja: <union> コンテンツを持つ単純型はサポートされていません。
ko: <union> 콘텐츠를 가진 단순 형식이 지원되지 않습니다.
pl: Proste typy z zawartością <union> nie są obsługiwane.
pt_br: Não há suporte para tipos simples com conteúdo <union>.
ru: Простые типы с содержимым <union> не поддерживаются.
tr: <union> içerikli basit türler desteklenmez.
zh_hans: 不支持那些具有 <union> 内容的简单类型。
zh_hant: 不支援具有 <union> 內容的簡單型別。

# SizeExceedsRemainingBufferSpace
source: The specified size exceeds the remaining buffer space ({0} bytes).
cs: Zadaná velikost překračuje zbývající místo ve vyrovnávací paměti (počet bajtů: {0}).
de: Die angegebene Größe überschreitet den verbleibenden Pufferspeicher ({0} Bytes).
es: El tamaño especificado supera el espacio restante del búfer ({0} bytes).
fr: La taille spécifiée est supérieure à l'espace restant de la mémoire tampon ({0} octets).
it: Le dimensioni specificate superano lo spazio buffer rimanente ({0} byte).
ja: 指定したサイズは、残りのバッファー容量 ({0} バイト) を超えています。
ko: 지정된 크기가 여유 버퍼 공간({0}바이트)을 초과합니다.
pl: Określony rozmiar przekracza ilość wolnego miejsca w buforze ({0} B).
pt_br: O tamanho especificado excede o espaço de buffer restante ({0} bytes).
ru: Указанный размер превышает оставшееся буферное пространство ({0} байт).
tr: Belirtilen boyut kalan ara bellek alanını ({0} bayt) aşıyor.
zh_hans: 指定的大小超出了剩余缓冲区空间({0} 个字节)。
zh_hant: 指定的大小超過剩餘的緩衝區空間 ({0} 個位元組)。

# SpecifiedTypeNotFoundInSchema
source: Invalid type specified. Type with name '{0}' not found in schema with namespace '{1}'.
cs: Je zadán neplatný typ. Typ s názvem {0} nebyl nalezen ve schématu s oborem názvů {1}.
de: Ein ungültiger Typ wurde angegeben. Ein Typ mit dem Namen "{0}" wurde im Schema mit dem Namespace "{1}" nicht gefunden.
es: El tipo especificado no es válido. No se encontró el tipo con el nombre "{0}" en el esquema con el espacio de nombres "{1}".
fr: Type non valide spécifié. Le type doté du nom '{0}' est introuvable dans le schéma avec l'espace de noms '{1}'.
it: Il tipo specificato non è valido. Il tipo denominato '{0}' non è stato trovato nello schema con lo spazio dei nomi '{1}'.
ja: 指定された型は無効です。名前空間 '{1}' を持つスキーマ内で、名前 '{0}' を持つ型が見つかりません。
ko: 잘못된 형식이 지정되었습니다. '{0}' 이름을 가진 형식을 '{1}' 네임스페이스를 가진 스키마에서 찾을 수 없습니다.
pl: Określono nieprawidłowy typ. Nie znaleziono typu o nazwie „{0}” w schemacie z przestrzenią nazw „{1}”.
pt_br: Tipo inválido especificado. Não foi encontrado nenhum tipo com nome '{0}' no esquema com namespace '{1}'.
ru: Указан недопустимый тип. Тип с именем "{0}" не найден в схеме с пространством имен "{1}".
tr: Geçersiz tür belirtildi. '{0}' adlı tür, '{1}' ad alanı olan şemada bulunamadı.
zh_hans: 指定的类型无效。在具有命名空间“{1}”的架构中未找到名称为“{0}”的类型。
zh_hant: 指定的類型無效。在命名空間為 '{1}' 的結構描述中找不到名為 '{0}' 的類型。

# SubstitutionGroupOnElementNotSupported
source: Substitution group on element '{0}' is not supported.
cs: Substituční skupina u prvku {0} není podporována.
de: Eine Ersetzungsgruppe für das Element "{0}" wird nicht unterstützt.
es: No se admite el grupo de sustitución en el elemento "{0}".
fr: Le groupe de substitution sur l'élément '{0}' n'est pas pris en charge.
it: Il gruppo di sostituzione sull'elemento '{0}' non è supportato.
ja: 要素 '{0}' の substitution グループはサポートされていません。
ko: 요소 '{0}'의 대체 그룹이 지원되지 않습니다.
pl: Grupa podstawienia w elemencie „{0}” nie jest obsługiwana.
pt_br: Não há suporte para grupo de substituição no elemento '{0}'.
ru: Группа подстановки элемента "{0}" не поддерживается.
tr: '{0}' öğesindeki yedek grup desteklenmiyor.
zh_hans: 不支持元素“{0}”上的替换组。
zh_hant: 不支援元素 '{0}' 上的替代群組。

# SupportForMultidimensionalArraysNotPresent
source: Multi-dimensional arrays are not supported.
cs: Vícerozměrná pole nejsou podporována.
de: Mehrdimensionale Arrays werden nicht unterstützt.
es: No se admiten matrices multidimensionales.
fr: Les tableaux multidimensionnels ne sont pas pris en charge.
it: Le matrici multidimensionali non sono supportate.
ja: 多次元配列はサポートされていません。
ko: 다차원 배열이 지원되지 않습니다.
pl: Wielowymiarowe tablice nie są obsługiwane.
pt_br: Não há suporte para matrizes multidimensionais.
ru: Многомерные массивы не поддерживаются.
tr: Çok boyutlu diziler desteklenmez.
zh_hans: 不支持多维数组。
zh_hant: 不支援多維陣列。

# SurrogatesWithGetOnlyCollectionsNotSupported
source: Using surrogates with get-only collection properties is not supported. Consider removing the surrogate associated with '{0}' or adding a setter to '{1}.{2}'.
cs: Použití znaků nahrazení s vlastnostmi kolekce pouze pro získání není podporováno. Odstraňte znak nahrazení spojený s vlastností {0} nebo přidejte zdroj k {1}.{2}.
de: Die Verwendung eines Ersatzes wird bei Eigenschaften nur abrufbarer Sammlungen nicht unterstützt. Entfernen Sie ggf. den "{0}" zugeordneten Ersatz, oder fügen Sie "{1}.{2}" einen Setter hinzu.
es: No se admite el uso de caracteres suplentes con propiedades de colección get-only. Considere quitar el carácter suplente asociado con "{0}" o agregar un establecedor a "{1}.{2}".
fr: L'utilisation de substituts avec des propriétés de collection get-only n'est pas prise en charge. Supprimez le substitut associé à '{0}' ou ajoutez un setter à '{1}.{2}'.
it: L'uso di surrogati con proprietà della raccolta con sola funzione di accesso get non è supportato. Provare a rimuovere il surrogato associato a '{0}' o ad aggiungere un setter a '{1}.{2}'.
ja: get-only コレクションのプロパティでサロゲートを使用することはサポートされていません。'{0}' に関連付けられたサロゲートを削除するか、'{1}.{2}' に setter を追加してください。
ko: get-only 컬렉션 속성에는 서로게이트를 사용할 수 없습니다. '{0}'과(와) 연결된 서로게이트를 제거하거나 setter를 '{1}.{2}'에 추가해 보세요.
pl: Używanie surogatów z właściwościami kolekcji get-only nie jest obsługiwane. Rozważ usunięcie surogatu skojarzonego z „{0}” lub dodanie metody ustawiającej do „{1}.{2}”.
pt_br: Não há suporte para o uso de alternativas com propriedades de coleção somente obtenção. Considere remover a alternativa associada a '{0}' ou adicionar um setter a '{1}.{2}'.
ru: Не поддерживается использование суррогатов со свойствами коллекции, предназначенной только для получения. Удалите суррогат, связанный с "{0}", или добавьте метод задания в "{1}.{2}".
tr: Salt alma koleksiyon özellikleriyle yedeklerin kullanılması desteklenmiyor. '{0}' ile ilişkili yedeği kaldırmayı ya da '{1}.{2}' öğesine bir ayarlayıcı eklemeyi deneyin.
zh_hans: 不支持将代理项与 get-only 集合属性一起使用。请考虑移除与“{0}”关联的代理项，或向“{1}.{2}”添加一个 setter。
zh_hant: 不支援使用具備 get-only 集合屬性的 Surrogate。請考慮移除與 '{0}' 相關的 Surrogate，或在 '{1}.{2}' 中新增 setter。

# SurrogatesWithGetOnlyCollectionsNotSupportedSerDeser
source: Using surrogates with get-only collection properties is not supported. Consider removing the surrogate associated with '{0}'.
cs: Použití znaků nahrazení s vlastnostmi kolekce pouze pro získání není podporováno. Odstraňte znak nahrazení spojený s vlastností {0}.
de: Die Verwendung eines Ersatzes wird bei Eigenschaften nur abrufbarer Sammlungen nicht unterstützt. Entfernen Sie ggf. den "{0}" zugeordneten Ersatz.
es: No se admite el uso de caracteres suplentes con propiedades de colección get-only. Considere quitar el carácter suplente asociado con "{0}".
fr: L'utilisation de substituts avec des propriétés de collection get-only n'est pas prise en charge. Supprimez le substitut associé à '{0}'.
it: L'uso di surrogati con proprietà della raccolta con sola funzione di accesso get non è supportato. Provare a rimuovere il surrogato associato a '{0}'.
ja: get-only コレクションのプロパティでサロゲートを使用することはサポートされていません。'{0}' に関連付けられたサロゲートを削除してください。
ko: get-only 컬렉션 속성에는 서로게이트를 사용할 수 없습니다. '{0}'과(와) 연결된 서로게이트를 제거해 보세요.
pl: Używanie surogatów z właściwościami kolekcji get-only nie jest obsługiwane. Rozważ usunięcie surogatu skojarzonego z „{0}”.
pt_br: Não há suporte para o uso de alternativas com propriedades de coleção somente obtenção. Considere remover a alternativa associada a '{0}'.
ru: Не поддерживается использование суррогатов со свойствами коллекции, предназначенной только для получения. Удалите суррогат, связанный с "{0}".
tr: Salt alma koleksiyon özellikleriyle yedeklerin kullanılması desteklenmiyor. '{0}' ile ilişkili yedeği kaldırmayı deneyin.
zh_hans: 不支持将代理项与 get-only 集合属性一起使用。请考虑移除与“{0}”关联的代理项。
zh_hant: 不支援使用具備 get-only 集合屬性的 Surrogate。請考慮移除與 '{0}' 相關的 Surrogate。

# TooManyCollectionContracts
source: Type '{0}' has more than one CollectionDataContractAttribute attribute.
cs: Typ {0} má více atributů CollectionDataContractAttribute.
de: Der Typ "{0}" enthält mehrere CollectionDataContractAttribute-Attribute.
es: El tipo "{0}" tiene más de un atributo CollectionDataContractAttribute.
fr: Le type '{0}' est doté de plusieurs attributs CollectionDataContractAttribute.
it: Il tipo '{0}' contiene più di un attributo CollectionDataContractAttribute.
ja: 型 '{0}' には、複数の CollectionDataContractAttribute 属性が含まれています。
ko: 형식 '{0}'에 둘 이상의 CollectionDataContractAttribute 특성이 있습니다.
pl: Typ „{0}” ma więcej niż jeden atrybut CollectionDataContractAttribute.
pt_br: O tipo '{0}' tem mais de um atributo CollectionDataContractAttribute.
ru: Тип "{0}" имеет несколько атрибутов CollectionDataContractAttribute.
tr: '{0}' türü birden çok CollectionDataContractAttribute özniteliğine sahip.
zh_hans: 类型“{0}”具有多个 CollectionDataContractAttribute 特性。
zh_hant: 類型 '{0}' 具有一個以上的 CollectionDataContractAttribute 屬性。

# TooManyDataContracts
source: Type '{0}' has more than one DataContractAttribute attribute.
cs: Typ {0} má více atributů DataContractAttribute.
de: Der Typ "{0}" enthält mehrere DataContractAttribute-Attribute.
es: El tipo "{0}" tiene más de un atributo DataContractAttribute.
fr: Le type '{0}' est doté de plusieurs attributs DataContractAttribute.
it: Il tipo '{0}' contiene più di un attributo DataContractAttribute.
ja: 型 '{0}' には、複数の DataContractAttribute 属性が含まれています。
ko: 형식 '{0}'에 둘 이상의 DataContractAttribute 특성이 있습니다.
pl: Typ „{0}” ma więcej niż jeden atrybut DataContractAttribute.
pt_br: O tipo '{0}' tem mais de um atributo DataContractAttribute.
ru: Тип "{0}" имеет несколько атрибутов DataContractAttribute.
tr: '{0}' türü birden çok DataContractAttribute özniteliğine sahip.
zh_hans: 类型“{0}”具有多个 DataContractAttribute 特性。
zh_hant: 類型 '{0}' 具有一個以上的 DataContractAttribute 屬性。

# TooManyDataMembers
source: Member '{0}.{1}' has more than one DataMemberAttribute attribute.
cs: Člen {0}.{1} má více atributů DataMemberAttribute.
de: Der Member "{0}.{1}" enthält mehrere DataMemberAttribute-Attribute.
es: El miembro "{0}.{1}" tiene más de un atributo DataMemberAttribute.
fr: Le membre '{0}.{1}' est doté de plusieurs attributs DataMemberAttribute.
it: Il membro '{0}.{1}' contiene più di un attributo DataMemberAttribute.
ja: メンバー '{0}.{1}' には、複数の DataMemberAttribute 属性が含まれています。
ko: 멤버 '{0}.{1}'에 둘 이상의 DataMemberAttribute 특성이 있습니다.
pl: Składowa „{0}.{1}” ma więcej niż jeden atrybut DataMemberAttribute.
pt_br: O membro '{0}.{1}' tem mais de um atributo DataMemberAttribute.
ru: Член "{0}.{1}" имеет несколько атрибутов DataMemberAttribute.
tr: '{0}.{1}' üyesi birden çok DataMemberAttribute özniteliğine sahip.
zh_hans: 成员“{0}.{1}”具有多个 DataMemberAttribute 特性。
zh_hant: 成員 '{0}.{1}' 具有一個以上的 DataMemberAttribute 屬性。

# TooManyEnumMembers
source: Member '{0}.{1}' has more than one EnumMemberAttribute attribute.
cs: Člen {0}.{1} má více atributů EnumMemberAttribute.
de: Der Member "{0}.{1}" enthält mehrere EnumMember-Attribute.
es: El miembro "{0}.{1}" tiene más de un atributo EnumMemberAttribute.
fr: Le membre '{0}.{1}' est doté de plusieurs attributs EnumMemberAttribute.
it: Il membro '{0}.{1}' contiene più di un attributo EnumMemberAttribute.
ja: メンバー '{0}.{1}' には、複数の EnumMemberAttribute 属性が含まれています。
ko: 멤버 '{0}.{1}'에 둘 이상의 EnumMemberAttribute 특성이 있습니다.
pl: Składowa „{0}.{1}” ma więcej niż jeden atrybut EnumMemberAttribute.
pt_br: O membro '{0}.{1}' tem mais de um atributo EnumMemberAttribute.
ru: Член "{0}.{1}" имеет несколько атрибутов EnumMemberAttribute.
tr: '{0}.{1}' üyesi birden çok EnumMemberAttribute özniteliğine sahip.
zh_hans: 成员“{0}.{1}”具有多个 EnumMemberAttribute 特性。
zh_hant: 成員 '{0}.{1}' 具有一個以上的 EnumMemberAttribute 屬性。

# TooManyIgnoreDataMemberAttributes
source: Member '{0}.{1}' has more than one IgnoreDataMemberAttribute attribute.
cs: Člen {0}.{1} má více atributů IgnoreDataMemberAttribute.
de: Der Member "{0}.{1}" enthält mehrere IgnoreDataMemberAttribute-Attribute.
es: El miembro "{0}.{1}" tiene más de un atributo IgnoreDataMemberAttribute.
fr: Le membre '{0}.{1}' a plusieurs attributs IgnoreDataMemberAttribute.
it: Il membro '{0}.{1}' contiene più di un attributo IgnoreDataMemberAttribute.
ja: メンバー '{0}.{1}' には、複数の IgnoreDataMemberAttribute 属性が含まれています。
ko: 멤버 '{0}.{1}'에 IgnoreDataMemberAttribute 특성이 두 개 이상 있습니다.
pl: Składowa „{0}.{1}” ma więcej niż jeden atrybut IgnoreDataMemberAttribute.
pt_br: O membro '{0}.{1}' tem mais de um atributo IgnoreDataMemberAttribute.
ru: Член "{0}.{1}" содержит более одного атрибута IgnoreDataMemberAttribute.
tr: '{0}.{1}' üyesi birden fazla IgnoreDataMemberAttribute özniteliğine sahip.
zh_hans: 成员“{0}.{1}”有多个 IgnoreDataMemberAttribute 特性。
zh_hant: 成員 '{0}.{1}' 具有一個以上的 IgnoreDataMemberAttribute 屬性。

# TopLevelElementRepresentsDifferentType
source: The global element found in the schema with same name references a different type '{0}' in namespace '{1}'. Data contract types must have the same name as their root element name. Consider removing the global element or changing its type.
cs: Globální element nalezený ve schématu se stejným názvem odkazuje na jiný typ {0} v oboru názvů {1}. Typy kontraktu dat musejí mít stejný název kořenového elementu. Zvažte možnost odebrat globální element nebo změnit jeho typ.
de: Das im Schema gefundene globale Element mit demselben Namen verweist auf einen anderen Typ "{0}" im Namespace "{1}". Datenvertragstypen muss derselbe Name als Stammelementname zugewiesen sein. Entfernen Sie ggf. das globale Element, oder ändern Sie den Typ des Elements.
es: El elemento global encontrado en el esquema con el mismo nombre hace referencia a un tipo distinto, "{0}", en el espacio de nombres "{1}". Los tipos de contrato de datos deben tener el mismo nombre que su elemento raíz. Pruebe a quitar el elemento global o a cambiar su tipo.
fr: L'élément global trouvé dans le schéma du même nom référence un type '{0}' différent dans l'espace de noms '{1}'. Les types de contrat de données doivent porter le même nom que leurs noms d'éléments racine. Supprimez l'élément global ou changez son type.
it: L'elemento globale trovato nello schema con lo stesso nome fa riferimento a un tipo diverso '{0}' nello spazio dei nomi '{1}'. Il nome dei tipi di contratto di dati deve essere uguale a quello del relativo elemento radice. Provare a rimuovere l'elemento globale o a modificarne il tipo.
ja: 同じ名前のスキーマで見つかったグローバル要素は、名前空間 '{1}' の異なる型 '{0}' を参照しています。データ コントラクト型の名前は、そのルート要素名と同じである必要があります。このグローバル要素を削除するか、その型を変更してください。
ko: 같은 이름의 스키마에서 찾은 전역 요소가 네임스페이스 '{1}'의 다른 형식 '{0}'을(를) 참조합니다. 데이터 계약 형식은 루트 요소 이름과 동일한 이름을 가져야 합니다. 전역 요소를 제거하거나 해당 형식을 변경해 보세요.
pl: Znaleziony element globalny w schemacie o tej samej nazwie odwołuje się do innego typu „{0}” w przestrzeni nazw „{1}”. Typy kontraktu danych muszą mieć taką samą nazwę jak nazwa ich elementu głównego. Rozważ usunięcie elementu globalnego lub zmianę jego typu.
pt_br: O elemento global encontrado no esquema com o mesmo nome referencia um tipo diferente '{0}' no namespace '{1}'. Os tipos de contrato de dados devem ter o nome igual ao nome de seus elementos raiz. Considere remover o elemento global ou alterar seu tipo.
ru: Глобальный элемент, найденный в схеме с тем же именем, ссылается на другой тип "{0}" в пространстве имен "{1}". Имена типов контракта данных должны совпадать с именами их корневых элементов. Удалите глобальный элемент или измените его тип.
tr: Aynı adla şemada bulunan genel öğe, '{1}' ad alanında '{0}' farklı türüne başvuru yapıyor. Veri anlaşması türleri, kök öğelerinin adları olarak aynı adı kullanmalıdır. Genel öğeyi kaldırmayı ya da türünü değiştirmeyi deneyin.
zh_hans: 相同名称的架构中找到的全局元素在命名空间“{1}”中引用了不同类型“{0}”。数据协定类型必须与其根元素名称相同。可以考虑删除全局元素或更改其类型。
zh_hant: 結構描述中找到的同名全域元素，參考了命名空間 '{1}' 中的其他類型 '{0}'。資料合約類型必須與其根項目同名。請考慮移除全域元素或變更其類型。

# TraceCodeXsdImportAnnotationFailed
source: Failed to import annotation during XSD import.
cs: Import komentáře při importu XSD se nezdařil.
de: Fehler beim Importieren der Anmerkung während des XSD-Imports.
es: No se pudo importar la anotación durante la importación XSD.
fr: Impossible d'importer l'annotation au moment de l'importation XSD.
it: Non è stato possibile importare l'annotazione durante l'importazione di XSD.
ja: XSD のインポート時に注釈をインポートできませんでした。
ko: XSD 가져오기 도중에 주석을 가져오지 못했습니다.
pl: Nie można zaimportować adnotacji podczas importowania pliku XSD.
pt_br: Falha ao importar anotação durante importação de XSD.
ru: Не удалось импортировать пометку во время импорта XSD.
tr: XSD içeri aktarması sırasında ek açıklama içeri aktarma işlemi başarısız oldu.
zh_hans: XSD 导入期间，未能导入注释。
zh_hant: XSD 匯入期間無法匯入註釋。

# TraceCodeXsdImportBegin
source: Starting schema import
cs: Zahajuje se import schématu.
de: Schemaimport wird gestartet.
es: Se está iniciando la importación del esquema
fr: Début de l'importation de schéma
it: Avvio dell'importazione dello schema
ja: スキーマのインポートを開始します
ko: 스키마 가져오기 시작 중
pl: Uruchamianie importu schematu
pt_br: Iniciando a importação de esquema
ru: Запускается импорт схемы.
tr: Şema içeri aktarma işlemi başlatılıyor
zh_hans: 开始架构导入
zh_hant: 即將開始匯入結構描述

# TraceCodeXsdImportEnd
source: Finished schema import
cs: Import schématu se dokončil.
de: Schemaimport beendet
es: Finalizó la importación del esquema
fr: Fin de l'importation de schéma
it: Importazione dello schema completata
ja: スキーマのインポートが完了しました
ko: 스키마 가져오기 완료
pl: Zakończono import schematu
pt_br: Importação de esquema concluída
ru: Импорт схемы завершен.
tr: Şema içeri aktarma işlemi tamamlandı
zh_hans: 结束的架构导入
zh_hant: 匯入結構描述已完成

# TraceCodeXsdImportError
source: Error on schema import
cs: Při importu schématu došlo k chybě.
de: Fehler beim Schemaimport
es: Error al importar el esquema
fr: Erreur survenue durant l'importation du schéma
it: Errore durante l'importazione dello schema
ja: スキーマのインポート エラーが発生しました
ko: 스키마 가져오기 오류
pl: Błąd podczas importowania schematu
pt_br: Erro na importação de esquema
ru: Ошибка импорта схемы
tr: Şema içeri aktarma hatası
zh_hans: 导入架构时出错
zh_hant: 匯入結構描述時發生錯誤

# TypeCannotBeImported
source: Type '{0}' in namespace '{1}' cannot be imported. {2}
cs: Typ {0} v oboru názvů {1} nelze importovat. {2}
de: Der Typ "{0}" im Namespace "{1}" kann nicht importiert werden. {2}
es: No se puede importar el tipo "{0}" en el espacio de nombres "{1}". {2}
fr: Impossible d'importer le type '{0}' dans l'espace de noms '{1}'. {2}
it: Non è possibile importare il tipo '{0}' nello spazio dei nomi '{1}'. {2}
ja: 名前空間 '{1}' の型 '{0}' をインポートできません。{2}
ko: 네임스페이스 '{1}'의 '{0}' 형식을 가져올 수 없습니다. {2}
pl: Nie można zaimportować typu „{0}” w przestrzeni nazw „{1}”. {2}
pt_br: O tipo '{0}' no namespace '{1}' não pode ser importado. {2}
ru: Не удается импортировать тип "{0}" в пространстве имен "{1}". {2}
tr: '{1}' ad alanındaki '{0}' türü içeri aktarılamıyor. {2}
zh_hans: 无法导入命名空间“{1}”中的类型“{0}”。{2}
zh_hant: 無法匯入命名空間 '{1}' 中的類型 '{0}'。 {2}

# TypeCannotBeImportedHowToFix
source: {0} Either change the schema so that the types can map to data contract types or use ImportXmlType or use a different serializer.
cs: {0} Změňte schéma, aby typy mohly namapovat typy kontraktů dat, nebo použijte typ ImportXmlType, případně použijte jiný serializátor.
de: {0}. Ändern Sie das Schema, sodass die Typen Datenvertragstypen zugeordnet werden können, oder verwenden Sie ImportXmlType oder ein anderes Serialisierungsmodul.
es: {0} Cambie el esquema para que los tipos puedan asignarse a tipos de contrato de datos o use ImportXmlType u otro serializador.
fr: {0} Changez le schéma pour que les types puissent être mappés aux types de contrat de données ou utilisez ImportXmlType ; vous pouvez aussi utiliser un autre sérialiseur.
it: {0} Modificare lo schema in modo da consentire il mapping dei tipi ai tipi di contratto di dati, usare ImportXmlType oppure usare un serializzatore diverso.
ja: {0}。スキーマを変更してこれらの型をデータ コントラクト型に割り当て可能にするか、ImportXmlType を使用するか、別のシリアライザーを使用してください。
ko: {0} 형식이 데이터 계약 형식에 매핑될 수 있도록 스키마를 변경하거나 ImportXmlType 또는 다른 직렬 변환기를 사용하세요.
pl: {0} Zmień schemat, tak aby typy mogły zostać zamapowane na typy kontraktu danych, użyj typu ImportXmlType lub użyj innego serializatora.
pt_br: {0} Altere o esquema para que os tipos possam ser mapeados para tipos de contrato de dados, use ImportXmlType ou use um serializador diferente.
ru: {0} Исправьте схему так, чтобы типы могли сопоставляться с типами контрактов данных, либо используйте ImportXmlType или другой сериализатор.
tr: {0} Türlerin veri anlaşması türleriyle eşlenmesini sağlayacak biçimde şemayı değiştirin ya da ImportXmlType kullanın veya farklı bir serileştirici kullanın.
zh_hans: {0} 更改架构使类型能够映射到数据协定类型，或使用 ImportXmlType 或使用其他序列化程序。
zh_hant: {0} 可變更結構描述以讓該類型可對應到資料合約類型，或使用 ImportXmlType 或是使用其他序列化程式。
