Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlMaxNameTableCharCountExceeded
source: The maximum nametable character count quota ({0}) has been exceeded while reading XML data. The nametable is a data structure used to store strings encountered during XML processing - long XML documents with non-repeating element names, attribute names and attribute values may trigger this quota. This quota may be increased by changing the MaxNameTableCharCount property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Při čtení dat XML byla překročena kvóta maximálního počtu znaků tabulky názvů ({0}). Tabulka názvů je datová struktura používaná k uložení řetězců nalezených při zpracování dokumentů XML – tuto kvótu mohou aktivovat dlouhé dokumenty XML s neopakujícími se názvy elementů, názvy atributů a hodnotami atributů. Tuto kvótu lze zvýšit změnou vlastnosti MaxNameTableCharCount u objektu XmlDictionaryReaderQuotas, který je používán při vytváření čtecí funkce XML.
de: Das Kontingent für die maximale Anzahl von Nametable-Zeichen ({0}) wurde beim Lesen von XML-Daten überschritten. Die Nametable ist eine Datenstruktur, in der bei der XML-Verarbeitung gefundene Zeichenfolgen gespeichert werden. Lange XML-Dokumente mit sich nicht wiederholenden Elementnamen, Attributnamen und Attributwerten können zum Überschreiten dieses Kontingents führen. Dieses Kontingent kann durch Ändern der MaxNameTableCharCount-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la cuota máxima de caracteres de tabla de nombres ({0}) al leer los datos XML. La tabla de nombres es una estructura de datos que se emplea para almacenar las cadenas encontradas durante el procesamiento XML. Los documentos XML largos con valores de atributo, nombres de atributo y nombres de elemento no repetidos pueden hacer que se sobrepase la cuota. Esta cuota puede aumentarse cambiando la propiedad MaxNameTableCharCount en el objeto XmlDictionaryReaderQuotas usado al crear el lector XML.
fr: Dépassement du quota maximal pour le nombre de caractères nametable ({0}) durant la lecture de données XML. La structure de données nametable est utilisée pour stocker les chaînes rencontrées durant le traitement XML ; des documents XML longs comportant des noms d'éléments non répétés, des noms d'attributs et des valeurs d'attributs peuvent déclencher ce quota. Le quota peut être augmenté en changeant la propriété MaxNameTableCharCount sur l'objet XmlDictionaryReaderQuotas utilisé durant la création du lecteur XML.
it: Durante la lettura dei dati XML è stata superata la quota per il numero massimo di caratteri della tabella dei nomi ({0}). La tabella dei nomi è una struttura dei dati usata per memorizzare le stringhe trovate durante l'elaborazione dei dati XML. Il superamento della quota può essere causato da documenti XML lunghi con nomi di elemento, nomi di attributo e valori di attributo non ripetuti. Per incrementare questa quota, modificare la proprietà MaxNameTableCharCount dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: XML データの読み取り中に、最大 nametable 文字数のクォータ ({0}) を超えました。nametable は、XML 処理時に検出された文字列を格納するためのデータ構造です。反復されない要素名、属性名、および属性値が含まれた長い XML ドキュメントによってこのクォータがトリガーされることがあります。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxNameTableCharCount プロパティを変更してください。
ko: XML 데이터를 읽는 동안 최대 nametable 문자 수 할당량({0})을 초과했습니다. nametable은 XML 처리 도중에 발견된 문자열을 저장하는 데 사용되는 데이터 구조입니다. 반복되지 않는 요소 이름, 특성 이름 및 특성 값을 가지는 긴 XML 문서로 인해 이 할당량이 트리거될 수 있습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxNameTableCharCount 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytywania danych XML został przekroczony maksymalny przydział liczby znaków dla tabeli nazw ({0}). Tabela nazw jest strukturą danych używaną do przechowywania ciągów napotkanych podczas przetwarzania XML — długie dokumenty XML z niepowtarzającymi się nazwami elementów, nazwami atrybutów i wartościami atrybutów mogą spowodować przekroczenie tego przydziału. Przydział można zwiększyć, zmieniając właściwość MaxNameTableCharCount obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A cota máxima de contagem de caracteres nametable ({0}) foi excedida na leitura de dados XML. Nametable é uma estrutura de dados usada para armazenar cadeias de caracteres encontradas durante o processamento do XML – documentos XML longos com nomes de elementos, nomes de atributos e valores de atributos não repetidos podem disparar essa cota. Essa cota pode ser aumentada com a alteração da propriedade MaxNameTableCharCount no objeto XmlDictionaryReaderQuotas usado na criação do leitor XML.
ru: Превышена квота максимального количества символов в таблице имен ({0}) при чтении данных XML. Таблица имен является структурой данных, в которой хранятся строки, обнаруженные при обработке данных XML. Триггером этой квоты могут служить длинные XML-документы с неповторяющимися именами элементов, именами атрибутов и значениями атрибутов. Эту квоту можно увеличить, изменив свойство MaxNameTableCharCount объекта XmlDictionaryReaderQuotas, используемого при создании модуля чтения XML.
tr: XML verileri okunurken, ad tablosu karakter sayısı üst sınırı ({0}) aşıldı. Ad tablosu, XML işlenirken karşılaşılan dizeleri depolamak için kullanılan bir veri yapısıdır (yinelenmeyen öğe adlarına sahip uzun XML belgeleri, öznitelik adları ve öznitelik değerleri bu kotayı tetikleyebilir). Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxNameTableCharCount özelliği değiştirilerek artırılabilir.
zh_hans: 读取 XML 数据时超过了最大名称表字符计数配额({0})。名称表是用于存储处理 XML 时所遇字符串的数据结构 - 具有非重复元素名称、特性名称和特性值的长 XML 文档可能会触发此配额。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxNameTableCharCount 属性，可增加此配额。
zh_hant: 讀取 XML 資料時已經超過最大名稱資料表字元計數配額 ({0})。名稱資料表是一種資料結構，用來儲存在 XML 處理過程中所遇到的字串 - 具有不重複的元素名稱、屬性名稱及屬性值的冗長 XML 文件可能會觸發此配額限制。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxNameTableCharCount 屬性，便可以增加此配額。

# XmlMaxStringContentLengthExceeded
source: The maximum string content length quota ({0}) has been exceeded while reading XML data. This quota may be increased by changing the MaxStringContentLength property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Při čtení dat XML byla překročena kvóta maximální délky obsahu řetězce ({0}). Tuto kvótu lze zvýšit změnou vlastnosti MaxStringContentLength u objektu XmlDictionaryReaderQuotas, který se používá při vytváření čtecí funkce XML.
de: Das Kontingent für die maximale Länge von Zeichenfolgeninhalt ({0}) wurde beim Lesen von XML-Daten überschritten. Dieses Kontingent kann durch Ändern der MaxStringContentLength-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la cuota de longitud del contenido de cadena ({0}) al leer los datos XML. Esta cuota se puede aumentar cambiando la propiedad MaxStringContentLength en el objeto XmlDictionaryReaderQuotas que se usa para crear el lector XML.
fr: Dépassement du quota maximal pour la longueur du contenu de chaîne ({0}) durant la lecture de données XML. Vous pouvez augmenter ce quota en changeant la propriété MaxStringContentLength sur l'objet XmlDictionaryReaderQuotas utilisé pendant la création du lecteur XML.
it: Durante la lettura dei dati XML è stata superata la quota per la lunghezza massima delle stringhe ({0}). Per incrementare questa quota, modificare la proprietà MaxStringContentLength dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: XML データの読み取り中に、最大文字列コンテンツ長のクォータ ({0}) を超えました。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxStringContentLength プロパティを変更してください。
ko: XML 데이터를 읽는 동안 최대 문자열 콘텐츠 길이 할당량({0})을 초과했습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxStringContentLength 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytywania danych XML został przekroczony maksymalny przydział długości zawartości ciągu ({0}). Wartość tę można zwiększyć, zmieniając właściwość MaxStringContentLength obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A cota máxima do comprimento do conteúdo da cadeia de caracteres ({0}) foi excedida durante a leitura dos dados XML. Essa cota pode ser aumentada com a alteração da propriedade MaxStringContentLength no objeto XmlDictionaryReaderQuotas usado na criação do leitor de XML.
ru: Превышена квота максимальной длины строки ({0}) при чтении данных XML. Эту квоту можно увеличить, изменив свойство MaxStringContentLength объекта XmlDictionaryReaderQuotas, используемого при создании модуля чтения XML.
tr: XML verileri okunurken, dize içerik uzunluğu kotası üst sınırı ({0}) aşıldı. Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxStringContentLength özelliği değiştirilerek artırılabilir.
zh_hans: 读取 XML 数据时超过了最大字符串内容长度配额({0})。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxStringContentLength 属性，可增加此配额。
zh_hant: 讀取 XML 資料時已經超過最大字串內容長度配額 ({0})。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxStringContentLength 屬性，便可以增加此配額。

# XmlMethodNotSupported
source: This XmlWriter implementation does not support the '{0}' method.
cs: Tato implementace XmlWriter nepodporuje metodu {0}.
de: Diese XmlWriter-Implementierung unterstützt die Methode "{0}" nicht.
es: Esta implementación de XmlWriter no admite el método "{0}".
fr: Cette implémentation XmlWriter ne prend pas en charge la méthode '{0}'.
it: Questa implementazione di XmlWriter non supporta il metodo '{0}'.
ja: この XmlWriter 実装は、'{0}' メソッドをサポートしていません。
ko: 이 XmlWriter 구현에서 '{0}' 메서드를 지원하지 않습니다.
pl: Ta implementacja elementu XmlWriter nie obsługuje metody „{0}”.
pt_br: A implementação XmlWriter não dá suporte ao método '{0}'.
ru: Эта реализация XmlWriter не поддерживает метод "{0}".
tr: Bu XmlWriter uygulaması '{0}' metodunu desteklemiyor.
zh_hans: 此 XmlWriter 实现不支持“{0}”方法。
zh_hant: 此 XmlWriter 實作不支援 '{0}' 方法。

# XmlMissingLowSurrogate
source: The surrogate pair is invalid. Missing a low surrogate character.
cs: Náhradní pár je neplatný. Chybí znak z nízkého rozsahu náhradního páru.
de: Das Ersatzzeichenpaar ist ungültig. Es fehlt ein niedriges Ersatzzeichen.
es: El par suplente no es válido. Falta un carácter suplente bajo.
fr: La paire de substitution est non valide. Il manque un caractère de substitution faible.
it: La coppia di surrogati non è valida. Manca un carattere surrogato basso.
ja: サロゲート ペアが無効です。下位サロゲート文字がありません。
ko: 서로게이트 쌍이 잘못되었습니다. 하위 서로게이트 문자가 없습니다.
pl: Para zastępcza jest nieprawidłowa. Brak znaku zastępczego niskiego poziomu.
pt_br: O par alternativo é inválido. Um caractere alternativo baixo está ausente.
ru: Недопустимая суррогатная пара. Пропущен младший символ-заместитель.
tr: Yedek çift geçersiz. Alt yedek karakter eksik.
zh_hans: 代理项对无效。缺少低代理项字符。
zh_hant: 代理字組無效。遺漏低代理字元。

# XmlMultipleRootElements
source: There are multiple root elements.
cs: Existuje několik kořenových elementů.
de: Es sind mehrere Stammelemente vorhanden.
es: Hay varios elementos raíz.
fr: Il existe plusieurs éléments racines.
it: Sono presenti più elementi radice.
ja: ルート要素が複数あります。
ko: 루트 요소가 여러 개 있습니다.
pl: Istnieje wiele elementów głównych.
pt_br: Há vários elementos raiz.
ru: Имеется несколько корневых элементов.
tr: Birden çok kök öğesi var.
zh_hans: 有多个根元素。
zh_hant: 有多個根項目。

# XmlNamespaceNotFound
source: The namespace '{0}' is not defined.
cs: Není definovaný obor názvů {0}.
de: Der Namespace "{0}" ist nicht definiert.
es: El espacio de nombres "{0}" no está definido.
fr: L'espace de noms '{0}' n'est pas défini.
it: Lo spazio dei nomi '{0}' non è definito.
ja: 名前空間 '{0}' が定義されていません。
ko: '{0}' 네임스페이스가 정의되지 않았습니다.
pl: Nie zdefiniowano przestrzeni nazw „{0}”.
pt_br: O namespace '{0}' não está definido.
ru: Пространство имен "{0}" не определено.
tr: '{0}' ad alanı tanımlı değil.
zh_hans: 未定义命名空间“{0}”。
zh_hant: 未定義命名空間 '{0}'。

# XmlNestedArraysNotSupported
source: Nested arrays are not supported.
cs: Vnořená pole nejsou podporována.
de: Geschachtelte Arrays werden nicht unterstützt.
es: No se admiten las matrices anidadas.
fr: Les tableaux imbriqués ne sont pas pris en charge.
it: Le matrici annidate non sono supportate.
ja: 入れ子にされた配列はサポートされていません。
ko: 중첩 배열이 지원되지 않습니다.
pl: Tablice zagnieżdżone są nieobsługiwane.
pt_br: Não há suporte para matrizes aninhadas.
ru: Вложенные массивы не поддерживаются.
tr: İç içe geçen diziler desteklenmez.
zh_hans: 不支持嵌套的数组。
zh_hant: 不支援巢狀陣列。

# XmlNoRootElement
source: The document does not have a root element.
cs: Dokument nemá kořenový element.
de: Das Dokument hat kein Stammelement.
es: El documento no tiene un elemento raíz.
fr: Le document n'a pas d'élément racine.
it: Il documento non contiene un elemento radice.
ja: ドキュメントにルート要素がありません。
ko: 문서에 루트 요소가 없습니다.
pl: Dokument nie ma elementu głównego.
pt_br: O documento não tem nenhum elemento raiz.
ru: Документ не содержит корневого элемента.
tr: Belgenin kök öğesi yok.
zh_hans: 文档没有根元素。
zh_hant: 文件沒有根項目。

# XmlObjectAssignedToIncompatibleInterface
source: '{0}' is an XML type and cannot be serialized when assigned to an interface type that does not implement IXmlSerializable ('{1}'.)
cs: {0} je typ XML a není možné ho serializovat, pokud je přiřazený k typu rozhraní bez implementace rozhraní IXmlSerializable ({1}).
de: "{0}" ist ein XML-Typ und kann nicht serialisiert werden, wenn er einem Schnittstellentyp zugewiesen ist, der IXmlSerializable nicht implementiert ("{1}").
es: "{0}" es un tipo XML y no se puede serializar cuando se asigna a un tipo de interfaz que no implementa IXmlSerializable ("{1}").
fr: '{0}' est un type XML. Il ne peut pas être sérialisé quand il est assigné à un type d'interface qui n'implémente pas IXmlSerializable ('{1}'.)
it: '{0}' è un tipo XML e non può essere serializzato quando è assegnato a un tipo di interfaccia che non implementa IXmlSerializable ('{1}'.)
ja: '{0}' は XML 型であり、IXmlSerializable ('{1}') を実装していないインターフェイス型に割り当てられているときはシリアル化できません。
ko: '{0}'은(는) XML 형식이며, IXmlSerializable('{1}')을 구현하지 않는 인터페이스 형식에 할당된 경우 직렬화할 수 없습니다.
pl: „{0}” jest typem XML i nie można go serializować, gdy jest przypisany do typu interfejsu, który nie implementuje interfejsu IXmlSerializable („{1}”).
pt_br: '{0}' é um tipo XML e não pode ser serializado quando atribuído a um tipo de interface que não implementa IXmlSerializable ('{1}').
ru: "{0}" является типом XML и не может быть сериализован при назначении типу интерфейса, который не реализует интерфейс IXmlSerializable ("{1}").
tr: '{0}' bir XML türüdür ve IXmlSerializable ('{1}') uygulamayan bir arabirim türüne atandığında serileştirilemez.
zh_hans: “{0}”是一个 XML 类型，当分配到没有实现 IXmlSerializable (“{1}”)的接口类型时不能对其序列化。
zh_hant: '{0}' 是 XML 類型，無法在指派到未實作 IXmlSerializable ('{1}') 的介面類型時進行序列化。

# XmlOnlyOneRoot
source: Only one root element is permitted per document.
cs: V jednom dokumentu je povolen pouze jeden kořenový element.
de: Pro Dokument ist jeweils nur ein Stammelement zulässig.
es: Solo se permite un elemento raíz por documento.
fr: Un seul élément racine est autorisé par document.
it: È consentito un solo elemento radice per documento.
ja: ドキュメントあたり 1 つのルート要素のみが許可されます。
ko: 문서당 하나의 루트 요소만 허용됩니다.
pl: Tylko jeden element główny jest dozwolony dla dokumentu.
pt_br: Só é permitido um elemento raiz por documento.
ru: В каждом документе разрешается не более одного корневого элемента.
tr: Belge başına yalnızca bir kök öğeye izin verilir.
zh_hans: 每个文档仅允许具有一个根元素。
zh_hant: 每個文件只允許有一個根項目。

# XmlOnlySingleValue
source: Only a single typed value may be written inside an attribute or content.
cs: V atributu nebo obsahu může být zapsána pouze jedna zadaná hodnota.
de: Innerhalb eines Attributs oder Inhalts kann nur ein typisierter Wert geschrieben werden.
es: Solo se puede escribir un valor dentro de un atributo o un contenido.
fr: Une seule valeur de type simple peut être écrite dans un attribut ou un contenu.
it: In un attributo o un contenuto è possibile scrivere solo un valore di tipo singolo.
ja: single 型の値のみを、属性またはコンテンツ内に書き込むことができます。
ko: 단일 형식 값만 특성 또는 콘텐츠 내에 쓸 수 있습니다.
pl: Tylko pojedyncza wartość może być zapisana wewnątrz atrybutu lub zawartości.
pt_br: Apenas um único valor tipado pode ser gravado dentro de um atributo ou conteúdo.
ru: В атрибут или содержимое можно записывать только одно отдельное типизированное значение.
tr: Bir özniteliğin ya da içeriğin içine yalnızca bir tek belirtilen değer yazılabilir.
zh_hans: 只有单类型值才可写入到特性或内容中。
zh_hant: 只會將單一個輸入值寫入屬性或內容。

# XmlOnlyWhitespace
source: Only white space characters can be written with this method.
cs: S touto metodou lze zapsat jen mezery.
de: Mit dieser Methode können nur Leerraumzeichen geschrieben werden.
es: Con este método, solo se pueden escribir caracteres de espacios en blanco.
fr: Seuls les caractères relatifs aux espaces blancs peuvent être écrits via cette méthode.
it: Con questo metodo è possibile scrivere solo spazi vuoti.
ja: このメソッドでは、空白文字のみを書き込むことができます。
ko: 공백 문자만 이 메서드에서 쓸 수 있습니다.
pl: Za pomocą tej metody można zapisywać tylko białe znaki.
pt_br: Apenas caracteres de espaço em branco podem ser gravados com este método.
ru: C помощью этого метода можно записать только пробелы.
tr: Bu metotla yalnızca boşluk karakterleri yazılabilir.
zh_hans: 使用此方法仅可写入空格字符。
zh_hant: 使用此方法只可寫入空白字元。

# XmlPrefixBoundToNamespace
source: The prefix '{0}' is bound to the namespace '{1}' and cannot be changed to '{2}'.
cs: Předpona {0} je vázána na obor názvů {1} a nelze ji změnit na {2}.
de: Das Präfix "{0}" ist an den Namespace "{1}" gebunden und kann nicht in "{2}" geändert werden.
es: El prefijo "{0}" está enlazado al espacio de nombres "{1}" y no se puede cambiar a "{2}".
fr: Le préfixe '{0}' est lié à l'espace de noms '{1}', et il est impossible de le changer en '{2}'.
it: Il prefisso '{0}' è associato allo spazio dei nomi '{1}' e non può essere modificato in '{2}'.
ja: プレフィックス '{0}' は名前空間 '{1}' にバインドされており、'{2}' に変更することはできません。
ko: '{0}' 접두사가 네임스페이스 '{1}'에 바인딩되며 '{2}'(으)로 변경할 수 없습니다.
pl: Prefiks „{0}” jest powiązany z przestrzenią nazw „{1}” i nie może być zmieniony na „{2}”.
pt_br: O prefixo '{0}' está associado ao namespace '{1}' e não pode ser alterado para '{2}'.
ru: Префикс "{0}" привязан к пространству имен "{1}" и не может быть изменен на "{2}".
tr: '{0}' öneki, '{1}' ad alanına bağlıdır ve '{2}' olarak değiştirilemez.
zh_hans: 前缀“{0}”已绑定到命名空间“{1}”，无法将其更改为“{2}”。
zh_hant: 前置詞 '{0}' 已繫結至命名空間 '{1}'，因而無法變更成 '{2}'。

# XmlProcessingInstructionNotSupported
source: Processing instructions (other than the XML declaration) and DTDs are not supported.
cs: Pokyny pro zpracování (jiné než deklarace XML) a DTD nejsou podporovány.
de: Verarbeitungsanweisungen (mit Ausnahme der XML-Deklaration) und DTDs werden nicht unterstützt.
es: No se admiten las definiciones de tipo de documento (DTD) ni las instrucciones de procesamiento (excepto la declaración XML).
fr: Les instructions de traitement (différentes de la déclaration XML) et les DTD ne sont pas pris en charge.
it: Non sono supportati DTD e istruzioni di elaborazione diverse dalla dichiarazione XML.
ja: 処理命令 (XML 宣言以外) および DTD はサポートされていません。
ko: XML 선언 이외의 처리 명령과 DTD는 지원되지 않습니다.
pl: Przetwarzanie instrukcji (innych niż deklaracja XML) i elementów DTD nie jest obsługiwane.
pt_br: Não há suporte para instruções de processamento (que não sejam declaração XML) e DTDs.
ru: Инструкции обработки (отличные от XML-объявления) и шаблоны DTD не поддерживаются.
tr: İşleme yönergeleri (XML bildirimi dışındakiler) ve DTD değerleri desteklenmez.
zh_hans: 不支持处理指令(XML 声明 除外)和 DTD。
zh_hant: 不支援處理指示 (非 XML 宣告) 及 DTD。

# XmlReservedPrefix
source: Prefixes beginning with "xml" (regardless of casing) are reserved for use by XML.
cs: Předpony začínající řetězcem xml (bez ohledu na velikost písmen) jsou vyhrazeny pro jazyk XML.
de: Präfixe, die mit "xml" beginnen, sind für die Verwendung durch XML reserviert. Dies gilt unabhängig von ihrer Schreibweise.
es: Los prefijos que empiezan por "xml" (tanto en mayúsculas como en minúsculas) están reservados para su uso en XML.
fr: Des préfixes commençant par "xml" (sans tenir compte de la casse) sont réservés à une utilisation XML.
it: I prefissi che iniziano per "xml", indipendentemente dalla combinazione di maiuscole e minuscole usata, sono riservati al codice XML.
ja: "xml" (場合によらず) で始まるプレフィックスは、XML 用に予約されています。
ko: 대/소문자에 상관없이 "xml"로 시작하는 접두사는 XML에 사용하도록 예약되어 있습니다.
pl: Prefiksy zaczynające się od elementu „xml” (bez względu na wielkość liter) są zarezerwowane do użycia w języku XML.
pt_br: Os prefixos iniciando com "xml" (independente de serem maiúsculos ou minúsculos) são reservados para uso pelo XML.
ru: Префиксы, начинающиеся с xml (независимо от регистра), зарезервированы для использования конструкциями XML.
tr: "Xml" (büyük/küçük harften bağımsız olarak) ile başlayan önekler, XML tarafından kullanılmak üzere ayrılmıştır.
zh_hans: 保留以 "xml" 开头的前缀(不考虑大小写)以供 XML 使用。
zh_hant: 開頭為 "xml" (不區分大小寫) 的前置詞已保留供 XML 使用。

# XmlSpaceBetweenAttributes
source: Whitespace must appear between attributes.
cs: Mezi atributy musí být mezera.
de: Zwischen Attributen müssen Leerzeichen stehen.
es: El espacio en blanco debe aparecer entre atributos.
fr: Il doit y avoir un espace entre les attributs.
it: Gli attributi devono essere separati da spazi vuoti.
ja: 属性間にはスペースが存在する必要があります。
ko: 특성 사이에 공백이 있어야 합니다.
pl: Między atrybutami muszą występować białe znaki.
pt_br: Espaços em branco devem aparecer entre os atributos.
ru: Атрибуты должны быть разделены пробелом.
tr: Öznitelikler arasında boşluk bulunmalıdır.
zh_hans: 特性之间必须有空格。
zh_hant: 屬性與屬性之間必須有空格。

# XmlSpecificBindingNamespace
source: The namespace '{1}' can only be bound to the prefix '{0}'.
cs: Obor názvů {1} lze vázat jen na předponu {0}.
de: Der Namespace "{1}" kann nur an das Präfix "{0}" gebunden werden.
es: El espacio de nombres "{1}" solo puede estar enlazado al prefijo "{0}".
fr: Seul l'espace de noms '{1}' peut être lié au préfixe '{0}'.
it: Lo spazio dei nomi '{1}' può essere associato solo al prefisso '{0}'.
ja: 名前空間 '{1}' は、プレフィックス '{0}' にのみバインドできます。
ko: '{1}' 네임스페이스는 접두사 '{0}'에만 바인딩될 수 있습니다.
pl: Przestrzeń nazw „{1}” może być powiązana tylko z prefiksem „{0}”.
pt_br: O namespace '{1}' só pode ser associado ao prefixo '{0}'.
ru: Пространство имен "{1}" может быть связано только с префиксом "{0}".
tr: '{1}' ad alanı yalnızca '{0}' önekine bağlanabilir.
zh_hans: 命名空间“{1}”只能绑定到前缀“{0}”。
zh_hant: 命名空間 '{1}' 只能繫結至前置詞 '{0}'。

# XmlSpecificBindingPrefix
source: The prefix '{0}' can only be bound to the namespace '{1}'.
cs: Předponu {0} lze vázat jen na obor názvů {1}.
de: Das Präfix "{0}" kann nur an den Namespace "{1}" gebunden werden.
es: El prefijo "{0}" solo puede estar enlazado al espacio de nombres "{1}".
fr: Seul le préfixe '{0}' peut être lié à l'espace de noms '{1}'.
it: Il prefisso '{0}' può essere associato solo allo spazio dei nomi '{1}'.
ja: プレフィックス '{0}' は、名前空間 '{1}' にのみバインドできます。
ko: '{0}' 접두사는 네임스페이스 '{1}'에만 바인딩될 수 있습니다.
pl: Prefiks „{0}” może być powiązany tylko z przestrzenią nazw „{1}”.
pt_br: O prefixo '{0}' só pode ser associado ao namespace '{1}'.
ru: Префикс "{0}" может быть связан только с пространством имен "{1}".
tr: '{0}' öneki yalnızca '{1}' ad alanına bağlanabilir.
zh_hans: 前缀“{0}”只能绑定到命名空间“{1}”。
zh_hant: 前置詞 '{0}' 只能繫結至命名空間 '{1}'。
