Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# KnownTypeAttributeUnknownMethod
source: KnownTypeAttribute attribute on type '{1}' specifies a method named '{0}' to provide known types. Static method '{0}()' was not found on this type. Ensure that the method exists and is marked as static.
cs: Atribut KnownTypeAttribute u typu {1} určuje metodu s názvem {0} k poskytnutí známých typů. U tohoto typu nebyla nalezena statická metoda {0}(). Zkontrolujte, zda metoda existuje a zda je označena jako statická.
de: Das Attribut KnownTypeAttribute für den Typ "{1}" definiert eine Methode namens "{0}", um bekannte Typen bereitzustellen. Die statische {0}()-Methode wurde in diesem Typ nicht gefunden. Vergewissern Sie sich, dass die Methode vorhanden und als statisch markiert ist.
es: El atributo KnownTypeAttribute del tipo "{1}" especifica un método denominado "{0}" para proporcionar tipos conocidos. El método estático "{0}()" no se encontró en este tipo. Asegúrese de que el método existe y está marcado como estático.
fr: L'attribut KnownTypeAttribute sur le type '{1}' spécifie une méthode nommée '{0}' pour fournir des types connus. La méthode statique '{0}()' est introuvable sur ce type. Vérifiez que la méthode existe et qu'elle est marquée comme statique.
it: L'attributo KnownTypeAttribute nel tipo '{1}' specifica un metodo denominato '{0}' per fornire tipi noti. Il metodo statico '{0}()' non è stato trovato in questo tipo. Assicurarsi che il metodo esista e che sia contrassegnato come statico.
ja: 型 '{1}' の KnownTypeAttribute 属性では、既知の型を提供する '{0}' という名前のメソッドが指定されています。この型で静的メソッド '{0}()' が見つかりませんでした。このメソッドが存在しており、静的として設定されていることを確認してください。
ko: 형식 '{1}'의 KnownTypeAttribute 특성이 알려진 형식을 제공하기 위해 '{0}'(이)라는 메서드를 지정합니다. 정적 메서드 '{0}()'을(를) 이 형식에서 찾을 수 없습니다. 메서드가 있으며 정적으로 표시되어 있는지 확인하세요.
pl: Atrybut KnownTypeAttribute typu „{1}” wskazuje metodę o nazwie „{0}” dostarczającą znane typy. W tym typie nie znaleziono metody statycznej „{0}()”. Upewnij się, że metoda istnieje i że jest oznaczona jako statyczna.
pt_br: O atributo KnownTypeAttribute no tipo '{1}' especifica o método denominado '{0}' para fornecer tipos conhecidos. O método estático '{0}()' não foi encontrado nesse tipo. Verifique se o método existe e se está marcado como estático.
ru: Атрибут KnownTypeAttribute типа "{1}" указывает метод с именем "{0}" для предоставления известных типов. Статический метод "{0}()" для этого типа не найден. Убедитесь, что метод существует и отмечен как статический.
tr: '{0}' türündeki KnownTypeAttribute özniteliği, bilinen türleri sağlamak için '{1}' adlı bir metot belirtiyor. Bu türde '{0}()' Static metodu bulunamadı. Metodun mevcut olduğundan ve statik olarak işaretlendiğinden emin olun.
zh_hans: 类型“{1}”的 KnownTypeAttribute 特性指定一个名为“{0}”的方法，以提供已知类型。此类型上找不到静态方法“{0}()”。请确保此方法存在并标记为静态。
zh_hant: 類型 '{1}' 上的 KnownTypeAttribute 屬性指定稱為 '{0}' 的方法，來提供已知類型。在此類型上找不到 Static 方法 '{0}()'。請確定該方法存在且標示為靜態。

# KnownTypeAttributeValidMethodTypes
source: Method specified by KnownTypeAttribute attribute on type '{0}' does not expose valid types.
cs: Metoda určená atributem KnownTypeAttribute u typu {0} nezveřejňuje platné typy.
de: Die vom Attribut KnownTypeAttribute für den Typ "{0}" angegebene Methode macht keine gültigen Typen verfügbar.
es: El método que especifica el atributo KnownTypeAttribute en el tipo "{0}" no expone tipos válidos.
fr: La méthode spécifiée par l'attribut KnownTypeAttribute sur le type '{0}' n'expose pas de types valides.
it: Il metodo specificato dall'attributo KnownTypeAttribute nel tipo '{0}' non espone tipi validi.
ja: 型 '{0}' の KnownTypeAttribute 属性により指定されたメソッドは、有効な型を公開しません。
ko: 형식 '{0}'의 KnownTypeAttribute 특성에 의해 지정된 메서드가 적합한 형식을 표시하지 않습니다.
pl: Metoda wskazywana przez atrybut KnownTypeAttribute w typie „{0}” nie uwidacznia prawidłowych typów.
pt_br: O método especificado pelo atributo KnownTypeAttribute no tipo '{0}' não expõe tipos válidos.
ru: Метод, указанный атрибутом KnownTypeAttribute в типе "{0}", не предоставляет допустимые типы.
tr: '{0}' türünde KnownTypeAttribute özniteliği tarafından belirtilen metot, geçerli türler yansıtmıyor.
zh_hans: 类型“{0}”的 KnownTypeAttribute 特性指定的方法不公开有效类型。
zh_hant: 類型 '{0}' 的 KnownTypeAttribute 屬性所指定之方法，未公開有效的類型。

# MaxArrayLengthExceeded
source: The maximum array length ({0}) has been exceeded while reading XML data for array of type '{1}'.
cs: Při čtení dat XML pro pole typu {1} byla překročena maximální délka pole ({0}).
de: Die maximale Arraylänge ({0}) wurde beim Lesen von XML-Daten für ein Array vom Typ "{1}" überschritten.
es: Se superó la longitud máxima de la matriz ({0}) mientras se leían los datos XML de una matriz del tipo "{1}".
fr: La longueur de tableau maximale ({0}) a été dépassée durant la lecture des données XML pour le tableau de type '{1}'.
it: Durante la lettura dei dati XML per la matrice di tipo '{1}' è stata superata la lunghezza massima della matrice ({0}).
ja: 型 '{1}' の配列の XML データの読み取り中に最大配列長 ({0}) を超えました。
ko: '{1}' 형식의 배열에 대한 XML 데이터를 읽는 동안 최대 배열 길이({0})를 초과했습니다.
pl: Przekroczono maksymalną długość tablicy ({0}) podczas odczytywania danych XML dla tablicy typu „{1}”.
pt_br: O comprimento máximo da matriz ({0}) foi excedido durante a leitura dos dados XML da matriz do tipo '{1}'.
ru: Превышена максимальная длина массива ({0}) при чтении данных XML для массива типа "{1}".
tr: '{1}' türü dizi için XML verileri okunurken, en büyük dizi uzunluğu ({0}) aşıldı.
zh_hans: 读取类型“{1}”的数组 XML 数据时，超出最大数组长度 ({0})。
zh_hant: 為類型 '{1}' 的陣列讀取 XML 資料時已經超過最大陣列長度 ({0})。

# MissingGetSchemaMethod
source: Type '{0}' does not have a static method '{1}' that takes a parameter of type 'System.Xml.Schema.XmlSchemaSet' as specified by the XmlSchemaProviderAttribute attribute.
cs: Typ {0} nemá statickou metodu {1}, která by přebírala parametr typu System.Xml.Schema.XmlSchemaSet, jak je určeno atributem XmlSchemaProviderAttribute.
de: Der Typ "{0}" besitzt keine statische {1}-Methode, die wie vom Attribut XmlSchemaProviderAttribute angegeben einen Parameter vom Typ System.Xml.Schema.XmlSchemaSet akzeptiert.
es: El tipo "{0}" no dispone de un método estático "{1}" que admita un parámetro del tipo "System.Xml.Schema.XmlSchemaSet" como especifica el atributo XmlSchemaProviderAttribute.
fr: Le type '{0}' ne comporte aucune méthode statique '{1}' acceptant un paramètre de type 'System.Xml.Schema.XmlSchemaSet' spécifié par l'attribut XmlSchemaProviderAttribute.
it: Il tipo '{0}' non contiene un metodo statico '{1}' che accetta un parametro di tipo 'System.Xml.Schema.XmlSchemaSet' come specificato dall'attributo XmlSchemaProviderAttribute.
ja: 型 '{0}' には、XmlSchemaProviderAttribute 属性により指定された型 'System.Xml.Schema.XmlSchemaSet' のパラメーターを取得する静的メソッド '{1}' が設定されていません。
ko: XmlSchemaProviderAttribute 특성에 지정된 'System.Xml.Schema.XmlSchemaSet' 형식의 매개 변수를 가지는 정적 메서드 '{1}'이(가) '{0}' 형식에 없습니다.
pl: Typ „{0}” nie ma statycznej metody „{1}” pobierającej parametr typu „System.Xml.Schema.XmlSchemaSet” określony przez atrybut XmlSchemaProviderAttribute.
pt_br: O tipo '{0}' não tem um método estático '{1}' que usa um parâmetro do tipo 'System.Xml.Schema.XmlSchemaSet' conforme especificado pelo atributo XmlSchemaProviderAttribute.
ru: Тип "{0}" не имеет статического метода "{1}", который принимает параметр типа System.Xml.Schema.XmlSchemaSet, указанный атрибутом XmlSchemaProviderAttribute.
tr: '{0}' türü XmlSchemaProviderAttribute özniteliği tarafından belirtildiği biçimde 'System.Xml.Schema.XmlSchemaSet' türünde bir parametre alan '{1}' statik metoduna sahip değil.
zh_hans: 类型“{0}”没有静态方法“{1}”，该方法使用由 XmlSchemaProviderAttribute 特性指定的 "System.Xml.Schema.XmlSchemaSet" 类型的参数。
zh_hant: 類型 '{0}' 沒有 Static 方法 '{1}'，此方法會取得 XmlSchemaProviderAttribute 屬性所指定的類型 'System.Xml.Schema.XmlSchemaSet'。

# MixedContentNotSupported
source: Complex type with mixed content is not supported.
cs: Komplexní typ se smíšeným obsahem není podporován.
de: Komplexe Typen mit gemischtem Inhalt werden nicht unterstützt.
es: No se admite el tipo complejo con contenido mixto.
fr: Le type complexe à contenu mixte n'est pas pris en charge.
it: Il tipo complesso con contenuto misto non è supportato.
ja: 混合コンテンツを持つ複合型はサポートされていません。
ko: 혼합 콘텐츠를 가진 복합 형식이 지원되지 않습니다.
pl: Typ złożony z zawartością mieszaną nie jest obsługiwany.
pt_br: Não há suporte para tipo complexo com conteúdo misturado.
ru: Составной тип со смешанным содержанием не поддерживается.
tr: Karışık içerikli Complex türü desteklenmez.
zh_hans: 不支持包含混合内容的复杂类型。
zh_hant: 不支援具有混合內容的複雜類型。

# MultipleIdDefinition
source: Invalid XML encountered. The same Id value '{0}' is defined more than once. Multiple objects cannot be deserialized using the same Id.
cs: Byla nalezena neplatná data XML. Stejná hodnota identifikátoru {0} je definována vícekrát. Více objektů se stejným identifikátorem nelze deserializovat.
de: Ungültiger XML-Code. Die ID "{0}" ist mehrmals definiert. Es ist nicht möglich, mehrere Objekte mit derselben ID zu deserialisieren.
es: Se encontraron datos XML no válidos. Se definió el mismo valor de id. "{0}" más de una vez. No es posible deserializar varios objetos con el mismo id.
fr: Détection de données XML non valides. La même valeur d'identificateur '{0}' est définie plusieurs fois. Il est impossible de désérialiser plusieurs objets au moyen du même Id.
it: Sono stati trovati dati XML non validi. Lo stesso valore di ID '{0}' è definito più di una volta. Non è possibile deserializzare più oggetti con lo stesso ID.
ja: 無効な XML が検出されました。同じ ID 値 '{0}' が複数回定義されています。同じ ID を使用して複数のオブジェクトをシリアル化解除することはできません。
ko: 잘못된 XML을 발견했습니다. 동일한 ID 값 '{0}'이(가) 두 번 이상 정의되었습니다. 동일한 ID를 사용하여 여러 개체를 deserialize할 수 없습니다.
pl: Napotkano nieprawidłowy element XML. Ta sama wartość identyfikatora „{0}” została zdefiniowana więcej niż raz. Nie można zdeserializować wielu obiektów przy użyciu tego samego identyfikatora.
pt_br: XML inválido encontrado. O mesmo valor de ID '{0}' é definido mais de uma vez. Não é possível desserializar vários objetos usando a mesma ID.
ru: Обнаружен недопустимый XML-код. Значение идентификатора "{0}" определено несколько раз. Невозможно десериализовать несколько объектов с одним и тем же идентификатором.
tr: Geçersiz XML ile karşılaşıldı. Aynı '{0}' Id değeri birkaç kez tanımlanmış. Aynı Id değeri kullanılarak birden çok nesne seri durumdan çıkarılamaz.
zh_hans: 遇到无效 XML。同一个 ID 值“{0}”被多次定义。无法使用同一个 ID 反序列化多个对象。
zh_hant: 出現無效的 XML。定義一次以上相同的識別碼值 '{0}'。使用相同的識別碼便無法將多個物件還原序列化。

# MustContainOnlyLocalElements
source: The root sequence must contain only local elements. Group ref, choice, any and nested sequences are not supported.
cs: Kořenová sekvence musí obsahovat pouze místní prvky. Skupinový odkaz, výběr, libovolné a vnořené sekvence nejsou podporovány.
de: Die Stammsequenz darf nur lokale Elemente enthalten. Gruppenverweise, "choice", "any" und geschachtelte Sequenzen werden nicht unterstützt.
es: La secuencia raíz solo puede contener elementos locales. No se admiten los tipos group ref, choice, any y sequence anidados.
fr: La séquence racine ne doit contenir que des éléments locaux. Les séquences référence de groupe, choix, tout et imbriqué ne sont pas prises en charge.
it: La sequenza radice deve contenere solo elementi locali. Le sequenze group ref, choice, any e nested non sono supportate.
ja: ルート シーケンスは、ローカル要素のみを含んでいる必要があります。group ref、choice、any、および入れ子のシーケンスはサポートされていません。
ko: 루트 시퀀스는 로컬 요소만 포함해야 합니다. 그룹 참조, 선택, 임의 및 중첩 시퀀스는 지원되지 않습니다.
pl: Główna sekwencja musi zawierać tylko elementy lokalne. Elementy: group ref, choice, any oraz sekwencje zagnieżdżone nie są obsługiwane.
pt_br: A sequência raiz deve conter apenas elementos locais. Não há suporte para ref, choice e any agrupados nem para sequências aninhadas.
ru: Корневая последовательность должна содержать только локальные элементы. Групповая ссылка, choice, any и вложенные последовательности не поддерживаются.
tr: Kök sırası yalınıza yerel öğeler içermelidir. Grup başvurusu, tercih, herhangi ve iç içe geçmiş sıralar desteklenmez.
zh_hans: 根序列必须仅包含本地元素。不支持组引用、选择以及嵌套的序列。
zh_hant: 根序列必須只包含本機元素。不支援群組參考、選擇、任何及巢狀序列。

# NameCannotBeNullOrEmpty
source: XmlQualifiedName.Name cannot be null or empty.
cs: Vlastnost XmlQualifiedName.Name nesmí mít hodnotu null ani být prázdná.
de: XmlQualifiedName.Name darf nicht NULL oder leer sein.
es: XmlQualifiedName.Name no puede ser nulo ni estar vacío.
fr: XmlQualifiedName.Name ne peut pas avoir une valeur null ou être vide.
it: XmlQualifiedName.Name non può essere Null o vuoto.
ja: XmlQualifiedName.Name を null または空にすることはできません。
ko: XmlQualifiedName.Name은 null이거나 비워 둘 수 없습니다.
pl: Właściwość XmlQualifiedName.Name nie może być wartością null ani pustą.
pt_br: XmlQualifiedName.Name não pode ser nulo nem vazio.
ru: Свойство XmlQualifiedName.Name не может быть пустым или равным null.
tr: XmlQualifiedName.Name değeri null veya boş olamaz.
zh_hans: XmlQualifiedName.Name 不能为 null 或空。
zh_hant: XmlQualifiedName.Name 不可為 null 或空白。

# NoConversionPossibleTo
source: An internal error has occurred. No conversion is possible to '{0}' - error generating code for serialization.
cs: Došlo k vnitřní chybě. Není možný převod na {0} – došlo k chybě při generování kódu pro serializaci.
de: Ein interner Fehler ist aufgetreten. Es ist keine Konvertierung in "{0}" möglich. Fehler beim Generieren des Codes für die Serialisierung.
es: Error interno. No se puede realizar la conversión en "{0}": error al generar el código para la serialización.
fr: Une erreur interne s'est produite. Aucune conversion n'est possible vers '{0}' – erreur survenue durant la génération de code pour la sérialisation.
it: Si è verificato un errore interno. La conversione in '{0}' non è possibile. Si è verificato un errore durante la generazione del codice per la serializzazione.
ja: 内部エラーが発生しました。'{0}' に変換することはできません。シリアル化用コードの生成エラーです。
ko: 내부 오류가 발생했습니다. '{0}'(으)로 변환할 수 없습니다. serialization을 위한 코드를 생성하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd wewnętrzny. Nie można przeprowadzić konwersji na „{0}” — błąd generowania kodu serializacji.
pt_br: Erro interno. Não é possível nenhuma conversão para '{0}' – código de geração de erro para serialização.
ru: Произошла внутренняя ошибка. Невозможно преобразовать в "{0}" — ошибка генерирования кода для сериализации.
tr: Bir iç hata oluştu. '{0}' türüne dönüşüm yapılamıyor. Serileştirme kodu oluşturulurken hata oluştu.
zh_hans: 出现内部错误。无法转换为“{0}”- 生成序列化的代码时出错。
zh_hant: 發生內部錯誤。無法轉換為 '{0}' - 產生序列化的程式碼時發生錯誤。

# NoGetMethodForProperty
source: No get method for property '{1}' in type '{0}'.
cs: Žádná metoda get pro vlastnost {1} v typu {0}
de: Es ist keine get-Methode für die {1}-Eigenschaft im Typ "{0}" implementiert.
es: Falta el método Get para la propiedad "{1}" del tipo "{0}".
fr: Aucune méthode get pour la propriété '{1}' dans le type '{0}'.
it: Nel tipo '{0}' non esiste alcun metodo get per la proprietà '{1}'.
ja: 型 '{0}' のプロパティ '{1}' に対する get メソッドはありません。
ko: 형식 '{0}'의 속성 '{1}'에 대한 get 메서드가 없습니다.
pl: Brak metody Get dla właściwości „{1}” w typie „{0}”.
pt_br: Nenhum método get para a propriedade '{1}' no tipo '{0}'.
ru: Для свойства "{1}" в типе "{0}" отсутствует метод Get.
tr: '{0}' türündeki '{1}' özelliği için get metodu yok.
zh_hans: 没有类型为“{0}”，属性为“{1}”的 Get 方法。
zh_hant: 類型 '{0}' 的屬性 '{1}' 沒有 Get 方法。

# NoSetMethodForProperty
source: No set method for property '{1}' in type '{0}'.
cs: Žádná metoda set pro vlastnost {1} v typu {0}
de: Es ist keine set-Methode für die {1}-Eigenschaft im Typ "{0}" implementiert.
es: Falta el método Set para la propiedad "{1}" del tipo "{0}".
fr: Aucune méthode set pour la propriété '{1}' dans le type '{0}'.
it: Nel tipo '{0}' non esiste alcun metodo set per la proprietà '{1}'.
ja: 型 '{0}' のプロパティ '{1}' に対する set メソッドはありません。
ko: 형식 '{0}'의 속성 '{1}'에 대한 set 메서드가 없습니다.
pl: Brak metody Set dla właściwości „{1}” w typie „{0}”.
pt_br: Nenhum método set para a propriedade '{1}' no tipo '{0}'.
ru: Для свойства "{1}" в типе "{0}" отсутствует метод Set.
tr: '{0}' türündeki '{1}' özelliği için set metodu yok.
zh_hans: 没有类型为“{0}”，属性为“{1}”的 Set 方法。
zh_hant: 類型 '{0}' 中的屬性 '{1}' 沒有 Set 方法。

# NonAttributedSerializableTypesMustHaveDefaultConstructor
source: The Type '{0}' must have a parameterless constructor.
cs: Typ {0} musí mít konstruktor bez parametrů.
de: Der Typ "{0}" muss einen parameterlosen Konstruktor haben.
es: El tipo "{0}" debe tener un constructor sin parámetros.
fr: Le type '{0}' doit avoir un constructeur sans paramètre.
it: Il tipo '{0}' deve contenere un costruttore senza parametri.
ja: 型 '{0}' には、パラメーターなしのコンストラクターが含まれている必要があります。
ko: '{0}' 형식에는 매개 변수가 없는 생성자가 있어야 합니다.
pl: Typ „{0}” musi mieć konstruktora bez parametrów.
pt_br: O tipo '{0}' deve ter um construtor sem parâmetros.
ru: Тип "{0}" должен содержать конструктор без параметров.
tr: '{0}' Türünün parametresiz bir oluşturucusu olmalıdır.
zh_hans: 类型“{0}”必须具有一个无参数的构造函数。
zh_hant: 類型 '{0}' 必須有無參數的建構函式。

# NonOptionalFieldMemberOnIsReferenceSerializableType
source: '{0}.{1}' is not marked with OptionalFieldAttribute, thus indicating that it must be serialized. However, '{0}' derives from a class marked with DataContractAttribute and an IsReference setting of '{2}'. It is not possible to have required data members on IsReference classes. Either decorate '{0}.{1}' with OptionalFieldAttribute, or disable the IsReference setting on the appropriate parent class.
cs: {0}.{1} není označen atributem OptionalFieldAttribute a udává, že musí být serializovaný. Člen {0} je odvozen od třídy označené atributem DataContractAttribute a má nastavení IsReference {2}. Není možné mít požadované datové členy ve třídách IsReference. Dekorujte {0}.{1} atributem OptionalFieldAttribute nebo v příslušné nadřazené třídě zakažte nastavení IsReference.
de: "{0}.{1}" ist nicht mit OptionalFieldAttribute markiert, wodurch angegeben wird, dass eine Serialisierung erforderlich ist. "{0}" ist jedoch von einer Klasse abgeleitet, die mit DataContractAttribute markiert ist und deren IsReference-Einstellung auf "{2}" festgelegt ist. Für IsReference-Klassen sind keine erforderlichen Datenmember möglich. Versehen Sie "{0}.{1}" mit OptionalFieldAttribute, oder deaktivieren Sie die IsReference-Einstellung für die entsprechende übergeordnete Klasse.
es: "{0}.{1}" no está marcado con OptionalFieldAttribute; por tanto, indica que se debe serializar. Sin embargo, "{0}" se deriva de una clase marcada con DataContractAttribute y un valor IsReference de "{2}". No se pueden tener miembros de datos necesarios en clases IsReference. Incluya OptionalFieldAttribute en "{0}.{1}" o deshabilite el valor IsReference en la clase primaria correspondiente.
fr: '{0}.{1}' n'est pas marqué avec OptionalFieldAttribute, ce qui indique que sa sérialisation est obligatoire. Toutefois, '{0}' provient d'une classe marquée avec DataContractAttribute et un paramètre IsReference de '{2}'. Il est impossible d'avoir des membres de données obligatoires sur les classes IsReference. Décorez '{0}.{1}' avec OptionalFieldAttribute ou désactivez le paramètre IsReference dans la classe parente appropriée.
it: '{0}.{1}' non è contrassegnato con OptionalFieldAttribute e deve quindi essere serializzato. Tuttavia, '{0}' deriva da una classe contrassegnata con DataContractAttribute e con l'impostazione IsReference uguale a '{2}'. Non possono esistere membri dati richiesti in classi IsReference. Decorare '{0}.{1}' con OptionalFieldAttribute oppure disabilitare l'impostazione IsReference nella classe padre appropriata.
ja: '{0}.{1}' に OptionalFieldAttribute が設定されていません。これは、シリアル化が必要であることを示しています。ただし、'{0}' は DataContractAttribute が設定されているクラスから派生し、IsReference 設定は '{2}' です。IsReference クラスで必要なデータ メンバーを持つことはできません。'{0}.{1}' を OptionalFieldAttribute で修飾するか、適切な親クラスの IsReference 設定を無効にしてください。
ko: '{0}.{1}'은(는) OptionalFieldAttribute로 표시되어 있지 않으므로 직렬화되어야 함을 나타냅니다. 하지만 '{0}'은(는) DataContractAttribute 및 IsReference 설정이 '{2}'(으)로 표시된 클래스에서 파생됩니다. IsReference 클래스에서 필요한 데이터 멤버를 사용할 수 없습니다. '{0}.{1}'을(를) OptionalFieldAttribute로 데코레이트하거나 적절한 부모 클래스에서 IsReference 설정을 사용하지 않도록 지정하세요.
pl: Element „{0}.{1}” nie jest oznaczony atrybutem OptionalFieldAttribute, co wskazuje, że musi być serializowany. Tymczasem element „{0}” dziedziczy z klasy oznaczonej atrybutem DataContractAttribute, mającej ustawienie IsReference równe „{2}”. W klasach IsReference nie mogą istnieć wymagane składowe danych. Oznacz element „{0}.{1}” atrybutem OptionalFieldAttribute lub wyłącz ustawienie IsReference w odpowiedniej klasie nadrzędnej.
pt_br: '{0}.{1}' não está marcado com OptionalFieldAttribute, indicando que deve ser serializado. No entanto, '{0}' deriva de uma classe marcada com DataContractAttribute e uma configuração IsReference de '{2}'. Não é possível ter membros de dados obrigatórios nas classes IsReference. Decore '{0}.{1}' com OptionalFieldAttribute ou desabilite a configuração IsReference na classe pai apropriada.
ru: "{0}.{1}" не отмечен с помощью OptionalFieldAttribute, что указывает на то, что его необходимо сериализовать. Однако "{0}" является производным от класса, отмеченного с помощью атрибута DataContractAttribute и параметра IsReference для "{2}". Невозможно получить необходимые элементы данных для классов IsReference. Параметризуйте "{0}.{1}" с помощью атрибута OptionalFieldAttribute или отключите параметр IsReference для соответствующего родительского класса.
tr: '{0}.{1}' OptionalFieldAttribute ile işaretlenmemiş, bu da serileştirilmiş olması gerektiğini gösteriyor. Ancak, '{0}' DataContractAttribute ile işaretlenmiş ve IsReference ayarı '{2}' olan bir sınıftan türetiliyor. IsReference sınıflarında gerekli veri üyeleri olması mümkün değildir. '{0}.{1}' öğesini OptionalFieldAttribute ile işaretleyin ya da ilgili üst sınıfta IsReference ayarını devre dışı bırakın.
zh_hans: “{0}.{1}”未用 OptionalFieldAttribute 标记，因此表明必须将其序列化。但是，“{0}”派生自用 DataContractAttribute 标记且 IsReference 设置为“{2}”的类。无法让必需的数据成员属于 IsReference 类。请用 OptionalFieldAttribute 修饰“{0}.{1}”，或禁用适当父类的 IsReference 设置。
zh_hant: '{0}.{1}' 未標示有 OptionalFieldAttribute，因此表示其必須序列化。但 '{0}' 衍生自標示有 DataContractAttribute 的類別，且 IsReference 的設定為 '{2}'。在 IsReference 類別上不可能有必要的資料成員。請為 '{0}.{1}' 加上 OptionalFieldAttribute，或在適當的父類別上停用 IsReference 設定。
