Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlArrayTooSmallInput
source: Array too small. Length of available data must be at least {0}.
cs: Pole je příliš malé. Délka dostupných dat musí být alespoň {0}.
de: Das Array ist zu klein. Die Länge der verfügbaren Daten muss mindestens {0} sein.
es: La matriz es demasiado pequeña. La longitud de los datos disponibles debe ser {0} como mínimo.
fr: Tableau trop petit. La longueur des données disponibles doit être au moins de {0}.
it: La matrice è troppo ridotta. La lunghezza dei dati disponibili deve essere pari ad almeno {0}.
ja: 配列が小さすぎます。利用可能なデータの長さは {0} 以上である必要があります。
ko: 배열이 너무 작습니다. 사용 가능한 데이터의 길이는 최소 {0} 이상이어야 합니다.
pl: Za mała tablica. Długość dostępnych danych musi wynosić co najmniej {0}.
pt_br: Matriz muito pequena. O comprimento dos dados disponíveis deve ser de pelo menos {0}.
ru: Массив слишком мал. Длина доступных данных должна быть не менее {0}.
tr: Dizi çok küçük. Kullanılabilir verilerin uzunluğu en az {0} olmalı.
zh_hans: 数组过小。可用数据的长度必须至少为 {0}。
zh_hant: 陣列太小。可用的資料長度至少必須要是 {0}。

# XmlArrayTooSmallOutput
source: Array too small. Must be able to hold at least {0}.
cs: Pole je příliš malé. Musí mít možnost držet alespoň {0}.
de: Das Array ist zu klein. Es muss mindestens {0} enthalten können.
es: La matriz es demasiado pequeña. Debe tener capacidad para {0} como mínimo.
fr: Tableau trop petit. Il doit pouvoir contenir au moins {0}.
it: La matrice è troppo piccola. Deve essere in grado di contenere almeno {0}.
ja: 配列が小さすぎます。{0} 以上を格納できる必要があります。
ko: 배열이 너무 작습니다. 최소 {0} 이상을 보유할 수 있어야 합니다.
pl: Za mała tablica. Musi mieścić co najmniej {0}.
pt_br: Matriz muito pequena. Deve poder armazenar pelo menos {0}.
ru: Массив слишком мал. Должен вмещать не менее {0}.
tr: Dizi çok küçük. En az {0} tutabilecek özellikte olmalı.
zh_hans: 数组过小。必须能够至少容纳 {0}。
zh_hant: 陣列太小。至少必須要能保留 {0}。

# XmlAsyncIsRunningException
source: An asynchronous operation is already in progress.
cs: Již probíhá jiná asynchronní operace.
de: Es wird bereits ein asynchroner Vorgang ausgeführt.
es: Ya hay una operación asincrónica en curso.
fr: Une opération asynchrone est déjà en cours.
it: Un'operazione asincrona è già in corso.
ja: 非同期操作は既に実行されています。
ko: 비동기 작업이 이미 진행 중입니다.
pl: Trwa już operacja asynchroniczna.
pt_br: Uma operação assíncrona já está em andamento.
ru: Асинхронная операция уже выполняется.
tr: Asenkron bir işlem zaten devam ediyor.
zh_hans: 异步操作已在进行中。
zh_hant: 非同步作業已在進行中。

# XmlBadBOM
source: Unrecognized Byte Order Mark.
cs: Nerozpoznaná značka pro pořadí bajtů.
de: Unbekannte Markierung der Bytereihenfolge.
es: Marca de orden de bytes no reconocida.
fr: Marque d'ordre d'octet non reconnue.
it: Byte order mark non riconosciuto.
ja: 認識されないバイト オーダー マークです。
ko: 인식할 수 없는 바이트 순서 표시입니다.
pl: Nierozpoznany znacznik kolejności bajtów.
pt_br: Marca de Ordem de Byte não reconhecida.
ru: Нераспознанная метка порядка байтов.
tr: Bilinmeyen Bayt Sıra İşareti.
zh_hans: 无法识别的字节顺序标记。
zh_hant: 無法辨識的位元順序標記。

# XmlBase64DataExpected
source: Base64 encoded data expected. Found {0}.
cs: Očekávána data kódovaná systémem Base64. Byl nalezen element {0}.
de: Es wurden Base64-codierte Daten erwartet. Gefunden wurde {0}.
es: Se esperaban datos con la codificación Base64, pero se encontró {0}.
fr: Données encodées en Base64 attendues. Trouvé {0}.
it: Sono previsti dati con codifica Base64, ma è stato trovato {0}.
ja: Base64 エンコード データが必要です。見つかったのは {0} でした。
ko: Base64로 인코딩된 데이터가 필요한데 {0}을(를) 찾았습니다.
pl: Oczekiwano danych zakodowanych algorytmem Base64. Znaleziono {0}.
pt_br: Espera-se dados codificados em Base64. Encontrado {0}.
ru: Ожидались данные в кодировке Base64. Найдено {0}.
tr: Base64 kodlamalı veri bekleniyordu. Bulunan: {0}.
zh_hans: 所需的 Base64 编码数据。已找到 {0}。
zh_hant: 需要 Base64 編碼的資料，但找到 {0}。

# XmlCDATAInvalidAtTopLevel
source: CData elements not valid at top level of an XML document.
cs: Prvky CData nejsou platné v horní úrovni dokumentu XML.
de: CData-Elemente sind auf der obersten Ebene eines XML-Dokuments nicht gültig.
es: Los elementos CData no son válidos en el nivel superior de un documento XML.
fr: Éléments CData non valides au niveau supérieur d'un document XML.
it: Gli elementi CData non sono validi al primo livello di un documento XML.
ja: CData 要素は、XML ドキュメントのトップ レベルでは無効です。
ko: CData 요소가 XML 문서의 최상위 수준에서 유효하지 않습니다.
pl: Nieprawidłowe elementy CData na najwyższym poziomie dokumentu XML.
pt_br: Elementos CData inválidos no nível superior de um documento XML.
ru: Элементы CData недопустимы на верхнем уровне XML-документа.
tr: CData öğeleri, bir XML belgesinin en üst düzeyinde geçerli değildir.
zh_hans: CData 元素在 XML 文档的顶层无效。
zh_hant: 位於 XML 文件最上層的 CData 元素無效。

# XmlCloseCData
source: ']]>' not valid in text node content.
cs: ']]>' není platné v obsahu textového uzlu.
de: "]]>" ist im Inhalt eines Textknotens nicht gültig.
es: "]]>" no es válido en el contenido del nodo de texto.
fr: ']]>' non valide dans un contenu de nœud de texte.
it: ']]>' non è valido nel contenuto di un nodo di testo.
ja: ']]>' は、テキスト ノードのコンテンツでは無効です。
ko: ']]>'이(가) 텍스트 노드 콘텐츠에서 유효하지 않습니다.
pl: Nieprawidłowy ciąg „]]>” w zawartości węzła tekstowego.
pt_br: ']]>' inválido no conteúdo de nó do texto.
ru: Символы "]]>" недопустимы в содержимом текстового узла.
tr: ']]>' metin düğümü içeriğinde geçerli değildir.
zh_hans: "]]>" 在文本节点内容中无效。
zh_hant: 文字節點內容中的 ']]>' 無效。

# XmlConversionOverflow
source: The value '{0}' cannot be represented with the type '{1}'.
cs: Hodnotu {0} nelze reprezentovat typem {1}.
de: Der Wert "{0}" kann nicht mithilfe des Typs "{1}" dargestellt werden.
es: El valor "{0}" no se puede representar con el tipo "{1}".
fr: La valeur '{0}' ne peut pas être représentée avec le type '{1}'.
it: Non è possibile rappresentare il valore '{0}' con il tipo '{1}'.
ja: 値 '{0}' を、型 '{1}' を使用して表示できません。
ko: '{0}' 값을 '{1}' 형식을 사용하여 나타낼 수 없습니다.
pl: Wartość „{0}” nie może być reprezentowana przez typ „{1}”.
pt_br: O valor '{0}' não pode ser representado como o tipo '{1}'.
ru: Значение "{0}" не может быть представлено типом "{1}".
tr: '{0}' değeri '{1}' türüyle temsil edilemez.
zh_hans: 值“{0}”无法使用类型“{1}”表示。
zh_hant: 類型 '{1}' 不可以有值 '{0}'。

# XmlDeclMissing
source: An XML declaration is required for all non-UTF8 documents.
cs: Pro všechny dokumenty s jiným kódováním než UTF8 je nutná deklarace XML.
de: Für alle Nicht-UTF8-Dokumente ist eine XML-Deklaration erforderlich.
es: Se requiere una declaración XML para todos los documentos que no sean UTF8.
fr: Une déclaration XML est obligatoire pour tous les documents non UTF8.
it: È necessaria una dichiarazione XML per tutti i documenti non UTF8.
ja: すべての非 UTF8 ドキュメントでは、XML 宣言が必要です。
ko: XML 선언이 모든 UTF8 이외 문서에 필요합니다.
pl: Deklaracja XML jest wymagana dla wszystkich dokumentów niekodowanych w standardzie UTF8.
pt_br: Uma declaração XML é necessária para todos os documentos não UTF8.
ru: Для всех документов в формате, отличном от UTF8, требуется XML-объявление.
tr: UTF8 olmayan tüm belgeler için bir XML bildirimi gerekir.
zh_hans: 所有非 UTF8 文档都需要 XML 声明。
zh_hant: 所有非 UTF8 文件都需要 XML 宣告。

# XmlDeclMissingVersion
source: Version not found in XML declaration.
cs: V deklaraci XML nebyla nalezena verze.
de: In der XML-Deklaration wurde keine Versionsangabe gefunden.
es: No se encontró la versión en la declaración XML.
fr: Version introuvable dans la déclaration XML.
it: La versione non è stata trovata nella dichiarazione XML.
ja: XML 宣言でバージョンが見つかりません。
ko: XML 선언에서 버전을 찾을 수 없습니다.
pl: Nie znaleziono wersji w deklaracji XML.
pt_br: Versão não encontrada na declaração XML.
ru: Не найдена версия в XML-объявлении.
tr: XML bildiriminde Version bulunamadı.
zh_hans: XML 声明中找不到版本信息。
zh_hant: 在 XML 宣告中找不到版本。

# XmlDeclNotFirst
source: No characters can appear before the XML declaration.
cs: Před deklarací XML se nesmí nacházet žádné znaky.
de: Es können keine Zeichen vor der XML-Deklaration angezeigt werden.
es: No puede haber ningún carácter delante de la declaración XML.
fr: Aucun caractère ne doit s'afficher devant la déclaration XML.
it: Non sono consentiti caratteri prima della dichiarazione XML.
ja: XML 宣言の前に文字を記述することはできません。
ko: XML 선언 앞에 문자가 올 수 없습니다.
pl: Żadne znaki nie mogą występować przed deklaracją XML.
pt_br: Nenhum caractere pode aparecer antes da declaração XML.
ru: Никакие символы не должны появляться перед XML-объявлением.
tr: XML bildiriminden önce herhangi bir karakter görünemez.
zh_hans: 在 XML 声明之前不能出现任何字符。
zh_hant: XML 宣告之前不可以出現任何字元。

# XmlDeclarationRequired
source: An XML declaration with an encoding is required for all non-UTF8 documents.
cs: Pro všechny dokumenty s jiným kódováním než UTF8 je nutná deklarace XML s kódováním.
de: Für alle Nicht-UTF8-Dokumente ist eine XML-Deklaration mit einer Codierung erforderlich.
es: Se requiere una declaración XML con una codificación para todos los documentos que no sean UTF8.
fr: Une déclaration XML avec un encodage est obligatoire pour tous les documents non UTF8.
it: È necessaria una dichiarazione XML con codifica per tutti i documenti non UTF8.
ja: すべての非 UTF8 ドキュメントでは、エンコードを含む XML 宣言が必要です。
ko: 인코딩이 있는 XML 선언이 모든 UTF8 이외 문서에 필요합니다.
pl: Deklaracja XML z kodowaniem jest wymagana dla wszystkich dokumentów niekodowanych w standardzie UTF8.
pt_br: Uma declaração XML com uma codificação é exigida para todos os documento não UTF8.
ru: Для всех документов в формате, отличном от UTF-8, требуется XML-объявление с кодированием.
tr: UTF8 olmayan tüm belgeler için kodlamalı bir XML bildirimi gerekir.
zh_hans: 所有非 UTF8 文档都需要使用具有编码的 XML 声明。
zh_hant: 所有非 UTF8 文件都需要具有編碼的 XML 宣告。

# XmlDictionaryStringIDRange
source: XmlDictionaryString IDs must be in the range from {0} to {1}.
cs: Identifikátory XmlDictionaryString musejí být v rozsahu od {0} do {1}.
de: XmlDictionaryString-IDs müssen im Bereich {0} bis {1} liegen.
es: Los id. XmlDictionaryString deben estar dentro del intervalo de {0} a {1}.
fr: Les ID XmlDictionaryString doivent être compris dans la plage allant de {0} à {1}.
it: Gli ID di XmlDictionaryString devono essere compresi tra {0} e {1}.
ja: XmlDictionaryString ID は、{0} から {1} の範囲である必要があります。
ko: XmlDictionaryString ID가 {0} - {1} 범위에 속해야 합니다.
pl: Identyfikatory XmlDictionaryString muszą być z zakresu od {0} do {1}.
pt_br: As IDs XmlDictionaryString devem estar no intervalo de {0} a {1}.
ru: Идентификаторы XmlDictionaryString должны быть в пределах от {0} до {1}.
tr: XmlDictionaryString ID değerleri, {0} ile {1} aralığında olmalıdır.
zh_hans: XmlDictionaryString ID 必须在 {0} 到 {1} 的范围内。
zh_hant: XmlDictionaryString 識別碼必須介於 {0} 到 {1} 的範圍之間。

# XmlDictionaryStringIDUndefinedSession
source: XmlDictionaryString ID {0} not defined in the XmlBinaryReaderSession.
cs: Identifikátor XmlDictionaryString {0} není definován v relaci XmlBinaryReaderSession.
de: Die XmlDictionaryString-ID {0} ist nicht in der XmlBinaryReaderSession definiert.
es: El id. XmlDictionaryString {0} no está definido en XmlBinaryReaderSession.
fr: L'ID XmlDictionaryString {0} n'est pas défini dans XmlBinaryReaderSession.
it: L'ID {0} di XmlDictionaryString non è definito nell'elemento XmlBinaryReaderSession.
ja: XmlDictionaryString ID {0} は XmlBinaryReaderSession で定義されていません。
ko: XmlDictionaryString ID {0}이(가) XmlBinaryReaderSession에 정의되지 않았습니다.
pl: W elemencie XmlBinaryReaderSession nie zdefiniowano identyfikatora {0} obiektu XmlDictionaryString.
pt_br: ID XmlDictionaryString {0} não definida na XmlBinaryReaderSession.
ru: В XmlBinaryReaderSession не определен идентификатор XmlDictionaryString ID {0}.
tr: XmlDictionaryString ID {0}, XmlBinaryReaderSession içinde tanımlı değil.
zh_hans: 未在 XmlBinaryReaderSession 中定义 XmlDictionaryString ID {0}。
zh_hant: XmlBinaryReaderSession 中未定義 XmlDictionaryString 識別碼 {0}。

# XmlDictionaryStringIDUndefinedStatic
source: XmlDictionaryString ID {0} not defined in the static dictionary.
cs: ID třídy XmlDictionaryString {0} není definováno ve statickém slovníku.
de: Die XmlDictionaryString-ID {0} ist nicht im statischen Wörterbuch definiert.
es: El id. XmlDictionaryString {0} no está definido en el diccionario estático.
fr: XmlDictionaryString ID {0} non défini dans le dictionnaire statique.
it: L'ID {0} di XmlDictionaryString non è definito nel dizionario statico.
ja: XmlDictionaryString ID {0} は、静的な辞書で定義されていません。
ko: XmlDictionaryString ID {0}이(가) 정적 사전에 정의되지 않았습니다.
pl: W słowniku statycznym nie zdefiniowano identyfikatora {0} obiektu XmlDictionaryString.
pt_br: ID de XmlDictionaryString {0} não definida no dicionário estático.
ru: Идентификатор XmlDictionaryString {0} не определен в статическом словаре.
tr: XmlDictionaryString ID {0}, statik sözlükte tanımlı değil.
zh_hans: 未在静态字典中定义 XmlDictionaryString ID {0}。
zh_hant: 靜態字典中未定義 XmlDictionaryString ID {0}。

# XmlDuplicateAttribute
source: Duplicate attribute found. Both '{0}' and '{1}' are from the namespace '{2}'.
cs: Byl nalezen duplicitní atribut. Atributy {0} a {1} jsou z oboru názvů {2}.
de: Ein doppeltes Attribut wurde gefunden. Sowohl "{0}" als auch "{1}" stammen aus dem Namespace "{2}".
es: Se encontró un atributo duplicado. Tanto "{0}" como "{1}" pertenecen al espacio de nombres "{2}".
fr: Attribut en double détecté. '{0}' et '{1}' proviennent de l'espace de noms '{2}'.
it: È stato trovato un attributo duplicato. Sia '{0}' che '{1}' appartengono allo spazio dei nomi '{2}'.
ja: 重複する属性が見つかりました。'{0}' と '{1}' の両方が、同じ名前空間 '{2}' に存在しています。
ko: 중복 특성을 찾았습니다. '{0}'과(와) '{1}'이(가) 모두 네임스페이스 '{2}'에 있습니다.
pl: Znaleziono zduplikowany atrybut. Oba elementy — „{0}” i „{1}” — pochodzą z przestrzeni nazw „{2}”.
pt_br: Atributo duplicado encontrado. Tanto '{0}' quanto '{1}' são do namespace '{2}'.
ru: Обнаружен дубликат атрибута. И "{0}", и "{1}" относятся к пространству имен "{2}".
tr: Çoğaltılmış öznitelik bulundu. '{0}' ve '{1}' öğelerinin her ikisi de '{2}' ad alanındandır.
zh_hans: 找到重复属性。“{0}”和“{1}”都来自命名空间“{2}”。
zh_hant: 找到重複的屬性。'{0}' 及 '{1}' 兩者皆來自於命名空間 '{2}'。

# XmlElementAttributes
source: Only Element nodes have attributes.
cs: Atributy mají pouze uzly Element.
de: Nur Elementknoten besitzen Attribute.
es: Solo los nodos de elementos tienen atributos.
fr: Seuls les nœuds d'éléments sont dotés d'attributs.
it: Solo i nodi Element contengono attributi.
ja: 要素ノードのみが属性を持ちます。
ko: 요소 노드만 특성을 가집니다.
pl: Tylko węzły elementów mają atrybuty.
pt_br: Apenas nós Element têm atributos.
ru: Только узлы Element имеют атрибуты.
tr: Yalnızca Element düğümleri özniteliklere sahiptir.
zh_hans: 只有元素节点具有属性。
zh_hant: 只有元素節點才具有屬性。

# XmlEmptyNamespaceRequiresNullPrefix
source: The empty namespace requires a null or empty prefix.
cs: Prázdný obor názvů vyžaduje předponu, která je null nebo prázdná.
de: Der leere Namespace erfordert ein NULL-Präfix oder ein leeres Präfix.
es: El espacio de nombres vacío requiere un prefijo nulo o vacío.
fr: L'espace de noms vide nécessite un préfixe vide ou de valeur null.
it: Con lo spazio dei nomi vuoto è necessario un prefisso vuoto o Null.
ja: 空の名前空間には、null または空のプレフィックスが必要です。
ko: 빈 네임스페이스에 null 또는 빈 접두사가 필요합니다.
pl: Pusta przestrzeń nazw wymaga prefiksu o wartości null lub pustego.
pt_br: O namespace vazio requer um prefixo nulo ou vazio.
ru: Пустое пространство имен требует нулевого или пустого префикса.
tr: Boş ad alanı, null ya da boş olan bir önek gerektirir.
zh_hans: 空命名空间需要 Null 或空前缀。
zh_hant: 空白命名空間需要 Null 或空白的前置詞。

# XmlEncodingMismatch
source: The encoding in the declaration '{0}' does not match the encoding of the document '{1}'.
cs: Kódování v deklaraci {0} se neshoduje s kódováním dokumentu {1}.
de: Die Codierung in der Deklaration "{0}" entspricht nicht der Codierung des Dokuments "{1}".
es: La codificación de la declaración "{0}" no coincide con la codificación del documento "{1}".
fr: L'encodage dans la déclaration '{0}' ne correspond pas à l'encodage du document '{1}'.
it: La codifica nella dichiarazione '{0}' non corrisponde alla codifica del documento '{1}'.
ja: 宣言 '{0}' に含まれているエンコードが、ドキュメント '{1}' のエンコードと一致しません。
ko: 선언 '{0}'의 인코딩이 문서 '{1}'의 인코딩과 일치하지 않습니다.
pl: Kodowanie w deklaracji „{0}” jest niezgodne z kodowaniem dokumentu „{1}”.
pt_br: A codificação na declaração '{0}' não corresponde à codificação do documento '{1}'.
ru: Кодировка в декларации "{0}" не совпадает с кодировкой документа "{1}".
tr: '{0}' bildirimindeki kodlama, '{1}' belgesi kodlamasıyla eşleşmiyor.
zh_hans: 声明“{0}”中的编码与文档“{1}”的编码不匹配。
zh_hant: 宣告 '{0}' 中的編碼與文件 '{1}' 中的編碼不符。

source: XML encoding not supported.
cs: Kódování XML není podporováno.
de: Die XML-Codierung wird nicht unterstützt.
es: No se admite la codificación XML.
fr: L'encodage XML n'est pas pris en charge.
it: La codifica XML non è supportata.
ja: XML エンコードはサポートされていません。
ko: XML 인코딩이 지원되지 않습니다.
pl: Kodowanie XML nie jest obsługiwane.
pt_br: Não há suporte para codificação XML.
ru: Кодировка XML не поддерживается.
tr: XML kodlaması desteklenmiyor.
zh_hans: 不支持 XML 编码。
zh_hant: 不支援 XML 編碼。

# XmlEndElementExpected
source: End element '{0}' from namespace '{1}' expected. Found {2}.
cs: Byl očekáván koncový element {0} z oboru názvů {1}. Byl nalezen element {2}.
de: Es wurde das Endelement "{0}" aus dem Namespace "{1}" erwartet. Gefunden wurde {2}.
es: Se esperaba el elemento final "{0}" del espacio de nombres "{1}". Se encontró {2}.
fr: Élément de fin '{0}' provenant de l'espace de noms '{1}' attendu. Trouvé {2}.
it: È previsto l'elemento finale '{0}' dello spazio dei nomi '{1}', ma è stato trovato {2}.
ja: 名前空間 '{1}' の終了要素 '{0}' が必要です。見つかったのは {2} でした。
ko: 네임스페이스 '{1}'의 끝 요소 '{0}'이(가) 필요한데 {2}을(를) 찾았습니다.
pl: Oczekiwano końcowego elementu „{0}” z przestrzeni nazw „{1}”. Znaleziono {2}.
pt_br: Espera-se o elemento final '{0}' no namespace '{1}'. Encontrado {2}.
ru: Ожидался конечный элемент "{0}" из пространства имен "{1}". Найден {2}.
tr: '{1}' ad alanından '{0}' End öğesi bekleniyordu. Bulunan: {2}.
zh_hans: 需要命名空间“{1}”中的结束元素“{0}”。找到 {2}。
zh_hant: 應要有命名空間 '{1}' 的結尾元素 '{0}'，但找到 {2}。

# XmlEndElementNoOpenNodes
source: No corresponding start element is open.
cs: Není otevřen žádný odpovídající počáteční element.
de: Es ist kein entsprechendes Startelement geöffnet.
es: No hay ningún elemento de inicio correspondiente abierto.
fr: Aucun élément de début correspondant n'est ouvert.
it: Non è aperto alcun elemento iniziale corrispondente.
ja: 対応する開始要素が開いていません。
ko: 열려 있는 해당 시작 요소가 없습니다.
pl: Żaden odpowiedni element początkowy nie jest otwarty.
pt_br: Nenhum elemento inicial correspondente está aberto.
ru: Ни один соответствующий начальный элемент не открыт.
tr: Karşılık gelen açık başlatma öğesi yok.
zh_hans: 未打开任何相应的开始元素。
zh_hant: 未開啟任何相對應的開始元素。

# XmlExpectedEncoding
source: The expected encoding '{0}' does not match the actual encoding '{1}'.
cs: Očekávané kódování {0} se neshoduje se skutečným kódováním {1}.
de: Die erwartete Codierung "{0}" entspricht nicht der tatsächlichen Codierung "{1}".
es: La codificación esperada "{0}" no coincide con la codificación real "{1}".
fr: L'encodage attendu '{0}' ne correspond pas à l'encodage réel '{1}'.
it: La codifica prevista '{0}' non corrisponde alla codifica effettiva '{1}'.
ja: 必要なエンコード '{0}' と実際のエンコード '{1}' が一致しません。
ko: 필요한 인코딩 '{0}'이(가) 실제 인코딩 '{1}'과(와) 일치하지 않습니다.
pl: Oczekiwane kodowanie „{0}” jest niezgodne z rzeczywistym kodowaniem „{1}”.
pt_br: A codificação esperada '{0}' não corresponde à codificação real '{1}'.
ru: Ожидаемая кодировка "{0}" не соответствует фактической кодировке "{1}".
tr: Beklenen '{0}' kodlaması gerçek '{1}' kodlamasıyla eşleşmiyor.
zh_hans: 所需编码“{0}”与实际编码“{1}”不匹配。
zh_hant: 應有編碼 '{0}' 與實際編碼 '{1}' 不符。

# XmlForObjectCannotHaveContent
source: Element {0} from namespace {1} cannot have child contents to be deserialized as an object. Please use XmlNode[] to deserialize this pattern of XML.
cs: Element {0} z oboru názvů {1} nemůže mít podřízený obsah, který se má deserializovat jako objekt. K deserializaci tohoto vzoru XML prosím použijte uzel XmlNode[].
de: Das Element "{0}" aus dem Namespace "{1}" kann keinen untergeordneten Inhalt enthalten, der als Objekt deserialisiert werden soll. Verwenden Sie XmlNode[] zum Deserialisieren dieses XML-Musters.
es: El elemento {0} del espacio de nombres {1} no puede tener un contenido secundario para deserializarlo como objeto. Use XmlNode[] para deserializar este patrón de XML.
fr: Aucun contenu enfant de l'élément {0} provenant de l'espace de noms {1} ne peut être désérialisé en tant qu'objet. Utilisez XmlNode[] pour désérialiser ce modèle de XML.
it: L'elemento {0} dello spazio dei nomi {1} non può includere contenuti figlio da deserializzare in un oggetto. Per deserializzare questo criterio del codice XML, usare XmlNode[].
ja: 名前空間 {1} の要素 {0} は、オブジェクトとしてシリアル化解除される子要素を持つことができません。このパターンの XML をシリアル化解除するには XmlNode[] を使用してください。
ko: 네임스페이스 {1}의 {0} 요소는 deserialize할 자식 콘텐츠를 개체로 가질 수 없습니다. XmlNode[]를 사용하여 이 XML 패턴을 deserialize하세요.
pl: Element {0} z przestrzeni nazw {1} nie może mieć podrzędnej zawartości przeznaczonej do zdeserializowania jako obiekt. Użyj klasy XmlNode[], aby przeprowadzić deserializację tego wzorca XML.
pt_br: O elemento {0} do namespace {1} não pode ter conteúdo filho a ser desserializado como um objeto. Use XmlNode[] para desserializar esse padrão de XML.
ru: Элемент {0} из пространства имен {1} не может иметь дочернего содержимого, которое десериализуется как объект. Используйте XmlNode[] для десериализации этого шаблона XML.
tr: {1} ad alanından {0} öğesi bir nesne olarak seri durumdan çıkarılacak alt içeriğe sahip olamaz. Bu XML düzenini seri durumdan çıkarmak için lütfen XmlNode[] kullanın.
zh_hans: 命名空间 {1} 中的元素 {0} 无法将子内容作为对象进行反序列化。请使用 XmlNode[] 反序列化此模式的 XML。
zh_hant: 命名空間 {1} 的元素 {0} 無法將子內容還原序列化而成為物件。請使用 XmlNode[] 來將此 XML 模式還原序列化。

# XmlFoundCData
source: cdata '{0}'
pl: element cdata „{0}”

# XmlFoundComment
source: comment '{0}'
cs: komentář {0}
de: Kommentar "{0}"
es: comentario "{0}"
fr: commentaire '{0}'
it: commento '{0}'
ja: コメント '{0}'
ko: 주석 '{0}'
pl: komentarz „{0}”
pt_br: comentário '{0}'
ru: комментарий "{0}"
tr: '{0}' açıklaması
zh_hans: 注释“{0}”
zh_hant: 註解 '{0}'

# XmlFoundElement
source: element '{0}' from namespace '{1}'
cs: element {0} z oboru názvů {1}
de: Element "{0}" aus dem Namespace "{1}"
es: elemento "{0}" del espacio de nombres "{1}"
fr: élément '{0}' provenant de l'espace de noms '{1}'
it: elemento '{0}' dello spazio dei nomi '{1}'
ja: 名前空間 '{1}' の要素 '{0}'
ko: 네임스페이스 '{1}'의 요소 '{0}'
pl: element „{0}” z przestrzeni nazw „{1}”
pt_br: elemento '{0}' do namespace '{1}'
ru: элемент "{0}" из пространства имен "{1}"
tr: '{1}' ad alanından '{0}' öğesi
zh_hans: 命名空间“{1}”中的元素“{0}”
zh_hant: 命名空間 '{1}' 的元素 '{0}'

# XmlFoundEndElement
source: end element '{0}' from namespace '{1}'
cs: koncový element {0} z oboru názvů {1}
de: Endelement "{0}" aus dem Namespace "{1}"
es: elemento final "{0}" del espacio de nombres "{1}"
fr: élément de fin '{0}' provenant de l'espace de noms '{1}'
it: elemento finale '{0}' dello spazio dei nomi '{1}'
ja: 名前空間 '{1}' の終了要素 '{0}'
ko: 네임스페이스 '{1}'의 끝 요소 '{0}'
pl: element końcowy „{0}” z przestrzeni nazw „{1}”
pt_br: elemento final '{0}' do namespace '{1}'
ru: конечный элемент "{0}" из пространства имен "{1}"
tr: '{1}' ad alanından '{0}' bitiş öğesi
zh_hans: 命名空间“{1}”中的结束元素“{0}”
zh_hant: 命名空間 '{1}' 的結尾元素 '{0}'

# XmlFoundEndOfFile
source: end of file
cs: konec souboru
de: Dateiende
es: fin del archivo
fr: fin de fichier
it: fine del file
ja: ファイルの終わり
ko: 파일 끝
pl: koniec pliku
pt_br: fim do arquivo
ru: конец файла
tr: dosya sonu
zh_hans: 文件尾
zh_hant: 檔案結尾

# XmlFoundNodeType
source: node {0}
cs: uzel {0}
de: Knoten "{0}"
es: nodo {0}
fr: nœud {0}
it: nodo {0}
ja: ノード {0}
ko: 노드 {0}
pl: węzeł {0}
pt_br: nó {0}
ru: узел {0}
tr: {0} düğümü
zh_hans: 节点 {0}
zh_hant: 節點 {0}

# XmlFoundText
source: text '{0}'
es: texto "{0}"
fr: texte '{0}'
it: testo '{0}'
ja: テキスト '{0}'
ko: 텍스트 '{0}'
pl: tekst „{0}”
pt_br: texto '{0}'
ru: текст "{0}"
tr: '{0}' metni
zh_hans: 文本“{0}”
zh_hant: 文字 '{0}'
