Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JsonDuplicateMemberInInput
source: The data contract type '{0}' cannot be deserialized because the data member '{1}' was found more than once in the input.
cs: Typ kontraktu dat {0} není možné deserializovat, protože datový člen {1} byl nalezen ve vstupu více než jednou.
de: Der Datenvertragstyp "{0}" kann nicht deserialisiert werden, da der Datenmember "{1}" mehrmals in der Eingabe gefunden wurde.
es: No se puede deserializar el tipo de contrato de datos "{0}" porque el miembro de datos "{1}" se ha encontrado varias veces en la entrada.
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé, car les données membres '{1}' ont été trouvées plusieurs fois dans l'entrée.
it: Non è possibile deserializzare il tipo di contratto di dati '{0}' perché il membro dati '{1}' è stato trovato più di una volta nell'input.
ja: 入力内容にデータ メンバー '{1}' が 2 回以上見つかったため、データ コントラクト型 '{0}' は逆シリアル化できません。
ko: 데이터 멤버 '{1}'이(가) 입력에서 두 번 이상 발견되었으므로 데이터 계약 형식 '{0}'을(를) deserialize할 수 없습니다.
pl: Nie można deserializować typu kontraktu danych „{0}”, ponieważ składowa danych „{1}” została znaleziona w danych wejściowych więcej niż raz.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado porque o membro de dados '{1}' foi encontrado mais de uma vez na entrada.
ru: Тип контрактов данных "{0}" не может быть десериализован, поскольку во входных данных было обнаружено более одного элемента данных "{1}".
tr: '{1}' veri üyesi girişte birden çok kez bulunduğundan, '{0}' veri anlaşması türü seri durumdan çıkarılamıyor.
zh_hans: 数据协定类型“{0}”无法反序列化，因为数据成员“{1}”在输入中出现多次。
zh_hant: 因為輸入中找到多次資料成員 '{1}'，所以資料合約類型 '{0}' 無法還原序列化。

# JsonDuplicateMemberNames
source: The data contract type '{0}' is not serializable with DataContractJsonSerializer because the data member '{1}' is duplicated in its type hierarchy.
cs: Typ kontraktu dat {0} nelze serializovat pomocí metody DataContractJsonSerializer, protože datový člen {1} je v hierarchii typů uveden duplicitně.
de: Der Datenvertragstyp "{0}" kann nicht mit DataContractJsonSerializer serialisiert werden, da der Datenmember "{1}" in seiner Typhierarchie dupliziert ist.
es: El tipo de contrato de datos "{0}" no se puede serializar con DataContractJsonSerializer porque el miembro de datos "{1}" está duplicado en su jerarquía de tipo.
fr: Le type de contrat de données '{0}' n'est pas sérialisable avec DataContractJsonSerializer, car les données membres '{1}' sont dupliquées dans sa hiérarchie de type.
it: Non è possibile serializzare il tipo di contratto di dati '{0}' con DataContractJsonSerializer perché il membro dati '{1}' è duplicato nella relativa gerarchia dei tipi.
ja: データ メンバー '{1}' がその型階層内で重複しているため、データ コントラクト型 '{0}' は、DataContractJsonSerializer でシリアル化できません。
ko: 데이터 멤버 '{1}'이(가) 형식 계층 구조에 중복되어 있기 때문에 DataContractJsonSerializer로 데이터 계약 형식 '{0}'을(를) 직렬화할 수 없습니다.
pl: Nie można serializować typu kontraktu danych „{0}” za pomocą klasy DataContractJsonSerializer, ponieważ składowa danych „{1}” została zduplikowana w jego hierarchii typów.
pt_br: O tipo de contrato de dados '{0}' não é serializável com DataContractJsonSerializer porque o membro de dados '{1}' está duplicado em sua hierarquia de tipos.
ru: Тип контрактов данных "{0}" не может быть сериализован с помощью DataContractJsonSerializer, поскольку в иерархии типа повторяется элемент данных "{1}".
tr: '{1}' veri üyesi tür hiyerarşisinde yinelendiğinden, '{0}' veri anlaşması türü DataContractJsonSerializer ile serileştirilemiyor.
zh_hans: 数据协定类型“{0}”无法使用 DataContractJsonSerializer 进行序列化，因为数据成员“{1}”在其类型层次结构中重复。
zh_hant: 因為資料成員 '{1}' 在其類型階層中重複，所以無法使用 DataContractJsonSerializer 將資料合約類型 '{0}' 序列化。

# JsonEncodingNotSupported
source: Encoding not supported in JSON. UTF-8, Unicode, and BigEndianUnicode are the only supported encodings.
cs: Kódování není podporováno ve třídách JSON. Podporována jsou pouze kódování UTF-8, Unicode a BigEndianUnicode.
de: Die Codierung wird in JSON nicht unterstützt. Die einzigen unterstützten Codierungen sind UTF-8, Unicode und BigEndianUnicode.
es: Codificación no admitida en JSON. UTF-8, Unicode y BigEndianUnicode son las únicas codificaciones que se admiten.
fr: Encodage non pris en charge en JSON. UTF-8, Unicode et BigEndianUnicode sont les seuls encodages pris en charge.
it: La codifica non è supportata in JSON. Le uniche codifiche supportate sono UTF-8, Unicode e BigEndianUnicode.
ja: JSON でサポートされていないエンコードです。サポートされているエンコードは、UTF-8、Unicode、および BigEndianUnicode のみです。
ko: JSON에서는 인코딩이 지원되지 않습니다. UTF-8, 유니코드 및 BigEndianUnicode만이 지원되는 인코딩입니다.
pl: Kodowanie nie jest obsługiwane w formacie JSON. Obsługiwane są tylko kodowania UTF-8, Unicode i BigEndianUnicode.
pt_br: Não há suporte para codificação em JSON. UTF-8, Unicode e BigEndianUnicode são as únicas codificações com suporte.
ru: В JSON кодирование не поддерживается. Поддерживаются только кодировки UTF-8, Юникод и BigEndianUnicode.
tr: Kodlama JSON'de desteklenmiyor. Yalnızca UTF-8, Unicode ve BigEndianUnicode kodlamaları desteklenmektedir.
zh_hans: JSON 不支持编码。只有 UTF-8、Unicode 和 BigEndianUnicode 才是受支持的编码。
zh_hant: JSON 中不支援編碼。只支援 UTF-8、Unicode 與 BigEndianUnicode 等編碼。

# JsonEncounteredUnexpectedCharacter
source: Encountered unexpected character '{0}'.
cs: Byl zjištěn neočekávaný znak {0}.
de: Ein unerwartetes Zeichen "{0}" wurde gefunden.
es: Carácter inesperado "{0}".
fr: Caractère inattendu '{0}'.
it: Il carattere '{0}' rilevato è imprevisto.
ja: 予期しない文字 '{0}' が見つかりました。
ko: 예기치 않은 문자 '{0}'이(가) 발견되었습니다.
pl: Napotkano nieoczekiwany znak „{0}”.
pt_br: Caractere inesperado '{0}' encontrado.
ru: Обнаружен непредвиденный символ "{0}".
tr: Beklenmeyen '{0}' karakteriyle karşılaşıldı.
zh_hans: 遇到意外字符“{0}”。
zh_hant: 出現非預期的字元 '{0}'。

# JsonEndElementNoOpenNodes
source: No corresponding start element is open.
cs: Není otevřen žádný odpovídající počáteční element.
de: Es ist kein entsprechendes Startelement geöffnet.
es: No hay ningún elemento de inicio correspondiente abierto.
fr: Aucun élément de début correspondant n'est ouvert.
it: Non è aperto alcun elemento iniziale corrispondente.
ja: 対応する開始要素が開いていません。
ko: 열려 있는 해당 시작 요소가 없습니다.
pl: Żaden odpowiedni element początkowy nie jest otwarty.
pt_br: Nenhum elemento inicial correspondente está aberto.
ru: Ни один соответствующий начальный элемент не открыт.
tr: Karşılık gelen açık başlatma öğesi yok.
zh_hans: 未打开任何相应的开始元素。
zh_hant: 未開啟任何相對應的開始元素。

# JsonExpectedEncoding
source: The expected encoding '{0}' does not match the actual encoding '{1}'.
cs: Očekávané kódování {0} se neshoduje se skutečným kódováním {1}.
de: Die erwartete Codierung "{0}" entspricht nicht der tatsächlichen Codierung "{1}".
es: La codificación esperada "{0}" no coincide con la codificación real "{1}".
fr: L'encodage attendu '{0}' ne correspond pas à l'encodage réel '{1}'.
it: La codifica prevista '{0}' non corrisponde alla codifica effettiva '{1}'.
ja: 必要なエンコード '{0}' と実際のエンコード '{1}' が一致しません。
ko: 필요한 인코딩 '{0}'이(가) 실제 인코딩 '{1}'과(와) 일치하지 않습니다.
pl: Oczekiwane kodowanie „{0}” jest niezgodne z rzeczywistym kodowaniem „{1}”.
pt_br: A codificação esperada '{0}' não corresponde à codificação real '{1}'.
ru: Ожидаемая кодировка "{0}" не соответствует фактической кодировке "{1}".
tr: Beklenen '{0}' kodlaması gerçek '{1}' kodlamasıyla eşleşmiyor.
zh_hans: 所需编码“{0}”与实际编码“{1}”不匹配。
zh_hant: 應有編碼 '{0}' 與實際編碼 '{1}' 不符。

# JsonInvalidBytes
source: Invalid byte encoding.
cs: Neplatné kódování bajtů
de: Ungültige Bytecodierung.
es: Codificación de bytes no válida.
fr: Codage d'octet non valide.
it: La codifica byte non è valida.
ja: 無効なバイト エンコードです。
ko: 바이트 인코딩이 잘못되었습니다.
pl: Nieprawidłowe kodowanie bajtów.
pt_br: Codificação de bytes inválida.
ru: Недопустимое байтовое кодирование.
tr: Geçersiz bayt kodlaması.
zh_hans: 字节编码无效。
zh_hant: 位元組編碼無效。

# JsonInvalidDataTypeSpecifiedForServerType
source: Attempted to write an attribute '{0}'='{1}' after writing the attribute with local name '{2}'. The attribute with local name '{2}' is only valid with an attribute '{0}'='{3}'.
cs: Byl proveden pokus o zápis atributu {0}={1} po zápisu atributu s místním názvem {2}. Atribut s místním názvem {2} je platný pouze v kombinaci s atributem {0}={3}.
de: Es wurde versucht, ein Attribut "{0}"="{1}" zu schreiben, nachdem das Attribut mit dem lokalen Namen "{2}" geschrieben wurde. Das Attribut mit dem lokalen Namen "{2}" ist nur mit einem Attribut "{0}"="{3}" gültig.
es: Se intentó escribir un atributo "{0}"="{1}" después de escribir el atributo con el nombre local "{2}". El atributo con el nombre local "{2}" solo es válido con un atributo "{0}"="{3}".
fr: Tentative d'écriture d'un attribut '{0}'='{1}' après l'écriture de l'attribut comportant le nom local '{2}'. L'attribut comportant le nom local '{2}' n'est valide qu'avec un attribut '{0}'='{3}'.
it: Si è provato a scrivere un attributo '{0}'='{1}' dopo che è stato scritto l'attributo con nome locale '{2}'. L'attributo con nome locale '{2}' è valido solo con un attributo '{0}'='{3}'.
ja: ローカル名 '{2}' の属性の書き込み後に属性 '{0}'='{1}' を書き込もうとしました。ローカル名 '{2}' の属性は、属性 '{0}'='{3}' でのみ有効です。
ko: 로컬 이름이 '{2}'인 특성을 쓴 다음 '{0}'='{1}' 특성을 쓰려고 했습니다. 로컬 이름이 '{2}'인 특성은 '{0}'='{3}' 특성에만 사용할 수 있습니다.
pl: Podjęto próbę zapisania atrybutu „{0}”=„{1}” po zapisaniu atrybutu o nazwie lokalnej „{2}”. Atrybut o nazwie lokalnej „{2}” jest prawidłowy tylko z atrybutem „{0}”=„{3}”.
pt_br: Tentativa de gravar um atributo '{0}'='{1}' depois de gravá-lo com nome local '{2}'. O atributo com nome local '{2}' é válido apenas com um atributo '{0}'='{3}'.
ru: Попытка записи атрибута "{0}"="{1}" после записи атрибута с локальным именем "{2}". Атрибут с локальным именем "{2}" допустим только с атрибутом "{0}"="{3}".
tr: '{2}' yerel adlı öznitelik yazıldıktan sonra '{0}'='{1}' özniteliği yazılmaya çalışıldı. '{2}' yerel adlı öznitelik yalnızca '{0}'='{3}' özniteliğiyle geçerlidir.
zh_hans: 试图在写入本地名称为“{2}”的特性后写入“{0}”=“{1}”的特性。本地名称为“{2}”的特性只有与“{0}”=“{3}”的特性一起才有效。
zh_hant: 在寫入本機名稱 '{2}' 的屬性之後，嘗試寫入屬性 '{0}'='{1}'。本機名稱 '{2}' 的屬性只有在屬性 '{0}'='{3}' 時才有效。

# JsonInvalidDateTimeString
source: DateTime content '{0}' does not start with '{1}' and end with '{2}' as required for JSON.
cs: Obsah DateTime {0} nezačíná elementem {1} a nekončí elementem {2}, jak to vyžaduje standard JSON.
de: Der DateTime-Inhalt "{0}" beginnt nicht mit "{1}" und endet nicht mit "{2}", wie es für JSON erforderlich ist.
es: El contenido de DateTime "{0}" no comienza por "{1}" y termina por "{2}" como se requiere para JSON.
fr: Le contenu de DateTime '{0}' ne commence pas par '{1}' et finit par '{2}' comme le nécessite JSON.
it: Il contenuto DateTime '{0}' non inizia con '{1}' e termina con '{2}' come richiesto per JSON.
ja: DateTime コンテンツ '{0}' は、JSON の要求どおりに '{1}' で開始して '{2}' で終了しません。
ko: DateTime 콘텐츠 '{0}'이(가) JSON의 필요 조건인 '{1}'(으)로 시작하고 '{2}'(으)로 끝나지 않습니다.
pl: Zawartość w formacie DateTime „{0}” nie rozpoczyna się od elementu „{1}” i nie kończy się elementem „{2}”, co jest wymagane w notacji JSON.
pt_br: O conteúdo DateTime '{0}' não começa com '{1}' e termina com '{2}', como solicitado para JSON.
ru: Содержимое DateTime "{0}" не начинается с "{1}" и заканчивается "{2}", как необходимо для JSON.
tr: DateTime içeriği '{0}', JSON için gerektiği şekilde '{1}' ile başlayıp '{2}' ile sona ermiyor.
zh_hans: DateTime 内容“{0}”未按 JSON 的要求以“{1}”开始并以“{2}”结束。
zh_hant: DateTime 內容 '{0}' 未如 JSON 所要求，以 '{1}' 開頭並以 '{2}' 結尾。

# JsonInvalidFFFE
source: Characters with hexadecimal values 0xFFFE and 0xFFFF are not valid.
cs: Znaky s šestnáctkovými hodnotami 0xFFFE a 0xFFFF nejsou platné.
de: Zeichen mit den Hexadezimalwerten 0xFFFE und 0xFFFF sind ungültig.
es: Los caracteres con los valores hexadecimales 0xFFFE y 0xFFFF no son válidos.
fr: Les caractères avec les valeurs hexadécimales 0xFFFE et 0xFFFF sont non valides.
it: I caratteri con valori esadecimali 0xFFFE e 0xFFFF non sono validi.
ja: 16 進数の値を使用した文字 0xFFFE と 0xFFFF は無効です。
ko: 16진수 값 0xFFFE 및 0xFFFF를 가진 문자가 잘못되었습니다.
pl: Znaki o wartościach szesnastkowych 0xFFFE i 0xFFFF są nieprawidłowe.
pt_br: Caracteres com valores hexadecimais 0xFFFE e 0xFFFF são inválidos.
ru: Символы с шестнадцатеричными значениями 0xFFFE и 0xFFFF недопустимы.
tr: 0xFFFE ve 0xFFFF on altılı değerlerini içeren karakterler geçersiz.
zh_hans: 具有十六进制值 0xFFFE 和 0xFFFF 的字符无效。
zh_hant: 十六進位值為 0xFFFE 及 0xFFFF 的字元無效。

# JsonInvalidItemNameForArrayElement
source: Encountered unexpected element local name '{0}' for item in collection. '{1}' is the only valid local name for elements in a collection.
cs: Byl zjištěn neočekávaný místní název elementu {0} pro položku v kolekci. Pro elementy v kolekci lze jako jediný platný místní název použít název {1}.
de: Für ein Element in der Sammlung wurde der unerwartete lokale Elementname "{0}" gefunden. "{1}" ist der einzige gültige lokale Name für Elemente in einer Sammlung.
es: Nombre local de elemento inesperado "{0}" para el elemento de la colección. "{1}" es el único nombre local válido para los elementos de una colección.
fr: Nom local de l'élément '{0}' inattendu pour l'élément de la collection. '{1}' est le seul nom local valide pour les éléments d'une collection.
it: Il nome locale '{0}' rilevato per l'elemento della raccolta è imprevisto. '{1}' è l'unico nome locale valido per gli elementi di una raccolta.
ja: コレクションの項目に予期しない要素ローカル名 '{0}' が見つかりました。コレクションの要素に有効なローカル名は '{1}' のみです。
ko: 컬렉션의 항목에 대해 예기치 않은 요소 로컬 이름 '{0}'이(가) 발견되었습니다. 컬렉션의 요소에 대해 유효한 로컬 이름은 '{1}'뿐입니다.
pl: Napotkano nieoczekiwaną nazwę lokalną elementu „{0}” dla elementu w kolekcji. Jedyną prawidłową nazwą lokalną dla elementów w kolekcji jest „{1}”.
pt_br: Encontrado um nome local do elemento inesperado '{0}' para o item na coleção. '{1}' é o único nome local válido para elementos em uma coleção.
ru: Обнаружено непредвиденное локальное имя "{0}" элемента коллекции. "{1}" представляет собой единственное допустимое локальное имя элементов коллекции.
tr: Koleksiyonda öğe için beklenmeyen '{0}' öğe yerel adıyla karşılaşıldı. '{1}', bir koleksiyondaki öğeler için geçerli tek yerel addır.
zh_hans: 集合中的项遇到意外的元素本地名称“{0}”。“{1}”是集合元素的唯一有效本地名称。
zh_hant: 集合中的項目出現了未預期的元素本機名稱 '{0}'。'{1}' 是唯一適用於集合中元素的有效本機名稱。

# JsonInvalidLocalNameEmpty
source: The empty string is not a valid local name in JSON.
cs: Podle standardu JSON není prázdný řetězec platným místním názvem.
de: Die leere Zeichenfolge ist kein gültiger lokaler Name in JSON.
es: La cadena vacía no es un nombre local válido en JSON.
fr: Une chaîne vide n'est pas un nom local valide en JSON.
it: La stringa vuota non è un nome locale valido in JSON.
ja: 空の文字列は、JSON の有効なローカル名ではありません。
ko: 빈 문자열은 JSON에서 유효한 로컬 이름이 아닙니다.
pl: Pusty ciąg nie jest prawidłową nazwą lokalną w notacji JSON.
pt_br: A cadeia de caracteres vazia não é um nome de local válido no JSON.
ru: Пустая строка не является допустимым локальным именем в JSON.
tr: Boş dize JSON içinde geçerli bir yerel ad değil.
zh_hans: 在 JSON 中空字符串不是有效的本地名称。
zh_hant: 空字串在 JSON 中不是有效的本機名稱。

# JsonInvalidMethodBetweenStartEndAttribute
source: Cannot write content while an attribute is being written.
cs: Současně se zápisem atributu nelze zapisovat obsah.
de: Während des Schreibens eines Attributs kann kein Inhalt geschrieben werden.
es: No se puede escribir contenido mientras se escribe un atributo.
fr: Impossible d'écrire un contenu quand un attribut est en cours d'écriture.
it: Non è possibile scrivere il contenuto durante la scrittura di un attributo.
ja: 属性の書き込み中は、コンテンツを書き込むことができません。
ko: 특성을 쓰는 동안에는 콘텐츠를 쓸 수 없습니다.
pl: Nie można zapisać zawartości, gdy trwa zapisywanie atrybutu.
pt_br: Não é possível gravar o conteúdo enquanto um atributo é gravado.
ru: Невозможно записать содержимое во время записи атрибута.
tr: Bir öznitelik yazılırken içerik yazılmaz.
zh_hans: 写入特性时无法写入内容。
zh_hant: 寫入屬性的同時，無法寫入內容。

# JsonInvalidRootElementName
source: Encountered invalid root element name '{0}'. '{1}' is the only allowed root element name.
cs: Byl zjištěn neplatný kořenový element s názvem {0}. Jediným povoleným názvem kořenového elementu je název {1}.
de: Ein ungültiger Stammelementname "{0}" wurde gefunden. "{1}" ist der einzige zulässige Stammelementname.
es: Nombre de elemento raíz no válido "{0}". "{1}" es el único nombre de elemento raíz permitido.
fr: Nom de l'élément racine '{0}' non valide. '{1}' est le seul nom autorisé pour l'élément racine.
it: Il nome '{0}' dell'elemento radice rilevato non è valido. '{1}' è l'unico nome dell'elemento radice consentito.
ja: 無効なルート要素名 '{0}' が見つかりました。ルート要素名に許可されているのは、'{1}' のみです。
ko: 잘못된 루트 요소 이름 '{0}'이(가) 발견되었습니다. 루트 요소 이름으로 허용되는 것은 '{1}'뿐입니다.
pl: Napotkano nieprawidłową nazwę elementu głównego „{0}”. Jedyną dozwoloną nazwą elementu głównego jest „{1}”.
pt_br: Nome de elemento raiz inválido '{0}' encontrado. '{1}' é permitido apenas para nome de elemento raiz.
ru: Обнаружено недопустимое имя корневого элемента "{0}". "{1}" является единственным допустимым именем корневого элемента.
tr: Geçersiz kök öğe adı '{0}' ile karşılaşıldı. '{1}', izin verilen tek kök öğe adıdır.
zh_hans: 遇到无效的根元素名称“{0}”。“{1}”是唯一允许的根元素名称。
zh_hant: 出現無效的根項目名稱 '{0}'。'{1}' 是唯一允許的根項目名稱。

# JsonInvalidStartElementCall
source: WriteStartElement can be called at only the start of a document or immediately after calling WriteEndElement.
cs: Metodu WriteStartElement lze volat pouze na začátku dokumentu nebo bezprostředně po volání metody WriteEndElement.
de: WriteStartElement kann nur am Anfang eines Dokuments oder sofort nach dem Aufrufen von WriteEndElement abgebrochen werden.
es: WriteStartElement solo se puede llamar al inicio de un documento o inmediatamente después de llamar a WriteEndElement.
fr: L'élément WriteStartElement peut être appelé uniquement au début d'un document ou immédiatement après avoir appelé l'élément WriteEndElement.
it: WriteStartElement può essere chiamato solo all'inizio di un documento o subito dopo la chiamata di WriteEndElement.
ja: WriteStartElement は、ドキュメントの開始時、または WriteEndElement の呼び出し直後にのみ呼び出せます。
ko: WriteStartElement는 문서를 시작할 때 또는 WriteEndElement를 호출한 직후에만 호출할 수 있습니다.
pl: Metodę WriteStartElement można wywołać tylko przy uruchamianiu dokumentu lub natychmiast po wywołaniu metody WriteEndElement.
pt_br: WriteStartElement pode ser chamado apenas no início de um documento ou imediatamente após chamar WriteEndElement.
ru: Метод WriteStartElement может быть вызван только в начале документа или сразу после вызова метода WriteEndElement.
tr: WriteStartElement yalnızca bir belgenin başlangıcında veya WriteEndElement çağrıldıktan hemen sonra çağrılabilir.
zh_hans: WriteStartElement 的调用位置只能是在文档开始处，或者是紧跟在 WriteEndElement 调用之后。
zh_hant: 唯有在文件開頭才能呼叫 WriteStartElement，或者在呼叫 WriteEndElement 之後立即呼叫 WriteStartElement。

# JsonInvalidWriteStat
source: '{0}' cannot be called while WriteState is '{1}'.
cs: Dokud je stav WriteState nastaven na hodnotu {1}, metodu {0} nelze zavolat.
de: Solange WriteState den Wert "{1}" aufweist, kann "{0}" nicht aufgerufen werden.
es: No se puede llamar a "{0}" mientras el estado de WriteState sea "{1}".
fr: Impossible d'appeler '{0}' tant que la valeur de WriteState est '{1}'.
it: Non è possibile chiamare '{0}' mentre WriteState è '{1}'.
ja: WriteState が '{1}' である間は '{0}' を呼び出すことはできません。
ko: WriteState가 '{1}'인 동안에는 '{0}'을(를) 호출할 수 없습니다.
pl: Nie można wywołać metody „{0}”, gdy stan metody WriteState ma wartość „{1}”.
pt_br: Não é possível chamar '{0}' enquanto WriteState for '{1}'.
ru: "{0}" не может быть вызван, если WriteState имеет значение "{1}".
tr: WriteState '{1}' iken '{0}' çağrılamaz.
zh_hans: 当 WriteState 为“{1}”时，不能调用“{0}”。
zh_hant: 當 WriteState 為 '{1}' 時，無法呼叫 '{0}'。

# JsonInvalidWriteState
source: '{0}' cannot be called while WriteState is '{1}'.
cs: Dokud je stav WriteState nastaven na hodnotu {1}, metodu {0} nelze zavolat.
de: Solange WriteState den Wert "{1}" aufweist, kann "{0}" nicht aufgerufen werden.
es: No se puede llamar a "{0}" mientras el estado de WriteState sea "{1}".
fr: Impossible d'appeler '{0}' tant que la valeur de WriteState est '{1}'.
it: Non è possibile chiamare '{0}' mentre WriteState è '{1}'.
ja: WriteState が '{1}' である間は '{0}' を呼び出すことはできません。
ko: WriteState가 '{1}'인 동안에는 '{0}'을(를) 호출할 수 없습니다.
pl: Nie można wywołać metody „{0}”, gdy stan metody WriteState ma wartość „{1}”.
pt_br: Não é possível chamar '{0}' enquanto WriteState for '{1}'.
ru: "{0}" не может быть вызван, если WriteState имеет значение "{1}".
tr: WriteState '{1}' iken '{0}' çağrılamaz.
zh_hans: 当 WriteState 为“{1}”时，不能调用“{0}”。
zh_hant: 當 WriteState 為 '{1}' 時，無法呼叫 '{0}'。

# JsonMethodNotSupported
source: This XmlDictionaryWriter implementation does not support the '{0}' method.
cs: Tato implementace třídy XmlDictionaryWriter nepodporuje metodu {0}.
de: Diese XmlDictionaryWriter-Implementierung unterstützt die {0}-Methode nicht.
es: Esta implementación de XmlDictionaryWriter no admite el método "{0}".
fr: L'implémentation de XmlDictionaryWriter ne prend pas en charge la méthode '{0}'.
it: Questa implementazione di XmlDictionaryWriter non supporta il metodo '{0}'.
ja: この XmlDictionaryWriter の実装は、'{0}' メソッドをサポートしていません。
ko: 이 XmlDictionaryWriter 구현에서는 '{0}' 메서드를 사용할 수 없습니다.
pl: Ta implementacja obiektu XmlDictionaryWriter nie obsługuje metody „{0}”.
pt_br: Essa implementação XmlDictionaryWriter não dá suporte ao método '{0}'.
ru: Эта реализация XmlDictionaryWriter не поддерживает метод "{0}".
tr: Bu XmlDictionaryWriter uygulaması '{0}' metodunu desteklemiyor.
zh_hans: 此 XmlDictionaryWriter 实现不支持“{0}”方法。
zh_hant: 這個 XmlDictionaryWriter 實作不支援 '{0}' 方法。

# JsonMultipleRootElementsNotAllowedOnWriter
source: This XmlDictionaryWriter implementation does not support the writing of multiple root elements.
cs: Tato implementace XmlDictionaryWriter nepodporuje zápis několika kořenových elementů.
de: Diese XmlDictionaryWriter-Implementierung unterstützt nicht das Schreiben mehrerer Stammelemente.
es: Esta implementación de XmlDictionaryWriter no admite la escritura de múltiples elementos raíz.
fr: Cette implémentation de XmlDictionaryWriter ne prend pas en charge l'écriture de multiples éléments racine.
it: Questa implementazione di XmlDictionaryWriter non supporta la scrittura di più elementi radice.
ja: この XmlDictionaryWriter の実装は、複数のルート要素の書き込みをサポートしていません。
ko: 이 XmlDictionaryWriter 구현에서는 루트 요소를 여러 개 쓸 수 없습니다.
pl: Ta implementacja obiektu XmlDictionaryWriter nie obsługuje zapisywania wielu elementów głównych.
pt_br: Essa implementação XmlDictionaryWriter não dá suporte à gravação de diversos elementos raiz.
ru: Эта реализация XmlDictionaryWriter не поддерживает запись нескольких корневых элементов.
tr: Bu XmlDictionaryWriter uygulaması birden çok kök öğenin yazılmasını desteklemiyor.
zh_hans: 此 XmlDictionaryWriter 实现不支持写入多个根元素。
zh_hant: 這個 XmlDictionaryWriter 實作不支援寫入多重根項目。
