Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlFullStartElementExpected
source: Non-empty start element expected. Found {0}.
cs: Byl očekáván neprázdný počáteční element. Byl nalezen element {0}.
de: Es wurde ein nicht leeres Startelement erwartet. Gefunden wurde {0}.
es: Se esperaba un elemento de inicio no vacío. Se encontró {0}.
fr: Élément de début non vide attendu. Trouvé {0}.
it: È previsto un elemento iniziale non vuoto, ma è stato trovato {0}.
ja: 空でない開始要素が必要です。{0} が見つかりました。
ko: 비어 있지 않은 시작 요소가 필요한데 {0}을(를) 찾았습니다.
pl: Oczekiwano niepustego elementu początkowego. Znaleziono {0}.
pt_br: Espera-se elemento inicial não vazio. Encontrado {0}.
ru: Ожидался непустой начальный элемент. Найден {0}.
tr: Boş olmayan başlangıç öğesi bekleniyordu. Bulunan: {0}.
zh_hans: 需要非空开始元素。找到 {0}。
zh_hant: 需要非空白的開始元素，但找到 {0}。

# XmlFullStartElementLocalNameNsExpected
source: Non-empty start element '{0}' from namespace '{1}' expected. Found {2}.
cs: Byl očekáván neprázdný počáteční element {0} z oboru názvů {1}. Byl nalezen element {2}.
de: Es wurde das nicht leere Startelement "{0}" aus dem Namespace "{1}" erwartet. Gefunden wurde {2}.
es: Se esperaba un elemento de inicio no vacío "{0}" del espacio de nombres "{1}". Se encontró {2}.
fr: Élément de début non vide '{0}' provenant de l'espace de noms '{1}' attendu. Trouvé {2}.
it: È previsto un elemento iniziale non vuoto '{0}' dello spazio dei nomi '{1}', ma è stato trovato {2}.
ja: 名前空間 '{1}' の空でない開始要素 '{0}' が必要です。見つかったのは {2} でした。
ko: 네임스페이스 '{1}'의 비어 있지 않은 시작 요소 '{0}'이(가) 필요한데 {2}을(를) 찾았습니다.
pl: Oczekiwano niepustego elementu początkowego „{0}” z przestrzeni nazw „{1}”. Znaleziono {2}.
pt_br: Espera-se elemento inicial não vazio '{0}' do namespace '{1}'. Encontrado {2}.
ru: Ожидался непустой начальный элемент "{0}" из пространства имен "{1}". Найден "{2}".
tr: '{1}' ad alanından boş olmayan başlangıç öğesi '{0}' bekleniyordu. Bulunan: {2}.
zh_hans: 需要命名空间“{1}”中的非空开始元素“{0}”。找到 {2}。
zh_hant: 需要來自命名空間 '{1}' 的非空白開始元素 '{0}'，但找到 {2}。

# XmlFullStartElementNameExpected
source: Non-empty start element '{0}' expected. Found {1}.
cs: Byl očekáván neprázdný počáteční element {0}. Byl nalezen element {1}.
de: Es wurde das nicht leere Startelement "{0}" erwartet. Gefunden wurde {1}.
es: Se esperaba un elemento de inicio no vacío "{0}". Se encontró {1}.
fr: Élément de début non vide '{0}' attendu. Trouvé {1}.
it: È previsto un elemento iniziale non vuoto '{0}', ma è stato trovato {1}.
ja: 空でない開始要素 '{0}' が必要です。見つかったのは {1} でした。
ko: 비어 있지 않은 시작 요소 '{0}'이(가) 필요한데 {1}을(를) 찾았습니다.
pl: Oczekiwano niepustego elementu początkowego „{0}”. Znaleziono {1}.
pt_br: Espera-se elemento inicial não vazio '{0}'. Encontrado {1}.
ru: Ожидался непустой начальный элемент "{0}". Найден {1}.
tr: Boş olmayan başlangıç öğesi '{0}' bekleniyordu. Bulunan: {1}.
zh_hans: 需要非空开始元素“{0}”。找到 {1}。
zh_hant: 需要非空白的開始元素 '{0}'，但找到 '{1}'。

# XmlIDDefined
source: ID already defined.
cs: ID je už definované.
de: Die ID ist bereits definiert.
es: Id. ya definido.
fr: ID déjà défini.
it: L'ID è già definito.
ja: ID は既に定義されています。
ko: ID가 이미 정의되었습니다.
pl: Identyfikator został już zdefiniowany.
pt_br: ID já definida.
ru: ИД уже определен.
tr: Kimlik zaten tanımlanmış.
zh_hans: 已定义 ID。
zh_hant: 已定義識別碼。

# XmlIllegalOutsideRoot
source: Text cannot be written outside the root element.
cs: Text nelze zapsat mimo kořenový element.
de: Text kann nicht außerhalb des Stammelements geschrieben werden.
es: No se puede escribir texto fuera del elemento raíz.
fr: Impossible d'écrire du texte en dehors de l'élément racine.
it: Non è possibile scrivere testo all'esterno dell'elemento radice.
ja: ルート要素の外側にテキストを書き込むことはできません。
ko: 루트 요소 외부에 텍스트를 쓸 수 없습니다.
pl: Tekst nie może być zapisany poza elementem głównym.
pt_br: O texto não pode ser gravado fora do elemento raiz.
ru: Текст не может быть записан вне корневого элемента.
tr: Metin, kök öğenin dışına yazılamaz.
zh_hans: 无法在根元素之外编写文本。
zh_hant: 不可以在根項目之外撰寫文字。

# XmlInvalidBase64Length
source: Base64 sequence length ({0}) not valid. Must be a multiple of 4.
cs: Délka sekvence Base64 ({0}) není platná. Musí být násobkem 4.
de: Ungültige Base64-Sequenzlänge {0}. Der Wert muss ein Vielfaches von 4 sein.
es: La longitud de la secuencia Base64 ({0}) no es válida. Debe ser un múltiplo de 4.
fr: Longueur de la séquence Base64 ({0}) non valide. Elle doit être un multiple de 4.
it: La lunghezza della sequenza Base64 non è valida ({0}). Deve essere un multiplo di 4.
ja: Base64 シーケンスの長さ ({0}) が無効です。4 の倍数である必要があります。
ko: Base64 시퀀스 길이({0})가 잘못되었습니다. 4의 배수여야 합니다.
pl: Długość sekwencji Base64 ({0}) jest nieprawidłowa. Musi być wielokrotnością liczby 4.
pt_br: Comprimento da sequência de Base64 ({0}) inválido. Deve ser um múltiplo de 4.
ru: Недопустимая для Base64 длина последовательности ({0}). Она должна быть кратна 4.
tr: Base64 sıra uzunluğu ({0}) geçerli değil. Değer, 4'ün katı olmalıdır.
zh_hans: Base64 序列长度({0})无效。必须为 4 的倍数。
zh_hant: Base64 序列長度 ({0}) 無效。必須是 4 的倍數。

# XmlInvalidBase64Sequence
source: The characters '{0}' at offset {1} are not a valid Base64 sequence.
cs: Znaky {0} u odsazení {1} nejsou platná sekvence Base64.
de: Die Zeichen "{0}" bei Offset {1} stellen keine gültige Base64-Sequenz dar.
es: Los caracteres "{0}" del desplazamiento {1} no son una secuencia Base64 válida.
fr: Les caractères '{0}' au décalage {1} ne sont pas une séquence Base64 valide.
it: I caratteri '{0}' alla posizione di offset {1} non costituiscono una sequenza Base64 valida.
ja: オフセット {1} における文字 '{0}' は、有効な Base64 シーケンスではありません。
ko: 오프셋 {1}의 '{0}' 문자가 유효한 Base64 시퀀스가 아닙니다.
pl: Znaki „{0}” w przesunięciu {1} nie są prawidłową sekwencją Base64.
pt_br: Os caracteres '{0}' no deslocamento {1} não são uma sequência de Base64 válida.
ru: Символы "{0}" в смещении {1} не являются допустимой для Base64 последовательностью.
tr: '{1}' uzaklığındaki {0} karakter, geçerli bir Base64 sırası değildir.
zh_hans: 偏移量 {1} 上的字符“{0}”不是有效的 Base64 序列。
zh_hant: 位於位移 {1} 的字元 '{0}' 不是有效的 Base64 序列。

# XmlInvalidBinHexLength
source: BinHex sequence length ({0}) not valid. Must be a multiple of 2.
cs: Délka sekvence BinHex ({0}) není platná. Musí být násobkem 2.
de: Ungültige BinHex-Sequenzlänge {0}. Der Wert muss ein Vielfaches von 2 sein.
es: La longitud de la secuencia BinHex ({0}) no es válida. Debe ser un múltiplo de 2.
fr: Longueur de la séquence BinHex ({0}) non valide. Elle doit être un multiple de 2.
it: La lunghezza della sequenza BinHex non è valida ({0}). Deve essere un multiplo di 2.
ja: BinHex シーケンスの長さ ({0}) が無効です。2 の倍数である必要があります。
ko: BinHex 시퀀스 길이({0})가 잘못되었습니다. 2의 배수여야 합니다.
pl: Długość sekwencji BinHex ({0}) jest nieprawidłowa. Musi być wielokrotnością liczby 2.
pt_br: Comprimento da sequência BinHex ({0}) inválido. Deve ser um múltiplo de 2.
ru: Недопустимая для BinHex длина последовательности ({0}). Она должна быть кратна 2.
tr: BinHex sıra uzunluğu ({0}) geçerli değil. Değer, 2'nin katı olmalıdır.
zh_hans: BinHex 序列长度({0})无效。必须为 2 的倍数。
zh_hant: BinHex 序列長度 ({0}) 無效。必須是 2 的倍數。

# XmlInvalidBinHexSequence
source: The characters '{0}' at offset {1} are not a valid BinHex sequence.
cs: Znaky {0} u odsazení {1} nejsou platná sekvence BinHex.
de: Die Zeichen "{0}" bei Offset {1} stellen keine gültige BinHex-Sequenz dar.
es: Los caracteres "{0}" del desplazamiento {1} no son una secuencia BinHex válida.
fr: Les caractères '{0}' au décalage {1} ne sont pas une séquence BinHex valide.
it: I caratteri '{0}' alla posizione di offset {1} non costituiscono una sequenza BinHex valida.
ja: オフセット {1} における文字 '{0}' は、有効な BinHex シーケンスではありません。
ko: 오프셋 {1}의 '{0}' 문자가 유효한 BinHex 시퀀스가 아닙니다.
pl: Znaki „{0}” w przesunięciu {1} nie są prawidłową sekwencją BinHex.
pt_br: Os caracteres '{0}' no deslocamento {1} não são uma sequência BinHex válida.
ru: Символы "{0}" в смещении {1} не являются допустимой для BinHex последовательностью.
tr: '{1}' uzaklığındaki {0} karakter, geçerli bir BinHex sırası değildir.
zh_hans: 偏移量 {1} 上的字符“{0}”是无效的 BinHex 序列。
zh_hant: 位於位移 {1} 的字元 '{0}' 不是有效的 BinHex 序列。

# XmlInvalidBytes
source: Invalid byte encoding.
cs: Neplatné kódování bajtů
de: Ungültige Bytecodierung.
es: Codificación de bytes no válida.
fr: Codage d'octet non valide.
it: La codifica byte non è valida.
ja: 無効なバイト エンコードです。
ko: 바이트 인코딩이 잘못되었습니다.
pl: Nieprawidłowe kodowanie bajtów.
pt_br: Codificação de bytes inválida.
ru: Недопустимое байтовое кодирование.
tr: Geçersiz bayt kodlaması.
zh_hans: 字节编码无效。
zh_hant: 位元組編碼無效。

# XmlInvalidCharRef
source: Character reference not valid.
cs: Odkaz znaků není platný.
de: Ungültiger Zeichenverweis.
es: Referencia de caracteres no válida.
fr: Référence de caractère non valide.
it: Il riferimento al carattere non è valido.
ja: 文字参照が無効です。
ko: 문자 참조가 잘못되었습니다.
pl: Nieprawidłowe odwołanie do znaku.
pt_br: Referência de caractere inválida.
ru: Недопустимая ссылка на символ.
tr: Karakter başvurusu geçerli değil.
zh_hans: 字符引用无效。
zh_hant: 字元參考無效。

# XmlInvalidCommentChars
source: XML comments cannot contain '--' or end with '-'.
cs: Komentáře XML nesmí obsahovat znak -- nebo končit znakem -.
de: XML-Kommentare dürfen nicht "--" enthalten oder mit "-" enden.
es: Los comentarios XML no pueden contener "--" ni terminar en "-".
fr: Les commentaires XML ne peuvent pas contenir '--' ni finir par '-'.
it: I commenti XML non possono contenere '--' o terminare con '-'.
ja: XML のコメントに '--' を含めることはできません。また、コメントの最後の文字に '-' を使用することはできません。
ko: XML 주석이 '--'을 포함하거나 '-'으로 끝날 수 없습니다.
pl: Komentarz XML nie może zawierać znaków „--” ani kończyć się znakiem „-”.
pt_br: Os comentários XML não podem conter '--' nem terminar com '-'.
ru: Комментарии XML не могут содержать комбинацию "--" или оканчиваться символом "-".
tr: XML açıklamaları '--' içeremez ya da '-' ile bitemez.
zh_hans: XML 注释不能包含 "--" 或以 "-" 结尾。
zh_hant: XML 註解不可以包含 '--' 或以 '-' 結尾。

# XmlInvalidConversion
source: The value '{0}' cannot be parsed as the type '{1}'.
cs: Hodnotu {0} nelze parsovat jako typ {1}.
de: Der Wert "{0}" kann nicht als Typ "{1}" analysiert werden.
es: El valor "{0}" no se puede analizar como el tipo "{1}".
fr: Impossible d'analyser la valeur '{0}' en tant que type '{1}'.
it: Il valore '{0}' non può essere analizzato come tipo '{1}'.
ja: 値 '{0}' を型 '{1}' として解析できません。
ko: '{0}' 값을 '{1}' 형식으로 구문 분석할 수 없습니다.
pl: Wartość „{0}” nie może być analizowana jako typ „{1}”.
pt_br: O valor '{0}' não pode ser analisado como o tipo '{1}'.
ru: Значение "{0}" не может интерпретироваться как тип "{1}".
tr: '{0}' değeri, '{1}' türü olarak ayrıştırılamaz.
zh_hans: 不能将值“{0}”作为类型“{1}”来分析。
zh_hant: 值 '{0}' 無法剖析為類型 '{1}'。

# XmlInvalidConversionWithoutValue
source: The value cannot be parsed as the type '{0}'.
cs: Hodnotu nelze parsovat jako typ {0}.
de: Der Wert kann nicht als Typ "{0}" analysiert werden.
es: El valor no se puede analizar como tipo "{0}".
fr: Impossible d'analyser la valeur en tant que type '{0}'.
it: Non è possibile analizzare il valore come tipo '{0}'.
ja: 値を型 '{0}' として解析できません。
ko: 값을 '{0}' 형식으로 구문 분석할 수 없습니다.
pl: Wartość nie może być analizowana jako typ „{0}”.
pt_br: O valor não pode ser analisado como o tipo '{0}'.
ru: Значение не может интерпретироваться как тип "{0}".
tr: Değer '{0}' türü olarak ayrıştırılamaz.
zh_hans: 无法将该值作为类型“{0}”来分析。
zh_hant: 無法將該值剖析為類型 '{0}'。

# XmlInvalidDeclaration
source: XML declaration can only be written at the beginning of the document.
cs: Deklaraci XML lze zapsat jen na začátku dokumentu.
de: Die XML-Deklaration kann nur am Anfang des Dokuments geschrieben werden.
es: La declaración XML solo se puede escribir al comienzo del documento.
fr: Une déclaration XML ne peut être écrite qu'au début du document.
it: La dichiarazione XML può essere scritta solo all'inizio del documento.
ja: XML 宣言を記述できるのはドキュメントの先頭のみです。
ko: XML 선언은 문서의 시작 부분에만 쓸 수 있습니다.
pl: Deklarację XML można zapisać tylko na początku dokumentu.
pt_br: A declaração XML pode ser gravada apenas no início do documento.
ru: XML-объявление может быть записано только в начале документа.
tr: XML bildirimi, yalnızca belgenin başında yazılabilir.
zh_hans: 只能在文档的开头写入 XML 声明。
zh_hant: XML 宣告只可寫入文件開頭。

# XmlInvalidDepth
source: Cannot call '{0}' while Depth is '{1}'.
cs: Nelze volat {0}, když je Hloubka {1}.
de: Ein Aufruf von "{0}" ist nicht möglich, solange Depth gleich "{1}" ist.
es: No se puede realizar la llamada a "{0}" mientras la profundidad sea "{1}".
fr: Impossible d'appeler '{0}' tant que la profondeur est '{1}'.
it: Non è possibile chiamare '{0}' mentre Depth è '{1}'.
ja: 深さが '{1}' の間は、'{0}' を呼び出すことはできません。
ko: Depth가 '{1}'인 동안에는 '{0}'을(를) 호출할 수 없습니다.
pl: Nie można wywołać obiektu „{0}”, gdy głębokość ma wartość „{1}”.
pt_br: Não é possível chamar '{0}' enquanto Profundidade é '{1}'.
ru: Не удается вызвать "{0}", пока параметр Depth имеет значение "{1}".
tr: Depth değeri '{1}' iken '{0}' çağrılamıyor.
zh_hans: 深度为“{1}”时，无法调用“{0}”。
zh_hant: 深度為 '{1}' 時無法呼叫 '{0}'。

# XmlInvalidEncoding
source: XML encoding must be 'UTF-8'.
cs: Kódování XML musí být UTF-8.
de: Als XML-Codierung muss "UTF-8" verwendet werden.
es: La codificación XML debe ser "UTF-8".
fr: L'encodage XML doit être 'UTF-8'.
it: La codifica XML deve essere 'UTF-8'.
ja: XML エンコードは 'UTF-8' である必要があります。
ko: XML 인코딩은 'UTF-8'이어야 합니다.
pl: Kodowanie XML musi być w standardzie „UTF-8”.
pt_br: A codificação XML deve ser 'UTF-8'.
ru: Кодировка XML должна быть "UTF-8".
tr: XML kodlaması 'UTF-8' olmalıdır.
zh_hans: XML 编码必须为 "UTF-8"。
zh_hant: XML 編碼必須為 'UTF-8'。

# XmlInvalidFFFE
source: Characters with hexadecimal values 0xFFFE and 0xFFFF are not valid.
cs: Znaky s šestnáctkovými hodnotami 0xFFFE a 0xFFFF nejsou platné.
de: Zeichen mit den Hexadezimalwerten 0xFFFE und 0xFFFF sind ungültig.
es: Los caracteres con los valores hexadecimales 0xFFFE y 0xFFFF no son válidos.
fr: Les caractères avec les valeurs hexadécimales 0xFFFE et 0xFFFF sont non valides.
it: I caratteri con valori esadecimali 0xFFFE e 0xFFFF non sono validi.
ja: 16 進数の値を使用した文字 0xFFFE と 0xFFFF は無効です。
ko: 16진수 값 0xFFFE 및 0xFFFF를 가진 문자가 잘못되었습니다.
pl: Znaki o wartościach szesnastkowych 0xFFFE i 0xFFFF są nieprawidłowe.
pt_br: Caracteres com valores hexadecimais 0xFFFE e 0xFFFF são inválidos.
ru: Символы с шестнадцатеричными значениями 0xFFFE и 0xFFFF недопустимы.
tr: 0xFFFE ve 0xFFFF on altılı değerlerini içeren karakterler geçersiz.
zh_hans: 具有十六进制值 0xFFFE 和 0xFFFF 的字符无效。
zh_hant: 十六進位值為 0xFFFE 及 0xFFFF 的字元無效。

# XmlInvalidFormat
source: The input source is not correctly formatted.
cs: Vstupní zdroj není správně formátovaný.
de: Die Eingabequelle ist nicht korrekt formatiert.
es: El origen de la entrada no tiene un formato correcto.
fr: Formatage de la source d'entrée incorrect.
it: L'origine di input non è formattata correttamente.
ja: 入力ソースが正しくフォーマットされていません。
ko: 입력 소스의 형식이 올바르지 않습니다.
pl: Źródło danych wejściowych zostało nieprawidłowo sformatowane.
pt_br: A fonte de entrada não está formatada corretamente.
ru: Входной источник неправильно отформатирован.
tr: Giriş kaynağı doğru biçimlendirilmemiş.
zh_hans: 未正确设置输入源格式。
zh_hant: 輸入來源的格式不正確。

# XmlInvalidHighSurrogate
source: High surrogate char '0x{0}' not valid. High surrogate chars range from 0xD800 to 0xDBFF.
cs: Vysoký znak nahrazení 0x{0} není platný. Vysoké znaky nahrazení jsou v rozsahu 0xD800 až 0xDBFF.
de: "0x{0}" ist kein gültiges hohes Ersatzzeichen. Der gültige Bereich für hohe Ersatzzeichen liegt zwischen 0xD800 und 0xDBFF.
es: El carácter suplente superior "0x{0}" no es válido. Los caracteres suplentes superiores deben estar dentro del intervalo de 0xD800 a 0xDBFF.
fr: Caractère de substitution étendu '0x{0}' non valide. Les caractères de substitution étendus sont compris dans la plage allant de 0xD800 à 0xDBFF.
it: Il carattere surrogato alto '0x{0}' non è valido. I caratteri surrogati alti devono essere compresi tra 0xD800 e 0xDBFF.
ja: 上位サロゲート文字 '0x{0}' は無効です。上位サロゲート文字は 0xD800 から 0xDBFF の範囲です。
ko: High surrogate char '0x{0}'이(가) 잘못되었습니다. High surrogate char의 범위는 0xD800 - 0xDBFF입니다.
pl: Nieprawidłowa wyższa część znaku dwuskładnikowego „0x{0}”. Wyższa część znaku dwuskładnikowego powinna być z zakresu od 0xD800 do 0xDBFF.
pt_br: Caractere alternativo alto '0x{0}' inválido. Os caracteres alternativos altos variam de 0xD800 a 0xDBFF.
ru: Старший символ-заместитель "0x{0}" недопустим. Диапазон старших символов-заместителей — от 0xD800 до 0xDBFF.
tr: Yüksek temsil karakteri '0x{0}' geçerli değil. Bu karakter aralığı 0xD800 ile 0xDBFF arasındadır.
zh_hans: 高代理项字符型 "0x{0}" 无效。高代理项字符型的范围为 0xD800 到 0xDBFF。
zh_hant: 高代理字元 '0x{0}' 無效。高代理字元的範圍介於 0xD800 到 0xDBFF 之間。

# XmlInvalidID
source: ID must be >= 0.
cs: Identifikátor musí být >= 0.
de: Die ID muss größer oder gleich 0 sein.
es: El id. debe ser >= 0.
fr: L'ID doit être >= 0.
it: Il valore di ID deve essere maggiore o uguale a 0.
ja: ID は、0 以上である必要があります。
ko: ID는 >= 0이어야 합니다.
pl: Identyfikator musi być >= 0.
pt_br: A ID deve ser >= 0.
ru: Идентификатор должен быть >= 0.
tr: ID >= 0 olmalı.
zh_hans: ID 必须大于等于 0。
zh_hant: 識別碼必須 >= 0。

# XmlInvalidLowSurrogate
source: Low surrogate char '0x{0}' not valid. Low surrogate chars range from 0xDC00 to 0xDFFF.
cs: Nízký znak nahrazení 0x{0} není platný. Nízké znaky nahrazení jsou v rozsahu 0xDC00 až 0xDFFF.
de: "0x{0}" ist kein gültiges niedriges Ersatzzeichen. Der gültige Bereich für niedrige Ersatzzeichen liegt zwischen 0xDC00 und 0xDFFF.
es: El carácter suplente inferior "0x{0}" no es válido. Los caracteres suplentes inferiores deben estar dentro del intervalo de 0xDC00 a 0xDFFF.
fr: Caractère de substitution faible '0x{0}' non valide. Les caractères de substitution faibles sont compris dans la plage allant de 0xDC00 à 0xDFFF.
it: Il carattere surrogato basso '0x{0}' non è valido. I caratteri surrogati bassi devono essere compresi tra 0xDC00 e 0xDFFF.
ja: 下位サロゲート文字 '0x{0}' は無効です。下位サロゲート文字は 0xDC00 から 0xDFFF の範囲です。
ko: 하위 서로게이트 문자 '0x{0}'이(가) 잘못되었습니다. 하위 서로게이트 문자의 범위는 0xDC00 - 0xDFFF입니다.
pl: Nieprawidłowa niższa część znaku dwuskładnikowego „0x{0}”. Niższa część znaku dwuskładnikowego powinna być z zakresu od 0xDC00 do 0xDFFF.
pt_br: Caractere alternativo baixo '0x{0}' inválido. Os caracteres alternativos baixos variam de 0xDC00 a 0xDFFF.
ru: Младший символ-заместитель "0x{0}" недопустим. Диапазон младших символов-заместителей — от 0xDC00 до 0xDFFF.
tr: Düşük temsil karakteri '0x{0}' geçerli değil. Bu karakter aralığı 0xDC00 ile 0xDFFF arasındadır.
zh_hans: 低代理项字符型 "0x{0}" 无效。低代理项字符型的范围为 0xDC00 到 0xDFFF。
zh_hant: 低代理字元 '0x{0}' 無效。低代理字元的範圍介於 0xDC00 到 0xDFFF 之間。

# XmlInvalidOperation
source: The reader cannot be advanced.
cs: Čtecí funkci nelze rozšířit.
de: Die Ausführung des Lesers kann nicht fortgesetzt werden.
es: El lector no puede ser avanzado.
fr: Impossible d'avancer le lecteur.
it: Il lettore non può procedere.
ja: リーダーを前進させることはできません。
ko: 판독기는 미리 진행될 수 없습니다.
pl: Moduł odczytujący nie może kontynuować.
pt_br: O leitor não pode ser avançado.
ru: Расширение модуля чтения невозможно.
tr: Okuyucu ilerletilemiyor.
zh_hans: 读取器不能为高级。
zh_hant: 不可以是進階讀取器。

# XmlInvalidPrefixState
source: A prefix cannot be defined while WriteState is '{0}'.
cs: Předponu nelze definovat, když je stav WriteState {0}.
de: Solange WriteState den Wert "{0}" aufweist, kann kein Präfix geschrieben werden.
es: No se puede definir un prefijo si el valor de WriteState es "{0}".
fr: Impossible de définir un préfixe tant que WriteState est '{0}'.
it: Non è possibile definire un prefisso mentre WriteState è '{0}'.
ja: WriteState が '{0}' である間はプレフィックスを定義することはできません。
ko: WriteState가 '{0}'인 동안에는 접두사를 정의할 수 없습니다.
pl: Nie można zdefiniować prefiksu, gdy element WriteState ma wartość „{0}”.
pt_br: Um prefixo não pode ser definido enquanto WriteState é '{0}'.
ru: Префикс не может быть определен при WriteState "{0}".
tr: WriteState '{0}' iken bir önek tanımlanamaz.
zh_hans: 当 WriteState 为“{0}”时，无法定义前缀。
zh_hant: 當 WriteState 為 '{0}' 時，無法定義前置詞。

# XmlInvalidQualifiedName
source: Expected XML qualified name. Found '{0}'.
cs: Byl očekáván určený název XML. Byl nalezen název {0}.
de: Es wurde ein qualifizierter XML-Name erwartet. Gefunden wurde "{0}".
es: Se esperaba un nombre XML completo. Se encontró "{0}".
fr: Nom qualifié XML attendu. '{0}' trouvé.
it: È previsto un nome qualificato XML, ma è stato trovato '{0}'.
ja: XML 修飾名が必要です。見つかったのは '{0}' でした。
ko: XML 정규화된 이름이 필요한데 '{0}'을(를) 찾았습니다.
pl: Oczekiwano kwalifikowanej nazwy XML. Znaleziono „{0}”.
pt_br: Espera-se nome qualificado XML. Encontrado '{0}'.
ru: Ожидалось полное имя XML. Найдено "{0}".
tr: Uygun XML adı bekleniyordu. '{0}' bulundu.
zh_hans: 需要 XML 限定名称。找到“{0}”。
zh_hant: 應為 XML 限定名稱，但找到 '{0}'。

# XmlInvalidRootData
source: The data at the root level is invalid.
cs: Data na kořenové úrovni nejsou platná.
de: Die Daten auf der Stammebene sind ungültig.
es: Los datos del nivel raíz no son válidos.
fr: Les données au niveau racine sont non valides.
it: I dati a livello di radice non sono validi.
ja: ルート レベルのデータが無効です。
ko: 루트 수준의 데이터가 잘못되었습니다.
pl: Nieprawidłowe dane na poziomie głównym.
pt_br: Os dados no nível raiz são inválidos.
ru: Эти данные на корневом уровне недопустимы.
tr: Kök düzeyindeki veriler geçersiz.
zh_hans: 根级别的数据无效。
zh_hant: 根層級的資料無效。

# XmlInvalidStandalone
source: 'standalone' value in declaration must be 'yes' or 'no'.
cs: Hodnota standalone v deklaraci musí být yes nebo no.
de: Der standalone-Wert in der Deklaration muss "yes" oder "no" lauten.
es: El valor "standalone" de la declaración debe ser "yes" o "no".
fr: La valeur 'standalone' dans la déclaration doit être 'yes' ou 'no'.
it: Il valore di 'standalone' nella dichiarazione deve essere 'yes' o 'no'.
ja: 宣言内の 'standalone' の値は、'yes' または 'no' である必要があります。
ko: 선언의 'standalone' 값은 'yes' 또는 'no'여야 합니다.
pl: Wartość „standalone” w deklaracji musi wynosić „yes” lub „no”.
pt_br: O valor 'standalone' na declaração deve ser 'yes' ou 'no'.
ru: Значение standalone в объявлении должно быть yes или no.
tr: Bildirimdeki 'standalone' değeri, 'yes' ya da 'no' olmalıdır.
zh_hans: 声明中的 "standalone" 值必须为 "yes" 或 "no"。
zh_hant: 宣告中的 'standalone' 值必須是 'yes' 或 'no'。

# XmlInvalidStream
source: Stream returned by IStreamProvider cannot be null.
cs: Stream vrácený poskytovatelem IStreamProvider nemůže být hodnota null.
de: Der von IStreamProvider zurückgegebene Datenstrom darf nicht NULL sein.
es: La secuencia que devuelve IStreamProvider no puede ser nula.
fr: Le flux retourné par IStreamProvider ne peut pas avoir une valeur null.
it: Il flusso restituito da IStreamProvider non può essere Null.
ja: IStreamProvider から返されたストリームは null 以外である必要があります。
ko: IStreamProvider에 의해 반환된 스트림은 null일 수 없습니다.
pl: Strumień zwrócony przez element IStreamProvider nie może mieć wartości null.
pt_br: O fluxo retornado por IStreamProvider não pode ser nulo.
ru: Поток, возвращенный поставщиком IStreamProvider, не может иметь значение null.
tr: IStreamProvider tarafından döndürülen akış null olamaz.
zh_hans: IStreamProvider 返回的流不能为 Null。
zh_hant: IStreamProvider 傳回的資料流不可為 Null。
