Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlInvalidSurrogate
source: Surrogate char '0x{0}' not valid. Surrogate chars range from 0x10000 to 0x10FFFF.
cs: Znak nahrazení 0x{0} není platný. Znaky nahrazení jsou v rozsahu 0x10000 až 0x10FFFF.
de: "0x{0}" ist kein gültiges Ersatzzeichen. Der gültige Bereich für Ersatzzeichen liegt zwischen 0x10000 und 0x10FFFF.
es: El carácter suplente "0x{0}" no es válido. Los caracteres suplentes deben estar dentro del intervalo de 0x10000 a 0x10FFFF.
fr: Caractère de substitution '0x{0}' non valide. Les caractères de substitution sont compris dans une plage allant de 0x10000 à 0x10FFFF.
it: Il carattere surrogato '0x{0}' non è valido. I caratteri surrogati devono essere compresi tra 0x10000 e 0x10FFFF.
ja: サロゲート文字 '0x{0}' は無効です。サロゲート文字は 0x10000 から 0x10FFFF の範囲です。
ko: Surrogate char '0x{0}'이(가) 잘못되었습니다. Surrogate char의 범위는 0x10000 - 0x10FFFF입니다.
pl: Nieprawidłowy znak dwuskładnikowy „0x{0}”. Znaki dwuskładnikowe muszą być z zakresu od 0x10000 do 0x10FFFF.
pt_br: Caractere alternativo '0x{0}' inválido. Os caracteres alternativos variam de 0x10000 a 0x10FFFF.
ru: Символ-заместитель "0x{0}" является недопустимым. Символы-заместители должны находиться в диапазоне от 0x10000 до 0x10FFFF.
tr: Temsil karakteri '0x{0}' geçerli değildir. Temsil karakter aralığı 0x10000 ile 0x10FFFF arasındadır.
zh_hans: 代理项字符型 "0x{0}" 无效。代理项字符型的范围为 0x10000 到 0x10FFFF。
zh_hant: 代理字元 '0x{0}' 無效。代理字元的範圍介於 0x10000 到 0x10FFFF 之間。

# XmlInvalidUTF8Bytes
source: '{0}' contains invalid UTF8 bytes.
cs: {0} obsahuje neplatné bajty UTF8.
de: "{0}" enthält ungültige UTF8-Bytes.
es: "{0}" contiene bytes UTF8 no válidos.
fr: '{0}' contient des octets UTF8 non valides.
it: '{0}' contiene byte UTF8 non validi.
ja: '{0}' には無効な UTF8 バイトが含まれています。
ko: '{0}'에 잘못된 UTF8 바이트가 있습니다.
pl: Ciąg „{0}” zawiera nieprawidłowe bajty UTF8.
pt_br: '{0}' contém bytes UTF8 inválidos.
ru: "{0}" содержит недопустимые для UTF8 байты.
tr: '{0}', geçersiz UTF8 baytı içeriyor.
zh_hans: “{0}”包含无效的 UTF8 字节。
zh_hant: '{0}' 包含無效的 UTF8 位元組。

# XmlInvalidUniqueId
source: UniqueId cannot be zero length.
cs: Identifikátor UniqueId nemůže mít nulovou délku.
de: Die Länge von UniqueId darf nicht null sein.
es: UniqueId no puede tener una longitud cero.
fr: La valeur de la longueur de UniqueId ne peut pas être zéro.
it: UniqueId non può avere lunghezza zero.
ja: UniqueId の長さは 0 以外である必要があります。
ko: UniqueId의 길이가 0일 수 없습니다.
pl: Długość unikatowego identyfikatora nie może być zerowa.
pt_br: UniqueId não pode ter comprimento zero.
ru: UniqueId не может иметь нулевую длину.
tr: UniqueId, sıfır uzunluğunda olamaz.
zh_hans: UniqueId 长度不能为零。
zh_hant: UniqueId 長度不可以為零。

# XmlInvalidVersion
source: XML version must be '1.0'.
cs: Verze XML musí být 1.0.
de: Die XML-Version muss "1.0" lauten.
es: La versión de XML debe ser "1.0".
fr: La version XML doit être '1.0'.
it: La versione XML deve essere '1.0'.
ja: XML バージョンは '1.0' である必要があります。
ko: XML 버전은 '1.0'이어야 합니다.
pl: Musi być używany język XML w wersji „1.0”.
pt_br: A versão XML deve ser '1.0'.
ru: Версия XML должна быть "1.0".
tr: XML sürümü '1.0' olmalıdır.
zh_hans: XML 版本必须为 "1.0"。
zh_hant: XML 版本必須為 '1.0'。

# XmlInvalidWriteState
source: '{0}' cannot be called while WriteState is '{1}'.
cs: Dokud je stav WriteState nastaven na hodnotu {1}, metodu {0} nelze zavolat.
de: Solange WriteState den Wert "{1}" aufweist, kann "{0}" nicht aufgerufen werden.
es: No se puede llamar a "{0}" mientras el estado de WriteState sea "{1}".
fr: Impossible d'appeler '{0}' tant que la valeur de WriteState est '{1}'.
it: Non è possibile chiamare '{0}' mentre WriteState è '{1}'.
ja: WriteState が '{1}' である間は '{0}' を呼び出すことはできません。
ko: WriteState가 '{1}'인 동안에는 '{0}'을(를) 호출할 수 없습니다.
pl: Nie można wywołać metody „{0}”, gdy stan metody WriteState ma wartość „{1}”.
pt_br: Não é possível chamar '{0}' enquanto WriteState for '{1}'.
ru: "{0}" не может быть вызван, если WriteState имеет значение "{1}".
tr: WriteState '{1}' iken '{0}' çağrılamaz.
zh_hans: 当 WriteState 为“{1}”时，不能调用“{0}”。
zh_hant: 當 WriteState 為 '{1}' 時，無法呼叫 '{0}'。

# XmlInvalidXmlByte
source: The byte 0x{0} is not valid at this location.
cs: Bajt 0x{0} není na tomto místě platný.
de: Das Byte "0x{0}" ist an dieser Position nicht gültig.
es: El byte 0x{0} no es válido en esta ubicación.
fr: L'octet 0x{0} est non valide à cet emplacement.
it: Il byte 0x{0} non è valido in questa posizione.
ja: バイト 0x{0} はこの場所では無効です。
ko: 0x{0}바이트가 이 위치에서 잘못되었습니다.
pl: Bajt 0x{0} jest nieprawidłowy w tej lokalizacji.
pt_br: O byte 0x{0} é inválido neste local.
ru: Байт 0x{0} в данном месте недопустим.
tr: Bayt 0x{0} bu konumda geçerli değil.
zh_hans: 字节 0x{0} 在此位置无效。
zh_hant: 此位置的位元組 0x{0} 無效。

# XmlInvalidXmlSpace
source: '{0}' is not a valid xml:space value. Valid values are 'default' and 'preserve'.
cs: {0} není platná hodnota xml:space. Platné hodnoty jsou default a preserve.
de: "{0}" ist kein gültiger xml:space-Wert. Gültige Werte sind "default" und "preserve".
es: "{0}" no es un valor xml:space válido. Los valores válidos son "default" y "preserve".
fr: '{0}' n'est pas une valeur xml:space valide. Les valeurs valides sont 'default' et 'preserve'.
it: '{0}' non è un valore xml:space valido. I valori validi sono 'default' e 'preserve'.
ja: '{0}' は、有効な xml:space 値ではありません。有効な値は、'default' および 'preserve' です。
ko: '{0}'이(가) 유효한 xml:space 값이 아닙니다. 유효한 값은 'default' 및 'preserve'입니다.
pl: „{0}” nie jest prawidłową wartością xml:space. Prawidłowe wartości to „default” i „preserve”.
pt_br: '{0}' não é um valor xml:space válido. Os valores válidos são 'default' e 'preserve'.
ru: "{0}" не является допустимым значением xml:space. Допустимы значения default и preserve.
tr: '{0}' geçerli bir xml:space değeri değildir. Geçerli değerler: 'default' ve 'preserve'.
zh_hans: “{0}”不是有效的 xml:space 值。有效值为 "default" 和 "preserve"。
zh_hant: '{0}' 不是有效的 xml:space 值。有效值為 'default' 與 'preserve'。

# XmlKeyAlreadyExists
source: The specified key already exists in the dictionary.
cs: Určený klíč již ve slovníku existuje.
de: Der angegebene Schlüssel ist bereits im Wörterbuch vorhanden.
es: La clave especificada ya existe en el diccionario.
fr: La clé spécifiée existe déjà dans le dictionnaire.
it: La chiave specificata esiste già nel dizionario.
ja: 指定されたキーは既に辞書に存在しています。
ko: 지정된 키가 이미 사전에 있습니다.
pl: Określony klucz już istnieje w słowniku.
pt_br: A chave especificada já existe no dicionário.
ru: Указанный ключ уже имеется в словаре.
tr: Belirtilen anahtar zaten sözlükte var.
zh_hans: 字典中已存在指定的项。
zh_hant: 字典中已有指定的索引鍵。

# XmlLineInfo
source: Line {0}, position {1}.
cs: Řádek {0}, pozice {1}
de: Zeile {0}, Position {1}.
es: Línea {0}, posición {1}.
fr: Ligne {0}, position {1}.
it: Riga {0}, posizione {1}.
ja: 行 {0}、位置 {1} です。
ko: 줄 {0}, 위치 {1}.
pl: Wiersz {0}, pozycja {1}.
pt_br: Linha {0}, posição {1}.
ru: Строка {0}, позиция {1}.
tr: Satır {0}, konum {1}.
zh_hans: 行 {0}，位置 {1}。
zh_hant: 行 {0}，位置 {1}。

# XmlMalformedDecl
source: Malformed XML declaration.
cs: Chybně vytvořená deklarace XML
de: Die XML-Deklaration ist falsch formatiert.
es: Declaración XML con formato incorrecto.
fr: Déclaration XML incorrecte.
it: La dichiarazione XML non è valida.
ja: XML 宣言の形式が正しくありません。
ko: XML 선언의 형식이 잘못되었습니다.
pl: Nieprawidłowo skonstruowana deklaracja XML.
pt_br: Declaração XML malformada.
ru: Неверный формат объявления XML.
tr: Bozuk XML bildirimi.
zh_hans: XML 声明格式错误。
zh_hant: XML 宣告的格式不正確。

# XmlMaxArrayLengthExceeded
source: The maximum array length quota ({0}) has been exceeded while reading XML data. This quota may be increased by changing the MaxArrayLength property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Při čtení dat XML byla překročena kvóta maximální délky pole ({0}). Tuto kvótu lze zvýšit změnou vlastnosti MaxArrayLength u objektu XmlDictionaryReaderQuotas, který se používá při vytváření čtecí funkce XML.
de: Das Kontingent für die maximale Arraylänge ({0}) wurde beim Lesen von XML-Daten überschritten. Dieses Kontingent kann durch Ändern der MaxArrayLength-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la cuota de longitud máxima de la matriz ({0}) al leer los datos XML. Se puede aumentar esta cuota modificando la propiedad MaxArrayLength del objeto XmlDictionaryReaderQuotas usado al crear el lector XML.
fr: Dépassement du quota maximal pour la longueur de tableau ({0}) durant la lecture des données XML. Vous pouvez augmenter ce quota en changeant la propriété MaxArrayLength sur l'objet XmlDictionaryReaderQuotas utilisé durant la création du lecteur XML.
it: Durante la lettura dei dati XML è stata superata la quota per la lunghezza massima della matrice ({0}). Per incrementare questa quota, modificare la proprietà MaxArrayLength dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: XML データの読み取り中に最大配列長クォータ ({0}) を超えました。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxArrayLength プロパティを変更してください。
ko: XML 데이터를 읽는 동안 최대 배열 길이 할당량({0})을 초과했습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxArrayLength 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytywania danych XML został przekroczony maksymalny przydział długości tablicy ({0}). Wartość tę można zwiększyć, zmieniając właściwość MaxArrayLength obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A cota máxima de comprimento de matriz ({0}) foi excedida durante a leitura dos dados XML. Essa cota pode ser aumentada com a alteração da propriedade MaxArrayLength no objeto XmlDictionaryReaderQuotas usado na criação do leitor de XML.
ru: Превышена квота максимальной длины массива ({0}) при чтении данных XML. Эту квоту можно увеличить, изменив свойство MaxArrayLength объекта XmlDictionaryReaderQuotas, используемого при создании модуля чтения XML.
tr: XML verileri okunurken dizi uzunluğu kotası üst sınırı ({0}) aşıldı. Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxArrayLength özelliği değiştirilerek artırılabilir.
zh_hans: 读取 XML 数据时，已超出最大数组长度配额({0})。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxArrayLength 属性，可增加此配额。
zh_hant: 讀取 XML 資料時已經超過最大陣列長度配額 ({0})。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxArrayLength 屬性，便可以增加此配額。

# XmlMaxBytesPerReadExceeded
source: The 'maximum bytes per Read operation' quota ({0}) has been exceeded while reading XML data. Long element start tags (consisting of the element name, attribute names and attribute values) may trigger this quota. This quota may be increased by changing the MaxBytesPerRead property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Při čtení dat XML byla překročena kvóta maximálního počtu bajtů na operaci Read ({0}). Tuto kvótu mohou aktivovat dlouhé počáteční značky elementu (obsahující název elementu, názvy atributů a hodnoty atributů). Zvýšit ji lze změnou vlastnosti MaxBytesPerRead u objektu XmlDictionaryReaderQuotas, který je používán při vytváření čtecí funkce XML.
de: Das Kontingent für die "maximalen Bytes pro Lesevorgang" ({0}) wurde beim Lesen von XML-Daten überschritten. Lange Elementstarttags (bestehend aus dem Elementnamen, Attributnamen und Attributwerten) können zum Überschreiten dieses Kontingents führen. Dieses Kontingent kann durch Ändern der MaxBytesPerRead-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la cuota de "número máximo de bytes por operación de lectura" ({0}) al leer los datos XML. Las etiquetas de inicio de elementos largos (que se componen de nombre de elemento, nombres de atributo y valores de atributo) pueden hacer que se sobrepase dicha cuota. La cuota se puede aumentar cambiando la propiedad MaxBytesPerRead del objeto XmlDictionaryReaderQuotas usado para crear el lector XML.
fr: Dépassement du quota 'nombre d'octets maximal par opération de lecture' ({0}) durant la lecture des données XML. Des balises de début d'éléments longs (composées du nom de l'élément, des noms d'attributs et des valeurs d'attributs) peuvent déclencher le quota. Vous pouvez augmenter ce quota en changeant la propriété MaxBytesPerRead sur l'objet XmlDictionaryReaderQuotas utilisé durant la création du lecteur XML.
it: Durante la lettura dei dati XML è stata superata la quota per il numero massimo di byte per operazione di lettura ({0}). Il superamento della quota può essere causato da tag di inizio elemento lunghi (costituiti da nome elemento, nomi di attributo e valori di attributo). Per incrementare questa quota, modificare la proprietà MaxBytesPerRead dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: XML データの読み取り中に、'読み取り操作あたりの最大バイト' クォータ ({0}) を超えました。長い要素開始タグ (要素名、属性名、および属性値で構成される) によってこのクォータがトリガーされることがあります。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxBytesPerRead プロパティを変更してください。
ko: XML 데이터를 읽는 동안 '읽기 작업당 최대 바이트' 할당량({0})을 초과했습니다. 긴 요소 시작 태그(요소 이름, 특성 이름 및 특성 값으로 구성)로 인해 이 할당량이 트리거될 수 있습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxBytesPerRead 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Podczas odczytywania danych XML został przekroczony przydział maksymalnej liczba bajtów na operację odczytu ({0}). Początkowe znaczniki długich elementów (składające się z nazwy elementu, nazw atrybutów i wartości atrybutów) mogą spowodować przekroczenie tego przydziału. Przydział można zwiększyć, zmieniając właściwość MaxBytesPerRead obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A cota 'máxima de bytes por operação de Leitura' ({0}) foi excedida durante a leitura dos dados XML. As marcas de início longas de elemento (compostas por nome do elemento, nomes de atributo e valores de atributo) podem disparar essa cota. Essa cota pode ser aumentada com a alteração da propriedade MaxBytesPerRead no objeto XmlDictionaryReaderQuotas usado na criação do leitor de XML.
ru: Превышена квота "максимальное количество байт за одно считывание" ({0}) при чтении данных XML. Триггером этой квоты могут служить длинные открывающие теги элементов (состоящие из имени элемента, имен атрибутов и значений атрибутов). Эту квоту можно увеличить, изменив свойство MaxBytesPerRead объекта XmlDictionaryReaderQuotas, используемого при создании модуля чтения XML.
tr: XML verileri okunurken, 'her Read işleminde okunan en fazla bayt' kotası ({0}) aşıldı. Uzun öğe başlangıç etiketleri (öğe adını, öznitelik adlarını ve öznitelik değerlerini içeren) bu kotayı tetikleyebilir. Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxBytesPerRead özelliği değiştirilerek artırılabilir.
zh_hans: 读取 XML 数据时超过了“每次读取操作的最大字节数”配额({0})。长元素起始标记(由元素名称、特性名称和特性值组成)可能会触发此配额。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxBytesPerRead 属性，可增加此配额。
zh_hant: 讀取 XML 資料時已經超過「每一讀取作業的最大位元組」配額 ({0})。冗長的元素開始標記 (由元素名稱、屬性名稱及屬性值所組成) 可能會觸發此配額限制。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxBytesPerRead 屬性，便可以增加此配額。

# XmlMaxDepthExceeded
source: The maximum read depth ({0}) has been exceeded because XML data being read has more levels of nesting than is allowed by the quota. This quota may be increased by changing the MaxDepth property on the XmlDictionaryReaderQuotas object used when creating the XML reader.
cs: Byla překročena maximální hloubka čtení ({0}), protože čtená data XML mají více úrovní vnoření, než je povoleno kvótou. Tuto kvótu lze zvýšit změnou vlastnosti MaxDepth u objektu XmlDictionaryReaderQuotas, který se používá při vytváření čtečky dat XML.
de: Die maximale Lesetiefe ({0}) wurde überschritten, da die gelesenen XML-Daten mehr Schachtelungsebenen enthalten als das Kontingent zulässt. Dieses Kontingent kann durch Ändern der MaxDepth-Eigenschaft des beim Erstellen des XML-Lesers verwendeten XmlDictionaryReaderQuotas-Objekts erhöht werden.
es: Se superó la profundidad máxima de lectura ({0}) porque los datos XML que se están leyendo tienen más niveles de anidación de los que permite la cuota. Esta cuota se puede aumentar cambiando la propiedad MaxDepth del objeto XmlDictionaryReaderQuotas usado para crear el lector XML.
fr: Dépassement de la profondeur de lecture maximale ({0}), car les données XML en cours de lecture comportent plus de niveaux d'imbrication que le nombre autorisé par le quota. Vous pouvez augmenter ce quota en changeant la propriété MaxDepth sur l'objet XmlDictionaryReaderQuotas utilisé durant la création du lecteur XML.
it: È stata superata la profondità di lettura massima ({0}) perché i dati XML da leggere includono più livelli di annidamento di quelli consentiti dalla quota. Per incrementare questa quota, modificare la proprietà MaxDepth dell'oggetto XmlDictionaryReaderQuotas usato durante la creazione del lettore XML.
ja: 読み取りの最大深度 ({0}) を超えました。読み取られる XML データの入れ子レベルが、このクォータで許可されたレベルを超えていたことが原因です。このクォータを増やすには、XML リーダーの作成時に使用される XmlDictionaryReaderQuotas オブジェクトの MaxDepth プロパティを変更してください。
ko: 읽는 중인 XML 데이터가 할당량에서 허용되는 것보다 많은 중첩 수준을 갖고 있기 때문에 최대 읽기 깊이({0})를 초과했습니다. XML 판독기를 만들 때 사용되는 XmlDictionaryReaderQuotas 개체에서 MaxDepth 속성을 변경하여 이 할당량을 늘릴 수 있습니다.
pl: Maksymalna głębokość odczytu ({0}) została przekroczona, ponieważ odczytywane dane XML mają więcej poziomów zagnieżdżenia niż dozwolono w przydziale. Wartość tę można zwiększyć, zmieniając właściwość MaxDepth obiektu XmlDictionaryReaderQuotas użytego podczas tworzenia modułu odczytującego XML.
pt_br: A profundidade máxima de leitura ({0}) foi excedida porque os dados XML lidos têm mais níveis de aninhamento do que o permitido pela cota. Essa cota pode ser aumentada com a alteração da propriedade MaxDepth no objeto XmlDictionaryReaderQuotas usado na criação do leitor XML.
ru: Превышена максимальная глубина считывания ({0}), так как считываемые данные XML имеют больше уровней вложения, чем разрешается данной квотой. Эту квоту можно увеличить, изменив свойство MaxDepth объекта XmlDictionaryReaderQuotas, используемого при создании модуля чтения XML.
tr: Okunan XML verileri, kota tarafından izin verilenden daha fazla iç içe geçen düzeye sahip olduğundan, en büyük okuma derinliği ({0}) aşıldı. Bu kota, XML okuyucusu oluşturulurken kullanılan XmlDictionaryReaderQuotas nesnesindeki MaxDepth özelliği değiştirilerek artırılabilir.
zh_hans: 由于正在读取的 XML 数据的嵌套级别比配额允许的嵌套级别多，因此已超出最大读取深度({0})。通过更改在创建 XML 读取器时所使用的 XmlDictionaryReaderQuotas 对象的 MaxDepth 属性，可增加此配额。
zh_hant: 已經超過最大讀取深度 ({0})，因為正在讀取的 XML 資料具有的巢狀層級超過配額所允許的深度。在建立 XML 讀取器時變更 XmlDictionaryReaderQuotas 物件上使用的 MaxDepth 屬性，便可以增加此配額。
