Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TypeHasNotBeenImported
source: Type '{0}' from namespace '{1}' has not been imported from schema. Consider first importing this type by calling one of the Import methods on XsdDataContractImporter.
cs: Typ {0} z oboru názvů {1} nebyl ze schématu importován. Importujte nejdříve tento typ voláním jedné z metod importu v třídě XsdDataContractImporter.
de: Der Typ "{0}" aus dem Namespace "{1}" wurde nicht aus dem Schema importiert. Importieren Sie ggf. zuerst diesen Typ, indem Sie eine der Import-Methoden für XsdDataContractImporter aufrufen.
es: No se importó del esquema el tipo "{0}" del espacio de nombres "{1}". Se recomienda importar primero este tipo mediante la llamada a uno de los métodos de importación de XsdDataContractImporter.
fr: Le type '{0}' provenant de l'espace de noms '{1}' n'a pas été importé à partir du schéma. Commencez par importer ce type en appelant l'une des méthodes d'importation sur XsdDataContractImporter.
it: Il tipo '{0}' dello spazio dei nomi '{1}' non è stato importato dallo schema. Provare a importare prima questo tipo chiamando uno dei metodi Import su XsdDataContractImporter.
ja: 名前空間 '{1}' の型 '{0}' はスキーマからインポートされていません。いずれかの Import メソッドを XsdDataContractImporter で呼び出して、まずこの型をインポートしてください。
ko: 네임스페이스 '{1}'의 '{0}' 형식을 스키마에서 가져오지 않았습니다. XsdDataContractImporter에서 Import 메서드 중 하나를 호출하여 먼저 이 형식을 가져와 보세요.
pl: Typ „{0}” z przestrzeni nazw „{1}” nie został zaimportowany ze schematu. Spróbuj najpierw zaimportować ten typ, wywołując jedną z metod Import w elemencie XsdDataContractImporter.
pt_br: O tipo '{0}' do namespace '{1}' não foi importado do esquema. Considere primeiro importar esse tipo chamando um dos métodos Import no XsdDataContractImporter.
ru: Тип "{0}" в пространстве имен "{1}" не был импортирован из схемы. Сначала импортируйте этот тип путем вызова одного из методов Import на XsdDataContractImporter.
tr: '{1}' ad alanından '{0}' türü şemadan içeri aktarılamadı. Önce bu türü XsdDataContractImporter üstündeki Import metotlarından birini çağırarak almayı deneyin.
zh_hans: 未从架构中导入命名空间“{1}”中的类型“{0}”。可以考虑先通过对 XsdDataContractImporter 调用其中一种 Import 方法导入此类型。
zh_hant: 尚未從結構描述匯入來自命名空間 '{1}' 的類型 '{0}'。請考慮呼叫 XsdDataContractImporter 上的其中一個 Import 方法，先將此類型匯入。

# TypeMustBeIXmlSerializable
source: Schema type '{2}' in namespace '{3}' must be imported as an XML type. Type '{0}' cannot be mapped to this schema type because it does not implement '{1}'. Consider not adding type '{0}' to the list of referenced types or changing it to implement '{1}'.
cs: Typ schématu {2} v oboru názvů {3} je nutné importovat jako typ XML. Typ {0} nelze namapovat na tento typ schématu, protože neimplementuje {1}. Zvažte možnost nepřidávat typ {0} na seznam odkazovaných typů nebo jej změnit tak, aby implementoval {1}.
de: Der Schematyp "{2}" im Namespace "{3}" muss als XML-Typ importiert werden. Der Typ "{0}" kann diesem Schematyp nicht zugeordnet werden, da er nicht "{1}" implementiert. Fügen Sie den Typ "{0}" ggf. nicht der Liste der referenzierten Typen hinzu, oder ändern Sie ihn, sodass er "{1}" implementiert.
es: El tipo de esquema "{2}" del espacio de nombres "{3}" debe importarse como tipo XML. El tipo "{0}" no se puede asignar a este tipo de esquema porque no implementa "{1}". Se recomienda no agregar el tipo "{0}" a la lista de tipos a los que se hace referencia o cambiarlo para implementar "{1}".
fr: Le type de schéma '{2}' dans l'espace de noms '{3}' doit être importé comme type XML. Il est impossible de mapper le type '{0}' à ce type de schéma, car il n'implémente pas '{1}'. N'ajoutez pas le type '{0}' à la liste des types référencés, ou changez-le pour implémenter '{1}'.
it: Il tipo di schema '{2}' nello spazio dei nomi '{3}' deve essere importato come tipo XML. Non è possibile eseguire il mapping del tipo '{0}' a questo tipo di schema perché non implementa '{1}'. Provare a non aggiungere il tipo '{0}' all'elenco dei tipi di riferimento o a modificarlo in modo che implementi '{1}'.
ja: 名前空間 '{3}' のスキーマ型 '{2}' は、XML 型としてインポートされる必要があります。型 '{0}' は、'{1}' を実装していないためこのスキーマ型に割り当てできません。型 '{0}' を参照された型のリストに追加しないようにするか、この型を変更して '{1}' を実装してください。
ko: 네임스페이스 '{3}'의 스키마 형식 '{2}'은(는) XML 형식으로 가져와야 합니다. '{0}' 형식은 '{1}'을(를) 구현하지 않기 때문에 이 스키마 형식에 매핑할 수 없습니다. '{0}' 형식을 참조된 형식 목록에 추가하지 않거나 '{1}'을(를) 구현하도록 변경해 보세요.
pl: Typ schematu „{2}” w przestrzeni nazw „{3}” musi być importowany jako typ XML. Typ „{0}” nie może być mapowany na ten typ schematu, ponieważ nie implementuje elementu „{1}”. Rozważ niedodawanie typu „{0}” do listy typów, do których następują odwołania, lub zmianę typu, tak aby implementował element „{1}”.
pt_br: O tipo de esquema '{2}' no namespace '{3}' deve ser importado como um tipo XML. O tipo '{0}' não pode ser mapeado para esse tipo de esquema porque ele não implementa '{1}'. Considere não adicionar o tipo '{0}' à lista de tipos referenciados ou não alterá-lo para implementar '{1}'.
ru: Тип схемы "{2}" в пространстве имен "{3}" должен импортироваться как тип XML. Тип "{0}" не может быть сопоставлен с этим типом схемы, так как он не реализует "{1}". Не добавляйте тип "{0}" в список ссылочных типов или измените его, чтобы реализовать "{1}".
tr: '{3}' ad alanındaki '{2}' şema türü, bir XML türü olarak içeri aktarılmalıdır. '{1}' metodunu uygulamadığından, '{0}' türü bu şema türüyle eşlenemiyor. '{0}' türünü başvurulan türler listesine eklememeyi ya da '{1}' metodunu uygulayacak biçimde değiştirmeyi deneyin.
zh_hans: 命名空间“{3}”中的架构类型“{2}”必须导入为 XML 类型。由于类型“{0}”未实现“{1}”，因此无法映射到此架构类型。可以考虑不向引用的类型列表中添加类型“{0}”，或将其更改以实现“{1}”。
zh_hant: 命名空間 '{3}' 中的結構描述類型 '{2}' 必須匯入成 XML 類型。類型 '{0}' 無法對應到此結構描述類型，因為它無法實行 '{1}'。請考慮不要將類型 '{0}' 新增到參考類型的清單，或是變更該類型以實行 '{1}'。

# TypeMustNotBeOpenGeneric
source: Type '{0}' is not a fully instantiated generic class.
cs: Typ {0} nemá zcela vytvořenou instanci obecné třídy.
de: Der Typ "{0}" ist keine vollständig instanziierte generische Klasse.
es: El tipo "{0}" no es una clase genérica de instancia completa.
fr: Le type '{0}' n'est pas une classe générique complètement instanciée.
it: Il tipo '{0}' non è una classe generica con istanza completa.
ja: 型 '{0}' は、完全にインスタンス化されたジェネリック クラスではありません。
ko: '{0}' 형식은 완전히 인스턴스화된 제네릭 클래스가 아닙니다.
pl: Typ „{0}” nie jest w pełni utworzoną klasą ogólną.
pt_br: O tipo '{0}' não é uma classe genérica completamente instanciada.
ru: Тип "{0}" не является полностью созданным экземпляром универсального класса.
tr: '{0}' türü, tam olarak oluşturulmuş bir genel sınıf değildir.
zh_hans: 类型“{0}”不是完全实例化的泛型类。
zh_hant: 類型 '{0}' 不是完整建立的一般類別。

# TypeNotSerializable
source: Type '{0}' cannot be serialized. Consider marking it with the DataContractAttribute attribute, and marking all of its members you want serialized with the DataMemberAttribute attribute. If the type is a collection, consider marking it with the CollectionDataContractAttribute. See the Microsoft .NET Framework documentation for other supported types.
cs: Typ {0} nelze serializovat. Označte jej atributem DataContractAttribute a označte všechny jeho členy, které chcete serializovat, atributem DataMemberAttribute. Pokud je typem kolekce, zvažte její označení atributem CollectionDataContractAttribute. Informace o dalších podporovaných typech získáte v dokumentaci rozhraní Microsoft .NET Framework.
de: Der Typ "{0}" kann nicht serialisiert werden. Markieren Sie ihn ggf. mit dem Attribut DataContractAttribute, und markieren Sie alle zu serialisierenden Member des Typs mit dem Attribut DataMemberAttribute. Wenn es sich bei dem Typ um eine Sammlung handelt, markieren Sie ihn ggf. mit dem CollectionDataContractAttribute. Weitere Informationen zu anderen unterstützten Typen finden Sie in der Microsoft .NET Framework-Dokumentation.
es: El tipo "{0}" no se puede serializar. Intente marcarlo con el atributo DataContractAttribute y marque todos los miembros que desee serializar con el atributo DataMemberAttribute. Si el tipo es una colección, pruebe a marcarlo con CollectionDataContractAttribute. Vea la documentación de Microsoft .NET Framework para conocer otros tipos admitidos.
fr: Impossible de sérialiser le type '{0}'. Marquez-le avec l'attribut DataContractAttribute et marquez tous ses membres devant être sérialisés avec l'attribut DataMemberAttribute. Si le type est une collection, marquez-le avec CollectionDataContractAttribute. Consultez la documentation Microsoft .NET Framework pour connaître les autres types pris en charge.
it: Non è possibile serializzare il tipo '{0}'. Provare a contrassegnarlo con l'attributo DataContractAttribute e a contrassegnare tutti i relativi membri da serializzare con l'attributo DataMemberAttribute. Se il tipo è una raccolta, provare a contrassegnarlo con l'attributo CollectionDataContractAttribute. Per gli altri tipi supportati, vedere la documentazione di Microsoft .NET Framework.
ja: 型 '{0}' をシリアル化できません。この型を DataContractAttribute 属性でマークするか、シリアル化するすべてのメンバーを DataMemberAttribute 属性でマークしてください。この型がコレクションの場合は、CollectionDataContractAttribute 属性でマークすることを検討してください。その他のサポートされている型については、Microsoft .NET Framework のマニュアルを参照してください。
ko: '{0}' 형식을 직렬화할 수 없습니다. 이 형식을 DataContractAttribute 특성으로 표시하고 직렬화할 모든 멤버를 DataMemberAttribute 특성으로 표시해 보세요. 형식이 컬렉션이면 CollectionDataContractAttribute로 표시해 보세요. 지원되는 다른 형식에 대해서는 Microsoft .NET Framework 설명서를 참조하세요.
pl: Nie można przeprowadzić serializacji typu {0}. Rozważ oznaczenie go atrybutem DataContractAttribute i oznaczenie wszystkich jego składowych, które mają być serializowane, atrybutem DataMemberAttribute. Jeśli typ jest kolekcją, rozważ oznaczenie go atrybutem CollectionDataContractAttribute. Aby dowiedzieć się, jakie inne typy są obsługiwane, zajrzyj do dokumentacji programu Microsoft .NET Framework.
pt_br: O tipo '{0}' não pode ser serializado. Considere marcá-lo com o atributo DataContractAttribute e marcar todos os membros que deseja serializar com o atributo DataMemberAttribute. Se o tipo for uma coleção, tente marcá-lo com CollectionDataContractAttribute. Consulte a documentação do Microsoft .NET Framework para obter outros tipos com suporte.
ru: Тип "{0}" не может быть сериализован. Пометьте его с помощью атрибута DataContractAttribute, а также пометьте все его члены, которые необходимо сериализовать, с помощью атрибута DataMemberAttribute. Если этот тип является коллекцией, пометьте его атрибутом CollectionDataContractAttribute. Для получения сведений о других поддерживаемых типах см. документацию к Microsoft .NET Framework.
tr: '{0}' türü serileştirilemiyor. DataContractAttribute özniteliğiyle işaretlemeyi ve serileştirmeyi istediğiniz üyelerinin tümünü DataMemberAttribute özniteliğiyle işaretlemeyi deneyin. Tür bir koleksiyonsa, CollectionDataContractAttribute ile işaretlemeyi deneyin. Desteklenen diğer türler için Microsoft .NET Framework belgelerine bakın.
zh_hans: 无法序列化类型“{0}”。请考虑将其标以 DataContractAttribute 特性，并将其所有要序列化的成员标以 DataMemberAttribute 特性。如果类型为集合，则请考虑将其标以 CollectionDataContractAttribute 特性。有关其他受支持的类型，请参见 Microsoft .NET Framework 文档。
zh_hant: 無法序列化類型 '{0}'。請考慮以 DataContractAttribute 屬性標記該類型，並以 DataMemberAttribute 屬性標記該類型要序列化的所有成員。如果該類型是集合，請考慮以 CollectionDataContractAttribute 標記該類型。如需其他支援類型，請參閱 Microsoft .NET Framework 文件。

# TypeShouldNotContainAttributes
source: Attributes must be optional and from namespace '{0}'.
cs: Atributy musejí být volitelné a z oboru názvů {0}.
de: Attribute müssen optional sein und aus dem Namespace "{0}" stammen.
es: Los atributos deben ser opcionales y pertenecer al espacio de nombres "{0}".
fr: Les attributs doivent être facultatifs et provenir de l'espace de noms '{0}'.
it: Gli attributi devono essere facoltativi e appartenere allo spazio dei nomi '{0}'.
ja: 属性は省略可能である必要があります。また、名前空間 '{0}' に含まれているものである必要があります。
ko: 특성은 '{0}' 네임스페이스에 있는 선택 사항이어야 합니다.
pl: Atrybuty muszą być opcjonalne i muszą pochodzić z przestrzeni nazw „{0}”.
pt_br: Os atributos devem ser opcionais e do namespace '{0}'.
ru: Атрибуты должны быть необязательными и принадлежать пространству имен "{0}".
tr: Öznitelikler isteğe bağlı ve '{0}' ad alanından olmalıdır.
zh_hans: 特性必须可选，且必须处于命名空间“{0}”中。
zh_hant: 屬性必須為選用屬性，且來自命名空間 '{0}'。

# UnexpectedContractType
source: An internal error has occurred. Unexpected contract type '{0}' for type '{1}' encountered.
cs: Došlo k vnitřní chybě. Byl nalezen neočekávaný typ kontraktu {0} pro typ {1}.
de: Ein interner Fehler ist aufgetreten. Für den Typ "{1}" wurde ein unerwarteter Vertragstyp "{0}" gefunden.
es: Error interno. Se encontró un tipo de contrato, "{0}", no esperado para el tipo "{1}".
fr: Une erreur interne s'est produite. Détection d'un type de contrat inattendu '{0}' pour le type '{1}'.
it: Si è verificato un errore interno. È stato rilevato il tipo di contratto imprevisto '{0}' per il tipo '{1}'.
ja: 内部エラーが発生しました。型 '{1}' の予期されないコントラクト型 '{0}' が検出されました。
ko: 내부 오류가 발생했습니다. 형식 '{1}'에 대한 예기치 않은 계약 형식 '{0}'을(를) 발견했습니다.
pl: Wystąpił błąd wewnętrzny. Napotkano nieoczekiwany typ kontraktu „{0}” dla typu „{1}”.
pt_br: Erro interno. Encontrado um tipo de contrato inesperado '{0}' para o tipo '{1}'.
ru: Произошла внутренняя ошибка. Обнаружен неожиданный тип контракта "{0}" для типа "{1}".
tr: Bir iç hata oluştu. '{1}' türü için beklenmeyen '{0}' anlaşma türüyle karşılaşıldı.
zh_hans: 出现内部错误。遇到了类型“{1}”的异常协定类型“{0}”。
zh_hant: 發生內部錯誤。類型 '{1}' 出現不正確的合約類型 '{0}'。

# UnexpectedElementExpectingElements
source: '{0}' '{1}' from namespace '{2}' is not expected. Expecting element '{3}'.
cs: {0} {1} z oboru názvů {2} není očekáván. Očekáván je element {3}.
de: "{0}" "{1}" aus dem Namespace "{2}" wird nicht erwartet. Das Element "{3}" wird erwartet.
es: No se esperaban los elementos "{0}" "{1}" del espacio de nombres "{2}". Se espera el elemento "{3}".
fr: '{0}' '{1}' provenant de l'espace de noms '{2}' n'est pas attendu. Élément attendu '{3}'.
it: '{0}' '{1}' dello spazio dei nomi '{2}' non è previsto. È previsto l'elemento '{3}'.
ja: 名前空間 '{2}' の '{0}' '{1}' は予期されていません。要素 '{3}' が必要です。
ko: 네임스페이스 '{2}'의 '{0}' '{1}'이(가) 필요한 요소가 아닙니다. '{3}' 요소가 필요합니다.
pl: Nieoczekiwany element „{0}” „{1}” z przestrzeni nazw „{2}”. Oczekiwany element: „{3}”.
pt_br: '{0}' '{1}' do namespace '{2}' não é esperado. Espera-se o elemento '{3}'.
ru: "{0}" "{1}" из пространства имен "{2}" не ожидается. Ожидается элемент "{3}".
tr: '{2}' ad alanından '{0}' '{1}' beklenmiyor. Beklenen öğe: '{3}'.
zh_hans: “{0}”命名空间“{2}”中的“{1}”并非所需元素。所需元素应为“{3}”。
zh_hant: 不應出現命名空間 '{2}' 的 '{0}' '{1}'。應為元素 '{3}'。

source: Unexpected end of file.
cs: Neočekávaný konec souboru
de: Unerwartetes Dateiende.
es: Final de archivo inesperado.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりです。
ko: 예기치 않은 파일의 끝입니다.
pl: Nieoczekiwany koniec pliku.
pt_br: Final de arquivo inesperado.
ru: Непредусмотренный конец файла.
tr: Beklenmeyen dosya sonu.
zh_hans: 意外的文件尾。
zh_hant: 未預期的檔案結尾。

# UnknownConstantType
source: Unrecognized constant type '{0}'.
cs: Nerozpoznaný typ konstanty {0}
de: Unbekannter Konstantentyp "{0}".
es: Tipo de constante no reconocido: "{0}".
fr: Type de constante non reconnu '{0}'.
it: Tipo di costante '{0}' non riconosciuto.
ja: 認識できない定数型 '{0}' です。
ko: 상수 형식 '{0}'을(를) 인식할 수 없습니다.
pl: Nierozpoznany typ stałej „{0}”.
pt_br: Tipo de constante '{0}' não reconhecido.
ru: Нераспознанный тип константы "{0}".
tr: Bilinmeyen sabit türü '{0}'.
zh_hans: 无法识别的常量类型“{0}”。
zh_hant: 無法辨識的常數類型 '{0}'。

# UnknownDataContract
source: Unknown data contract: '{0}'.
cs: Neznámý kontrakt dat: {0}
de: Unbekannter Datenvertrag: "{0}".
es: Contrato de datos desconocido: "{0}".
fr: Contrat de données inconnu : '{0}'.
it: Contratto di dati sconosciuto: '{0}'.
ja: 不明なデータ コントラクト: '{0}'。
ko: 알 수 없는 데이터 계약: '{0}'.
pl: Nieznany kontrakt danych: „{0}”.
pt_br: Contrato de dados desconhecido: '{0}'.
ru: Неизвестный контракт данных: "{0}".
tr: Bilinmeyen veri anlaşması: '{0}'.
zh_hans: 未知数据协定: “{0}”。
zh_hant: 未知的資料合約: '{0}'。

# UnknownXmlType
source: Type '{0}' is not a valid XML type.
cs: Typ {0} není platný typ XML.
de: Der Typ "{0}" ist kein gültiger XML-Typ.
es: "{0}" no es un tipo XML válido.
fr: Le type '{0}' n'est pas un type XML valide.
it: Il tipo '{0}' non è un tipo XML valido.
ja: 型 '{0}' は有効な XML 型ではありません。
ko: '{0}' 형식이 유효한 XML 형식이 아닙니다.
pl: Typ „{0}” nie jest prawidłowym typem XML.
pt_br: O tipo '{0}' não é um tipo XML válido.
ru: Тип "{0}" не является допустимым типом XML.
tr: '{0}' türü geçerli bir XML türü değil.
zh_hans: 类型“{0}”不是有效的 XML 类型。
zh_hant: 類型 '{0}' 不是有效的 XML 類型。

# ValueMustBeInRange
source: The value of this argument must fall within the range {0} to {1}.
cs: Hodnota tohoto argumentu musí být v rozsahu od {0} do {1}.
de: Der Wert dieses Arguments muss zwischen {0} und {1} liegen.
es: El valor de este argumento debe estar comprendido entre {0} y {1}.
fr: La valeur de cet argument doit être comprise entre {0} et {1}.
it: Il valore di questo argomento deve essere compreso tra {0} e {1}.
ja: この引数の値は、{0} から {1} の範囲内である必要があります。
ko: 이 인수의 값은 {0} - {1} 범위에 속해야 합니다.
pl: Wartość tego argumentu musi należeć do zakresu od {0} do {1}.
pt_br: O valor deste argumento deve estar no intervalo de {0} a {1}.
ru: Значение этого аргумента должно попадать в интервал от {0} до {1}.
tr: Bu bağımsız değişkenin değeri {0} - {1} aralığında olmalıdır.
zh_hans: 此参数的值必须介于 {0} 至 {1} 的范围内。
zh_hant: 此引數的值必須介於 {0} 到 {1} 之間。

# ValueMustBeNonNegative
source: The value of this argument must be non-negative.
cs: Hodnota tohoto argumentu nesmí být záporná.
de: Der Wert dieses Arguments darf keine negative Zahl sein.
es: El valor de este argumento no puede ser negativo.
fr: La valeur de cet argument doit être non négative.
it: Il valore di questo argomento non deve essere negativo.
ja: この引数の値は、負ではない値である必要があります。
ko: 이 인수의 값은 음수가 아니어야 합니다.
pl: Wartość tego argumentu nie może być ujemna.
pt_br: O valor deste argumento não deve ser negativo.
ru: Значение этого аргумента должно быть неотрицательным.
tr: Bu bağımsız değişkenin değeri negatif olmamalıdır.
zh_hans: 此参数的值必须为非负。
zh_hant: 此引數的值必須是非負數。

# ValueTypeCannotBeNull
source: ValueType '{0}' cannot be null.
cs: ValueType {0} nemůže být hodnota null.
de: Der ValueType "{0}" kann nicht NULL sein.
es: El elemento ValueType "{0}" no puede ser nulo.
fr: Le ValueType '{0}' ne peut pas avoir une valeur null.
it: L'elemento ValueType '{0}' non può essere Null.
ja: ValueType '{0}' は null 以外である必要があります。
ko: ValueType '{0}'은(는) null일 수 없습니다.
pl: Element ValueType „{0}” nie może mieć wartości null.
pt_br: ValueType '{0}' não pode ser nulo.
ru: ValueType "{0}" не может иметь значение null.
tr: ValueType '{0}' null olamaz.
zh_hans: ValueType“{0}”不能为 Null。
zh_hant: ValueType '{0}' 不可以是 Null。

# ValueTypeCannotHaveBaseType
source: Data contract '{0}' from namespace '{1}' is a value type and cannot have base contract '{2}' from namespace '{3}'.
cs: Kontrakt dat {0} z oboru názvů {1} je hodnotový typ a nemůže mít základní kontrakt {2} z oboru názvů {3}.
de: Der Datenvertrag "{0}" aus dem Namespace "{1}" ist ein Werttyp und kann sich daher nicht auf einen Basisvertrag "{2}" aus dem Namespace "{3}" beziehen.
es: El contrato de datos "{0}" del espacio de nombres "{1}" es un tipo de valor que no puede tener el contrato base "{2}" del espacio de nombres "{3}".
fr: Le contrat de données '{0}' provenant de l'espace de noms '{1}' est un type valeur, et il ne peut pas comporter de contrat de base '{2}' provenant de l'espace de noms '{3}'.
it: Il contratto di dati '{0}' dello spazio dei nomi '{1}' è un tipo valore e non può contenere un contratto di base '{2}' dello spazio dei nomi '{3}'.
ja: 名前空間 '{1}' のデータ コントラクト '{0}' は値の型で、名前空間 '{3}' の基本コントラクト '{2}' を持つことはできません。
ko: 네임스페이스 '{1}'의 데이터 계약 '{0}'은(는) 값 형식이며 네임스페이스 '{3}'의 기본 계약 '{2}'을(를) 가질 수 없습니다.
pl: Kontrakt danych „{0}” z przestrzeni nazw „{1}” jest typem wartości i nie może mieć podstawowego kontraktu „{2}” z przestrzeni nazw „{3}”.
pt_br: O contrato de dados '{0}' do namespace '{1}' é um tipo de valor e não pode ter contrato base '{2}' no namespace '{3}'.
ru: Контракт данных "{0}" из пространства имен "{1}" является типом значения и не может иметь базовый контракт "{2}" из пространства имен "{3}".
tr: '{1}' ad alanındaki '{0}' veri anlaşması bir değer türünde ve '{3}' ad alanındaki '{2}' temel anlaşmasına sahip olamaz.
zh_hans: 命名空间“{1}”中的数据协定“{0}”是值类型，不能包含命名空间“{3}”中的基协定“{2}”。
zh_hant: 來自命名空間 '{1}' 的資料合約 '{0}' 是實值型別，不能有來自命名空間 '{3}' 的基底合約 '{2}'。

# ValueTypeCannotHaveId
source: ValueType '{0}' cannot have id.
cs: ValueType {0} nemůže mít identifikátor.
de: Der ValueType "{0}" kann keine ID besitzen.
es: El elemento ValueType "{0}" no puede tener un id.
fr: ValueType '{0}' ne peut pas comporter d'ID.
it: L'elemento ValueType '{0}' non può contenere ID.
ja: ValueType '{0}' は ID を持つことができません。
ko: ValueType '{0}'은(는) ID를 가질 수 없습니다.
pl: Element ValueType „{0}” nie może mieć identyfikatora.
pt_br: ValueType '{0}' não pode ter ID.
ru: ValueType "{0}" не может иметь идентификатор.
tr: ValueType '{0}' öğesinin kimliği olamaz.
zh_hans: ValueType“{0}”不能有 ID。
zh_hant: ValueType '{0}' 不可以具有識別碼。

# ValueTypeCannotHaveIsReference
source: Value type '{0}' cannot have the IsReference setting of '{1}'. Either change the setting to '{2}', or remove it completely.
cs: Hodnotový typ {0} nemůže mít nastavení IsReference {1}. Změňte nastavení na {2} nebo ho úplně odeberte.
de: Für den Werttyp "{0}" kann die IsReference-Einstellung nicht auf "{1}" festgelegt werden. Ändern Sie die Einstellung in "{2}", oder entfernen Sie sie vollständig.
es: El tipo de valor "{0}" no puede tener el valor IsReference de "{1}". Cambie el valor a "{2}" o quítelo completamente.
fr: Le type valeur '{0}' ne peut pas avoir le paramètre IsReference '{1}'. Changez le paramètre en lui affectant '{2}', ou supprimez-le complètement.
it: L'impostazione IsReference del tipo valore '{0}' non può essere '{1}'. Modificare l'impostazione in '{2}' o rimuoverla.
ja: 値の型 '{0}' で IsReference 設定を '{1}' にすることはできません。設定を '{2}' に変更するか、完全に削除してください。
ko: 값 형식 '{0}'의 IsReference 설정으로 '{1}'을(를) 사용할 수 없습니다. 설정을 '{2}'(으)로 변경하거나 완전히 제거하세요.
pl: Typ wartości „{0}” nie może mieć ustawienia IsReference równego „{1}”. Zmień to ustawienie na „{2}” lub je usuń.
pt_br: O tipo de valor '{0}' não pode ter IsReference definido como '{1}'. Altere a configuração para '{2}' ou remova-a por completo.
ru: Тип значения "{0}" не может содержать параметр IsReference для "{1}". Измените параметр на "{2}" или удалите его.
tr: '{0}' değer türünün IsReference ayarı '{1}' olamaz. Ayarı '{2}' olarak değiştirin ya da tamamen kaldırın.
zh_hans: 值类型“{0}”不能具有值为“{1}”的 IsReference 设置。请将此设置改为“{2}”，或将其完全移除。
zh_hant: 實值型別 '{0}' 的 IsReference 設定不能為 '{1}'。請將設定變更為 '{2}'，或將其完全移除。

# ValueTypeCannotHaveRef
source: ValueType '{0}' cannot have ref to another object.
cs: ValueType {0} nemůže mít odkaz na jiný objekt.
de: Der ValueType "{0}" kann keinen Verweis auf ein anderes Objekt enthalten.
es: El elemento ValueType "{0}" no puede contener una referencia a otro objeto.
fr: ValueType '{0}' ne peut pas comporter de référence à un autre objet.
it: L'elemento ValueType '{0}' non può fare riferimento a un altro oggetto.
ja: ValueType '{0}' は、別のオブジェクトに対する ref を持つことができません。
ko: ValueType '{0}'은(는) 다른 개체에 대한 참조를 가질 수 없습니다.
pl: Element ValueType „{0}” nie może mieć odwołania do innego obiektu.
pt_br: ValueType '{0}' não pode ter ref a outro objeto.
ru: ValueType "{0}" не может иметь ссылки на другой объект.
tr: ValueType '{0}' başka bir nesneye başvuru bulunduramaz.
zh_hans: ValueType“{0}”无法引用其他对象。
zh_hant: ValueType '{0}' 不可以參考到其他物件。

# XmlArrayTooSmall
source: Array too small.
cs: Pole je příliš malé.
de: Das Array ist zu klein.
es: La matriz es demasiado pequeña.
fr: Tableau trop petit.
it: Le dimensioni della matrice sono troppo ridotte.
ja: 配列が小さすぎます。
ko: 배열이 너무 작습니다.
pl: Za mała tablica.
pt_br: Matriz muito pequena.
ru: Массив слишком мал.
tr: Dizi çok küçük.
zh_hans: 数组过小。
zh_hant: 陣列太小。
