Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CollectionTypeCannotHaveDataContract
source: {0} has DataContractAttribute attribute.
cs: {0} má atribut DataContractAttribute.
de: {0} enthält ein Attribut DataContractAttribute.
es: {0} tiene un atributo DataContractAttribute.
fr: {0} comporte l'attribut DataContractAttribute.
it: {0} contiene un attributo DataContractAttribute.
ja: {0} には DataContract 属性が含まれています。
ko: {0}에 DataContractAttribute 특성이 있습니다.
pl: Typ {0} ma atrybut DataContractAttribute.
pt_br: {0} tem atributo DataContractAttribute.
ru: {0} имеет атрибут DataContractAttribute.
tr: {0}, DataContractAttribute özniteliğine sahip.
zh_hans: {0} 具有 DataContractAttribute 特性。
zh_hant: {0} 具有 DataContractAttribute 屬性。

# CollectionTypeDoesNotHaveAddMethod
source: {0} does not have a valid Add method with parameter of type '{1}'.
cs: {0} nemá platnou metodu Add s parametrem typu {1}.
de: {0} enthält keine gültige Add-Methode mit einem Parameter vom Typ "{1}".
es: {0} no tiene un método Add con un parámetro del tipo "{1}".
fr: {0} n'a pas de méthode Add valide dotée d'un paramètre de type '{1}'.
it: {0} non contiene un metodo Add valido con parametro di tipo '{1}'.
ja: {0} には、型 '{1}' のパラメーターを持つ有効な Add メソッドが設定されていません。
ko: {0}에 '{1}' 형식의 매개 변수를 가진 유효한 Add 메서드가 없습니다.
pl: Typ {0} nie ma prawidłowej metody Add z parametrem typu „{1}”.
pt_br: {0} não tem um método Add válido com parâmetro do tipo '{1}'.
ru: {0} не имеет допустимого метода Add с параметром типа "{1}".
tr: {0}, '{1}' türünde parametreye sahip geçerli bir Add metodu içermiyor.
zh_hans: {0} 不具有带有类型“{1}”的参数的有效 Add 方法。
zh_hant: {0} 沒有搭配類型 '{1}' 參數的有效 Add 方法。

# CollectionTypeDoesNotHaveDefaultCtor
source: {0} does not have a default constructor.
cs: {0} nemá výchozí konstruktor.
de: {0} enthält keinen Standardkonstruktor.
es: {0} no tiene un constructor predeterminado.
fr: {0} n'a pas de constructeur par défaut.
it: {0} non contiene un costruttore predefinito.
ja: {0} には、既定のコンストラクターが含まれていません。
ko: {0}에 기본 생성자가 없습니다.
pl: Typ {0} nie ma domyślnego konstruktora.
pt_br: {0} não tem um construtor padrão.
ru: {0} не имеет конструктора по умолчанию.
tr: {0} varsayılan bir yapılandırıcıya sahip değil.
zh_hans: {0} 不具有默认的构造函数。
zh_hant: {0} 沒有預設的建構函式。

# CollectionTypeHasMultipleDefinitionsOfInterface
source: {0} has multiple definitions of interface '{1}'.
cs: {0} má více definicí rozhraní {1}.
de: {0} enthält mehrere Definitionen der Schnittstelle "{1}".
es: {0} tiene varias definiciones de la interfaz "{1}".
fr: {0} a plusieurs définitions de l'interface '{1}'.
it: {0} contiene più definizioni dell'interfaccia '{1}'.
ja: {0} には、インターフェイス '{1}' の複数の定義が含まれています。
ko: {0}에 '{1}' 인터페이스의 정의가 여러 개 있습니다.
pl: Typ {0} ma wiele definicji interfejsu „{1}”.
pt_br: {0} tem várias definições de interface '{1}'.
ru: {0} имеет несколько определений интерфейса "{1}".
tr: {0}, '{1}' arabiriminin birkaç tanımına sahip.
zh_hans: {0} 具有接口“{1}”的多个定义。
zh_hant: {0} 具有多個介面 '{1}' 的定義。

# CollectionTypeIsNotIEnumerable
source: {0} does not implement IEnumerable interface.
cs: {0} neimplementuje rozhraní IEnumerable.
de: {0} implementiert keine IEnumerable-Schnittstelle.
es: {0} no implementa la interfaz IEnumerable.
fr: {0} n'implémente pas l'interface IEnumerable.
it: {0} non implementa l'interfaccia IEnumerable.
ja: {0} は、IEnumerable インターフェイスを実装していません。
ko: {0}이(가) IEnumerable 인터페이스를 구현하지 않습니다.
pl: Typ {0} nie ma zaimplementowanego interfejsu IEnumerable.
pt_br: {0} não implementa a interface IEnumerable.
ru: {0} не реализует интерфейс IEnumerable.
tr: {0}, IEnumerable arabirimini uygulamıyor.
zh_hans: {0} 没有实现 IEnumerable 接口。
zh_hant: {0} 未實作 IEnumerable 介面。

# ComplexTypeRestrictionNotSupported
source: Complex types derived by restriction not supported.
cs: Komplexní typy odvozené omezením nejsou podporovány.
de: Durch Einschränkung abgeleitete komplexe Typen werden nicht unterstützt.
es: No se admiten los tipos complejos derivados de una restricción.
fr: Les types complexes dérivés par restriction ne sont pas pris en charge.
it: I tipi complessi derivati per restrizione non sono supportati.
ja: 制限により派生した複合型はサポートされていません。
ko: 제한에 의해 파생된 복합 형식은 지원되지 않습니다.
pl: Typy złożone pochodne przez ograniczenie nie są obsługiwane.
pt_br: Não há suporte para tipos complexos derivados por restrição.
ru: Составные типы, произведенные путем ограничения, не поддерживаются.
tr: Kısıtlama ile türetilen karmaşık türler desteklenmez.
zh_hans: 不支持由限制派生的复杂类型。
zh_hant: 不支援由限制所衍生的複雜類型。

# CouldNotReadSerializationSchema
source: An internal error has occurred. Could not load serialization schema. Consider providing schema with namespace '{0}'.
cs: Došlo k vnitřní chybě. Nelze načíst schéma serializace. Schéma můžete poskytnout s oborem názvů {0}.
de: Ein interner Fehler ist aufgetreten. Das Serialisierungsschema konnte nicht geladen werden. Stellen Sie ggf. ein Schema mit dem Namespace "{0}" bereit.
es: Error interno. No se pudo cargar el esquema de serialización. Se recomienda proporcionar al esquema el espacio de nombres "{0}".
fr: Une erreur interne s'est produite. Impossible de charger le schéma de sérialisation. Fournissez un schéma avec l'espace de noms '{0}'.
it: Si è verificato un errore interno. Non è stato possibile caricare lo schema di serializzazione. Provare a specificare lo schema con lo spazio dei nomi '{0}'.
ja: 内部エラーが発生しました。シリアル化スキーマを読み込めませんでした。名前空間 '{0}' を持つスキーマを提供してください。
ko: 내부 오류가 발생했습니다. serialization 스키마를 로드할 수 없습니다. '{0}' 네임스페이스가 있는 스키마를 제공해 보세요.
pl: Wystąpił błąd wewnętrzny. Nie można załadować schematu serializacji. Podaj schemat z przestrzeni nazw „{0}”.
pt_br: Erro interno. Não foi possível carregar o esquema de serialização. Considere fornecer um esquema com o namespace '{0}'.
ru: Произошла внутренняя ошибка. Не удалось загрузить схему сериализации. Укажите схему с пространством имен "{0}".
tr: Bir iç hata oluştu. Serileştirme şeması yüklenemedi. '{0}' ad alanın sahip olan şemayı sağlamayı deneyin.
zh_hans: 出现内部错误。无法加载序列化架构。请考虑提供具有命名空间“{0}”的架构。
zh_hant: 發生內部錯誤。無法載入序列化結構描述。請考慮提供命名空間為 '{0}' 的結構描述。

# DataContractCacheOverflow
source: An internal error has occurred. DataContract cache overflow.
cs: Došlo k vnitřní chybě. Přetečení mezipaměti kontraktu DataContract.
de: Ein interner Fehler ist aufgetreten. Ein Überlauf des DataContract-Cache hat stattgefunden.
es: Error interno. Se desbordó la caché de DataContract.
fr: Une erreur interne s'est produite. Dépassement de la mémoire cache de DataContract.
it: Si è verificato un errore interno. Overflow della cache di DataContract.
ja: 内部エラーが発生しました。DataContract のキャッシュ オーバーフローです。
ko: 내부 오류가 발생했습니다. DataContract 캐시가 오버플로되었습니다.
pl: Wystąpił błąd wewnętrzny. Przepełnienie pamięci podręcznej elementu DataContract.
pt_br: Erro interno. Houve um estouro de cache do DataContract.
ru: Произошла внутренняя ошибка. Переполнение кэша DataContract.
tr: Bir iç hata oluştu. DataContract önbelleği taşması.
zh_hans: 出现内部错误。DataContract 缓存溢出。
zh_hant: 發生內部錯誤。DataContract 快取溢位。

# DataContractNamespaceAlreadySet
source: ContractNamespaceAttribute attribute maps CLR namespace '{2}' to multiple data contract namespaces '{0}' and '{1}'. You can map a CLR namespace to only one data contract namespace.
cs: Atribut ContractNamespaceAttribute mapuje obor názvů CLR {2} na více oborů názvů kontraktů dat {0} a {1}. Obor názvů CLR je možné namapovat jen na jeden obor názvů kontraktu dat.
de: Das Attribut ContractNamespaceAttribute ordnet den CLR-Namespace "{2}" den Datenvertragsnamespaces "{0}" und "{1}" zu. Ein CLR-Namespace kann nur einem Datenvertragsnamespace zugeordnet werden.
es: El atributo ContractNamespaceAttribute asigna el espacio de nombres CLR "{2}" a varios espacios de nombre de contrato de datos "{0}" y "{1}". Un espacio de nombres CLR se puede asignar solo a un espacio de nombres de contrato de datos.
fr: L'attribut ContractNamespaceAttribute mappe l'espace de noms CLR '{2}' à plusieurs espaces de noms de contrats de données '{0}' et '{1}'. Vous ne pouvez mapper un espace de noms CLR qu'à un seul espace de noms de contrat de données.
it: L'attributo ContractNamespaceAttribute consente di eseguire il mapping dello spazio dei nomi '{2}' di CLR a più spazi dei nomi del contratto di dati '{0}' e '{1}'. È possibile eseguire il mapping uno spazio dei nomi di CLR a un solo spazio dei nomi del contratto di dati.
ja: ContractNamespaceAttribute 属性は、CLR 名前空間 '{2}' を複数のデータ コントラクト名前空間 '{0}' および '{1}' にマッピングします。CLR 名前空間は 1 つのデータ コントラクト名前空間にしかマッピングできません。
ko: ContractNamespaceAttribute 특성이 CLR 네임스페이스 '{2}'을(를) 여러 데이터 계약 네임스페이스 '{0}' 및 '{1}'에 매핑합니다. CLR 네임스페이스를 하나의 데이터 계약 네임스페이스에만 매핑할 수 있습니다.
pl: Atrybut ContractNamespaceAttribute mapuje przestrzeń nazw CLR „{2}” na wiele przestrzeni nazw kontraktu danych „{0}” i „{1}”. Przestrzeń nazw CLR można zamapować tylko na jedną przestrzeń nazw kontraktu danych.
pt_br: O atributo ContractNamespaceAttribute mapeia o namespace CLR '{2}' para vários namespaces de contrato de dados '{0}' e '{1}'. Você pode mapear um namespace CLR para apenas um namespace de contrato de dados.
ru: Атрибут ContractNamespaceAttribute сопоставляет пространство имен CLR "{2}" с пространствами имен контрактов данных "{0}" и "{1}". Пространство имен CLR можно сопоставить только с одним пространством имен контрактов данных.
tr: ContractNamespaceAttribute özniteliği '{2}' CLR ad alanını, çoklu veri anlaşması ad alanları '{0}' ve '{1}' ile eşliyor. Bir CLR ad alanını yalnızca bir tek veri anlaşması ad alanıyla eşleyebilirsiniz.
zh_hans: ContractNamespaceAttribute 特性将 CLR 命名空间“{2}”映射到多个数据协定命名空间“{0}”和“{1}”。仅可以将 CLR 命名空间映射到一个数据协定命名空间。
zh_hant: ContractNamespaceAttribute 屬性將 CLR 命名空間 '{2}' 對應到多個資料合約命名空間 '{0}' 及'{1}'。但您只能將 CLR 命名空間對應到一個資料合約命名空間。

# DataContractNamespaceIsNotValid
source: DataContract namespace '{0}' is not a valid URI.
cs: Obor názvů kontraktu DataContract {0} není platný identifikátor URI.
de: Der DataContract-Namespace "{0}" ist kein gültiger URI.
es: El espacio de nombres de DataContract "{0}" no es un URI válido.
fr: L'espace de noms DataContract '{0}' n'est pas un URI valide.
it: Lo spazio dei nomi '{0}' di DataContract non è un URI valido.
ja: DataContract 名前空間 '{0}' は、有効な URI ではありません。
ko: DataContract 네임스페이스 '{0}'이(가) 유효한 URI가 아닙니다.
pl: Przestrzeń nazw schematu DataContract „{0}” nie jest prawidłowym identyfikatorem URI.
pt_br: O namespace DataContract '{0}' não é um URI válido.
ru: Пространство имен DataContract "{0}" не является допустимым URI.
tr: DataContract ad alanı '{0}', geçerli bir URI değil.
zh_hans: DataContract 命名空间“{0}”不是有效的 URI。
zh_hant: DataContract 命名空間 '{0}' 不是有效的 URI。

# DataContractNamespaceReserved
source: DataContract namespace '{0}' cannot be specified since it is reserved.
cs: Obor názvů kontraktu DataContract {0} nelze zadat, protože je vyhrazen.
de: Der DataContract-Namespace "{0}" kann nicht angegeben werden, da er reserviert ist.
es: No se puede especificar el espacio de nombres de DataContract "{0}", ya que está reservado.
fr: Spécification de l'espace de noms DataContract '{0}' impossible, car il est réservé.
it: Lo spazio dei nomi '{0}' di DataContract è riservato e non può essere specificato.
ja: DataContract 名前空間 '{0}' は予約されているため、指定できません。
ko: DataContract 네임스페이스 '{0}'은(는) 예약되었기 때문에 지정할 수 없습니다.
pl: Nie można określić przestrzeni nazw schematu DataContract „{0}” z powodu wcześniejszej rezerwacji.
pt_br: O namespace DataContract '{0}' não pode ser especificado porque está reservado.
ru: Невозможно указать пространство имен DataContract "{0}", так как оно зарезервировано.
tr: Ayrılmış olduğundan, DataContract ad alanı '{0}' belirtilemiyor.
zh_hans: 无法指定 DataContract 命名空间“{0}”，因为它是被保留的命名空间。
zh_hant: 無法指定 DataContract 命名空間 '{0}'，因為它是保留的命名空間。

# DataMemberOnEnumField
source: Member '{0}.{1}' has DataMemberAttribute attribute. Use EnumMemberAttribute attribute instead.
cs: Člen {0}.{1} má atribut DataMemberAttribute. Použijte místo něj atribut EnumMemberAttribute.
de: Der Member "{0}.{1}" enthält das Attribut DataMemberAttribute. Verwenden Sie stattdessen das Attribut EnumMemberAttribute.
es: El miembro "{0}.{1}" tiene el atributo DataMemberAttribute. Use el atributo EnumMemberAttribute.
fr: Le membre '{0}.{1}' est doté de l'attribut DataMemberAttribute. Utilisez l'attribut EnumMemberAttribute à la place.
it: Il membro '{0}.{1}' contiene l'attributo DataMemberAttribute. Usare l'attributo EnumMemberAttribute.
ja: メンバー '{0}.{1}' には DataMemberAttribute 属性が含まれています。代わりに EnumMemberAttribute 属性を使用してください。
ko: 멤버 '{0}.{1}'에 DataMemberAttribute 특성이 있습니다. 대신 EnumMemberAttribute 특성을 사용하세요.
pl: Składowa „{0}.{1}” ma atrybut DataMemberAttribute. Użyj w zamian atrybutu EnumMemberAttribute.
pt_br: O membro '{0}.{1}' tem atributo DataMemberAttribute. Em vez disso, use o atributo EnumMemberAttribute.
ru: Член "{0}.{1}" имеет атрибут DataMemberAttribute. Вместо него используйте атрибут EnumMemberAttribute.
tr: '{0}.{1}' üyesi DataMemberAttribute özniteliğine sahip. Bunun yerine EnumMemberAttribute özniteliğini kullanın.
zh_hans: 成员“{0}.{1}”具有 DataMemberAttribute 特性。请改用 EnumMemberAttribute 特性。
zh_hant: 成員 '{0}.{1}' 具有 DataMemberAttribute 屬性。請改用 EnumMemberAttribute 屬性。

# DcTypeNotFoundOnDeserialize
source: Element '{2}:{3}' contains data from a type that maps to the name '{0}:{1}'. The deserializer has no knowledge of any type that maps to this name. Consider using a DataContractResolver if you are using DataContractSerializer or add the type corresponding to '{1}' to the list of known types - for example, by using the KnownTypeAttribute attribute or by adding it to the list of known types passed to the serializer.
cs: Element {2}:{3} obsahuje data z typu, který se mapuje na název {0}:{1}. Deserializátor nezná žádný typ, který by se mapoval na tento název. Pokud používáte DataContractSerializer, zvažte použití modulu DataContractResolver, nebo přidejte typ odpovídající elementu {1} do seznamu známých typů, např. pomocí atributu KnownTypeAttribute nebo přidáním do seznamu známých typů předaných serializátoru.
de: Das Element "{2}:{3}" enthält Daten eines Typs, der dem Namen "{0}:{1}" zugeordnet ist. Dem Deserialisierungsmodul ist kein Typ bekannt, der diesem Namen zugeordnet ist. Verwenden Sie ggf. einen DataContractResolver, wenn Sie DataContractSerializer verwenden, oder fügen Sie den entsprechenden Typ für "{1}" der Liste der bekannten Typen hinzu. Verwenden Sie dazu z. B. das Attribut KnownTypeAttribute, oder fügen Sie den Typ der an das Serialisierungsmodul übergebenen Liste von bekannten Typen hinzu.
es: El elemento "{2}:{3}" contiene datos de un tipo que coincide con el nombre "{0}:{1}". El deserializador no tiene conocimiento de ningún tipo que esté asignado a este nombre. Si está usando DataContractSerializer, intente usar DataContractResolver o agregar el tipo correspondiente a "{1}" a la lista de tipos conocidos (por ejemplo, usando el atributo KnownTypeAttribute o agregándolo a la lista de tipos conocidos que se pasa a DataContractSerializer).
fr: L'élément '{2}:{3}' contient des données dont le type est mappé au nom '{0}:{1}'. Le désérialiseur n'a connaissance d'aucun type mappé à ce nom. Utilisez DataContractResolver si vous utilisez DataContractSerializer, ou ajoutez le type correspondant à '{1}' dans la liste des types connus, par exemple en utilisant l'attribut KnownTypeAttribute ou en l'ajoutant à la liste des types connus qui est passée au sérialiseur.
it: L'elemento '{2}:{3}' contiene dati di un tipo di cui è stato eseguito il mapping al nome '{0}:{1}'. Il deserializzatore non può determinare il tipo con il mapping a tale nome. Provare a usare DataContractResolver se si intende usare DataContractSerializer o ad aggiungere il tipo corrispondente a '{1}' all'elenco di tipi noti, ad esempio usando l'attributo KnownTypeAttribute o aggiungendolo all'elenco di tipi noti passati al serializzatore.
ja: 要素 '{2}:{3}' には、名前 '{0}:{1}' にマッピングされた型のデータが含まれています。デシリアライザーでは、この名前にマッピングされた型が不明です。DataContractSerializer を使用している場合は DataContractResolver を使用するか、'{1}' に対応する型を既知の型の一覧に追加してください。このためには、たとえば KnownTypeAttribute 属性を使用するか、シリアライザーへ渡される既知の型の一覧にこの型を追加します。
ko: 요소 '{2}:{3}'에 이름 '{0}:{1}'에 매핑되는 형식의 데이터가 있습니다. 역직렬 변환기가 이 이름에 매핑되는 형식을 알지 못합니다. DataContractSerializer를 사용하는 경우 DataContractResolver를 사용하거나 '{1}'에 해당하는 형식을 알려진 형식 목록에 추가해 보세요. 예를 들어 KnownTypeAttribute 특성을 사용하거나 직렬 변환기에 전달된 알려진 형식 목록에 해당 형식을 추가합니다.
pl: Element „{2}:{3}” zawiera dane z typu, który jest mapowany na nazwę „{0}:{1}”. Deserializator nie zna żadnego typu, który jest mapowany na tę nazwę. Rozważ użycie obiektu DataContractResolver, jeśli używasz obiektu DataContractSerializer, lub dodaj typ odpowiadający nazwie „{1}” do listy znanych typów, na przykład za pomocą atrybutu KnownTypeAttribute lub dodając go do listy znanych typów przekazywanej do serializatora.
pt_br: O elemento '{2}:{3}' contém dados de um tipo que mapeia para o nome '{0}:{1}'. O desserializador não tem conhecimento de nenhum tipo que mapeia para esse nome. Considere usar um DataContractResolver se estiver usando um DataContractSerializer ou adicione o tipo correspondente a '{1}' à lista de tipos conhecidos – por exemplo, usando o atributo KnownTypeAttribute ou adicionando-o à lista de tipos conhecidos passados ao serializador.
ru: Элемент "{2}:{3}" содержит данные из типа данных, сопоставляемого с именем "{0}:{1}". В десериализаторе отсутствует информация о каком-либо типе, сопоставляемом с этим именем. Используйте DataContractResolver, если вы используете DataContractSerializer, или добавьте тип, соответствующий "{1}", в список известных типов, например используя атрибут KnownTypeAttribute или путем его добавления в список известных типов, передаваемый в сериализатор.
tr: '{2}:{3}' öğesi, '{0}:{1}' adıyla eşlenen bir türe ait veriler içeriyor. Seri durumdan çıkarıcı bu adla eşlenen herhangi bir tür hakkında bilgi sahibi değil. DataContractSerializer kullanıyorsanız bir DataContractResolver kullanmayı deneyin veya '{1}' öğesine karşılık gelen türü bilinen türler listesine ekleyin (örneğin KnownTypeAttribute özniteliğini kullanarak ya da bunu serileştiriciye geçirilen bilinen türler listesine ekleyerek).
zh_hans: 元素“{2}:{3}”含有来自映射到名称“{0}:{1}”的类型的数据。反序列化程序无法识别任何映射到此名称的类型。请考虑使用 DataContractResolver (如果你正在使用 DataContractSerializer)，或将与“{1}”对应的类型添加到已知类型的列表。例如，通过使用 KnownTypeAttribute 属性，或者将它添加到传递给序列化程序的已知类型列表。
zh_hant: 元素 '{2}: {3}' 包含來自對應至名稱 '{0}: {1}' 之類型的資料。還原序列化程式並不知道對應到此名稱的任何類型。若目前使用 DataContractSerializer，請考慮使用 DataContractResolver，或將對應到 '{1}' 的類型新增至已知類型清單 - 例如，使用 KnownTypeAttribute 屬性，或將其新增至已傳遞到序列化程式的已知類型清單。

# DcTypeNotFoundOnSerialize
source: Type '{0}' with data contract name '{1}:{2}' is not expected. Consider using a DataContractResolver if you are using DataContractSerializer or add any types not known statically to the list of known types - for example, by using the KnownTypeAttribute attribute or by adding them to the list of known types passed to the serializer.
cs: Typ {0} s názvem kontraktu dat {1}:{2} není očekávaný typ. Pokud používáte DataContractSerializer, zvažte použití modulu DataContractResolver, nebo do seznamu známých typů přidejte typy, které nejsou známé staticky (například pomocí atributu KnownTypeAttribute nebo jejich přidáním do seznamu známých typů předaných serializátoru).
de: Der Typ "{0}" mit dem Datenvertragsnamen "{1}:{2}" wird nicht erwartet. Verwenden Sie ggf. einen DataContractResolver, wenn Sie DataContractSerializer verwenden, oder fügen Sie alle unbekannten Typen statisch der Liste der bekannten Typen hinzu. Verwenden Sie dazu z. B. das Attribut KnownTypeAttribute, oder fügen Sie die Typen der an das Serialisierungsmodul übergebenen Liste von bekannten Typen hinzu.
es: No se espera el tipo "{0}" con el nombre de contrato de datos "{1}:{2}". Si está usando DataContractSerializer, intente usar DataContractResolver o agregar tipos no conocidos estáticamente a la lista de tipos conocidos (por ejemplo, usando el atributo KnownTypeAttribute o agregándolos a la lista de tipos conocidos que se pasa a DataContractSerializer).
fr: Le type '{0}' comportant le nom de contrat de données '{1}:{2}' n'est pas attendu. Utilisez un DataContractResolver si vous utilisez DataContractSerializer ou ajoutez tous les types non connus statiquement à la liste des types connus, par exemple en utilisant l'attribut KnownTypeAttribute ou en les ajoutant à la liste des types connus passée au sérialiseur.
it: Il tipo '{0}' con il nome di contratto di dati '{1}:{2}' non è previsto. Provare a usare DataContractResolver se si intende usare DataContractSerializer o ad aggiungere in modo statico tipi sconosciuti all'elenco di tipi noti, ad esempio usando l'attributo KnownTypeAttribute o aggiungendoli all'elenco di tipi noti passato al serializzatore.
ja: データ コントラクト名 '{1}:{2}' を持つ型 '{0}' は予期されていません。DataContractSerializer を使用している場合は DataContractResolver を使用することを検討するか、静的に認知されていないすべての型を既知の型の一覧に追加してください。このためには、たとえば KnownTypeAttribute 属性を使用するか、シリアライザーへ渡される既知の型の一覧にこれらの型を追加します。
ko: 데이터 계약 이름 '{1}:{2}'을(를) 가진 '{0}' 형식은 필요한 형식이 아닙니다. DataContractSerializer를 사용하는 경우 DataContractResolver를 사용하거나 정적으로 알려지지 않은 모든 형식을 알려진 형식 목록에 추가하세요. 예를 들어 KnownTypeAttribute 특성을 사용하거나 직렬 변환기에 전달된 알려진 형식 목록에 이러한 형식을 추가합니다.
pl: Nieoczekiwany typ „{0}” o nazwie kontraktu danych „{1}:{2}”. Rozważ użycie obiektu DataContractResolver, jeśli używasz obiektu DataContractSerializer, lub dodaj dowolny typ nieznany statycznie do listy znanych typów, na przykład za pomocą atrybutu KnownTypeAttribute lub dodając go do listy znanych typów przekazywanej do serializatora.
pt_br: O tipo '{0}' com nome de contrato de dados '{1}:{2}' não é esperado. Considere usar um DataContractResolver se você estiver usando um DataContractSerializer ou adicione quaisquer tipos não conhecidos estaticamente à lista de tipos conhecidos – por exemplo, usando o atributo KnownTypeAttribute ou adicionando-os à lista de tipos conhecidos passados ao serializador.
ru: Тип "{0}" с именем контракта данных "{1}:{2}" не ожидается. Попробуйте использовать DataContractResolver, если вы используете DataContractSerializer, или добавьте любые статически неизвестные типы в список известных типов, например используя атрибут KnownTypeAttribute или путем их добавления в список известных типов, передаваемый в сериализатор.
tr: '{1}:{2}' veri anlaşması adına sahip '{0}' türü beklenmiyor. DataContractSerializer kullanıyorsanız bir DataContractResolver kullanmayı deneyin veya statik olarak bilinmeyen türleri bilinen türler listesine ekleyin (örneğin KnownTypeAttribute özniteliğini kullanarak ya da bunları serileştiriciye geçirilen bilinen türler listesine ekleyerek).
zh_hans: 数据协定名称为“{1}:{2}”的类型“{0}”不是所需的类型。请考虑使用 DataContractResolver (如果你正在使用 DataContractSerializer)，或将任何未知类型以静态方式添加到已知类型的列表。例如，可以使用 KnownTypeAttribute 属性，或者将未知类型添加到传递给序列化程序的已知类型列表。
zh_hant: 不需要資料合約名稱為 '{1}: {2}' 的類型 '{0}'。如果您使用 DataContractSerializer，請考慮使用 DataContractResolver，或將任何統計上不明的類型新增已知類型清單 - 例如，使用 KnownTypeAttribute 屬性，或將它們新增已傳送給序列化程式的已知類型清單。
