Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IsAnyCannotBeSerializedAsDerivedType
source: An object of type '{0}' cannot be serialized at the top level for IXmlSerializable root type '{1}' since its IsAny setting is 'true'. This type must write all its contents including the root element. Verify that the IXmlSerializable implementation is correct.
cs: Objekt typu {0} nelze v horní úrovni serializovat pro kořenový typ IXmlSerializable {1}, protože má pro nastavení IsAny hodnotu true. Tento typ musí zapsat veškerý svůj obsah včetně kořenového elementu. Zkontrolujte, jestli je implementace IXmlSerializable správná.
de: Ein Objekt vom Typ "{0}" kann nicht auf oberster Ebene für den IXmlSerializable-Stammtyp "{1}" serialisiert werden, da die IsAny-Einstellung auf "true" gesetzt ist. Dieser Typ muss seinen gesamten Inhalt einschließlich des Stammelements schreiben. Stellen Sie sicher, dass die IXmlSerializable-Implementierung korrekt ist.
es: No se puede serializar un objeto del tipo "{0}" en el nivel superior del tipo raíz IXmlSerializable "{1}", ya que el valor de su opción IsAny es "true". Este tipo debe escribir todo su contenido, incluido el elemento raíz. Compruebe que la implementación de IXmlSerializable es correcta.
fr: Sérialisation impossible d'un objet de type '{0}' au niveau supérieur pour le type racine IXmlSerializable '{1}', car la valeur de son paramètre IsAny est 'true'. Ce type doit écrire tout son contenu, en incluant l'élément racine. Vérifiez que l'implémentation IXmlSerializable est correcte.
it: Non è possibile serializzare un oggetto di tipo '{0}' al primo livello per il tipo radice '{1}' di IXmlSerializable perché IsAny è 'true'. Questo tipo deve scrivere l'intero contenuto, compreso l'elemento radice. Verificare che l'implementazione di IXmlSerializable sia corretta.
ja: IXmlSerializable ルート型 '{1}' の IsAny は 'true' に設定されているため、この型のトップ レベルで型 '{0}' のオブジェクトをシリアル化できません。この型は、ルート要素を含むそのすべての内容を書き込む必要があります。IXmlSerializable の実装が正しいことを確認してください。
ko: 해당 IsAny 설정이 'true'이기 때문에 IXmlSerializable 루트 형식 '{1}'의 최상위 수준에서 '{0}' 형식의 개체를 직렬화할 수 없습니다. 이 형식은 루트 요소를 포함한 모든 내용을 기록해야 합니다. IXmlSerializable 구현이 올바른지 확인하세요.
pl: Obiektu typu „{0}” nie można serializować na najwyższym poziomie w przypadku typu głównego „{1}” interfejsu IXmlSerializable, ponieważ wartość jego parametru IsAny to „true”. W przypadku tego typu musi być zapisana cała jego zawartość, łącznie z elementem głównym. Upewnij się, że implementacja interfejsu IXmlSerializable jest prawidłowa.
pt_br: Um objeto do tipo '{0}' não pode ser serializado no nível superior para o tipo de raiz IXmlSerializable '{1}' porque sua configuração IsAny é 'true'. Esse tipo deve gravar todo o seu conteúdo, inclusive o elemento raiz. Verifique se a implementação do IXmlSerializable está correta.
ru: Объект типа "{0}" не может быть сериализован на самом верхнем уровне, так как тип корня IXmlSerializable "{1}" с IsAny=true должен записать все свое содержимое, включая корневой элемент. Проверьте правильность реализации IXmlSerializable.
tr: IsAny ayarı 'true' olduğundan, IXmlSerializable kök türü '{1}' en üst düzeyinde '{0}' türünde bir nesne serileştirilemez. Bu tür, kök öğeyi de içeren içerik değerlerinin tümünü yazmalıdır. IXmlSerializable uygulamasının doğru olduğundan emin olun.
zh_hans: 由于 IXmlSerializable 根类型“{1}”的 IsAny 设置为 "true"，因此无法在其顶层序列化类型为“{0}”的对象。此类型必须写入包括根元素在内的所有内容。请验证 IXmlSerializable 实现是否正确。
zh_hant: 無法在 IXmlSerializable 根類型 '{1}' 的最上層序列化類型 '{0}' 的物件，因為其 IsAny 設定為 'true'。此類型必須寫出它的所有內容，包括根項目在內。請確定 IXmlSerializable 實作正確。

# IsAnyCannotHaveXmlRoot
source: Type '{0}' cannot specify an XmlRootAttribute attribute because its IsAny setting is 'true'. This type must write all its contents including the root element. Verify that the IXmlSerializable implementation is correct.
cs: Typ {0} nemůže udávat atribut XmlRootAttribute, protože má pro nastavení IsAny hodnotu true. Tento typ musí zapsat veškerý svůj obsah včetně kořenového elementu. Zkontrolujte, jestli je implementace IXmlSerializable správná.
de: Der Typ "{0}" kann kein Attribut XmlRootAttribute festlegen, da die IsAny-Einstellung auf "true" gesetzt ist. Dieser Typ muss seinen gesamten Inhalt einschließlich des Stammelements schreiben. Stellen Sie sicher, dass die IXmlSerializable-Implementierung korrekt ist.
es: El tipo "{0}" no puede especificar un atributo XmlRootAttribute, porque el valor de su opción IsAny es "true". Este tipo debe escribir todo su contenido, incluido el elemento raíz. Compruebe que la implementación de IXmlSerializable es correcta.
fr: Le type '{0}' ne peut pas spécifier un attribut XmlRootAttribute, car la valeur de son paramètre IsAny est 'true'. Ce type doit écrire tout son contenu, en incluant l'élément racine. Vérifiez que l'implémentation IXmlSerializable est correcte.
it: Il tipo '{0}' non può specificare un attributo XmlRootAttribute perché la relativa impostazione IsAny è 'true'. Questo tipo deve scrivere l'intero contenuto, compreso l'elemento radice. Verificare che l'implementazione di IXmlSerializable sia corretta.
ja: IsAny が 'True' に設定されているため、型 '{0}' は XmlRootAttribute 属性を指定できません。この型はルート要素を含むすべての内容を書き込む必要があります。IXmlSerializable の実装が正しいことを確認してください。
ko: 해당 IsAny 설정이 'true'이기 때문에 '{0}' 형식은 XmlRootAttribute 특성을 지정할 수 없습니다. 이 형식은 루트 요소를 포함한 모든 내용을 기록해야 합니다. IXmlSerializable 구현이 올바른지 확인하세요.
pl: W przypadku typu „{0}” nie można określić atrybutu XmlRootAttribute, ponieważ wartość jego parametru IsAny to „true”. W przypadku tego typu musi być zapisana cała jego zawartość, łącznie z elementem głównym. Upewnij się, że implementacja interfejsu IXmlSerializable jest prawidłowa.
pt_br: O tipo '{0}' não pode especificar um atributo XmlRootAttribute porque sua configuração IsAny é 'true'. Esse tipo deve gravar todo o seu conteúdo, inclusive o elemento raiz. Verifique se a implementação do IXmlSerializable está correta.
ru: Тип "{0}" не может задавать атрибут XmlRootAttribute, так как его параметр IsAny имеет значение true. Этот тип должен записать все свое содержимое, включая корневой элемент. Проверьте правильность реализации IXmlSerializable.
tr: IsAny ayarı 'true' olduğundan, '{0}' türünde bir XmlRootAttribute özniteliği belirtilemez. Bu tür, kök öğeyi de içeren içerik değerlerinin tümünü yazmalıdır. IXmlSerializable uygulamasının doğru olduğundan emin olun.
zh_hans: 类型“{0}”无法指定 XmlRootAttribute 特性，因为它的 IsAny 设置为 "true"。此类型必须写入包括根元素在内的所有内容。请验证 IXmlSerializable 实现是否正确。
zh_hant: 類型 '{0}' 無法指定 XmlRootAttribute 屬性，因為它的 IsAny 設定是 'true'。此類型必須寫出它的所有內容，包括根項目在內。請確定 IXmlSerializable 實作正確。

# IsDictionaryFormattedIncorrectly
source: '{0}' is an invalid value for IsDictionary annotation. {1}
cs: Hodnota {0} není platná pro poznámku IsDictionary. {1}
de: "{0}" ist ein ungültiger Wert für die IsDictionary-Anmerkung. {1}
es: "{0}" es un valor no válido para la anotación IsDictionary. {1}
fr: '{0}' est une valeur non valide pour l'annotation IsDictionary. {1}
it: '{0}' è un valore non valido per l'annotazione IsDictionary. {1}
ja: '{0}' は、IsDictionary の注釈として無効な値です。{1}
ko: '{0}'이(가) IsDictionary 주석에 대한 잘못된 값입니다. {1}
pl: „{0}” jest nieprawidłową wartością adnotacji IsDictionary. {1}
pt_br: '{0}' é um valor inválido para a anotação IsDictionary. {1}
ru: "{0}" не является допустимым значением для заметки IsDictionary. {1}
tr: '{0}', IsDictionary açıklaması için geçersiz bir değerdir. {1}
zh_hans: “{0}”对于 IsDictionary 注释为无效值。{1}
zh_hant: '{0}' 對 IsDictionary 註釋是無效值。{1}

# IsNotAssignableFrom
source: An internal error has occurred. '{0}' is not assignable from '{1}' - error generating code for serialization.
cs: Došlo k vnitřní chybě. {0} nelze přiřadit z {1} – při generování kódu pro serializaci došlo k chybě.
de: Ein interner Fehler ist aufgetreten. "{0}" kann nicht von "{1}" zugewiesen werden – Fehler beim Generieren des Codes für die Serialisierung.
es: Error interno. "{0}" no se puede asignar desde "{1}": error al generar el código de la serialización.
fr: Une erreur interne s'est produite. Affection de '{0}' impossible à partir de '{1}' – erreur au moment de la génération du code pour la sérialisation.
it: Si è verificato un errore interno. Non è possibile assegnare '{0}' da '{1}'. Si è verificato un errore durante la generazione del codice per la serializzazione.
ja: 内部エラーが発生しました。'{0}' を '{1}' から割り当てることはできません。シリアル化用コードの生成エラーです。
ko: 내부 오류가 발생했습니다. '{0}'을(를) '{1}'에서 할당할 수 없습니다. serialization을 위한 코드를 생성하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd wewnętrzny. Nie można przypisać elementu „{0}” z elementu „{1}” — błąd generowania kodu serializacji.
pt_br: Erro interno. '{0}' não pode ser atribuído de '{1}' – código de geração de erro para serialização.
ru: Произошла внутренняя ошибка. "{0}" не может быть назначено из "{1}" — ошибка генерирования кода для сериализации.
tr: Bir iç hata oluştu. '{0}' öğesi '{1}' içinden atanamaz. Serileştirme kodu oluşturulurken hata oluştu.
zh_hans: 出现内部错误。无法从“{1}”中分配“{0}”- 生成序列化的代码时出错。
zh_hant: 發生內部錯誤。無法從 '{1}' 指派'{0}' - 產生序列化的程式碼時發生錯誤。

# IsRequiredDataMemberOnIsReferenceDataContractType
source: '{0}.{1}' has the IsRequired setting of '{2}. However, '{0}' has the IsReference setting of '{2}', because either it is set explicitly, or it is derived from a base class. Set IsRequired on '{0}.{1}' to false, or disable IsReference on '{0}'.
cs: {0}.{1} má nastavení IsRequired {2}. {0} má nastavení IsReference {2}, protože je buď nastaveno explicitně, nebo je odvozeno od základní třídy. Nastavte IsRequired v {0}.{1} na hodnotu false, nebo zakažte IsReference v {0}.
de: Die IsRequired-Einstellung von "{0}.{1}" ist auf "{2}" festgelegt. Die IsReference-Einstellung von "{0}" ist jedoch auf "{2}" festgelegt, da sie explizit festgelegt oder von einer Basisklasse abgeleitet wurde. Legen Sie IsRequired für "{0}.{1}" auf "false" fest, oder deaktivieren Sie IsReference für "{0}".
es: "{0}.{1}" tiene el valor IsRequired de "{2}". Sin embargo, "{0}" tiene el valor IsReference de "{2}", porque se ha establecido de forma explícita o porque se ha derivado de una clase base. Establezca IsRequired en "{0}.{1}" en false, o bien deshabilite IsReference en "{0}".
fr: '{0}.{1}' a le paramètre IsRequired de '{2}. Cependant, '{0}' a le paramètre IsReference de '{2}', car il est défini explicitement ou dérivé d'une classe de base. Affectez false à IsRequired sur '{0}.{1}' ou désactivez IsReference sur '{0}'.
it: L'impostazione IsRequired di '{0}.{1}' è '{2}. Tuttavia, l'impostazione IsRequired di '{0}' è '{2}' perché è impostata in modo esplicito o derivata da una classe di base. Impostare IsRequired di '{0}.{1}' su false oppure disabilitare IsReference in '{0}'.
ja: '{0}.{1}' の IsRequired 設定が '{2}' ですが、'{0}' の IsReference 設定は '{2}' です。これは、明示的に設定されているか、基本クラスから派生しているためです。'{0}.{1}' の IsRequired を false に設定するか、'{0}' の IsReference を無効にしてください。
ko: '{0}.{1}'의 IsRequired 설정은 '{2}'입니다. 하지만 명시적으로 설정되었거나 기본 클래스에서 파생되어 '{0}'의 IsReference 설정은 '{2}'입니다. '{0}.{1}'의 IsRequired를 false로 설정하거나 '{0}'에서 IsReference를 사용하지 않도록 설정하세요.
pl: Element „{0}.{1}” ma ustawienie IsRequired równe „{2}”. Tymczasem element „{0}” ma ustawienie IsReference równe „{2}”, ponieważ jest ono określone jawnie lub pochodzi z klasy bazowej. Podaj wartość false dla ustawienia IsRequired w elemencie „{0}.{1}” lub wyłącz ustawienie IsReference w elemencie „{0}”.
pt_br: '{0}.{1}' tem a configuração IsRequired de '{2}. No entanto, '{0}' tem a configuração IsReference de '{2}', pois está definida explicitamente ou é derivada de uma classe base. Defina IsRequired em '{0}.{1}' como false ou desabilite IsReference em '{0}'.
ru: "{0}.{1}" содержит параметр IsRequired для "{2}. Однако "{0}" содержит параметр IsReference для "{2}", поскольку он установлен явно или является производным от базового класса. Установите параметр IsRequired для "{0}.{1}" в значение false или отключите IsReference для "{0}".
tr: '{0}.{1}' için IsRequired ayarı '{2}'. Ancak, açıkça ayarlandığından veya bir temel sınıftan türetildiğinden '{0}' için IsReference ayarı '{2}'. '{0}.{1}' üzerinde IsRequired ayarını false yapın veya '{0}' üzerinde IsReference ayarını devre dışı bırakın.
zh_hans: “{0}.{1}”具有值为“{2}”的 IsRequired 设置。但是，“{0}”具有值为“{2}”的 IsReference 设置，因为它是显式设置的，或者它派生自基类。请将“{0}.{1}”的 IsRequired 设置为 false，或者禁用“{0}”的 IsReference。
zh_hant: '{0}.{1}' 的 IsRequired 設定為 '{2}，但 '{0}' 的 IsReference 設定為 '{2}'，有可能已明確設定，或是衍生自基底類別。請在 '{0}.{1}' 上將 IsRequired 設為 false，或在 '{0}' 上停用 IsReference。

# IsValueTypeFormattedIncorrectly
source: '{0}' is an invalid value for IsValueType annotation. {1}
cs: {0} není platná hodnota pro poznámku IsValueType. {1}
de: "{0}" ist ein ungültiger Wert für eine IsValueType-Anmerkung. {1}
es: "{0}" es un valor no válido para la anotación IsValueType. {1}
fr: '{0}' est une valeur non valide pour l'annotation IsValueType. {1}
it: '{0}' non è un valore valido per l'annotazione IsValueType. {1}
ja: '{0}' は、IsValueType の注釈としては無効な値です。{1}
ko: '{0}'이(가) IsValueType 주석에 대한 잘못된 값입니다. {1}
pl: „{0}” jest nieprawidłową wartością adnotacji IsValueType. {1}
pt_br: '{0}' é um valor inválido para a anotação de IsValueType. {1}
ru: "{0}" не является допустимым значением для заметки IsValueType. {1}
tr: '{0}' IsValueType ek açıklaması için geçersiz bir değerdir. {1}
zh_hans: “{0}”对于 IsValueType 注释为无效值。{1}
zh_hant: '{0}' 對 IsValueType 註釋是無效值。 {1}

# JsonAttributeAlreadyWritten
source: Cannot write attribute with local name '{0}' multiple times.
cs: Atribut s místním názvem {0} nelze zapisovat vícekrát.
de: Das Attribut mit dem lokalen Namen "{0}" kann nicht mehrfach geschrieben werden.
es: No se puede escribir el atributo con el nombre local "{0}" varias veces.
fr: Impossible d'écrire plusieurs fois l'attribut comportant le nom local '{0}'.
it: Non è possibile scrivere più volte l'attributo con nome locale '{0}'.
ja: ローカル名 '{0}' の属性は複数回書き込めません。
ko: 로컬 이름이 '{0}'인 특성은 여러 번 쓸 수 없습니다.
pl: Nie można wielokrotnie zapisać atrybutu o nazwie lokalnej „{0}”.
pt_br: Não é possível gravar atributo com nome local '{0}' várias vezes.
ru: Невозможно записать атрибут с локальным именем "{0}" несколько раз.
tr: Yerel adı '{0}' olan öznitelik birden çok kez yazılamaz.
zh_hans: 无法多次写入本地名称为“{0}”的特性。
zh_hant: 無法多次寫入本機名稱 '{0}' 的屬性。

# JsonAttributeMustHaveElement
source: WriteStartElement must be called at least once before WriteStartAttribute may be called.
cs: Nutnou podmínkou volání metody WriteStartAttribute je minimálně jedno předchozí volání metody WriteStartElement.
de: WriteStartElement muss mindestens einmal aufgerufen werden, bevor WriteStartAttribute aufgerufen werden kann.
es: Se debe llamar a WriteStartElement al menos una vez antes de que se pueda llamar a WriteStartAttribute.
fr: L'élément WriteStartElement doit être appelé au moins une fois avant de pouvoir appeler l'attribut WriteStartAttribute.
it: WriteStartElement deve essere chiamato almeno una volta prima di poter chiamare WriteStartAttribute.
ja: WriteStartAttribute が呼び出される前に、WriteStartElement が少なくとも 1 回呼び出されなければなりません。
ko: WriteStartElement를 한 번 이상 호출해야 WriteStartAttribute를 호출할 수 있습니다.
pl: Należy co najmniej raz wywołać metodę WriteStartElement, aby można było wywołać metodę WriteStartAttribute.
pt_br: O WriteStartElement deve ser chamado pelo menos uma vez antes de WriteStartAttribute ser chamado.
ru: До вызова метода WriteStartAttribute необходимо хотя бы один раз вызвать метод WriteStartElement.
tr: WriteStartAttribute çağrılmadan önce WriteStartElement öğesinin en az bir kez çağrılması gerekir.
zh_hans: 调用 WriteStartAttribute 前，至少须调用一次 WriteStartElement。
zh_hant: 呼叫 WriteStartAttribute 之前，必須至少先呼叫 WriteStartElement 一次。

# JsonCannotWriteStandaloneTextAfterQuotedText
source: Cannot write a CLR value that maps to number, array, object, true, false or null in JSON after a string value has been written.
cs: Ve formátu JSON po zápisu řetězcové hodnoty nelze zapsat hodnotu CLR, která je mapována na číslo, pole, objekt, hodnotu true, false nebo null.
de: Ein CLR-Wert, der in JSON "number", "array", "object", "true", "false" oder "null" entspricht, kann nicht geschrieben werden, nachdem ein Zeichenfolgenwert geschrieben wurde.
es: No se puede escribir un valor CLR que se asigne a un valor, matriz, objeto, valor true, valor false o valor nulo en JSON después de haber escrito un valor de cadena.
fr: Impossible d'écrire une valeur CLR qui établit une correspondance avec un nombre, un tableau, un objet, true, false ou null en JSON après l'écriture d'une valeur de chaîne.
it: Non è possibile scrivere un valore CLR associato a un numero, una matrice, un oggetto, true, false o Null in JSON dopo che è stato scritto un valore stringa.
ja: 文字列値が書き込まれた後に、JSON の number、array、object、true、false、または null にマップする CLR 値を書き込むことはできません。
ko: 문자열 값을 쓴 다음 JSON의 숫자, 배열, 개체, true, false 또는 null로 매핑되는 CLR 값을 쓸 수 없습니다.
pl: Nie można zapisać wartości CLR, która jest mapowana na liczbę, tablicę, obiekt, wartość True, wartość False lub wartość Null, w notacji JSON po zapisaniu wartości ciągu.
pt_br: Não é possível gravar um valor CLR que mapeia para número, matriz, objeto, verdadeiro, falso ou nulo no JSON após um valor da cadeia de caracteres ter sido gravado.
ru: Невозможно записать значение CLR, сопоставляемое с числом, массивом, объектом, значениями true, false или NULL в JSON, после записи строкового значения.
tr: JSON içinde bir dize değeri yazıldıktan sonra sayı, dizi, nesne, true, false veya null ile eşlenen bir CLR değeri yazılamaz.
zh_hans: 在写入字符串值后，无法在 JSON 中写入映射到数字、数组、对象、True、False 或 Null 的 CLR 值。
zh_hant: 寫入字串值之後，無法在 JSON 中寫入對應至數字、陣列、物件、True、False 或 Null 的 CLR 值。

# JsonCannotWriteTextAfterNonTextAttribute
source: Attempted to write text after writing attribute type='{0}'. Text may be written only after the attributes type='number', type='boolean', or type='string'.
cs: Byl proveden pokus o zápis textu po zápisu typu atributu {0}. Text lze zapsat pouze za atributy typu number, boolean nebo string.
de: Es wurde versucht, Text zu schreiben, nachdem das Attribut type="{0}" geschrieben wurde. Text darf nur nach den Attributen type="number", type="boolean" und type="string" geschrieben werden.
es: Se intentó escribir texto después de escribir el atributo type="{0}". El texto solo se puede escribir después de los atributos type="number", type="boolean" o type="string".
fr: Tentative d'écriture du texte après avoir écrit un attribut type='{0}'. Il est possible d'écrire du texte uniquement après les attributs type='number', type='boolean' ou type='string'.
it: Si è provato a scrivere testo dopo che è stato scritto l'attributo type='{0}'. È possibile scrivere testo solo dopo che sono stati scritti gli attributi type='number', type='boolean' o type='string'.
ja: 属性 type='{0}' の書き込み後にテキストを書き込もうとしました。テキストは、属性 type='number'、type='boolean'、または type='string' の後にのみ書き込むことができます。
ko: type='{0}' 특성을 쓴 다음 텍스트를 쓰려고 했습니다. 텍스트는 type='number', type='boolean' 또는 type='string' 특성 뒤에만 쓸 수 있습니다.
pl: Podjęto próbę zapisania tekstu po zapisaniu atrybutu type=„{0}”. Tekst można zapisać tylko po atrybucie type=„number”, type=„boolean” lub type=„string”.
pt_br: Tentou gravar o texto após gravar o tipo de atributo='{0}'. O texto pode ser gravado somente após o tipo de atributos='número', tipo='booliano' ou tipo='cadeia de caracteres'.
ru: Попытка записи текста после записи атрибута type="{0}". Текст может быть записан только после атрибутов type="number", type="boolean" или type="string".
tr: Öznitelik türü='{0}' yazıldıktan sonra metin yazılmaya çalışıldı. Metin yalnızca type='number', type='boolean' veya type='string' özniteliklerinden sonra yazılabilir.
zh_hans: 试图在写入类型为“{0}”的特性后写入文本。只能在类型为 "number"、"boolean" 或 "string" 的特性后写入文本。
zh_hant: 寫入屬性 type='{0}' 之後，嘗試寫入文字。但只有在寫入屬性 type='number'、type='boolean' 或 type='string' 之後，才可寫入文字。

# JsonCircularReferenceDetected
source: A circular reference has been detected when serializing an object of type {0} to JSON. Circular references are not supported in the JSON format.
cs: Během serializace objektu typu {0} do formátu JSON se zjistil cyklický odkaz. Cyklické odkazy nejsou ve formátu JSON podporovány.
de: Bei der Serialisierung eines Objekts vom Typ {0} in JSON wurde ein Zirkelbezug erkannt. Zirkelbezüge werden im JSON-Format nicht unterstützt.
es: Se ha detectado una referencia circular al serializar un objeto de tipo {0} en JSON. Las referencias circulares no se admiten en el formato JSON.
fr: Une référence circulaire a été détectée durant la sérialisation d'un objet de type {0} au format JSON. Les références circulaires ne sont pas prises en charge au format JSON.
it: È stato rilevato un riferimento circolare. durante la serializzazione di un oggetto di tipo {0} in JSON. I riferimenti circolari non sono supportati nel formato JSON.
ja: 型 {0} のオブジェクトを JSON にシリアル化している間に循環参照が検出されました。循環参照は JSON 形式でサポートされていません。
ko: {0} 형식의 개체를 JSON으로 직렬화할 때 순환 참조가 검색되었습니다. JSON 형식에서는 순환 참조가 지원되지 않습니다.
pl: Podczas serializacji obiektu typu {0} do formatu JSON wykryto odwołanie cykliczne. Odwołania cykliczne nie są obsługiwane w formacie JSON.
pt_br: Uma referência circular foi detectada ao serializar um objeto de tipo {0} para JSON. Não há suporte para referências circulares no formato JSON.
ru: Обнаружена циклическая ссылка при сериализации объекта типа {0} в JSON. Циклические ссылки не поддерживаются в формате JSON.
tr: {0} türündeki bir nesne JSON'a serileştirilirken döngüsel bir başvuru algılandı. JSON biçiminde döngüsel başvurular desteklenmez.
zh_hans: 将类型为 {0} 的对象序列化为 JSON 时检测到循环引用。JSON 格式不支持循环引用。
zh_hant: 將類型為 {0} 的物件序列化為 JSON 時，偵測到循環參考。JSON 格式不支援循環參考。

# JsonDateTimeOutOfRange
source: DateTime values that are greater than DateTime.MaxValue or smaller than DateTime.MinValue when converted to UTC cannot be serialized to JSON.
cs: Hodnoty DateTime, které jsou při převodu do formátu UTC větší než DateTime.MaxValue nebo menší než DateTime.MinValue, není možné serializovat do třídy JSON.
de: DateTime-Werte, die größer als DateTime.MaxValue oder kleiner als DateTime.MinValue sind, können bei der Konvertierung in UTC nicht in JSON serialisiert werden.
es: Los valores DateTime que son mayores que DateTime.MaxValue o menores que DateTime.MinValue al convertirse a UTC no se pueden serializar para JSON.
fr: Les valeurs DateTime supérieures à DateTime.MaxValue ou inférieures à DateTime.MinValue durant leur conversion en UTC ne peuvent pas être sérialisées en JSON.
it: Non è possibile serializzare in JSON i valori DateTime più grandi di DateTime.MaxValue o più piccoli di DateTime.MinValue se convertiti in UTC.
ja: UTC への変換時、DateTime.MaxValue より大きい DateTime 値、または DateTime.MinValue より小さい DateTime 値は、JSON にシリアル化することはできません。
ko: UTC로 변환했을 때 DateTime.MaxValue보다 크거나 DateTime.MinValue보다 작은 DateTime 값은 JSON으로 직렬화할 수 없습니다.
pl: Wartości DateTime, które w czasie konwersji na format UTC są większe niż wartość DateTime.MaxValue lub mniejsze niż wartość DateTime.MinValue, nie można serializować do notacji JSON.
pt_br: Valores de DateTime maiores que DateTime.MaxValue ou menores que DateTime.MinValue quando convertidos em UTC não podem ser serializados para JSON.
ru: Значения DateTime, которые больше DateTime.MaxValue или меньше DateTime.MinValue, при преобразовании во время в формате UTC не могут быть сериализованы в JSON.
tr: UTC'ye dönüştürüldükten sonra DateTime.MaxValue değerinden büyük veya DateTime.MinValue değerinden küçük olan DateTime değerleri JSON'a serileştirilemez.
zh_hans: 在转换为 UTC 时，大于 DateTime.MaxValue 或小于 DateTime.MinValue 的 DateTime 值无法序列化为 JSON。
zh_hant: 大於 DateTime.MaxValue 或小於 DateTime.MinValue 的 DateTime 值在轉換為 UTC 時，無法序列化為 JSON。
