Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidCollectionDataContract
source: Type '{0}' with CollectionDataContractAttribute attribute is an invalid collection type since it
cs: Typ {0} s atributem CollectionDataContractAttribute je neplatný typ kolekce, protože
de: Der Typ "{0}" mit dem Attribut CollectionDataContractAttribute ist ein ungültiger Sammlungstyp, da er
es: El tipo "{0}" con el atributo CollectionDataContractAttribute es un tipo de colección no válido, ya que
fr: Le type '{0}' avec l'attribut CollectionDataContractAttribute est un type de collection non valide, car il
it: Il tipo '{0}' con l'attributo CollectionDataContractAttribute è un tipo di raccolta non valido perché
ja: 以降、CollectionDataContractAttribute 属性を持つ型 '{0}' は無効なコレクション型です
ko: CollectionDataContractAttribute 특성을 가진 '{0}' 형식은 다음과 같은 이유에서 잘못된 컬렉션 형식입니다.
pl: Typ „{0}” z atrybutem CollectionDataContractAttribute jest nieprawidłowym typem kolekcji, ponieważ
pt_br: O tipo '{0}' com atributo CollectionDataContractAttribute é um tipo de coleção inválido porque ele
ru: Тип "{0}" с атрибутом CollectionDataContractAttribute является недопустимым типом коллекции, так как он
tr: CollectionDataContractAttribute özniteliğine sahip '{0}' türü geçersiz bir koleksiyon türüdür; nedeni:
zh_hans: 特性为 CollectionDataContractAttribute 的类型“{0}”为无效的集合类型，因为它
zh_hant: 具有 CollectionDataContractAttribute 屬性的類型 '{0}' 不是有效的集合類型，因為

# InvalidCollectionType
source: Type '{0}' is an invalid collection type since it
cs: Typ {0} je neplatný typ kolekce, protože
de: Der Typ "{0}" ist ein ungültiger Sammlungstyp, da er
es: "{0}" es un tipo de colección no válido, ya que
fr: Le type '{0}' est un type de collection non valide, car il
it: Il tipo '{0}' è un tipo di raccolta non valido perché
ja: それ以降、型 '{0}' は無効なコレクションの型です
ko: '{0}' 형식은 다음과 같은 이유에서 잘못된 컬렉션 형식입니다.
pl: Typ „{0}” jest nieprawidłowym typem kolekcji, ponieważ
pt_br: O tipo '{0}' é um tipo de coleção inválido porque ele
ru: Тип "{0}" является недопустимым типом коллекции, так как он
tr: '{0}' türü geçersiz bir koleksiyon türüdür; nedeni:
zh_hans: 类型“{0}”为无效的集合类型，因为它
zh_hant: 類型 '{0}' 不是有效的集合類型，因為

# InvalidDataContractName
source: Type '{0}' cannot have DataContractAttribute attribute Name set to null or empty string.
cs: U typu {0} nemůže být název Name u atributu DataContractAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf der Name für das Attribut DataContractAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento Name del atributo DataContractAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un Name d'attribut DataContractAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo DataContractAttribute in cui Name è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、DataContractAttribute 属性の Name を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 DataContractAttribute 특성 이름을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości Namespace atrybutu DataContractAttribute ustawionej na wartość null ani pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo Name de DataContractAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут DataContractAttribute с параметром Name, имеющим в качестве значения null или пустую строку.
tr: '{0}' türü, DataContractAttribute özniteliği Name öğesinin null ya da boş dize olarak ayarlanmasına izin vermez.
zh_hans: 类型“{0}”无法将 DataContractAttribute 特性 Name 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 DataContractAttribute 屬性 Name 設為 Null 或空字串。

# InvalidDataContractNamespace
source: Type '{0}' cannot have DataContractAttribute attribute Namespace set to null.
cs: U typu {0} nemůže být obor názvů Namespace u atributu DataContractAttribute nastaven na hodnotu null.
de: Für den Typ "{0}" darf der Namespace für das Attribut DataContractAttribute nicht auf NULL festgelegt sein.
es: El tipo "{0}" no puede tener el elemento Namespace del atributo DataContractAttribute nulo.
fr: Le type '{0}' ne peut pas avoir un Namespace d'attribut DataContractAttribute avec une valeur null.
it: Il tipo '{0}' non può contenere un attributo DataContractAttribute in cui Namespace è impostato su Null.
ja: 型 '{0}' では、DataContractAttribute 属性の Namespace を null に設定することはできません。
ko: '{0}' 형식은 DataContractAttribute 특성 네임스페이스를 null로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości Namespace atrybutu DataContractAttribute ustawionej na wartość null.
pt_br: O tipo '{0}' não pode ter o atributo Namespace de DataContractAttribute definido como nulo.
ru: Тип "{0}" не может иметь атрибут DataContractAttribute с параметром Namespace, имеющим значение null.
tr: '{0}' türünde, null olarak ayarlanan DataContractAttribute özniteliği Namespace öğesi bulunamaz.
zh_hans: 类型“{0}”无法将 DataContractAttribute 特性 Namespace 设置为 null。
zh_hant: 類型 '{0}' 無法將 DataContractAttribute 屬性 Namespace 設為 Null。

# InvalidDataMemberName
source: Member '{0}' in type '{1}' cannot have DataMemberAttribute attribute Name set to null or empty string.
cs: U členu {0} v typu {1} nemůže být název Name u atributu DataMemberAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Member "{0}" im Typ "{1}" darf der Name für das Attribut DataMemberAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El miembro "{0}" del tipo "{1}" no puede tener el elemento Name del atributo DataMemberAttribute definido como una cadena nula o vacía.
fr: Le membre '{0}' dans le type '{1}' ne peut pas avoir un Name d'attribut DataMemberAttribute avec une valeur null ou une chaîne vide.
it: Il membro '{0}' nel tipo '{1}' non può contenere un attributo DataMemberAttribute in cui Name è impostato su una stringa vuota o su Null.
ja: 型 '{1}' のメンバー '{0}' では、DataMemberAttribute 属性の Name を null や空の文字列に設定することはできません。
ko: 형식 '{1}'의 멤버 '{0}'(은)는 DataMemberAttribute 특성 이름을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Składowa „{0}” w typie „{1}” nie może mieć właściwości Name atrybutu DataMemberAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O membro '{0}' no tipo '{1}' não pode ter o atributo Name de DataMemberAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Член "{0}" в типе "{1}" не может иметь атрибут DataMemberAttribute с параметром Name, имеющим в качестве значения null или пустую строку.
tr: '{1}' türündeki '{0}' üyesinde, null ya da boş dize olarak ayarlanan DataMemberAttribute özniteliği Name öğesi bulunamaz.
zh_hans: 类型“{1}”中的成员“{0}”无法将 DataMemberAttribute 特性 Name 设置为 null 或空字符串。
zh_hant: 類型 '{1}' 的成員 '{0}' 無法將 DataMemberAttribute 屬性 Name 設定為 Null 或空字串。

# InvalidEmitDefaultAnnotation
source: Annotation for element {0} in type {1} from namespace {2} specifies EmitDefaultValue as 'true'. This requires the element to be either nillable or the element's type must be a value type.
cs: Komentář pro element {0} v typu {1} z oboru názvů {2} udává hodnotu EmitDefaultValue jako true. Kvůli tomu musí být možné element nastavit na null nebo typ elementu musí být typem hodnoty.
de: Die Anmerkung für das Element "{0}" im Typ "{1}" aus dem Namespace "{2}" legt für EmitDefaultValue den Wert "true" fest. Dies setzt voraus, dass das Element "nillable" ist oder der Typ des Elements ein Werttyp ist.
es: La anotación del elemento {0} en el tipo {1} del espacio de nombres {2} especifica que EmitDefaultValue tiene el valor "true". Ello requiere que el elemento admita valores nulos o que el tipo de elemento sea un tipo de valor.
fr: L'annotation pour l'élément {0} dans le type {1} provenant de l'espace de noms {2} spécifie la valeur de EmitDefaultValue comme étant 'true'. Pour cela, l'élément doit être 'nillable' (c'est-à-dire qu'il autorise la valeur nil) ou son type être un type valeur.
it: Nell'annotazione per l'elemento {0} nel tipo {1} dello spazio dei nomi {2} l'elemento EmitDefaultValue è specificato come 'true'. L'elemento deve quindi essere nillable oppure il tipo dell'elemento deve essere un tipo valore.
ja: 名前空間 {2} の型 {1} における要素 {0} の注釈は、EmitDefaultValue を 'True' に指定しています。この場合は要素が nillable であるか、または要素の型が値の型である必要があります。
ko: 네임스페이스 {2}의 형식 {1}에서 요소 {0}의 주석이 EmitDefaultValue를 'true'로 지정합니다. 이렇게 하려면 요소가 nillable이거나 요소의 형식이 값 형식이어야 합니다.
pl: Adnotacja elementu {0} w typie {1} z przestrzeni nazw {2} określa dla parametru EmitDefaultValue wartość „true”. Oznacza to, że element musi mieć przypisany atrybut nillable lub typ elementu musi być typem wartości.
pt_br: A anotação do elemento {0} no tipo {1} do namespace {2} especifica EmitDefaultValue como 'true'. Isso requer que o elemento permita valor nulo ou que o tipo do elemento seja um tipo de valor.
ru: Заметка для элемента {0} в типе {1} из пространства имен {2} указывает значение true для EmitDefaultValue. Для этого требуется, чтобы элемент был обнуляемым, или тип элемента должен быть типом значения.
tr: {2} ad alanındaki {1} türündeki {0} öğe ek açıklaması EmitDefaultValue özniteliğini 'true' olarak belirtir. Bu, öğenin sıfır olabilme özelliğinde olmasını ya da öğe türünün bir değer türünde olmasını gerektirir.
zh_hans: 命名空间 {2} 的类型 {1} 中的元素 {0} 的注释将 EmitDefaultValue 指定为 "true"。这要求该元素为 Nillable 或元素类型必须为值类型。
zh_hant: 命名空間 {2} 之類型 {1} 中元素 {0} 的註釋，將 EmitDefaultValue 指定為 'true'。這需要元素為 nillable，或元素的類型必須為實值型別。

# InvalidEnumBaseType
source: Type '{0}' in namespace '{1}' is not a valid base type for enum '{2}' in namespace '{3}'.
cs: Typ {0} v oboru názvů {1} není platný základní typ pro výčet {2} v oboru názvů {3}.
de: Der Typ "{0}" im Namespace "{1}" ist kein gültiger Basistyp für die Enumeration "{2}" im Namespace "{3}".
es: El tipo "{0}" del espacio de nombres "{1}" no es un tipo base válido para la enumeración "{2}" del espacio de nombres "{3}".
fr: Le type '{0}' dans l'espace de noms '{1}' n'est pas un type de base valide pour l'enum '{2}' dans l'espace de noms '{3}'.
it: Il tipo '{0}' nello spazio dei nomi '{1}' non è un tipo di base valido per l'enumerazione '{2}' nello spazio dei nomi '{3}'.
ja: 名前空間 '{1}' の型 '{0}' は、名前空間 '{3}' の列挙型 '{2}' に対して有効な基本データ型ではありません。
ko: 네임스페이스 '{1}'의 '{0}' 형식이 네임스페이스 '{3}'의 열거형 '{2}'에 유효한 기본 형식이 아닙니다.
pl: Typ „{0}” w przestrzeni nazw „{1}” nie jest prawidłowym typem podstawowym dla wyliczenia „{2}” w przestrzeni nazw „{3}”.
pt_br: O tipo '{0}' no namespace '{1}' não é um tipo base válido para a enumeração '{2}' no namespace '{3}'.
ru: Тип "{0}" в пространстве имен "{1}" не является допустимым базовым типом для перечисления "{2}" в пространстве имен "{3}".
tr: '{1}' ad alanındaki '{0}' türü, '{3}' ad alanındaki '{2}' sabit listesi için geçerli bir temel tür değil.
zh_hans: 命名空间“{1}”中的类型“{0}”对于命名空间“{3}”中的枚举“{2}”不是有效的基类型。
zh_hant: 命名空間中的 '{1}' 類型 '{0}' 不是命名空間 '{3}' 中列舉 '{2}' 的有效基底類型。

# InvalidEnumMemberValue
source: '{0}' in type '{1}' cannot have EnumMemberAttribute attribute Value set to null or empty string.
cs: U {0} v typu {1} nemůže být hodnota Value u atributu EnumMemberAttribute nastavena na hodnotu null nebo prázdný řetězec.
de: Für "{0}" im Typ "{1}" darf der Wert für das Attribut EnumMemberAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El elemento "{0}" del tipo "{1}" no puede tener como el elemento Value del atributo EnumMemberAttribute definido como una cadena nula o vacía.
fr: '{0}' dans le type '{1}' ne peut pas avoir un Value d'attribut EnumMemberAttribute avec une valeur null ou une chaîne vide.
it: '{0}' nel tipo '{1}' non può contenere un attributo EnumMemberAttribute in cui Value è impostato su una stringa vuota o su Null.
ja: 型 '{1}' の '{0}' では、EnumMemberAttribute 属性の Value を null や空の文字列に設定することはできません。
ko: 형식 '{1}'의 '{0}'은(는) EnumMemberAttribute 특성 Value를 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Element „{0}” w typie „{1}” nie może mieć właściwości Value atrybutu EnumMemberAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: '{0}' no tipo '{1}' não pode ter o atributo Value de EnumMemberAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: "{0}" в типе "{1}" не может иметь атрибут EnumMemberAttribute с параметром Value, имеющим в качестве значения null или пустую строку.
tr: '{1}' türündeki '{0}' içinde EnumMemberAttribute özniteliği Value öğesi null ya da boş dize olarak ayarlanamaz.
zh_hans: 类型“{1}”中的“{0}”无法将 EnumMemberAttribute 特性 Value 设置为 null 或空字符串。
zh_hant: 類型 '{1}' 的 '{0}' 無法將 EnumMemberAttribute 屬性 Value 設定為 Null 或空字串。

# InvalidEnumValueOnRead
source: Invalid enum value '{0}' cannot be deserialized into type '{1}'. Ensure that the necessary enum values are present and are marked with EnumMemberAttribute attribute if the type has DataContractAttribute attribute.
cs: Neplatnou hodnotu výčtu {0} nelze deserializovat na typ {1}. Pokud má typ atribut DataContractAttribute, ujistěte se, že nutné hodnoty výčtu jsou přítomny a označeny atributem EnumMemberAttribute.
de: Der ungültige Enumerationswert "{0}" kann nicht in den Typ "{1}" deserialisiert werden. Stellen Sie sicher, dass die erforderlichen Enumerationswerte vorhanden und mit dem Attribut EnumMemberAttribute markiert sind, wenn der Typ das Attribut DataContractAttribute aufweist.
es: El valor de enumeración no válido "{0}" no se puede deserializar para convertirlo en el tipo "{1}". Asegúrese de que los valores de enumeración necesarios están presentes y marcados con el atributo EnumMemberAttribute si el tipo tiene el atributo DataContractAttribute.
fr: La valeur enum non valide '{0}' ne peut pas être désérialisée en type '{1}'. Vérifiez que les valeurs enum nécessaires sont présentes et qu'elles sont marquées avec l'attribut EnumMemberAttribute si le type contient l'attribut DataContractAttribute.
it: Non è possibile deserializzare il valore di enumerazione non valido '{0}' nel tipo '{1}'. Assicurarsi che i valori di enumerazione necessari siano presenti e siano contrassegnati con l'attributo EnumMemberAttribute se l'attributo del tipo è DataContractAttribute.
ja: 無効な列挙値 '{0}' のシリアル化を解除して型 '{1}' に変換できません。必要な列挙値が存在していることを確認して、この型が DataContractAttribute 属性を持つ場合は、これらの値に EnumMemberAttribute 属性が設定されていることを確認してください。
ko: 잘못된 열거 값 '{0}'을(를) '{1}' 형식으로 deserialize할 수 없습니다. 형식에 DataContractAttribute 특성이 있는 경우 필요한 열거 값이 있으며 EnumMemberAttribute 특성으로 표시되는지 확인하세요.
pl: Nie można zdeserializować nieprawidłowej wartości wyliczeniowej „{0}” do typu „{1}”. Upewnij się, że zostały określone potrzebne wartości wyliczeniowe oraz że są one oznaczone atrybutem EnumMemberAttribute, jeśli typ ma przypisany atrybut DataContractAttribute.
pt_br: O valor de enumeração inválido '{0}' não pode ser desserializado no tipo '{1}'. Verifique se os valores de enumeração necessários estão presentes e marcados com o atributo EnumMemberAttribute se o tipo tiver o atributo DataContractAttribute.
ru: Недопустимое перечисляемое значение "{0}" не может быть десериализовано в тип "{1}". Если данный тип имеет атрибут DataContractAttribute, то необходимо убедиться в том, что необходимые перечисляемые значения присутствуют и отмечены атрибутом EnumMemberAttribute.
tr: Geçersiz '{0}' sabit listesi değeri, '{1}' türüne dönüşecek şekilde seri durumdan çıkarılamıyor. Gerekli sabit listesi değerlerinin mevcut olduğundan ve tür DataContractAttribute özniteliğine sahipse, EnumMemberAttribute özniteliğiyle işaretlenmiş olduğundan emin olun.
zh_hans: 无法将无效的枚举值“{0}”反序列化为类型“{1}”。如果该类型具有 DataContractAttribute 特性，则请确保显示必要的枚举值且标记为 EnumMemberAttribute 特性。
zh_hant: 無法將無效的列舉值 '{0}' 還原序列化為類型 '{1}'。請確定存在必要的列舉值，且若類型具有 DataContractAttribute 屬性，該值會標示有 EnumMemberAttribute 屬性。

# InvalidEnumValueOnWrite
source: Enum value '{0}' is invalid for type '{1}' and cannot be serialized. Ensure that the necessary enum values are present and are marked with EnumMemberAttribute attribute if the type has DataContractAttribute attribute.
cs: Hodnota výčtu {0} není pro typ {1} platná a nelze ji deserializovat. Pokud má typ atribut DataContractAttribute, ujistěte se, že nutné hodnoty výčtu jsou přítomny a označeny atributem EnumMemberAttribute.
de: Der Enumerationswert "{0}" ist für den Typ "{1}" ungültig und kann nicht serialisiert werden. Stellen Sie sicher, dass die erforderlichen Enumerationswerte vorhanden und mit dem Attribut EnumMemberAttribute markiert sind, wenn der Typ das Attribut DataContractAttribute aufweist.
es: El valor de enumeración "{0}" no es válido para el tipo "{1}" y no se puede serializar. Asegúrese de que los valores de enumeración necesarios están presentes y marcados con el atributo EnumMemberAttribute si el tipo tiene el atributo DataContractAttribute.
fr: Sérialisation impossible de la valeur enum '{0}' non valide pour le type '{1}'. Vérifiez que les valeurs enum nécessaires sont présentes et qu'elles sont marquées avec l'attribut EnumMemberAttribute si le type contient l'attribut DataContractAttribute.
it: Non è possibile serializzare il valore di enumerazione non valido '{0}' nel tipo '{1}'. Assicurarsi che i valori di enumerazione necessari siano presenti e siano contrassegnati con l'attributo EnumMemberAttribute se l'attributo del tipo è DataContractAttribute.
ja: 列挙値 '{0}' は型 '{1}' に対して無効であるため、シリアル化できません。必要な列挙値が存在していることを確認して、この型が DataContractAttribute 属性を持つ場合は、これらの値に EnumMemberAttribute 属性が設定されていることを確認してください。
ko: 열거 값 '{0}'이(가) 형식 '{1}'에 유효하지 않으며 직렬화할 수 없습니다. 형식에 DataContractAttribute 특성이 있는 경우 필요한 열거 값이 있으며 EnumMemberAttribute 특성으로 표시되는지 확인하세요.
pl: Wartość wyliczeniowa „{0}” jest nieprawidłowa dla typu „{1}” i nie można jej zserializować. Upewnij się, że zostały określone potrzebne wartości wyliczeniowe oraz że są one oznaczone atrybutem EnumMemberAttribute, jeśli typ ma przypisany atrybut DataContractAttribute.
pt_br: O valor de enumeração '{0}' é inválido para o tipo '{1}' e não pode ser serializado. Verifique se os valores de enumeração necessários estão presentes e marcados com o atributo de EnumMemberAttribute se o tipo tiver o atributo de DataContractAttribute.
ru: Перечисляемое значение "{0}" недопустимо для типа "{1}" и не может быть сериализовано. Если данный тип имеет атрибут DataContractAttribute, то нужно убедиться в том, что необходимые перечисляемые значения присутствуют и отмечены атрибутом EnumMemberAttribute.
tr: '{0}' sabit listesi değeri, '{1}' türü için geçerli değil ve serileştirilemiyor. Gerekli sabit listesi değerlerinin mevcut olduğundan ve tür DataContractAttribute özniteliğine sahipse, EnumMemberAttribute özniteliğiyle işaretlenmiş olduğundan emin olun.
zh_hans: 枚举值“{0}”对于类型“{1}”无效，无法序列化。如果该类型具有 DataContractAttribute 特性，则请确保显示必要的枚举值且标记为 EnumMemberAttribute 特性。
zh_hant: 類型 '{1}' 的列舉值 '{0}' 無效，且無法序列化。請確定存在必要的列舉值，且若類型具有 DataContractAttribute 屬性，該值會標示有 EnumMemberAttribute 屬性。

# InvalidGetSchemaMethod
source: Type '{0}' cannot have MethodName on XmlSchemaProviderAttribute attribute set to null or empty string.
cs: U typu {0} nemůže být název MethodName u atributu XmlSchemaProviderAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf MethodName für das Attribut XmlSchemaProviderAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento MethodName del atributo XmlSchemaProviderAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un MethodName d'attribut XmlSchemaProviderAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo XmlSchemaProviderAttribute in cui MethodName è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、XmlSchemaProviderAttribute 属性の MethodName を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 XmlSchemaProviderAttribute 특성의 MethodName을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości MethodName atrybutu XmlSchemaProviderAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter um MethodName no atributo XmlSchemaProviderAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут XmlSchemaProviderAttribute с параметром MethodName, имеющим в качестве значения null или пустую строку.
tr: '{0}' türü, XmlSchemaProviderAttribute özniteliğinde null ya da boş dize olarak ayarlanan MethodName değeri bulunduramaz.
zh_hans: 类型“{0}”无法将 XmlSchemaProviderAttribute 特性的 MethodName 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 XmlSchemaProviderAttribute 屬性上的 MethodName 設為 Null 或空字串。

# InvalidGlobalDataContractNamespace
source: CLR namespace '{0}' cannot have ContractNamespace set to null.
cs: U oboru názvů CLR {0} nemůže být obor názvů ContractNamespace nastaven na hodnotu null.
de: Für den CLR-Namespace "{0}" darf ContractNamespace nicht auf NULL festgelegt sein.
es: El espacio de nombres CLR "{0}" no puede tener una propiedad ContractNamespace nula.
fr: L'espace de noms CLR '{0}' ne peut pas avoir ContractNamespace avec une valeur null.
it: ContractNamespace non può essere impostato su Null nello spazio dei nomi '{0}' di CLR.
ja: CLR 名前空間 '{0}' では、ContractNamespace を null に設定することはできません。
ko: CLR 네임스페이스 '{0}'은(는) ContractNamespace를 null로 설정할 수 없습니다.
pl: Przestrzeń nazw „{0}” środowiska CRL nie może mieć właściwości ContractNamespace o wartości null.
pt_br: O namespace CLR '{0}' não pode ter ContractNamespace definido como nulo.
ru: Пространство имен CLR "{0}" не может иметь параметр ContractNamespace со значением null.
tr: '{0}' CLR ad alanında ContractNamespace null olarak ayarlanamaz.
zh_hans: CLR 命名空间“{0}”无法将 ContractNamespace 设置为 Null。
zh_hant: CLR 命名空間 '{0}' 無法將 ContractNamespace 設為 Null。

# InvalidISerializableDerivation
source: Cannot import type '{0}' in namespace '{1}' as its base type because derived type is ISerializable but the base type is not ISerializable.
cs: Typ {0} v oboru názvů {1} nelze importovat jako základní typ, protože odvozený typ je ISerializable, ale základní typ není ISerializable.
de: Der Typ "{0}" im Namespace "{1}" kann nicht als Basistyp importiert werden, da der abgeleitete Typ ISerializable ist, der Basistyp aber nicht ISerializable ist.
es: No se puede importar el tipo "{0}" en el espacio de nombres "{1}" como tipo base, ya que el tipo derivado es ISerializable, pero el tipo base no es ISerializable.
fr: Le type '{0}' dans l'espace de noms '{1}' ne peut pas être importé comme étant son type de base, car le type dérivé est ISerializable mais le type de base n'est pas ISerializable.
it: Non è possibile importare il tipo '{0}' nello spazio dei nomi '{1}' come tipo di base perché il tipo derivato è ISerializable, ma il tipo di base non è ISerializable.
ja: 派生型は ISerializable ですが基本型は ISerializable ではないため、名前空間 '{1}' の型 '{0}' をその基本データ型としてインポートできません。
ko: 파생된 형식이 ISerializable이지만 기본 형식이 ISerializable이 아니므로 네임스페이스 '{1}'의 '{0}' 형식을 기본 형식으로 가져올 수 없습니다.
pl: Nie można zaimportować typu „{0}” do przestrzeni nazw „{1}” jako jego typu podstawowego, ponieważ typem pochodnym jest typ ISerializable, natomiast typ podstawowy nie jest typem ISerializable.
pt_br: Não é possível importar o tipo '{0}' no namespace '{1}' como seu tipo base porque o tipo derivado é ISerializable, mas o tipo base não é ISerializable.
ru: Невозможно импортировать тип "{0}" в пространстве имен "{1}" как базовый, так как производный тип является ISerializable, но базовый тип не является ISerializable.
tr: Türetilen tür ISerializable, ancak temel tür ISerializable dışında bir değer olduğundan, '{1}' ad alanındaki '{0}' türü temel tür olarak içeri aktarılamıyor.
zh_hans: 由于派生类型为 ISerializable，但基类型不是 ISerializable，因此无法将类型“{0}”导入到命名空间“{1}”来作为其基类型。
zh_hant: 無法將命名空間 '{1}' 中的類型 '{0}' 匯入成本身的基底類型，因為衍生的類型為 ISerializable，但基底類型並非 ISerializable。
