Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# GenericParameterNotValid
source: In the data contract name for type '{1}', there are curly braces with '{0}' inside, which is an invalid value. Curly braces have special meaning in data contract names - they are used to customize the naming of data contracts for generic types. Based on the number of generic parameters this type has, the contents of the curly braces must either be a number between 0 and '{2}' to insert the name of the generic parameter at that index or the '#' symbol to insert a digest of the generic parameter namespaces.
cs: V názvu kontraktu dat pro typ {1} jsou složené závorky obsahující hodnotu {0}, která není platná. Složené závorky mají v názvech kontraktů dat zvláštní význam – používají se k úpravě názvů kontraktů dat pro obecné typy. Podle počtu obecných parametrů, které tento typ má, musí být obsah složených závorek buď číslo mezi 0 a {2} pro vložení názvu obecného parametru na daném indexu, nebo symbol # pro vložení přehledu oboru názvů obecných parametrů.
de: Der Datenvertragsnamen für den Typ "{1}" enthält geschwungene Klammern, in denen "{0}" steht. Dies ist ein ungültiger Wert. Geschwungene Klammern haben in Datenvertragsnamen eine spezielle Bedeutung: Sie werden verwendet, um die Benennung von Datenverträgen für generische Typen anzupassen. Basierend auf der Anzahl von generischen Parametern dieses Typs muss es sich beim Inhalt der geschwungenen Klammern entweder um eine Zahl zwischen 0 und "{2}" handeln, um den Namen des generischen Parameters bei diesem Index einzufügen, oder um das Symbol "#", um einen Hashwert der generischen Parameternamespaces einzufügen.
es: El nombre de contrato de datos para el tipo "{1}" contiene "{0}" entre llaves. Este valor no es válido. Las llaves tienen un significado especial en los nombres de contrato de datos: se usan para personalizar la nomenclatura de los contratos de datos para tipos genéricos. Según el número de parámetros genéricos que tenga este tipo, el contenido de las llaves debe ser un número entre 0 y "{2}" para insertar el nombre del parámetro genérico en ese índice, o el símbolo "#" para insertar un resumen de los espacios de nombres de parámetros genéricos.
fr: Dans le nom de contrat de données pour le type '{1}', '{0}' a été placé entre accolades, ce qui constitue une valeur non valide. Les accolades ont une signification particulière dans les noms de contrats de données, elles sont utilisées pour personnaliser l'affectation de noms aux contrats de données pour les types génériques. En fonction du nombre de paramètres génériques de ce type, les accolades contiennent soit un nombre compris entre 0 et '{2}' pour l'insertion du nom du paramètre générique à cet index, soit le symbole '#' pour l'insertion d'un condensat des espaces de noms du paramètre générique.
it: Il nome di contratto di dati per il tipo '{1}' include il valore non valido '{0}' racchiuso tra parentesi graffe. Le parentesi graffe hanno un significato speciale nei nomi di contratto di dati. Vengono infatti usate per personalizzare la denominazione dei contratti di dati per i tipi generici. A seconda del numero di parametri generici di questo tipo, le parentesi graffe possono racchiudere un numero compreso tra 0 e '{2}' per inserire il nome del parametro generico a tale indice o il simbolo '#' per inserire un digest degli spazi dei nomi di parametro generici.
ja: 型 '{1}' のデータ コントラクト名には、無効な値である '{0}' を囲んでいる中かっこが含まれています。中かっこは、データ コントラクト名では特別な意味を持ち、ジェネリック型のデータ コントラクトの名前付けをカスタマイズするために使用されます。この型が持つジェネリック パラメーターの数に基づいて、中かっこの内容は 0 から '{2}' の間の数字または # 記号である必要があります。前者の場合は、そのインデックスのジェネリック パラメーターの名前が挿入され、後者の場合は、ジェネリック パラメーターの名前空間のダイジェストが挿入されます。
ko: 형식 '{1}'에 대한 데이터 계약 이름에 잘못된 '{0}' 값이 들어 있는 중괄호가 있습니다. 중괄호는 데이터 계약 이름에서 특별한 의미가 있습니다. 즉, 중괄호는 제네릭 형식에 대한 데이터 계약 이름 지정을 사용자 지정하는 데 사용됩니다. 이 형식에 있는 제네릭 매개 변수의 수에 기초하여 중괄호의 내용은 해당 인덱스에서 제네릭 매개 변수의 이름을 삽입하려는 경우에는 0과 '{2}' 사이의 숫자여야 하며, 제네릭 매개 변수 네임스페이스의 다이제스트를 삽입하려는 경우에는 '#' 기호여야 합니다.
pl: W nazwie kontraktu danych dla typu „{1}” istnieją nawiasy klamrowe obejmujące „{0}”, co jest nieprawidłową wartością. Nawiasy klamrowe mają w nazwach kontraktów danych specjalne znaczenie — są używane do dostosowywania nazw kontraktów danych do typów ogólnych. Zawartość nawiasów klamrowych zależy od liczby parametrów ogólnych danego typu. Musi być to liczba z zakresu 0 i „{2}” dla nazwy parametru ogólnego lub symbol „#” dla skrótu przestrzeni nazw parametru ogólnego.
pt_br: No nome do contrato de dados para o tipo '{1}', existem chaves cujo conteúdo é '{0}', que é um valor inválido. As chaves têm significado especial nos nomes de contrato de dados: elas são usadas para personalizar a nomenclatura de contratos de dados de tipos genéricos. Baseado no número de parâmetros genéricos que esse tipo tem, o conteúdo das chaves deve ser um número entre 0 e '{2}' para inserir o nome do parâmetro genérico nesse índice ou o símbolo '#' para inserir um resumo dos namespaces do parâmetro genérico.
ru: В имени контракта данных для типа "{1}" имеются фигурные скобки, заключающие "{0}", что является недопустимым значением. Фигурным скобкам отводится особая роль в именах контрактов данных — они используются для настройки именования контрактов данных для базовых типов. В зависимости от количества базовых параметров данного типа фигурные скобки заключают число в диапазоне от 0 до "{2}" для вставки имени универсального параметра с этим индексом или символ "#" для вставки хэш-кода пространств имен универсальных параметров.
tr: '{1}' türü veri anlaşması adında, geçersiz bir değer olan içinde '{0}' bulunan büyük ayraçlar var. Büyük ayraçların veri anlaşması adlarında özel anlamları vardır, genel türler için veri anlaşması adlandırmasını özelleştirmek için kullanılırlar. Bu türün sahip olduğu genel parametre sayısına bağlı olarak, büyük ayraç içeriği ilgili dizine genel parametre adını eklemek için 0 ve '{2}' arasında bir sayı olmalı ya da genel parametre ad alanlarının bir özetini eklemek için '#' simgesi olmalıdır.
zh_hans: 在类型“{1}”的数据协定名称中，花括号内具有“{0}”这一无效的数值。在数据协定名称中花括号具有特殊的含义: 它们用来自定义用于泛型类型的数据协定的命名。根据此类型具有的泛型形参的数目，花括号内的内容必须为介于 0 和“{2}”之间的数值(以便插入位于该索引的泛型形参的名称)或为“#”符号(以便插入泛型形参命名空间的摘要)。
zh_hant: 在類型 '{1}' 的資料合約名稱中，大括號內含有無效的值 '{0}'。大括號在資料合約名稱中具有特殊意義 - 它們可以用來自訂一般類型的資料合約名稱。根據此類型擁有的一般參數數目，大括號的內容必須是介於 0 到 '{2}' 的數字，以於該索引插入一般參數的名稱，或必須是 '#' 符號以插入一般參數命名空間的摘要。

# GenericTypeNameMismatch
source: DataContract name '{0}' from namespace '{1}' does not match the generic name '{2}' from namespace '{3}'.
cs: Název kontraktu DataContract {0} z oboru názvů {1} se neshoduje s obecným názvem {2} z oboru názvů {3}.
de: Der DataContract-Name "{0}" aus dem Namespace "{1}" stimmt nicht mit dem generischen Namen "{2}" aus dem Namespace "{3}" überein.
es: El nombre DataContract "{0}" del espacio de nombres "{1}" no coincide con el nombre genérico "{2}" del espacio de nombres "{3}".
fr: Le nom DataContract '{0}' provenant de l'espace de noms '{1}' ne correspond pas au nom générique '{2}' provenant de l'espace de noms '{3}'.
it: Il nome '{0}' di DataContract dello spazio dei nomi '{1}' non corrisponde al nome generico '{2}' dello spazio dei nomi '{3}'.
ja: 名前空間 '{1}' の DataContract 名 '{0}' が、名前空間 '{3}' のジェネリック名 '{2}' に一致していません。
ko: 네임스페이스 '{1}'의 DataContract 이름 '{0}'이(가) 네임스페이스 '{3}'의 제네릭 이름 '{2}'과(와) 일치하지 않습니다.
pl: Nazwa schematu DataContract „{0}” z przestrzeni nazw „{1}” nie pasuje do nazwy ogólnej „{2}” z przestrzeni nazw „{3}”.
pt_br: O nome do DataContract '{0}' do namespace '{1}' não corresponde ao nome genérico '{2}' do namespace '{3}'.
ru: Имя DataContract "{0}" из пространства имен "{1}" не совпадает с универсальным именем "{2}" из пространства имен "{3}".
tr: '{1}' ad alanındaki '{0}' DataContract adı, '{3}' ad alanındaki '{2}' genel adıyla eşleşmiyor.
zh_hans: 来自命名空间“{1}”的 DataContract 名称“{0}”与来自命名空间“{3}”的通用名称“{2}”不匹配。
zh_hant: 命名空間 '{1}' 的 DataContract 名稱 '{0}' 與命名空間 '{3}' 的一般名稱 '{2}' 不相符。

# GenericTypeNotExportable
source: Type '{0}' cannot be exported as a schema type because it is an open generic type. You can only export a generic type if all its generic parameter types are actual types.
cs: Typ {0} nelze exportovat jako typ schématu, protože je to otevřený obecný typ. Obecný typ lze exportovat jen tehdy, jsou-li všechny jeho obecné typy parametrů skutečnými typy.
de: Der Typ "{0}" kann nicht als Schematyp exportiert werden, da er ein offener generischer Typ ist. Ein generischer Typ kann nur exportiert werden, wenn alle zugehörigen generischen Parametertypen tatsächliche Typen sind.
es: El tipo "{0}" no se puede exportar como tipo de esquema, ya que es un tipo genérico abierto. Solo se puede exportar un tipo genérico si todos sus tipos de parámetros genéricos son tipos reales.
fr: Impossible d'importer le type '{0}' comme type schéma, car il s'agit d'un type générique ouvert. Un type générique est uniquement exportable si tous ses types de paramètre génériques sont des types réels.
it: Il tipo '{0}' non può essere esportato come tipo di schema perché è un tipo generico aperto. Si può esportare un tipo generico solo se tutti i tipi di parametri generici che contiene sono effettivi.
ja: 型 '{0}' は、オープン ジェネリック型であるためスキーマ型としてエクスポートできません。ジェネリック型をエクスポートできるのは、そのすべてのジェネリック パラメーター型が実際の型である場合のみです。
ko: '{0}' 형식이 개방형 제네릭 형식이기 때문에 스키마 형식으로 내보낼 수 없습니다. 모든 제네릭 매개 변수 형식이 실제 형식인 경우에만 제네릭 형식을 내보낼 수 있습니다.
pl: Nie można wyeksportować typu „{0}” jako typu schematu, ponieważ jest to otwarty typ ogólny. Eksport typu ogólnego może być wykonany tylko wtedy, gdy wszystkie jego typy parametrów ogólnych są typami rzeczywistymi.
pt_br: O tipo '{0}' não pode ser exportado como um tipo de esquema porque ele é um tipo genérico aberto. Você só poderá exportar um tipo genérico se todos os tipos de parâmetros genéricos forem tipos reais.
ru: Невозможно экспортировать тип "{0}" как тип схемы, так как он является открытым универсальным типом. Универсальный тип можно экспортировать, только если все типы его универсальных параметров являются реальными типами.
tr: Açık genel bir tür olduğundan, '{0}' türü bir şema türü olarak dışarı aktarılamıyor. Bir genel türü, yalnızca tüm genel parametre türleri gerçek türler olduğunda verebilirsiniz.
zh_hans: 类型“{0}”无法作为架构类型被导出，因为它是一种开放的泛型类型。泛型类型仅可以在其所有的泛型形参类型均为实际类型时才可以被导出。
zh_hant: 無法將類型 '{0}' 匯入成結構描述類型，因為它是開放式一般類型。如果所有一般參數類型都是實際類型，您便只能匯入一般類型。

# GetOnlyCollectionMustHaveAddMethod
source: Collection interface type '{0}' is being used as a get-only property and does not have an Add method. Consider adding a setter to the property or using a collection data contract that does have an Add method - for example IList or ICollection<T>.
cs: Typ rozhraní kolekce {0} se používá jako vlastnost pouze pro získání (get) a neobsahuje metodu Add. Zvažte přidání metody setter do vlastnosti nebo použití kontraktu dat kolekce, který neobsahuje metodu Add (například rozhraní IList nebo ICollection<T>).
de: Der Sammlungsschnittstellentyp "{0}" wird als ausschließlich abrufbare Eigenschaft verwendet und weist keine Add-Methode auf. Fügen Sie der Eigenschaft ggf. einen Setter hinzu, oder verwenden Sie einen Sammlungsdatenvertrag mit einer Add-Methode, z. B. IList oder ICollection<T>.
es: El tipo de interfaz de colección "{0}" se está usando como una propiedad get-only y no tiene un método Add. Considere la posibilidad de agregar un establecedor a la propiedad o de usar un contrato de datos de colección que no tenga un método Add, por ejemplo, IList o ICollection<T>.
fr: Le type d'interface de collection '{0}' est utilisé en tant que propriété get-only et n'a pas de méthode Add. Ajoutez une méthode setter à la propriété ou utilisez un contrat de données de collection comportant une méthode Add, par exemple IList ou ICollection<T>.
it: Il tipo di interfaccia della raccolta '{0}' viene usato come proprietà con sola funzione di accesso e non dispone di un metodo Add. Provare ad aggiungere un setter alla proprietà o a usare un contratto di dati della raccolta che non contiene un metodo Add, ad esempio IList o ICollection<T>.
ja: コレクションのインターフェイスの型 '{0}' は get-only プロパティとして使用され、Add メソッドを含んでいません。プロパティに setter を追加するか、IList や ICollection<T> などの Add メソッドを含んでいないコレクション データ コントラクトを使用してください。
ko: 컬렉션 인터페이스 형식 '{0}'은(는) 가져오기 전용 속성으로 사용 중이며 Add 메서드가 없습니다. 속성에 setter를 추가하거나 Add 메서드가 있는 컬렉션 데이터 계약을 사용해 보세요(예: IList 또는 ICollection<T>).
pl: Typ interfejsu kolekcji „{0}” jest używany jako właściwość tylko do pobrania i nie ma metody Add. Rozważ dodanie do właściwości metody ustawiającej lub użycie kontraktu danych kolekcji, który ma metodę Add, na przykład IList lub ICollection<T>.
pt_br: O tipo de interface de coleção '{0}' está sendo usado como uma propriedade somente obtenção e não tem um método Add. Considere adicionar um setter à propriedade ou usar um contrato de dados de coleção que tenha um método Add, por exemplo, IList ou ICollection<T>.
ru: Тип интерфейса коллекции "{0}" используется как свойство только для чтения и не имеет метода Add. Рекомендуется добавить в свойство метод задания или использовать контракт данных коллекции, не имеющий метода Add, например IList или ICollection<T>.
tr: Koleksiyon arabirim türü '{0}' salt alma özelliği olarak kullanılıyor ve bir Add metodu içermiyor. Özelliğe bir ayarlayıcı eklemeyi veya Add metodu içeren bir koleksiyon veri anlaşması (IList veya ICollection<T> gibi) kullanmayı düşünün.
zh_hans: 集合接口类型“{0}”正用作 get-only 属性，但没有 Add 方法。请考虑向该属性添加 setter，或使用具有 Add 方法的集合数据协定 - 例如 IList 或 ICollection<T>。
zh_hant: 集合介面類型 '{0}' 目前用作為 get-only 屬性，且沒有 Add 方法。請考慮為屬性新增 Setter，或使用沒有 Add 方法的集合資料合約，例如 IList 或 ICollection<T>。

# ISerializableContainsMoreThanOneItems
source: Its root sequence contains more than one particle.
cs: Jeho kořenová sekvence obsahuje více než jednu částici.
de: Die Stammsequenz enthält mehrere Partikel.
es: Su secuencia raíz contiene más de una partícula.
fr: Sa séquence racine contient plusieurs particules.
it: La sequenza radice contiene più di una particella.
ja: ルート シーケンスは複数のパーティクルを含んでいます。
ko: 해당 루트 시퀀스에 둘 이상의 파티클이 포함되어 있습니다.
pl: Główna sekwencja zawiera więcej niż jedną cząstkę.
pt_br: Sua sequência raiz contém mais de uma partícula.
ru: Его корневая последовательность содержит несколько частей.
tr: Kök sırası, birden fazla parçacık içeriyor.
zh_hans: 它的根序列包含多个粒子。
zh_hant: 其根序列包含一個以上的物件。

# ISerializableDerivedContainsOneOrMoreItems
source: Derived ISerializable types cannot contain any particles.
cs: Odvozené typy ISerializable nemohou obsahovat žádné částice.
de: Abgeleitete ISerializable-Typen können keine Partikel enthalten.
es: Los tipos ISerializable derivados no pueden contener partículas.
fr: Les types ISerializable dérivés ne peuvent pas contenir de particules.
it: I tipi derivati da ISerializable non possono contenere alcuna particella.
ja: 派生した ISerializable 型にパーティクルを含めることはできません。
ko: 파생된 ISerializable 형식은 파티클을 포함할 수 없습니다.
pl: Typy pochodne implementujące interfejs ISerializable nie mogą zawierać żadnych cząstek.
pt_br: Os tipos ISerializable derivados não podem conter nenhuma partícula.
ru: Производные типы ISerializable не могут содержать какие-либо части.
tr: Türetilen ISerializable türler, herhangi bir parçacık bulunduramaz.
zh_hans: 派生的 ISerializable 类型不能包含任何粒子。
zh_hant: Derived ISerializable 類型不可以包含任何物件。

# ISerializableDoesNotContainAny
source: It does not contain root sequence with a wildcard element <any>.
cs: Neobsahuje kořenovou sekvenci se zástupným elementem <any>.
de: Es ist keine Stammsequenz mit einem Platzhalterelement <any> vorhanden.
es: No contiene la secuencia raíz con un elemento comodín <any>.
fr: Une séquence racine avec un élément de caractère générique <any> n'est pas contenue.
it: Non contiene la sequenza radice con un elemento jolly <any>.
ja: ワイルドカード要素 <any> を持つルート シーケンスを含みません。
ko: 와일드카드 요소 <any>가 있는 루트 시퀀스가 포함되어 있지 않습니다.
pl: Nie zawiera sekwencji głównej z elementem symbolu wieloznacznego <any>.
pt_br: Isto não contém uma sequência raiz com um elemento curinga <any>.
ru: Он не содержит корневую последовательность с групповым элементом <any>.
tr: <any> joker parçacığı öğesine sahip kök sırası bulundurmuyor.
zh_hans: 它不包含具有通配符元素 <any> 的根序列。
zh_hant: 未包含具有萬用字元元素 <any> 的根序列。

# ISerializableMustRefFactoryTypeAttribute
source: It does not reference attribute '{0}' from namespace '{1}'.
cs: Neodkazuje na atribut {0} z oboru názvů {1}.
de: Es ist kein Verweis auf das Attribut "{0}" aus dem Namespace "{1}" vorhanden.
es: No contiene una referencia al atributo "{0}" del espacio de nombres "{1}".
fr: L'attribut '{0}' provenant de l'espace de noms '{1}' n'est pas référencé.
it: Non fa riferimento all'attributo '{0}' dello spazio dei nomi '{1}'.
ja: 名前空間 '{1}' の属性 '{0}' を参照しません。
ko: 네임스페이스 '{1}'의 '{0}' 특성을 참조하지 않습니다.
pl: Nie odwołuje się do atrybutu „{0}” z przestrzeni nazw „{1}”.
pt_br: Isto não referencia um atributo '{0}' do namespace '{1}'.
ru: Он не ссылается на атрибут "{0}" из пространства имен "{1}".
tr: '{1}' ad alanındaki '{0}' özniteliğine başvuru yapmıyor.
zh_hans: 它不从命名空间“{1}”中引用特性“{0}”。
zh_hant: 未參考命名空間 '{1}' 的屬性 '{0}'。

# ISerializableTypeCannotBeImported
source: ISerializable type '{0}' in namespace '{1}' cannot be imported. '{2}'
cs: Typ ISerializable {0} v oboru názvů {1} nelze importovat. {2}
de: Der ISerializable-Typ "{0}" im Namespace "{1}" kann nicht importiert werden. "{2}"
es: El tipo ISerializable "{0}" del espacio de nombres "{1}" no se puede importar. "{2}"
fr: Le type ISerializable '{0}' dans l'espace de noms '{1}' ne peut pas être importé. '{2}'
it: Non è possibile importare il tipo ISerializable '{0}' nello spazio dei nomi '{1}'. '{2}'
ja: 名前空間 '{1}' の ISerializable 型 '{0}' をインポートできません。'{2}'
ko: 네임스페이스 '{1}'의 ISerializable 형식 '{0}'을(를) 가져올 수 없습니다. '{2}'
pl: Nie można zaimportować typu „{0}” implementującego interfejs ISerializable w przestrzeni nazw „{1}”. „{2}”
pt_br: O tipo ISerializable '{0}' no namespace '{1}' não pode ser importado. '{2}'
ru: Тип ISerializable "{0}" в пространстве имен "{1}" не может быть импортирован. "{2}"
tr: '{1}' ad alanındaki '{0}' ISerializable türü içeri aktarılamıyor. '{2}'
zh_hans: 无法导入命名空间“{1}”中的 ISerializable 类型“{0}”。“{2}”
zh_hant: 無法匯入命名空間 '{1}' 中的 ISerializable 類型 '{0}'。 '{2}'

# ISerializableWildcardMaxOccursMustBe
source: 'maxOccurs' on the wildcard element must be '{0}'.
cs: Hodnota vlastnosti maxOccurs u zástupného elementu musí být {0}.
de: "maxOccurs" muss für das Platzhalterelement "{0}" sein.
es: El valor de "maxOccurs" en el elemento comodín debe ser "{0}".
fr: 'maxOccurs' sur l'élément de caractère générique doit être '{0}'.
it: Il valore di 'maxOccurs' nell'elemento jolly deve essere '{0}'.
ja: ワイルドカード要素の 'maxOccurs' は '{0}' である必要があります。
ko: 와일드카드 요소의 'maxOccurs'는 '{0}'이어야 합니다.
pl: Wartość parametru „maxOccurs” w elemencie symbolu wieloznacznego musi wynosić „{0}”.
pt_br: 'maxOccurs' no elemento curinga deve ser '{0}'.
ru: Параметр maxOccurs группового элемента должен равняться "{0}".
tr: Joker parçacığı öğesindeki 'maxOccurs' değeri '{0}' olmalı.
zh_hans: 通配符元素上的 "maxOccurs" 必须为“{0}”。
zh_hant: 萬用字元元素上的 'maxOccurs' 必須是 '{0}'。

# ISerializableWildcardMinOccursMustBe
source: 'minOccurs' on the wildcard element must be '{0}'.
cs: Hodnota vlastnosti minOccurs u zástupného elementu musí být {0}.
de: "minOccurs" muss für das Platzhalterelement "{0}" sein.
es: El valor de "minOccurs" en el elemento comodín debe ser "{0}".
fr: 'minOccurs' sur l'élément de caractère générique doit être '{0}'.
it: Il valore di 'minOccurs' nell'elemento jolly deve essere '{0}'.
ja: ワイルドカード要素の 'minOccurs' は '{0}' である必要があります。
ko: 와일드카드 요소의 'minOccurs'는 '{0}'이어야 합니다.
pl: Wartość parametru „minOccurs” w elemencie symbolu wieloznacznego musi wynosić „{0}”.
pt_br: 'minOccurs' no elemento curinga deve ser '{0}'.
ru: Параметр minOccurs группового элемента должен быть "{0}".
tr: Joker parçacığı öğesindeki 'minOccurs' değeri '{0}' olmalı.
zh_hans: 通配符元素上的 "minOccurs" 必须为“{0}”。
zh_hant: 萬用字元元素上的 'minOccurs' 必須是 '{0}'。

# ISerializableWildcardNamespaceInvalid
source: Namespace on the wildcard element must be '{0}'.
cs: Obor názvů u zástupného elementu musí být {0}.
de: Der Namespace muss für das Platzhalterelement "{0}" sein.
es: El espacio de nombres del elemento comodín debe ser "{0}".
fr: L'espace de noms sur l'élément de caractère générique doit être '{0}'.
it: Il valore di Namespace nell'elemento jolly deve essere '{0}'.
ja: ワイルドカード要素の名前空間は '{0}' である必要があります。
ko: 와일드카드 요소의 네임스페이스는 '{0}'이어야 합니다.
pl: Przestrzeń nazw w elemencie symbolu wieloznacznego musi mieć wartość „{0}”.
pt_br: O namespace no elemento curinga deve ser '{0}'.
ru: Пространство имен группового элемента должно быть "{0}".
tr: Joker parçacığı öğesindeki Namespace değeri '{0}' olmalı.
zh_hans: 通配符元素上的命名空间必须为“{0}”。
zh_hant: 萬用字元元素上的命名空間必須是 '{0}'。

# ISerializableWildcardProcessContentsInvalid
source: ProcessContents on the wildcard element must be '{0}'.
cs: Hodnota vlastnosti ProcessContents u zástupného elementu musí být {0}.
de: ProcessContents muss für das Platzhalterelement "{0}" sein.
es: El valor de ProcessContents en el elemento comodín debe ser "{0}".
fr: ProcessContents sur l'élément de caractère générique doit être '{0}'.
it: Il valore di ProcessContents nell'elemento jolly deve essere '{0}'.
ja: ワイルドカード要素の ProcessContents は '{0}' である必要があります。
ko: 와일드카드 요소의 ProcessContents는 '{0}'이어야 합니다.
pl: Wartość parametru ProcessContents w elemencie symbolu wieloznacznego musi wynosić „{0}”.
pt_br: O ProcessContents no elemento curinga deve ser '{0}'.
ru: Параметр ProcessContents группового элемента должен равняться "{0}".
tr: Joker parçacığı öğesindeki ProcessContents değeri '{0}' olmalı.
zh_hans: 通配符元素上的 ProcessContents 必须为“{0}”。
zh_hant: 萬用字元元素上的 ProcessContents 必須是 '{0}'。

# IXmlSerializableCannotHaveCollectionDataContract
source: Type '{0}' cannot be IXmlSerializable and have CollectionDataContractAttribute attribute.
cs: Typ {0} nemůže být IXmlSerializable a mít atribut CollectionDataContractAttribute.
de: Der Typ "{0}" kann nicht IXmlSerializable sein und zugleich das Attribut CollectionDataContractAttribute aufweisen.
es: El tipo "{0}" no puede ser IXmlSerializable y tener el atributo CollectionDataContractAttribute.
fr: Le type '{0}' ne peut pas être IXmlSerializable et avoir l'attribut CollectionDataContractAttribute.
it: Il tipo '{0}' non può essere IXmlSerializable e contenere l'attributo CollectionDataContractAttribute.
ja: 型 '{0}' は IXmlSerializable であってはならず、CollectionDataContractAttribute 属性を含んでいてはいけません。
ko: '{0}' 형식은 IXmlSerializable일 수 없으며 CollectionDataContractAttribute 특성을 가질 수 없습니다.
pl: Typ „{0}” nie może implementować interfejsu IXmlSerializable i mieć jednocześnie przypisany atrybut CollectionDataContractAttribute.
pt_br: O tipo '{0}' não pode ser IXmlSerializable e ter um atributo CollectionDataContractAttribute.
ru: Тип "{0}" не может быть IXmlSerializable и иметь атрибут CollectionDataContractAttribute.
tr: '{0}' türü IXmlSerializable olamaz ve CollectionDataContractAttribute özniteliğine sahip olamaz.
zh_hans: 类型“{0}”不能为 IXmlSerializable，且不能具有 CollectionDataContractAttribute 特性。
zh_hant: 類型 '{0}' 不可以是 IXmlSerializable，也不能具有 CollectionDataContractAttribute 屬性。
