Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# CannotImportInvalidSchemas
source: Cannot import invalid schemas. Compilation on the XmlSchemaSet failed.
cs: Nelze importovat neplatná schémata. Kompilace v sadě XmlSchemaSet selhala.
de: Ungültige Schemas können nicht importiert werden. Fehler bei der Kompilierung von XmlSchemaSet.
es: No se pueden importar esquemas no válidos. Error de compilación en XmlSchemaSet.
fr: Impossible d'importer des schémas non valides. Échec de la compilation sur XmlSchemaSet.
it: Non è possibile importare schemi non validi. La compilazione su XmlSchemaSet non è riuscita.
ja: 無効なスキーマをインポートできません。XmlSchemaSet でのコンパイルに失敗しました。
ko: 잘못된 스키마를 가져올 수 없습니다. XmlSchemaSet에서 컴파일하지 못했습니다.
pl: Nie można zaimportować nieprawidłowych schematów. Kompilacja zestawu XmlSchemaSet nie powiodła się.
pt_br: Não é possível importar esquemas inválidos. Falha ao compilar no XmlSchemaSet.
ru: Нельзя импортировать недопустимые схемы. Ошибка компиляции для XmlSchemaSet.
tr: Geçersiz şemalar içeri aktarılamaz. XmlSchemaSet üstünde derleme başarısız oldu.
zh_hans: 无法导入无效的架构。在 XmlSchemaSet 上的编译失败。
zh_hant: 無法匯入無效的結構描述。編譯 XmlSchemaSet 失敗。

# CannotImportNullDataContractName
source: Cannot import type for null XmlQualifiedName specified via parameter.
cs: Pro třídu XmlQualifiedName s hodnotou null zadanou parametrem nelze importovat typ.
de: Der Typ für einen über Parameter angegebenen XmlQualifiedName mit dem Wert NULL kann nicht importiert werden.
es: No se puede importar el tipo del elemento XmlQualifiedName nulo especificado mediante un parámetro.
fr: Impossible d'importer un type pour le XmlQualifiedName de valeur null spécifié via un paramètre.
it: Non è possibile importare il tipo per l'elemento XmlQualifiedName Null specificato tramite il parametro.
ja: パラメーターを介して指定された null XmlQualifiedName の型をインポートできません。
ko: 매개 변수를 통해 지정된 null XmlQualifiedName에 대한 형식을 가져올 수 없습니다.
pl: Nie można zaimportować typu z powodu przekazanego przez parametr elementu XmlQualifiedName o wartości null.
pt_br: Não é possível importar tipo para XmlQualifiedName nulo especificado via parâmetro.
ru: Невозможно импортировать тип пустого имени XmlQualifiedName, указанный в параметре.
tr: Parametreyle belirtilen null XmlQualifiedName türü içeri aktarılamaz.
zh_hans: 无法导入通过参数指定的空 XmlQualifiedName 的类型。
zh_hant: 無法透過參數為指定的 null XmlQualifiedName 匯入類型。

# CannotImportNullSchema
source: Cannot import null XmlSchema contained in XmlSchemaSet specified via parameter.
cs: Nelze importovat schéma XmlSchema s hodnotou null obsažené ve třídě XmlSchemaSet zadané parametrem.
de: Ein in einem über Parameter angegebenen XmlSchemaSet enthaltenes XmlSchema mit dem Wert NULL kann nicht importiert werden.
es: No se puede importar el elemento XmlSchema nulo contenido en el elemento XmlSchemaSet especificado mediante un parámetro.
fr: Impossible d'importer le XmlSchema de valeur null contenu dans le XmlSchemaSet spécifié via un paramètre.
it: Non è possibile importare l'elemento XmlSchema Null contenuto nell'elemento XmlSchemaSet specificato tramite il parametro.
ja: パラメーターを介して指定された XmlSchemaSet に含まれる null XmlSchema をインポートできません。
ko: 매개 변수를 통해 지정된 XmlSchemaSet에 포함된 null XmlSchema를 가져올 수 없습니다.
pl: Nie można zaimportować obiektu XmlSchema o wartości null zawartego w zestawie XmlSchemaSet, określonego przez parametr.
pt_br: Não é possível importar XmlSchema nulo contido no XmlSchemaSet especificado via parâmetro.
ru: Невозможно импортировать пустую схему XmlSchema, которая содержится в XmlSchemaSet, указанном в параметре.
tr: Parametreyle belirtilen XmlSchemaSet içindeki null XmlSchema içeri aktarılamaz.
zh_hans: 无法导入通过参数指定的 XmlSchemaSet 中包含的空 XmlSchema。
zh_hant: 無法透過參數匯入指定的 XmlSchemaSet 中所包含的 null XmlSchema。

# CannotLoadMemberType
source: Cannot load member type '{0}'.
cs: Nelze načíst typ členu {0}.
de: Der Membertyp "{0}" kann nicht geladen werden.
es: No se puede cargar el tipo de miembro "{0}".
fr: Impossible de charger le type de membre '{0}'.
it: Non è possibile caricare il tipo di membro '{0}'.
ja: メンバー型 '{0}' を読み込めません。
ko: 멤버 형식 '{0}'을(를) 로드할 수 없습니다.
pl: Nie można załadować składowej typu „{0}”.
pt_br: Não é possível carregar o tipo de membro '{0}'.
ru: Не удается загрузить тип члена "{0}".
tr: '{0}' üye türü yüklenemiyor.
zh_hans: 无法加载成员类型“{0}”。
zh_hant: 無法載入成員類型 '{0}'。

# CannotSerializeObjectWithCycles
source: Object graph for type '{0}' contains cycles and cannot be serialized if reference tracking is disabled.
cs: Graf objektů pro typ {0} obsahuje cykly a není možné ho serializovat, když je zakázáno sledování odkazů.
de: Der Objektgraph für den Typ "{0}" enthält Zyklen und kann nicht serialisiert werden, wenn die Nachverfolgung von Verweisen deaktiviert ist.
es: El gráfico de objetos del tipo "{0}" contiene ciclos y no se puede serializar si el seguimiento de referencias está deshabilitado.
fr: Le graphique de l'objet pour le type '{0}' contient des cycles, et il est impossible de le sérialiser si le suivi de référence est désactivé.
it: L'oggetto grafico per il tipo '{0}' contiene cicli e non può essere serializzato se la verifica dei riferimenti è disabilitata.
ja: 型 '{0}' のオブジェクト グラフは、循環を含んでいるため、参照追跡が無効になっている場合はシリアル化できません。
ko: 형식 '{0}'에 대한 개체 그래프에 주기가 포함되어 있으며 이 개체 그래프는 참조 추적을 사용할 수 없는 경우 직렬화할 수 없습니다.
pl: Wykres obiektu dla typu „{0}” zawiera cykle i nie może zostać poddany serializacji, jeśli śledzenie odwołań jest wyłączone.
pt_br: O grafo de objeto para o tipo '{0}' contém ciclos e não poderá ser serializado se o acompanhamento de referência estiver desabilitado.
ru: Граф объекта для типа "{0}" содержит циклы и не может быть сериализован, если отключено отслеживание ссылок.
tr: '{0}' türü için nesne grafı döngüler içerir ve başvuru izlemesi devre dışı bırakılırsa serileştirilemez.
zh_hans: “{0}”类型的对象图包含循环，如果禁用引用跟踪，择无法对其进行序列化。
zh_hant: 類型 '{0}' 的物件圖形包含循環，且如果已停用參考追蹤，便無法被序列化。

# CannotSetMembersForReferencedType
source: Existing type '{0}' specified via the referenced types collection has been referenced in the generated code. Members cannot be added for this type since it cannot be modified.
cs: Na stávající typ {0} zadaný přes odkazovanou kolekci typů se odkazovalo v generovaném kódu. Pro tento typ nejdou přidávat členy, protože se nedá měnit.
de: Auf den vorhandenen, über die referenzierte Typsammlung angegebenen Typ "{0}" wurde im generierten Code verwiesen. Für diesen Typ können keine Member hinzugefügt werden, da er nicht geändert werden kann.
es: El código generado contiene una referencia al tipo existente "{0}" especificado a través de la colección de tipos a los que se hace referencia. No es posible agregar miembros a este tipo, ya que no se puede modificar.
fr: Le type existant '{0}' spécifié via la collection des types référencés a été référencé dans le code généré. Il est impossible d'ajouter des membres pour ce type, car il n'est pas modifiable.
it: Nel codice generato si fa riferimento al tipo esistente '{0}' specificato tramite la raccolta di tipi di riferimento. Non è possibile aggiungere membri per questo tipo in quanto non può essere modificato.
ja: 参照された型のコレクションを介して指定された既存の型 '{0}' は、生成されたコードで参照されています。この型は変更できないため、この型のメンバーを追加できません。
ko: 참조된 형식 컬렉션을 통해 지정된 기존 형식 '{0}'이(가) 생성된 코드에서 참조되었습니다. 이 형식은 수정할 수 없기 때문에 이 형식에 대해 멤버를 추가할 수 없습니다.
pl: Istniejący typ „{0}” określony przez przywoływaną kolekcję typów został przywołany w wygenerowanym kodzie. Nie można dodawać składowych do tego typu, ponieważ nie może on być modyfikowany.
pt_br: O tipo existente '{0}' especificado via coleção de tipos referenciados foi referenciado no código gerado. Os membros desse tipo não podem ser adicionados porque ele não pode ser modificado.
ru: Сгенерированный код содержит ссылку на существующий тип "{0}", указанный в коллекции ссылочных типов. Не удается добавить члены для этого типа, так как он не может быть изменен.
tr: Başvurulan tür koleksiyonuyla belirtilen mevcut '{0}' türüne, oluşturulan kodda başvuru yapılmış. Değiştirilemediğinden, bu tür için üye eklenemez.
zh_hans: 通过引用的类型集合指定的现有类型“{0}”已经在生成的代码中被引用。由于无法修改该类型，因此无法添加此类型的成员。
zh_hant: 產生的程式碼中已參考了透過參考類型集合所指定的現有類型 '{0}'。因為該類型無法修改，所以無法新增此類型的成員。

# CannotSetNamespaceForReferencedType
source: Existing type '{0}' specified via the referenced types collection has been referenced in the generated code. Cannot set namespace for this type since it cannot be modified.
cs: Na stávající typ {0} zadaný přes odkazovanou kolekci typů se odkazovalo v generovaném kódu. Pro tento typ není možné nastavit obor názvů, protože se nedá měnit.
de: Auf den vorhandenen, über die referenzierte Typsammlung angegebenen Typ "{0}" wurde im generierten Code verwiesen. Der Namespace für diesen Typ kann nicht festgelegt werden, da er nicht geändert werden kann.
es: El código generado contiene una referencia al tipo existente "{0}" especificado a través de la colección de tipos a los que se hace referencia. No es posible definir un espacio de nombres para este tipo, ya que no se puede modificar.
fr: Le type existant '{0}' spécifié via la collection des types référencés a été référencé dans le code généré. Il est impossible de définir l'espace de noms pour ce type, car il n'est pas modifiable.
it: Nel codice generato si fa riferimento al tipo esistente '{0}' specificato tramite la raccolta di tipi di riferimento. Non è possibile impostare lo spazio dei nomi per questo tipo in quanto non può essere modificato.
ja: 参照された型のコレクションを介して指定された既存の型 '{0}' は、生成されたコードで参照されています。この型は変更できないため、この型の名前空間を設定できません。
ko: 참조된 형식 컬렉션을 통해 지정된 기존 형식 '{0}'이(가) 생성된 코드에서 참조되었습니다. 이 형식을 수정할 수 없기 때문에 이 형식에 대해 네임스페이스를 설정할 수 없습니다.
pl: Istniejący typ „{0}” określony przez wskazaną kolekcję typów został wskazany w wygenerowanym kodzie. Nie można skonfigurować przestrzeni nazw dla tego typu, ponieważ nie może być on modyfikowany.
pt_br: O tipo existente '{0}' especificado via coleção de tipos referenciados foi referenciado no código gerado. Não é possível definir o namespace para esse tipo porque ele não pode ser modificado.
ru: Сгенерированный код содержит ссылку на существующий тип "{0}", указанный в коллекции ссылочных типов. Не удается установить пространство имен для этого типа, так как он не может быть изменен.
tr: Başvurulan tür koleksiyonuyla belirtilen mevcut '{0}' türüne, oluşturulan kodda başvuru yapılmış. Değiştirilemediğinden, bu tür için ad alanı eklenemez.
zh_hans: 通过引用的类型集合指定的现有类型“{0}”已经在生成的代码中被引用。由于无法修改该类型，因此无法设置此类型的命名空间。
zh_hant: 產生的程式碼中已參考了透過參考類型集合所指定的現有類型 '{0}'。因為該類型無法修改，所以無法設定此類型的命名空間。

# CannotUseGenericTypeAsBase
source: Collection type cannot be generated for type '{0}' from namespace '{1}'. Cannot use a generic list type as a base type because the language does not support generic type references.
cs: Pro typ {0} z oboru názvů {1} nelze generovat typ kolekce. Jako základní typ nelze použít typ obecného seznamu, protože jazyk nepodporuje odkazy obecných typů.
de: Für den Typ "{0}" aus dem Namespace "{1}" kann kein Sammlungstyp generiert werden. Es ist nicht möglich, einen generischen Listentyp als Basistyp zu verwenden, da die Sprache keine Verweise auf generische Typen unterstützt.
es: No se puede generar el tipo de colección para el tipo "{0}" del espacio de nombres "{1}". No se puede usar un tipo de lista genérico como tipo base, ya que el lenguaje no admite referencias de tipo genéricas.
fr: Impossible de générer le type de collection pour le type '{0}' provenant de l'espace de noms '{1}'. Impossible d'utiliser un type de liste générique comme type de base, car le langage ne prend pas en charge les références des types génériques.
it: Non è possibile generare il tipo di raccolta per il tipo '{0}' dello spazio dei nomi '{1}'. Non si può usare un tipo di elenco generico come tipo di base perché il linguaggio non supporta riferimenti a tipi generici.
ja: 名前空間 '{1}' から型が '{0}' のコレクション型を生成することはできません。言語がジェネリック型の参照をサポートしていないため、ジェネリック リスト型を基本データ型として使用することはできません。
ko: 네임스페이스 '{1}'의 형식 '{0}'에 대해 컬렉션 형식을 생성할 수 없습니다. 언어에서 제네릭 형식 참조를 지원하지 않기 때문에 제네릭 목록 형식을 기본 형식으로 사용할 수 없습니다.
pl: Nie można wygenerować typu kolekcji dla typu „{0}” z przestrzeni nazw „{1}”. Jako typu podstawowego nie można użyć typu listy ogólnej, ponieważ język nie obsługuje odwołań do typu ogólnego.
pt_br: Não é possível gerar o tipo de coleção para o tipo '{0}' do namespace '{1}'. Não é possível usar um tipo de lista genérico como um tipo base porque a linguagem não dá suporte para referências de tipo genérico.
ru: Тип коллекции не может быть сформирован для типа "{0}" из пространства имен "{1}". Универсальный тип списка нельзя использовать в качестве базового типа, так как этот язык не поддерживает ссылки на универсальные типы.
tr: '{1}' ad alanındaki '{0}' türü için koleksiyon türü oluşturulamıyor. Dil, genel tür başvurularını desteklemediğinden genel liste türü temel tür olarak kullanılamıyor.
zh_hans: 无法为来自命名空间“{1}”的类型“{0}”生成集合类型。由于该语言不支持泛型类型引用，因此无法将通用列表类型用作基类型。
zh_hant: 無法為來自命名空間 '{1}' 的類型 '{0}' 產生集合類型。無法將一般清單類型用作為基底類型，因為該語言不支援一般類型參考。

# CharIsInvalidPrimitive
source: An internal error has occurred. Char is not a valid schema primitive and should be treated as int in DataContract.
cs: Došlo k vnitřní chybě. Typ char není platný základní prvek schématu a mělo by se s ním v kontraktu DataContract manipulovat jako s typem int.
de: Ein interner Fehler ist aufgetreten. "Char" ist kein gültiger Schemagrundtyp und muss in einem DataContract als "int" behandelt werden.
es: Error interno. Char no es un tipo primitivo de esquema válido y debe tratarse como Int en DataContract.
fr: Une erreur interne s'est produite. La variable Char n'est pas une primitive de schéma valide ; elle doit être traitée comme entier (int) dans DataContract.
it: Si è verificato un errore interno. Char non è una primitiva valida per lo schema e deve essere considerato come int in DataContract.
ja: 内部エラーが発生しました。char は有効なスキーマ プリミティブではないため、DataContract 内では int として扱う必要があります。
ko: 내부 오류가 발생했습니다. Char가 유효한 원시 스키마가 아니며 DataContract에서 int로 처리되어야 합니다.
pl: Wystąpił błąd wewnętrzny. Typ char nie jest prawidłowym schematem pierwotnym i w schemacie DataContract powinien być traktowany jako typ int.
pt_br: Erro interno. Char não é uma primitiva de esquema válida e deve ser tratada como int no DataContract.
ru: Произошла внутренняя ошибка. Char не является допустимым простым типом схемы и должен рассматриваться как целое число в DataContract.
tr: Bir iç hata oluştu. Char geçerli bir şema temel türü değil ve DataContract içinde int olarak değerlendirilmelidir.
zh_hans: 出现内部错误。Char 不是有效的架构基元，在 DataContract 中，应将其当作 Int 进行处理。
zh_hant: 發生內部錯誤。Char 不是有效的結構描述基本類型，而且在 DataContract 中應將其視為 int。

# CircularTypeReference
source: It contains a circular reference for type '{0}' from namespace '{1}'.
cs: Obsahuje kruhový odkaz pro typ {0} z oboru názvů {1}.
de: Enthält einen Zirkelbezug für den Typ "{0}" aus dem Namespace "{1}".
es: Contiene una referencia circular para el tipo "{0}" del espacio de nombres "{1}".
fr: Une référence circulaire est contenue pour le type '{0}' provenant de l'espace de noms '{1}'.
it: Contiene un riferimento circolare per il tipo '{0}' dello spazio dei nomi '{1}'.
ja: これには、名前空間 '{1}' の型 '{0}' に対する循環参照が含まれています。
ko: 네임스페이스 '{1}'의 형식 '{0}'에 대한 순환 참조가 포함되어 있습니다.
pl: Zawiera odwołanie cykliczne dla typu „{0}” z przestrzeni nazw „{1}”.
pt_br: Ele contém uma referência circular para o tipo '{0}' do namespace '{1}'.
ru: Здесь содержится циклическая ссылка для типа "{0}" из пространства имен "{1}".
tr: '{1}' ad alanından '{0}' türü için bir döngüsel başvuru içeriyor.
zh_hans: 它包含对来自命名空间“{1}”的类型“{0}”的循环引用。
zh_hant: 包含命名空間 '{1}' 類型 '{0}' 的循環參考。

# ClrTypeNotFound
source: The deserializer cannot load the type to deserialize because type '{1}' could not be found in assembly '{0}'. Check that the type being serialized has the same contract as the type being deserialized and the same assembly is used.
cs: Deserializátor nemůže načíst typ k převodu, protože typ {1} nebyl nalezen v sestavení {0}. Zkontrolujte, zda má serializovaný typ stejný kontrakt jako typ, který je deserializován, a zda se používá stejné sestavení.
de: Das Deserialisierungsmodul kann den zu deserialisierenden Typ nicht laden, da der Typ "{1}" nicht in der Assembly "{0}" gefunden wurde. Stellen Sie sicher, dass der serialisierte Typ denselben Vertrag besitzt wie der deserialisierte Typ und dieselbe Assembly verwendet wird.
es: El deserializador no puede cargar el tipo que se va a deserializar porque no se pudo encontrar el tipo "{1}" en el ensamblado "{0}". Compruebe que el tipo que se está serializando tiene el mismo contrato que el tipo que se está deserializando y que se está usando el mismo ensamblado.
fr: Le désérialiseur ne peut pas charger le type pour procéder à la désérialisation, car le type '{1}' est introuvable dans l'assembly '{0}'. Vérifiez que le type en cours de sérialisation a le même contrat que le type qui est désérialisé ; vérifiez également que le même assembly est utilisé.
it: Il deserializzatore non può caricare il tipo da deserializzare perché il tipo '{1}' non è stato trovato nell'assembly '{0}'. Verificare che il tipo da serializzare abbia lo stesso contratto del tipo da serializzare e che venga usato lo stesso assembly.
ja: 型 '{1}' はアセンブリ '{0}' 内で見つからなかったため、デシリアライザーは逆シリアル化する型を読み込めません。シリアル化される型と逆シリアル化される型のコントラクトが同じであり、同じアセンブリが使用されていることを確認してください。
ko: 어셈블리 '{0}'에서 '{1}' 형식을 찾을 수 없기 때문에 역직렬 변환기가 deserialize할 형식을 로드할 수 없습니다. 직렬화할 형식에 deserialize할 형식과 동일한 계약이 있는지, 그리고 동일한 어셈블리가 사용되는지 확인하세요.
pl: Deserializator nie może załadować typu do deserializacji, ponieważ nie można było odnaleźć typu „{1}” w zestawie „{0}”. Sprawdź, czy typ poddany serializacji ma ten sam kontrakt co typ do deserializacji i czy używany jest ten sam zestaw.
pt_br: O desserializador não pode carregar o tipo a ser desserializado porque o tipo '{1}' não pôde ser encontrado no assembly '{0}'. Verifique se o tipo que está sendo serializado tem o mesmo contrato que o tipo que está sendo desserializado e se o mesmo assembly é usado.
ru: Десериализатор не может загрузить тип для десериализации, так как не удается найти тип "{1}" в сборке "{0}". Убедитесь, что сериализуемый и десериализуемый типы имеют одинаковый контракт и что используется одна и та же сборка.
tr: '{1}' türü, '{0}' bütünleştirilmiş kodunda bulunamadığından, seri durumdan çıkarıcı, seri durumdan çıkarılacak türü yükleyemiyor. Serileştirilmekte olan türün seri durumdan çıkarılmakta olan türle aynı anlaşmaya sahip olduğundan ve aynı bütünleştirilmiş kodun kullanıldığından emin olun.
zh_hans: 反序列化程序无法加载该类型进行反序列化，因为没有在程序集“{0}”中找到类型“{1}”。请检查正在进行序列化的类型是否与正在进行反序列化的类型具有相同的协定以及是否使用了同一个程序集。
zh_hant: 因為無法在組件 '{0}' 中找到類型 '{1}'，所以還原序列化程式無法載入要還原序列化的類型。請檢查序列化的類型與要還原序列化的類型是否擁有相同的合約，且使用相同的組件。

# CollectionAssignedToIncompatibleInterface
source: '{0}' is a collection type and cannot be serialized when assigned to an interface type that does not implement IEnumerable ('{1}'.)
cs: Parametr {0} představuje typ kolekce. Tento objekt nelze serializovat v případě, že je přiřazen k typu rozhraní bez implementovaného rozhraní IEnumerable ({1}).
de: "{0}" ist ein Sammlungstyp und kann nicht serialisiert werden, wenn er einem Schnittstellentyp zugewiesen ist, der IEnumerable nicht implementiert ("{1}").
es: "{0}" es un tipo de colección y no se puede serializar cuando se asigna a un tipo de interfaz que implementa IEnumerable ("{1}").
fr: '{0}' est un type collection. Il est impossible de le sérialiser quand il est assigné à un type d'interface qui n'implémente pas IEnumerable ('{1}'.)
it: '{0}' è un tipo di raccolta e non può essere serializzato quando è assegnato a un tipo di interfaccia che non implementa IEnumerable ('{1}').
ja: '{0}' は、コレクション型であり、IEnumerable ('{1}') を実装していないインターフェイス型に割り当てられたときはシリアル化できません。
ko: '{0}'은(는) 컬렉션 형식이며 IEnumerable('{1}')을(를) 구현하지 않는 인터페이스 형식에 할당된 경우 직렬화할 수 없습니다.
pl: Typ „{0}” jest typem kolekcji i nie można go serializować, gdy jest przypisany do typu interfejsu, który nie implementuje interfejsu IEnumerable („{1}”).
pt_br: '{0}' é um tipo de coleção e não pode ser serializado quando atribuído a um tipo de interface que não implementa IEnumerable ('{1}'.)
ru: "{0}" является типом коллекции и не может быть сериализован при назначении типу интерфейса, не реализующему интерфейс IEnumerable ("{1}").
tr: '{0}' bir koleksiyon türüdür ve IEnumerable ('{1}') uygulamayan bir arabirim türüne atandığında serileştirilemez.
zh_hans: “{0}”是一个集合类型，分配给没有实现 IEnumerable (“{1}”)的接口类型时不能对其序列化。
zh_hant: '{0}' 是集合類型，無法在指派到未實作 IEnumerable ('{1}') 的介面類型時進行序列化。

# CollectionMustHaveAddMethod
source: Collection type '{0}' does not have a valid Add method.
cs: Typ kolekce {0} nemá platnou metodu Add.
de: Der Sammlungstyp "{0}" enthält keine gültige Add-Methode.
es: El tipo de colección "{0}" no tiene un método Add válido.
fr: Le type de collection '{0}' ne dispose pas d'une méthode Add valide.
it: Il tipo di raccolta '{0}' non contiene un metodo Add valido.
ja: 有効な Add メソッドがコレクション型 '{0}' に設定されていません。
ko: 컬렉션 형식 '{0}'에 유효한 Add 메서드가 없습니다.
pl: Typ kolekcji „{0}” nie ma prawidłowej metody Add.
pt_br: O tipo coleção '{0}' não tem um método Add válido.
ru: Тип коллекции "{0}" не имеет допустимого метода Add.
tr: '{0}' koleksiyon türü, geçerli bir Add metoduna sahip değil.
zh_hans: 集合类型“{0}”不具有有效的 Add 方法。
zh_hant: 集合類型 '{0}' 沒有有效的 Add 方法。

# CollectionMustHaveGetEnumeratorMethod
source: Collection type '{0}' does not have a valid GetEnumerator method.
cs: Typ kolekce {0} nemá platnou metodu GetEnumerator.
de: Der Sammlungstyp "{0}" enthält keine gültige GetEnumerator-Methode.
es: El tipo de colección "{0}" no tiene un método GetEnumerator válido.
fr: Le type de collection '{0}' ne dispose pas d'une méthode GetEnumerator valide.
it: Il tipo di raccolta '{0}' non contiene un metodo GetEnumerator valido.
ja: 有効な GetEnumerator メソッドがコレクション型 '{0}' に設定されていません。
ko: 컬렉션 형식 '{0}'에 유효한 GetEnumerator 메서드가 없습니다.
pl: Typ kolekcji „{0}” nie ma prawidłowej metody GetEnumerator.
pt_br: O tipo coleção '{0}' não tem um método GetEnumerator válido.
ru: Тип коллекции "{0}" не имеет допустимого метода GetEnumerator.
tr: '{0}' koleksiyon türü, geçerli bir GetEnumerator metoduna sahip değil.
zh_hans: 集合类型“{0}”不具有有效的 GetEnumerator 方法。
zh_hant: 集合類型 '{0}' 沒有有效的 GetEnumerator 方法。

# CollectionMustHaveItemType
source: Collection type '{0}' must have a non-null item type.
cs: Typ kolekce {0} musí mít typ položky, který není null.
de: Der Sammlungstyp "{0}" muss einen Elementtyp aufweisen, der nicht den Wert NULL hat.
es: El tipo de colección "{0}" debe tener un tipo de elemento no nulo.
fr: Le type de collection '{0}' doit comporter un type d'élément de valeur non null.
it: Il tipo di raccolta '{0}' deve contenere un tipo di elemento non Null.
ja: コレクション型 '{0}' には null でない項目型が含まれている必要があります。
ko: 컬렉션 형식 '{0}'에 null이 아닌 항목 종류가 있어야 합니다.
pl: Typ kolekcji „{0}” musi mieć typ elementu inny niż null.
pt_br: O tipo de coleção '{0}' deve ter um tipo de item não nulo.
ru: Тип коллекции "{0}" должен иметь ненулевой тип объекта.
tr: '{0}' koleksiyon türü, null olmayan öğe türüne sahip olmalı.
zh_hans: 集合类型“{0}”必须具有非空的项目类型。
zh_hant: 集合類型 '{0}' 必須擁有非 Null 項目類型。

# CollectionTypeCannotBeBuiltIn
source: {0} is a built-in type and cannot be a collection.
cs: {0} je předdefinovaný typ a nemůže být kolekcí.
de: {0} ist ein integrierter Typ und kann keine Sammlung sein.
es: {0} es un tipo integrado y, por tanto, no puede ser una colección.
fr: {0} est un type intégré, et il ne peut pas être une collection.
it: {0} è un tipo predefinito e non può essere una raccolta.
ja: {0} はビルトイン型であるため、コレクションにすることはできません。
ko: {0}은(는) 기본 제공 형식이며 컬렉션이 될 수 없습니다.
pl: Typ {0} jest typem wbudowanym i nie może być kolekcją.
pt_br: {0} é um tipo embutido e não pode ser uma coleção.
ru: {0} является встроенным типом и не может быть коллекцией.
tr: {0}, yerleşik bir türdür ve koleksiyon olamaz.
zh_hans: {0} 为内置类型，不能用作集合。
zh_hant: {0} 是內建類型，且不可為集合。
