Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlStartElementExpected
source: Start element expected. Found {0}.
cs: Byl očekáván počáteční element. Nalezen byl element {0}.
de: Es wurde ein Startelement erwartet. Gefunden wurde {0}.
es: Se esperaba el elemento de inicio. Se encontró {0}.
fr: Élément de début attendu. {0} trouvé.
it: È previsto l'elemento iniziale, ma è stato trovato {0}.
ja: 開始要素が必要です。{0} が見つかりました。
ko: 시작 요소가 필요합니다. {0}을(를) 찾았습니다.
pl: Oczekiwano elementu początkowego. Znaleziono element {0}.
pt_br: Elemento inicial esperado. Encontrado {0}.
ru: Ожидался начальный элемент. Найден {0}.
tr: Başlangıç öğesi bekleniyordu. {0} bulundu.
zh_hans: 需要开始元素。找到 {0}。
zh_hant: 需要開始元素，但找到 {0}。

# XmlStartElementLocalNameNsExpected
source: Start element '{0}' from namespace '{1}' expected. Found {2}.
cs: Byl očekáván počáteční element {0} z oboru názvů {1}. Byl nalezen element {2}.
de: Es wurde das Startelement "{0}" aus dem Namespace "{1}" erwartet. Gefunden wurde {2}.
es: Se esperaba el elemento de inicio "{0}" del espacio de nombres "{1}". Se encontró {2}.
fr: Élément de début '{0}' provenant de l'espace de noms '{1}' attendu. Trouvé {2}.
it: È previsto l'elemento iniziale '{0}' dello spazio dei nomi '{1}', ma è stato trovato {2}.
ja: 名前空間 '{1}' の開始要素 '{0}' が必要です。見つかったのは {2} でした。
ko: 네임스페이스 '{1}'의 시작 요소 '{0}'이(가) 필요한데 {2}을(를) 찾았습니다.
pl: Oczekiwano elementu początkowego „{0}” z przestrzeni nazw „{1}”. Znaleziono {2}.
pt_br: Espera-se o elemento inicial '{0}' do namespace '{1}'. Encontrado {2}.
ru: Ожидался начальный элемент "{0}" из пространства имен "{1}". Найден {2}.
tr: '{1}' ad alanından Start öğesi '{0}' bekleniyordu. Bulunan: {2}.
zh_hans: 需要命名空间“{1}”中的开始元素“{0}”。找到 {2}。
zh_hant: 需自命名空間 '{1}' 的開始元素 '{0}'，但找到 {2}。

# XmlStartElementNameExpected
source: Start element '{0}' expected. Found {1}.
cs: Byl očekáván počáteční element {0}. Byl nalezen element {1}.
de: Es wurde das Startelement "{0}" erwartet. Gefunden wurde {1}.
es: Se esperaba el elemento de inicio "{0}". Se encontró {1}.
fr: Élément de début '{0}' attendu. Trouvé {1}.
it: È previsto l'elemento iniziale '{0}', ma è stato trovato {1}.
ja: 開始要素 '{0}' が必要です。見つかったのは {1} でした。
ko: 시작 요소 '{0}'이(가) 필요한데 {1}을(를) 찾았습니다.
pl: Oczekiwano elementu początkowego „{0}”. Znaleziono {1}.
pt_br: Espera-se o elemento inicial '{0}'. Encontrado {1}.
ru: Ожидался начальный элемент "{0}". Найден {1}.
tr: '{0}' başlangıç öğesi bekleniyordu. {1} bulundu.
zh_hans: 需要开始元素“{0}”。找到 {1}。
zh_hant: 需要開始元素 '{0}'，但找到 {1}。

# XmlTagMismatch
source: Start element '{0}' does not match end element '{1}'.
cs: Počáteční element {0} se neshoduje s koncovým elementem {1}.
de: Das Startelement "{0}" entspricht nicht dem Endelement "{1}".
es: El elemento de inicio "{0}" no coincide con el elemento final "{1}".
fr: L'élément de début '{0}' ne correspond pas à l'élément de fin '{1}'.
it: L'elemento iniziale '{0}' non corrisponde all'elemento finale '{1}'.
ja: 開始要素 '{0}' と終了要素 '{1}' が異なっています。
ko: 시작 요소 '{0}'이(가) 끝 요소 {1}과(와) 일치하지 않습니다.
pl: Element początkowy „{0}” jest niezgodny z elementem „{1}”.
pt_br: O elemento inicial '{0}' não corresponde ao elemento final '{1}'.
ru: Начальный элемент "{0}" не соответствует конечному элементу "{1}".
tr: '{0}' Start öğesi, '{1}' end öğesiyle eşleşmiyor.
zh_hans: 开始元素“{0}”与结束元素“{1}”不匹配。
zh_hant: 開始元素 '{0}' 與結束元素 '{1}' 不符。

# XmlTokenExpected
source: The token '{0}' was expected but found '{1}'.
cs: Byl očekáván token {0}, ale byl nalezen token {1}.
de: Es wurde das Token "{0}" erwartet, gefunden wurde jedoch "{1}".
es: Se esperaba el token "{0}", pero se encontró "{1}".
fr: Jeton '{0}' attendu, mais '{1}' a été trouvé.
it: È previsto il token '{0}', ma è stato trovato '{1}'.
ja: トークン '{0}' が予期されましたが、'{1}' が見つかりました。
ko: 토큰 '{0}'이(가) 필요한데 {1}을(를) 찾았습니다.
pl: Oczekiwano tokenu „{0}”, ale znaleziono „{1}”.
pt_br: Esperava-se o token '{0}', mas '{1}' foi encontrado.
ru: Ожидался маркер "{0}", но найден "{1}".
tr: '{0}' belirteci bekleniyordu, ancak '{1}' bulundu.
zh_hans: 需要令牌“{0}”，但找到“{1}”。
zh_hant: 需要權杖 '{0}'，但找到 '{1}'。

# XmlUndefinedPrefix
source: The prefix '{0}' is not defined.
cs: Předpona {0} není definována.
de: Das Präfix "{0}" ist nicht definiert.
es: El prefijo "{0}" no está definido.
fr: Le préfixe '{0}' n'est pas défini.
it: Il prefisso '{0}' non è definito.
ja: プレフィックス '{0}' が定義されていません。
ko: 접두사 '{0}'이(가) 정의되지 않았습니다.
pl: Nie zdefiniowano prefiksu „{0}”.
pt_br: O prefixo '{0}' não está definido.
ru: Префикс "{0}" не определен.
tr: '{0}' ön eki tanımlı değil.
zh_hans: 未定义前缀“{0}”。
zh_hant: 未定義前置詞 '{0}'。

# XmlUnexpectedEndElement
source: No matching start tag for end element.
cs: Neexistuje odpovídající počáteční značka pro koncový element.
de: Kein passendes Starttag für Endelement gefunden.
es: No hay ninguna etiqueta de inicio que coincida con el elemento final.
fr: Aucune balise de début correspondante pour l'élément de fin.
it: Non è presente alcun tag di inizio corrispondente per l'elemento finale.
ja: 開始タグと終了要素が一致しません。
ko: 끝 요소에 일치하는 시작 태그가 없습니다.
pl: Brak tagu start pasującego do elementu end.
pt_br: Nenhuma marca de início correspondente ao elemento final.
ru: Для конечного элемента нет соответствующего открывающего тега.
tr: Bitiş öğesi için başlangıç etiketi eşleşmesi yok.
zh_hans: 没有与结束元素匹配的开始标记。
zh_hant: 結束元素沒有相符的開始標記。

# XmlUnexpectedEndOfFile
source: Unexpected end of file. Following elements are not closed: {0}.
cs: Neočekávaný konec souboru. Následující elementy nejsou uzavřeny: {0}
de: Unerwartetes Dateiende. Folgende Elemente sind nicht geschlossen: {0}.
es: Fin de archivo no esperado. Los siguientes elementos no están cerrados: {0}.
fr: Fin de fichier inattendue. Les éléments suivants ne sont pas fermés : {0}.
it: Fine del file imprevista. Gli elementi seguenti non sono chiusi: {0}.
ja: 予期しない EOF エラーです。次の要素は閉じられていません: {0}。
ko: 예기치 않은 파일의 끝입니다. 다음 요소를 닫지 않았습니다. {0}.
pl: Nieoczekiwany koniec pliku. Następujące elementy nie zostały zamknięte: {0}.
pt_br: Fim de arquivo inesperado. Os elementos seguintes não estão fechados: {0}.
ru: Неожиданный конец файла. Следующие элементы не закрыты: {0}.
tr: Beklenmeyen dosya sonu. Aşağıdaki öğeler kapatılmadı: {0}.
zh_hans: 意外的文件结束。下列元素未关闭: {0}。
zh_hant: 檔案意外結束。下列元素尚未關閉: {0}。

# XmlWriterClosed
source: The XmlWriter is closed.
cs: Funkce XmlWriter je zavřena.
de: Der XmlWriter wurde geschlossen.
es: XmlWriter está cerrado.
fr: XmlWriter est fermé.
it: L'elemento XmlWriter è chiuso.
ja: XmlWriter は閉じられています。
ko: XmlWriter가 닫혀 있습니다.
pl: Element XmlWriter jest zamknięty.
pt_br: O XmlWriter está fechado.
ru: XmlWriter закрыт.
tr: XmlWriter kapalı.
zh_hans: XmlWriter 已关闭。
zh_hant: XmlWriter 已關閉。

# XmlWriterMustBeInElement
source: WriteState '{0}' not valid. Caller must write start element before serializing in contentOnly mode.
cs: Stav WriteState {0} není platný. Volající musí zapsat počáteční element před serializací v režimu contentOnly.
de: Ungültiger WriteState "{0}". Der Aufrufer muss das Startelement schreiben, bevor er mit der Serialisierung im contentOnly-Modus beginnt.
es: El valor de WriteState "{0}" no es válido. El autor de la llamada debe escribir el elemento de inicio antes de realizar la serialización en el modo contentOnly.
fr: WriteState '{0}' est non valide. L'appelant doit écrire l'élément de début avant de sérialiser en mode contentOnly.
it: L'elemento WriteState '{0}' non è valido. Il chiamante deve scrivere l'elemento iniziale prima della serializzazione in modalità contentOnly.
ja: WriteState '{0}' が無効です。呼び出し側は、contentOnly モードでシリアル化する前に開始要素を書き込む必要があります。
ko: WriteState '{0}'이(가) 잘못되었습니다. 호출자는 contentOnly 모드에서 직렬화하기 전에 시작 요소를 기록해야 합니다.
pl: Nieprawidłowy element WriteState „{0}”. Obiekt wywołujący musi zapisać element początkowy przed rozpoczęciem serializacji w trybie contentOnly.
pt_br: WriteState '{0}' inválido. O chamador deve gravar o elemento inicial antes de serializar no modo contentOnly.
ru: Недопустимое состояние WriteState "{0}". Вызывающая сторона должна записать начальный элемент перед началом сериализации в режиме contentOnly.
tr: WriteState '{0}' geçerli değil. Çağrıyı yapan, contentOnly modunda serileştirmeden önce başlangıç öğesini yazmalıdır.
zh_hans: WriteState“{0}”无效。调用方必须在序列化之前，以 contentOnly 模式写入开始元素。
zh_hant: WriteState '{0}' 無效。呼叫者必須先寫入開始元素，才能以 contentOnly 模式序列化。
