Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DcTypeNotResolvedOnDeserialize
source: Element '{2}:{3}' contains data from a type that maps to the name '{0}:{1}'. The deserializer has no knowledge of any type that maps to this name. Consider changing the implementation of the ResolveName method on your DataContractResolver to return a non-null value for name '{1}' and namespace '{0}'.
cs: Element {2}:{3} obsahuje data z typu, který je mapován na název {0}:{1}. Deserializátor nemá žádné informace o typu, který je mapován na tento název. Zvažte změnu implementace metody ResolveName vašeho objektu DataContractResolver tak, aby pro název {1} a obor názvů {0} nevracela hodnotu null.
de: Das Element "{2}:{3}" enthält Daten eines Typs, der dem Namen "{0}:{1}" zugeordnet ist. Dem Deserialisierungsmodul sind keine Typen bekannt, die diesem Namen zugeordnet sind. Ändern Sie ggf. die Implementierung der ResolveName-Methode für den DataContractResolver, sodass für den Namen "{1}" und den Namespace "{0}" ein Wert ungleich NULL zurückgegeben wird.
es: El elemento "{2}:{3}" contiene datos de un tipo que coincide con el nombre "{0}:{1}". El deserializador no tiene conocimiento de ningún tipo que esté asignado a este nombre. Intente cambiar la implementación del método ResolveName en DataContractResolver para que devuelva un valor que no sea nulo para el nombre "{1}" y el espacio de nombres "{0}".
fr: L'élément '{2}:{3}' contient des données dont le type est mappé au nom '{0}:{1}'. Le désérialiseur n'a connaissance d'aucun type mappé à ce nom. Changez l'implémentation de la méthode ResolveName dans DataContractResolver afin de retourner une valeur non null pour le nom '{1}' et l'espace de noms '{0}'.
it: L'elemento '{2}:{3}' contiene dati di un tipo di cui è stato eseguito il mapping al nome '{0}:{1}'. Il deserializzatore non può determinare alcun tipo con mapping a tale nome. Provare a modificare l'implementazione del metodo ResolveName in DataContractResolver in modo che restituisca un valore non Null per il nome '{1}' e lo spazio dei nomi '{0}'.
ja: 要素 '{2}:{3}' には、名前 '{0}:{1}' にマッピングされた型のデータが含まれています。デシリアライザーでは、この名前にマッピングされた型が不明です。DataContractResolver の ResolveName メソッドの実装を変更して、名前 '{1}' および名前空間 '{0}' に対して null 以外の値を返すようにしてください。
ko: 요소 '{2}:{3}'에 이름 '{0}:{1}'에 매핑되는 형식의 데이터가 있습니다. 역직렬 변환기가 이 이름에 매핑되는 형식을 알지 못합니다. DataContractResolver에서 ResolveName 메서드의 구현을 변경하여 이름 '{1}' 및 네임스페이스 '{0}'에 대해 null이 아닌 값을 반환해 보세요.
pl: Element „{2}:{3}” zawiera dane z typu, który jest mapowany na nazwę „{0}:{1}”. Deserializator nie zna żadnego typu, który jest mapowany na tę nazwę. Rozważ zmianę implementacji metody ResolveName obiektu DataContractResolver, aby dla nazwy „{1}” i przestrzeni nazw „{0}” była zwracana wartość inna niż null.
pt_br: O elemento '{2}:{3}' contém dados de um tipo que mapeia para o nome '{0}:{1}'. O desserializador não tem conhecimento de nenhum tipo que mapeia para esse nome. Considere alterar a implementação do método ResolveName no DataContractResolver para retornar um valor não nulo para o nome '{1}' e para o namespace '{0}'.
ru: Элемент "{2}:{3}" содержит данные типа, сопоставленного имени "{0}:{1}". Десериализатор не имеет данных о типе, которому сопоставляется это имя. Следует изменить реализацию метода ResolveName для DataContractResolver, чтобы для имени "{1}" и пространства имен "{0}" возвращалось значение, отличное от null.
tr: '{2}:{3}' öğesi '{0}:{1}' adıyla eşlenen bir türe ait veriler içeriyor. Seri durumdan çıkarıcı bu adla eşlenen herhangi bir tür hakkında bilgi sahibi değil. DataContractResolver'ınızdaki ResolveName metodunun uygulamasını, '{1}' adı ve '{0}' ad alanı için null olmayan bir değer döndürecek şekilde değiştirmeyi deneyin.
zh_hans: 元素“{2}:{3}”含有来自映射到名称“{0}:{1}”的类型的数据。反序列化程序无法识别任何映射到此名称的类型。请考虑更改 DataContractResolver 上 ResolveName 方法的实现，从而对于名称“{1}”和命名空间“{0}”返回非 null 值。
zh_hant: 元素 '{2}:{3}' 包含的資料之類型，對應到名稱 '{0}:{1}'。還原序列化程式不知道對應到此名稱的任何類型。請考慮變更 DataContractResolver 上 ResolveName 方法的實作，以傳回名稱 '{1}' 與命名空間 '{0}' 的非 null 值。

# DefaultOnElementNotSupported
source: Default value on element '{0}' is not supported.
cs: Výchozí hodnota u elementu {0} není podporována.
de: Der Standardwert des Elements "{0}" wird nicht unterstützt.
es: No se admite el valor predeterminado del elemento "{0}".
fr: La valeur par défaut sur l'élément '{0}' n'est pas prise en charge.
it: Il valore predefinito nell'elemento '{0}' non è supportato.
ja: 要素 '{0}' の既定値はサポートされていません。
ko: 요소 '{0}'의 기본값이 지원되지 않습니다.
pl: Wartość domyślna elementu „{0}” nie jest obsługiwana.
pt_br: Não há suporte para o valor padrão no elemento '{0}'.
ru: Значение по умолчанию элемента "{0}" не поддерживается.
tr: '{0}' öğesinde varsayılan değer desteklenmiyor.
zh_hans: 不支持元素“{0}”上的默认值。
zh_hant: 不支援元素 '{0}' 上的預設值。

# DerivedTypeNotISerializable
source: It is not ISerializable but its base type '{0}' in namespace '{1}' is ISerializable.
cs: Není typem ISerializable, ale jeho základní typ {0} v oboru názvů {1} je ISerializable.
de: Er ist nicht ISerializable, der zugehörige Basistyp "{0}" im Namespace "{1}" ist jedoch ISerializable.
es: No es ISerializable, pero su tipo base "{0}", del espacio de nombres "{1}", sí es ISerializable.
fr: Il n'est pas ISerializable mais son type de base '{0}' dans l'espace de noms '{1}' est ISerializable.
it: Non è ISerializable, ma il relativo tipo di base '{0}' dello spazio dei nomi '{1}' è ISerializable.
ja: これは ISerializable ではなく、名前空間 '{1}' のその基本データ型 '{0}' が ISerializable です。
ko: ISerializable이 아니지만 네임스페이스 '{1}'의 해당 기본 형식 '{0}'이(가) ISerializable입니다.
pl: Nie jest to typ ISerializable, ale jego typ podstawowy „{0}” w przestrzeni nazw „{1}” jest typem ISerializable.
pt_br: Isto não é ISerializable, mas seu tipo base '{0}' no namespace '{1}' é ISerializable.
ru: Это не ISerializable, но его базовый тип "{0}" в пространстве имен "{1}" — ISerializable.
tr: ISerializable değil, ancak '{1}' ad alanındaki '{0}' temel türü ISerializable özellikte.
zh_hans: 它并非为 ISerializable，而是其位于命名空间“{1}”中的基类型“{0}”为 ISerializable。
zh_hant: 它不是 ISerializable，但它在命名空間 '{1}' 中的基底類型 '{0}' 是 ISerializable。

# DeserializedObjectWithIdNotFound
source: Deserialized object with reference id '{0}' not found in stream.
cs: Deserializovaný objekt s identifikátorem odkazu {0} nebyl ve streamu nalezen.
de: Es wurde kein deserialisiertes Objekt mit der Verweis-ID "{0}" im Datenstrom gefunden.
es: El objeto deserializado con el id. de referencia "{0}" no se encuentra en la secuencia.
fr: L'objet désérialisé avec l'ID de référence '{0}' est introuvable dans le flux.
it: L'oggetto deserializzato con ID di riferimento '{0}' non è stato trovato nel flusso.
ja: 参照 ID '{0}' を持つシリアルを解除されたオブジェクトがストリーム内に見つかりません。
ko: 참조 ID가 스트림에서 '{0}'인 deserialize된 개체를 찾을 수 없습니다.
pl: W strumieniu nie znaleziono obiektu po deserializacji z identyfikatorem odwołania „{0}”.
pt_br: Objeto desserializado com ID de referência '{0}' não encontrado no fluxo.
ru: Десериализованный объект с идентификатором ссылки "{0}" в потоке не найден.
tr: Seri durumdan çıkarılan '{0}' başvuru kimlikli nesne, akışta bulunmadı.
zh_hans: 没有在流中找到引用 ID 为“{0}”的反序列化对象。
zh_hant: 在資料流中找不到參考識別碼為 '{0}' 的已還原序列化物件。

# DupContractInDataContractSet
source: DataContract with name '{0}' and namespace '{1}' cannot be added to DataContractSet since another contract with the same data contract name is already present and the contracts are not equivalent.
cs: Kontrakt DataContract s názvem {0} a oborem názvů {1} nelze přidat do sady DataContractSet, protože již existuje jiný kontrakt se stejným názvem kontraktu dat a kontrakty nejsou rovnocenné.
de: Der DataContract mit dem Namen "{0}" und dem Namespace "{1}" kann dem DataContractSet nicht hinzugefügt werden, da ein anderer Vertrag mit demselben Namen bereits vorhanden ist und die Verträge einander nicht entsprechen.
es: El elemento DataContract con el nombre "{0}" y el espacio de nombres "{1}" no se puede agregar a DataContractSet, puesto que en este ya hay otro contrato de datos con el mismo nombre y ambos no son equivalentes.
fr: Impossible d'ajouter le DataContract comportant le nom '{0}' et l'espace de noms '{1}' à DataContractSet, car un autre contrat portant le même nom de contrat de données est déjà présent et les contrats ne sont pas équivalents.
it: Non è possibile aggiungere l'elemento DataContract denominato '{0}' con lo spazio dei nomi '{1}' all'elemento DataContractSet perché esiste già un altro contratto con lo stesso nome di contratto di dati e i contratti non sono equivalenti.
ja: 名前 '{0}' と名前空間 '{1}' の DataContract と同じデータ コントラクト名を持つ別のコントラクトが既に存在し、追加対象のコントラクトと等しくないため、このコントラクトを DataContractSet に追加できません。
ko: 같은 데이터 계약 이름을 가진 다른 계약이 이미 있고 계약이 서로 동일하지 않기 때문에 이름 '{0}' 및 네임스페이스 '{1}'을(를) 가진 DataContract를 DataContractSet에 추가할 수 없습니다.
pl: Do elementu DataContractSet nie można dodać elementu DataContract o nazwie „{0}” i przestrzeni nazw „{1}”, ponieważ istnieje inny kontrakt danych o tej samej nazwie i kontrakty te nie są równoważne.
pt_br: O DataContract com nome '{0}' e namespace '{1}' não pode ser adicionado ao DataContractSet porque outro contrato com o mesmo nome de contrato de dados já está presente e os contratos não são equivalentes.
ru: Невозможно добавить DataContract с именем "{0}" и пространством имен "{1}" к DataContractSet, так как уже имеется другой контракт с тем же именем контракта данных и эти контракты не эквивалентны.
tr: Aynı veri anlaşması adına sahip başka bir anlaşma zaten bulunduğundan ve anlaşmalar eşdeğer olmadığından '{0}' adına ve '{1}' ad alanına sahip DataContract, DataContractSet içine eklenemiyor.
zh_hans: 名称为“{0}”、命名空间为“{1}”的 DataContract 无法添加到 DataContractSet，因为已经存在另一个与其具有相同数据协定名称的协定并且这些协定并不是等效的。
zh_hant: 名稱為 '{0}' 且命名空間為 '{1}' 的 DataContract，無法新增到 DataContractSet，因為已有同名的資料合約名稱存在，且合約並不相等。

# DupContractInKnownTypes
source: Type '{0}' cannot be added to list of known types since another type '{1}' with the same data contract name '{2}:{3}' is already present. If there are different collections of a particular type - for example, List<Test> and Test[], they cannot both be added as known types. Consider specifying only one of these types for addition to the known types list.
cs: Typ {0} nelze přidat do seznamu známých typů, protože již existuje jiný typ {1} se stejným názvem kontraktu dat {2}:{3}. Pokud existují různé kolekce konkrétního typu (například List<Test> a Test[]), nelze je obě přidat jako známé typy. Zvažte, zda by pro přidání do seznamu známých typů nestačilo určit pouze jeden typ.
de: Der Typ "{0}" kann der Liste bekannter Typen nicht hinzugefügt werden, da bereits ein anderer Typ "{1}" mit demselben Datenvertragsnamen "{2}:{3}" vorhanden ist. Wenn verschiedene Sammlungen eines bestimmten Typs vorhanden sind, z. B. List<Test> und Test[], können nicht beide als bekannte Typen hinzugefügt werden. Fügen Sie ggf. nur einen dieser Typen der Liste der bekannten Typen hinzu.
es: El tipo "{0}" no se puede agregar a la lista de tipos conocidos, puesto que ya hay en ella otro tipo, "{1}", con el mismo nombre de contrato de datos, "{2}:{3}". Si hay colecciones distintas de un determinado tipo (por ejemplo, List<Test> y Test[]), no se pueden agregar ambas colecciones como tipos conocidos. Especifique solamente uno de estos tipos para su inclusión en la lista de tipos conocidos.
fr: Impossible d'ajouter le type '{0}' à la liste des types connus, car un autre type '{1}' avec le même nom de contrat de données '{2}:{3}' est déjà présent. S'il existe différentes collections d'un type particulier, par exemple List<Test> et Test[], il est impossible de les ajouter en tant que types connus. Spécifiez uniquement l'un de ces types pour l'ajouter à la liste des types connus.
it: Non è possibile aggiungere il tipo '{0}' all'elenco dei tipi noti perché esiste già un altro tipo '{1}' con lo stesso nome di contratto di dati '{2}:{3}'. Se sono disponibili raccolte diverse di un determinato tipo, ad esempio List<Test> e Test[], non è possibile aggiungere entrambe come tipi noti. Provare a specificare solo uno di questi tipi per l'aggiunta all'elenco dei tipi noti.
ja: 同じデータ コントラクト名 '{2}:{3}' を持つ別の型 '{1}' が既に存在するため、型 '{0}' を既知の型の一覧に追加できません。特定の型の異なるコレクション (List<Test> と Test[] など) がある場合は、両方を既知の型として追加することはできません。一方の型だけを既知の型の一覧に追加してください。
ko: 같은 데이터 계약 이름 '{2}:{3}'을(를) 가진 다른 형식 '{1}'이(가) 이미 있기 때문에 '{0}' 형식을 알려진 형식 목록에 추가할 수 없습니다. List<Test> 및 Test[] 같이 특정 형식의 서로 다른 컬렉션이 있는 경우 하나만 알려진 형식으로 추가할 수 있습니다. 이러한 형식 중 하나만 알려진 형식 목록에 추가하도록 지정해 보세요.
pl: Nie można dodać typu {0} do listy znanych typów, ponieważ istnieje inny typ {1} o takiej samej nazwie kontraktu danych „{2}:{3}”. Jeśli istnieją różne kolekcje określonego typu, na przykład List<Test> i Test[], nie można ich obu dodać jako znanych typów. Rozważ dodanie tylko jednego z tych typów do listy znanych typów.
pt_br: O tipo '{0}' não pode ser adicionado à lista de tipos conhecidos porque outro tipo '{1}' com o mesmo nome do contrato de dados '{2}:{3}' já está presente. Se houver diferentes coleções de um tipo específico – por exemplo, List<Test> e Test[], elas não poderão ser adicionadas como tipos conhecidos. Considere especificar apenas um desses tipos para adicionar à lista de tipos conhecidos.
ru: Невозможно добавить тип "{0}" в список известных типов, так как уже имеется тип "{1}" с тем же именем контракта данных "{2}:{3}". Если существуют разные коллекции конкретного типа, например List<Test> и Test[], их нельзя одновременно добавить в список в качестве известных типов. Выберите только одну из этих коллекций для добавления в список.
tr: Aynı '{2}:{3}' veri anlaşması adına sahip olan başka bir '{1}' türü zaten bulunduğundan, '{0}' türü bilinen türler listesine eklenemiyor. Belirli bir türde farklı koleksiyonlar varsa (örneğin Liste<Test> ve Test[]), bunların ikisi birden bilinen tür olarak eklenemez. Bilinen türler listesine eklenmek üzere bu türlerden yalnızca birini belirtmeyi deneyin.
zh_hans: 无法将类型“{0}”添加到已知类型的列表，因为已有另一个类型“{1}”，其数据协定名称也为“{2}:{3}”。如果特定类型有不同的集合(例如 List<Test> 和 Test[])，则无法将这些集合都添加为已知类型。请考虑仅指定其中一种类型添加到已知类型列表。
zh_hant: 無法將類型 '{0}' 新增到已知類型清單，因為另一個類型 '{1}' 已經有相同的資料合約名稱 '{2}:{3}'。如果特定類型有不同集合 (例如 List<Test> 與 Test[])，它們無法同時新增為已知類型。請考慮只指定這其中一種類型，來新增到已知類型清單。

# DupEnumMemberValue
source: Type '{2}' contains two members '{0}' 'and '{1}' with the same name '{3}'. Multiple members with the same name in one type are not supported. Consider changing one of the member names using EnumMemberAttribute attribute.
cs: Typ {2} obsahuje dva členy {0} a {1} se stejným názvem {3}. Více členů se stejným názvem v jednom typu není podporováno. Můžete změnit jeden z názvů členů pomocí atributu EnumMemberAttribute.
de: Der Typ "{2}" enthält zwei Member "{0}" und "{1}" mit demselben Namen "{3}". Mehrere Member mit demselben Namen in einem Typ werden nicht unterstützt. Ändern Sie ggf. einen der Membernamen mithilfe des Attributs EnumMemberAttribute.
es: El tipo "{2}" contiene dos miembros, "{0}" y "{1}", con el mismo nombre: "{3}". No se admite la presencia de varios miembros con el mismo nombre en un tipo. Se recomienda cambiar uno de los nombres de miembro mediante el atributo EnumMemberAttribute.
fr: Le type '{2}' contient deux membres '{0}' et '{1}' avec le même nom '{3}'. Plusieurs membres portant le même nom dans un type ne sont pas pris en charge. Changez l'un des noms de ces membres via l'attribut EnumMemberAttribute.
it: Il tipo '{2}' contiene due membri '{0}' e '{1}' con lo stesso nome '{3}'. L'uso di più membri con lo stesso nome in un solo tipo non è supportato. Provare a modificare il nome di uno dei membri usando l'attributo EnumMemberAttribute.
ja: 型 '{2}' には、同じ名前 '{3}' を持つ 2 つのメンバー '{0}' と '{1}' が含まれています。1 つの型に同じ名前の複数のメンバーを含めることはできません。EnumMemberAttribute 属性を使用してどちらかのメンバー名を変更してください。
ko: 형식 '{2}'에 같은 이름 '{3}'을(를) 가진 두 개의 '{0}' 및 '{1}' 멤버가 있습니다. 하나의 형식에서 같은 이름을 가진 여러 멤버는 지원되지 않습니다. EnumMemberAttribute 특성을 사용하여 멤버 이름 중 하나를 변경해 보세요.
pl: Typ „{2}” zawiera dwie składowe „{0}” i „{1}” o takiej samej nazwie „{3}”. Sytuacja z wieloma składowymi o takiej samej nazwie w obrębie jednego typu nie jest obsługiwana. Zmień nazwę jednej składowej za pomocą atrybutu EnumMemberAttribute.
pt_br: O tipo '{2}' contém dois membros '{0}' e '{1}' com o mesmo nome '{3}'. Não há suporte para vários membros com o mesmo nome em um tipo. Considere alterar um dos nomes de membro usando o atributo EnumMemberAttribute.
ru: Тип "{2}" содержит два члена "{0}" и "{1}" с одним и тем же именем "{3}". Несколько членов с одинаковыми именами не поддерживаются. Измените имя одного из членов с помощью атрибута EnumMemberAttribute.
tr: '{2}' türü, aynı '{3}' adını taşıyan '{0}' ve '{1}' üyelerini içeriyor. Bir türde aynı ada sahip birden fazla üye olması desteklenmez. EnumMemberAttribute özniteliğini kullanarak üye adlarından birini değiştirmeyi deneyin.
zh_hans: 类型“{2}”含有两个名称均为“{3}”的成员“{0}”和“{1}”。不支持多个属于一个类型并具有相同名称的成员。请考虑使用 EnumMemberAttribute 特性更改其中一个成员的名称。
zh_hant: 類型 '{2}' 包含兩個成員 '{0}' 及 '{1}' 均具有相同的名稱 '{3}'。不支援一個類型中有多個同名的成員。請考慮使用 EnumMemberAttribute 屬性來變更其中一個成員名稱。

# DupKeyValueName
source: The collection data contract type '{0}' specifies the same value '{1}' for both the KeyName and the ValueName properties. This is not allowed. Consider changing either the KeyName or the ValueName property.
cs: Typ kontraktu dat kolekce {0} udává stejnou hodnotu {1} pro vlastnosti KeyName a ValueName. To není povoleno. Změňte vlastnost KeyName nebo ValueName.
de: Der Sammlungsdatenvertragstyp "{0}" gibt denselben Wert "{1}" für die Eigenschaften KeyName und ValueName an. Dies ist nicht zulässig. Ändern Sie ggf. die Eigenschaft KeyName oder ValueName.
es: El tipo de contrato de datos "{0}" especifica el mismo valor, "{1}", para las propiedades KeyName y ValueName, lo cual no está permitido. Pruebe a cambiar la propiedad KeyName o la propiedad ValueName.
fr: Le type de contrat de données de collection '{0}' spécifie la même valeur '{1}' pour les propriétés KeyName et ValueName. Ceci n'est pas autorisé. Changez l'une des deux propriétés, KeyName ou ValueName.
it: Nel tipo di contratto di dati '{0}' della raccolta viene specificato lo stesso valore '{1}' per entrambe le proprietà KeyName e ValueName. Questa impostazione non è consentita. Provare a modificare la proprietà KeyName o ValueName.
ja: コレクション データ コントラクト型 '{0}' では、KeyName と ValueName の両方のプロパティに同じ値 '{1}' が指定されていますが、これは許可されていません。KeyName または ValueName プロパティのどちらかを変更してください。
ko: 컬렉션 데이터 계약 형식 '{0}'에서 KeyName 및 ValueName 속성에 대해 동일한 값 '{1}'을(를) 지정합니다. 이것은 허용되지 않습니다. KeyName 또는 ValueName 속성을 변경해 보세요.
pl: W typie kontraktu danych kolekcji „{0}” nadana została ta sama wartość „{1}” dla właściwości KeyName oraz ValueName. Nie jest to dozwolone. Zmień właściwość KeyName lub ValueName.
pt_br: O tipo de contrato de dados da coleção '{0}' especifica o mesmo valor '{1}' para as propriedades KeyName e ValueName. Isso não é permitido. Considere alterar a propriedade KeyName ou a propriedade ValueName.
ru: В типе контракта данных коллекции "{0}" указано одно и то же значение "{1}" для свойств KeyName и ValueName, что недопустимо. Измените одно из свойств KeyName или ValueName.
tr: '{0}' koleksiyon veri anlaşması türü KeyName ve ValueName Özellikleri için aynı '{1}' değerini belirtiyor. Buna izin verilmez. KeyName veya ValueName özelliğini değiştirmeyi deneyin.
zh_hans: 集合数据协定类型“{0}”为 KeyName 和 ValueName 属性指定了相同的值“{1}”。这是不允许的。请考虑更改 KeyName 或 ValueName 属性。
zh_hant: 集合資料合約類型 '{0}' 對 KeyName 及 ValueName 屬性指定相同的值 '{1}'，但不允許此情況。請考慮變更 KeyName 或 ValueName 屬性。

# DupMemberName
source: Type '{2}' contains two members '{0}' 'and '{1}' with the same data member name '{3}'. Multiple members with the same name in one type are not supported. Consider changing one of the member names using DataMemberAttribute attribute.
cs: Typ {2} obsahuje dva členy {0} a {1} se stejným názvem datového členu {3}. Více členů se stejným názvem v jednom typu není podporováno. Změňte jeden z názvů členů pomocí atributu DataMemberAttribute.
de: Der Typ "{2}" enthält zwei Member "{0}" und "{1}" mit demselben Datenmembernamen "{3}". Mehrere Member mit demselben Namen in einem Typ werden nicht unterstützt. Ändern Sie ggf. einen der Membernamen mithilfe des Attributs DataMemberAttribute.
es: El tipo "{2}" contiene dos miembros, "{0}" y "{1}", con el mismo nombre de miembro de datos: "{3}". No se admite la presencia de varios miembros con el mismo nombre en un tipo. Se recomienda cambiar uno de los nombres de miembro mediante el atributo DataMemberAttribute.
fr: Le type '{2}' contient deux membres '{0}' et '{1}' avec le même nom de membre de données '{3}'. Plusieurs membres portant le même nom dans un type ne sont pas pris en charge. Changez l'un des noms de ces membres via l'attribut DataMemberAttribute.
it: Il tipo '{2}' contiene due membri '{0}' e '{1}' con lo stesso nome di membro dati '{3}'. L'uso di più membri con lo stesso nome in un solo tipo non è supportato. Provare a modificare il nome di uno dei membri usando l'attributo DataMemberAttribute.
ja: 型 '{2}' には、同じデータ メンバー名 '{3}' を持つ 2 つのメンバー '{0}' と '{1}' が含まれています。1 つの型に同じ名前の複数のメンバーを含めることはできません。DataMemberAttribute 属性を使用してどちらかのメンバー名を変更してください。
ko: 형식 '{2}'에 같은 데이터 멤버 이름 '{3}'을(를) 가진 두 개의 '{0}' 및 '{1}' 멤버가 있습니다. 하나의 형식에서 같은 이름을 가진 여러 멤버는 지원되지 않습니다. DataMemberAttribute 특성을 사용하여 멤버 이름 중 하나를 변경해 보세요.
pl: Typ „{2}” zawiera dwie składowe „{0}” i „{1}” o tej samej nazwie składowych danych „{3}”. Sytuacja z wieloma składowymi o tej samej nazwie w jednym typie nie jest obsługiwana. Zmień nazwę jednej składowej za pomocą atrybutu DataMemberAttribute.
pt_br: O tipo '{2}' contém dois membros '{0}' e '{1}' com o mesmo nome de membro de dados '{3}'. Não há suporte para vários membros com o mesmo nome em um tipo. Considere alterar um dos nomes de membro usando o atributo DataMemberAttribute.
ru: Тип "{2}" содержит два члена "{0}" и "{1}" с одним и тем же именем члена данных "{3}". Несколько членов с одинаковыми именами в одном типе не поддерживаются. Измените имя одного из членов с помощью атрибута DataMemberAttribute.
tr: '{2}' türü, '{3}' aynı veri üye adına sahip '{0}' ve '{1}' adlı iki üye bulunduruyor. Bir türde aynı ada sahip birden fazla üye olması desteklenmez. DataMemberAttribute özniteliğini kullanarak üye adlarından birini değiştirmeyi deneyin.
zh_hans: 类型“{2}”含有两个数据成员名称均为“{3}”的成员“{0}”和“{1}”。不支持多个属于一个类型并具有相同名称的成员。请考虑使用 DataMemberAttribute 特性更改其中一个成员的名称。
zh_hant: 類型 '{2}' 包含兩個成員 '{0}' 及 '{1}' 均具有相同的資料成員名稱 '{3}'。不支援一個類型中有多個同名的成員。請考慮使用 DataMemberAttribute 屬性來變更其中一個成員名稱。
