Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AbstractElementNotSupported
source: The element cannot have 'abstract' set to 'true'.
cs: Element nemůže mít vlastnost abstract nastavenou na hodnotu true.
de: Für das Element darf "abstract" nicht auf "true" gesetzt sein.
es: El elemento no puede tener el valor de "abstract" establecido en "true".
fr: La valeur de 'abstract' ne peut pas être 'true' pour l'élément.
it: 'abstract' non può essere impostato su 'true' in questo elemento.
ja: この要素では、'abstract' を 'true' に設定できません。
ko: 요소에서 'abstract'를 'true'로 설정할 수 없습니다.
pl: Atrybut „abstract” elementu nie może mieć nadanej wartości „true”.
pt_br: O elemento não pode ter 'abstract' definido como 'true'.
ru: Абстракция элемента не поддерживается.
tr: Öğede 'abstract' değeri 'true' olarak belirlenemez.
zh_hans: 该元素不能将 "abstract" 设置为 "true"。
zh_hant: 此元素的 'abstract' 不可設為 'true'。

# AbstractTypeNotSupported
source: The type cannot have 'abstract' set to 'true'.
cs: Typ nemůže mít vlastnost abstract nastavenou na hodnotu true.
de: Für den Typ darf "abstract" nicht auf "true" gesetzt sein.
es: El tipo no puede tener el valor de "abstract" establecido en "true".
fr: La valeur de 'abstract' ne peut pas être 'true' pour le type.
it: 'abstract' non può essere impostato su 'true' in questo tipo.
ja: この型では、'abstract' を 'true' に設定できません。
ko: 형식에서 'abstract'를 'true'로 설정할 수 없습니다.
pl: Atrybut „abstract” typu nie może mieć nadanej wartości „true”.
pt_br: O tipo não pode ter 'abstract' definido como 'true'.
ru: Абстракция типа не поддерживается.
tr: Türde 'abstract' değeri 'true' olarak belirlenemez.
zh_hans: 该类型不能将 "abstract" 设置为 "true"。
zh_hant: 此類型的 'abstract' 不可設為 'true'。

# AmbiguousReferencedCollectionTypes1
source: List of referenced collection types contains more than one type with same data contract name. Include only one of the following types. Only matching types can be valid references: {0}
cs: Seznam odkazovaných typů kolekce obsahuje více než jeden typ se stejným názvem kontraktu dat. Zařaďte pouze jeden z následujících typů. Platnými odkazy mohou být pouze shodné typy: {0}
de: Die Liste der referenzierten Sammlungstypen enthält mehrere Typen mit demselben Datenvertragsnamen. Nehmen Sie nur einen der folgenden Typen in die Liste auf. Nur übereinstimmende Typen können gültige Verweise sein: {0}.
es: La lista de tipos de colección a los que se hace referencia contiene más de un tipo con el mismo nombre de contrato de datos. Incluya solo uno de los siguientes tipos. Solo los tipos coincidentes pueden ser referencias válidas: {0}
fr: La liste des types de collection référencés contient plusieurs types avec le même nom de contrat de données. Incluez uniquement un seul des types suivants. Seuls les types concordants peuvent être des références valides : {0}
it: L'elenco dei tipi di raccolta di riferimento contiene più tipi con lo stesso nome di contratto di dati. Includere solo uno dei tipi seguenti. Solo i tipi corrispondenti possono essere riferimenti validi: {0}
ja: 参照されたコレクション型のリストは、同じデータ コントラクト名を持つ複数の型を含んでいます。次の型の 1 つのみを含めてください。一致する型のみが有効な参照になります。{0}
ko: 참조된 컬렉션 형식 목록에 동일한 데이터 계약 이름을 가진 둘 이상의 형식이 있습니다. 다음 형식 중 하나만 포함하세요. 일치하는 형식만 유효한 참조가 될 수 있습니다. {0}
pl: Lista wskazanych typów kolekcji zawiera co najmniej dwa typy o takiej samej nazwie kontraktu danych. Uwzględnij tylko jeden z następujących typów. Można odwoływać się tylko do pasujących typów: {0}
pt_br: A lista de tipos de coleção referenciados contém mais de um tipo com o mesmo nome de contrato de dados. Inclua apenas um dos tipos a seguir. Apenas tipos correspondentes podem ser referências válidas: {0}
ru: Список ссылочных типов коллекций содержит несколько типов с одинаковым именем контракта данных. Включите только один из следующих типов. Только согласованные типы могут быть правильными ссылками: {0}
tr: Başvuru yapılan koleksiyon türlerinin listesinde, aynı veri anlaşması adına sahip birden fazla tür var. Aşağıdaki türlerden yalnızca birini ekleyin. Yalnızca eşleşen türler geçerli başvuru olabilir: {0}
zh_hans: 引用的集合类型的列表含有多个具有相同数据协定名称的类型。仅包括以下类型之一。只有匹配的类型才可以为有效引用: {0}
zh_hant: 參考集合類型的清單包含一個上的類型有相同的資料合約名稱。請只包含下列其中一個類型。只有相符的類型才是有效的參考: {0}

# AmbiguousReferencedCollectionTypes3
source: List of referenced collection types contains more than one type with data contract name '{0}' in namespace '{1}'. Include only one of the following types. Only matching types can be valid references: {2}
cs: Seznam odkazovaných typů kolekce obsahuje více než jeden typ s názvem kontraktu dat {0} v oboru názvů {1}. Zařaďte pouze jeden z následujících typů. Platnými odkazy mohou být pouze shodné typy: {2}
de: Die Liste der referenzierten Sammlungstypen enthält mehrere Typen mit dem Datenvertragsnamen "{0}" im Namespace "{1}". Nehmen Sie nur einen der folgenden Typen in die Liste auf. Nur übereinstimmende Typen können gültige Verweise sein: {2}.
es: La lista de tipos de colección a los que se hace referencia contiene más de un tipo con el nombre de contrato de datos "{0}" en el espacio de nombres "{1}". Incluya solo uno de los siguientes tipos. Solo los tipos coincidentes pueden ser referencias válidas: {2}
fr: La liste des types de collection référencés contient plusieurs types comportant le nom de contrat de données '{0}' dans l'espace de noms '{1}'. Incluez uniquement un seul des types suivants. Seuls les types concordants peuvent être des références valides : {2}
it: L'elenco dei tipi di raccolta di riferimento contiene più di un tipo con il nome di contratto di dati '{0}' nello spazio dei nomi '{1}'. Includere solo uno dei tipi seguenti. Solo i tipi corrispondenti possono essere riferimenti validi: {2}
ja: 参照されたコレクション型のリストは、名前空間 '{1}' でのデータ コントラクト名 '{0}' を持つ複数の型を含んでいます。次の型の 1 つのみを含めてください。一致する型のみが有効な参照になります。{2}
ko: 참조된 컬렉션 형식 목록에 네임스페이스 '{1}'의 데이터 계약 이름 '{0}'을(를) 가진 둘 이상의 형식이 있습니다. 다음 형식 중 하나만 포함하세요. 일치하는 형식만 유효한 참조가 될 수 있습니다. {2}
pl: Lista wskazanych typów kolekcji zawiera co najmniej dwa typy o takiej samej nazwie kontraktu danych „{0}” w przestrzeni nazw „{1}”. Uwzględnij tylko jeden z następujących typów. Można odwoływać się tylko do pasujących typów: {2}
pt_br: A lista de tipos de coleção referenciados contém mais de um tipo com o nome de contrato de dados '{0}' no namespace '{1}'. Inclua apenas um dos tipos a seguir. Apenas tipos correspondentes podem ser referências válidas: {2}
ru: Список ссылочных типов коллекций содержит несколько типов с одинаковым именем контракта данных "{0}" в пространстве имен "{1}". Включите только один из следующих типов. Только согласованные типы могут быть правильными ссылками: {2}
tr: Başvuru yapılan koleksiyon türlerinin listesinde, '{1}' ad alanında aynı '{0}' veri anlaşması adına sahip birden fazla tür var. Aşağıdaki türlerden yalnızca birini ekleyin. Yalnızca eşleşen türler geçerli başvuru olabilir: {2}
zh_hans: 引用的集合类型的列表含有多个数据协定名称“{0}”位于命名空间“{1}”中的类型。仅包括以下类型之一。只有匹配的类型才可以为有效引用: {2}
zh_hant: 參考集合類型的清單包含一個以上的類型，在命名空間 '{1}' 中的資料合約名稱為 '{0}'。請只包含下列其中一個類型。只有相符的類型才是有效的參考: {2}

# AmbiguousReferencedTypes1
source: List of referenced types contains more than one type with same data contract name. Need to exclude all but one of the following types. Only matching types can be valid references: {0}
cs: Seznam odkazovaných typů obsahuje více než jeden typ se stejným názvem kontraktu dat. Je nutné vyloučit všechny následující typy kromě jednoho. Platnými odkazy mohou být pouze shodné typy: {0}
de: Die Liste der referenzierten Auflistungstypen enthält mehrere Typen mit demselben Datenvertragsnamen. Sie müssen bis auf einen alle der folgenden Typen ausschließen. Nur übereinstimmende Typen können gültige Verweise sein: {0}.
es: La lista de tipos a los que se hace referencia contiene más de un tipo con el mismo nombre de contrato de datos. Es necesario excluir todos los tipos siguientes menos uno. Solo los tipos coincidentes pueden ser referencias válidas: {0}
fr: La liste des types référencés contient plusieurs types avec le même nom de contrat de données. Les types suivants, à l'exception de l'un d'entre eux, doivent être exclus. Seuls les types concordants peuvent être des références valides : {0}
it: L'elenco dei tipi di raccolta di riferimento contiene più tipi con lo stesso nome di contratto di dati. Escludere tutti i tipi seguenti tranne uno. Solo i tipi corrispondenti possono essere riferimenti validi: {0}
ja: 参照された型のリストは、同じデータ コントラクト名を持つ複数の型を含んでいます。次の型の 1 つを除き、すべて除外する必要があります。一致する型のみが有効な参照になります。{0}
ko: 참조된 형식 목록에 동일한 데이터 계약 이름을 가진 둘 이상의 형식이 있습니다. 다음 형식 중 하나를 제외한 모든 형식을 제외해야 합니다. 일치하는 형식만 유효한 참조가 될 수 있습니다. {0}
pl: Lista wskazanych typów kolekcji zawiera co najmniej dwa typy o takiej samej nazwie kontraktu danych. Z następujących typów należy wykluczyć wszystkie typy oprócz jednego. Można odwoływać się tylko do pasujących typów: {0}
pt_br: A lista de tipos referenciados contém mais de um tipo com o mesmo nome de contrato de dados. É necessário excluir todos, exceto um dos tipos a seguir. Apenas tipos correspondentes podem ser referências válidas: {0}
ru: Список ссылочных типов коллекций содержит несколько типов с одинаковым именем контракта данных. Необходимо исключить все следующие типы, кроме одного. Только соответствующие типы могут быть правильными ссылками: {0}
tr: Başvuru yapılan türlerin listesinde, aynı veri anlaşması adına sahip birden fazla tür var. Aşağıdaki türlerden biri dışında tümü çıkarılmalıdır. Yalnızca eşleşen türler geçerli başvuru olabilir: {0}
zh_hans: 引用的类型的列表含有多个具有相同数据协定名称的类型。需要排除以下类型之一外的所有类型。只有匹配的类型才可以为有效引用: {0}
zh_hant: 參考類型的清單包含一個上的類型有相同的資料合約名稱。除下列其中一個類型以外，需要排除所有類型。只有相符的類型才是有效的參考: {0}

# AmbiguousReferencedTypes3
source: List of referenced types contains more than one type with data contract name '{0}' in namespace '{1}'. Need to exclude all but one of the following types. Only matching types can be valid references: {2}
cs: Seznam odkazovaných typů obsahuje více než jeden typ s názvem kontraktu dat {0} v oboru názvů {1}. Je nutné vyloučit všechny následující typy kromě jednoho. Platnými odkazy mohou být pouze shodné typy: {2}
de: Die Liste der referenzierten Auflistungstypen enthält mehrere Typen mit dem Datenvertragsnamen "{0}" im Namespace "{1}". Sie müssen bis auf einen alle der folgenden Typen ausschließen. Nur übereinstimmende Typen können gültige Verweise sein: {2}.
es: La lista de tipos a los que se hace referencia contiene más de un tipo con el nombre de contrato de datos "{0}" en el espacio de nombres "{1}". Es necesario excluir todos los tipos siguientes menos uno. Solo los tipos coincidentes pueden ser referencias válidas: {2}
fr: La liste des types référencés contient plusieurs types comportant le nom de contrat de données '{0}' dans l'espace de noms '{1}'. Les types suivants, à l'exception de l'un d'entre eux, doivent être exclus. Seuls les types concordants peuvent être des références valides : {2}
it: L'elenco dei tipi di raccolta di riferimento contiene più di un tipo con il nome di contratto di dati '{0}' nello spazio dei nomi '{1}'. Escludere tutti i tipi seguenti tranne uno. Solo i tipi corrispondenti possono essere riferimenti validi: {2}
ja: 参照された型のリストは、名前空間 '{1}' でデータ コントラクト名 '{0}' を持つ複数の型を含んでいます。次の型の 1 つを除き、すべて除外する必要があります。一致する型のみが有効な参照になります。{2}
ko: 참조된 형식 목록에 네임스페이스 '{1}'의 데이터 계약 이름 '{0}'을(를) 가진 둘 이상의 형식이 있습니다. 다음 형식 중 하나를 제외한 모든 형식을 제외해야 합니다. 일치하는 형식만 유효한 참조가 될 수 있습니다. {2}
pl: Lista wskazanych typów kolekcji zawiera co najmniej dwa typy o takiej samej nazwie kontraktu danych {0} w przestrzeni nazw {1}. Z następujących typów należy wykluczyć wszystkie typy oprócz jednego. Można odwoływać się tylko do pasujących typów: {2}
pt_br: A lista de tipos referenciados contém mais de um tipo com o nome de contrato de dados '{0}' no namespace '{1}'. É necessário excluir todos, exceto um dos tipos a seguir. Apenas tipos correspondentes podem ser referências válidas: {2}
ru: Список ссылочных типов коллекций содержит несколько типов с одинаковым именем контракта данных "{0}" в пространстве имен "{1}". Необходимо исключить все следующие типы, кроме одного. Только согласованные типы могут быть правильными ссылками: {2}
tr: Başvuru yapılan türlerin listesinde, '{1}' ad alanında aynı '{0}' veri anlaşması adına sahip birden fazla tür var. Aşağıdaki türlerden biri dışında tümü çıkarılmalıdır. Yalnızca eşleşen türler geçerli başvuru olabilir: {2}
zh_hans: 引用的类型的列表含有多个数据协定名称“{0}”位于命名空间“{1}”中的类型。需要排除以下类型之一外的所有类型。只有匹配的类型才可以为有效引用: {2}
zh_hant: 參考類型的清單包含一個以上的類型，在命名空間 '{1}' 中的資料合約名稱為 '{0}'。除下列其中一個類型以外，需要排除所有類型。只有相符的類型才是有效的參考: {2}

# AnnotationAttributeNotFound
source: Invalid '{0}' annotation in type '{1}' from namespace '{2}'. Attribute '{3}' not present.
cs: Neplatná poznámka {0} v typu {1} z oboru názvů {2}. Atribut {3} není přítomen.
de: Ungültige Anmerkung "{0}" im Typ "{1}" aus dem Namespace "{2}". Das Attribut "{3}" ist nicht vorhanden.
es: La anotación "{0}" no es válida en el tipo "{1}" del espacio de nombres "{2}". Falta el atributo "{3}".
fr: Annotation '{0}' non valide dans le type '{1}' provenant de l'espace de noms '{2}'. L'attribut '{3}' est absent.
it: L'annotazione '{0}' non è valida nel tipo '{1}' dello spazio dei nomi '{2}'. L'attributo '{3}' non è presente.
ja: 名前空間 '{2}' の型 '{1}' における注釈 '{0}' は無効です。属性 '{3}' が存在しません。
ko: 네임스페이스 '{2}'의 형식 '{1}'에 잘못된 '{0}' 주석이 있습니다. '{3}' 특성이 없습니다.
pl: Nieprawidłowa adnotacja „{0}” w typie „{1}” z przestrzeni nazw „{2}”. Brak atrybutu „{3}”.
pt_br: Anotação '{0}' inválida no tipo '{1}' do namespace '{2}'. Atributo '{3}' não presente.
ru: Недопустимая заметка "{0}" в типе "{1}" из пространства имен "{2}". Атрибут "{3}" отсутствует.
tr: '{2}' ad alanından '{1}' türünde '{0}' geçersiz ek açıklaması. '{3}' özniteliği yok.
zh_hans: 来自命名空间“{2}”的类型“{1}”中的“{0}”注释无效。属性“{3}”不存在。
zh_hant: 命名空間 '{2}' 的類型 '{1}' 中有無效的 '{0}' 註釋。屬性 '{3}' 不存在。

# AnonymousTypeNotSupported
source: Anonymous type in element '{0}' from namespace '{1}' is not supported.
cs: Anonymní typ v elementu {0} z oboru názvů {1} není podporován.
de: Der anonyme Typ im Element "{0}" aus dem Namespace "{1}" wird nicht unterstützt.
es: No se admite el tipo anónimo que hay en el elemento "{0}" del espacio de nombres "{1}".
fr: Le type anonyme dans l'élément '{0}' provenant de l'espace de noms '{1}' n'est pas pris en charge.
it: Il tipo anonimo nell'elemento '{0}' dello spazio dei nomi '{1}' non è supportato.
ja: 名前空間 '{1}' の要素 '{0}' では匿名型はサポートされていません。
ko: 네임스페이스 '{1}'의 요소 '{0}'에 있는 무명 형식이 지원되지 않습니다.
pl: Typ anonimowy w elemencie „{0}” z przestrzeni nazw „{1}” nie jest obsługiwany.
pt_br: Não há suporte para tipo anônimo no elemento '{0}' do namespace '{1}'.
ru: Анонимный тип в элементе "{0}" из пространства имен "{1}" не поддерживается.
tr: '{1}' ad alanındaki '{0}' öğesinde Anonymous türü desteklenmiyor.
zh_hans: 来自命名空间“{1}”的元素“{0}”中不支持匿名类型。
zh_hant: 不支援命名空間 '{1}' 元素 '{0}' 中的匿名類型。

# AnyAttributeNotSupported
source: 'anyAttribute' is not supported.
cs: Parametr anyAttribute není podporován.
de: "anyAttribute" wird nicht unterstützt.
es: No se admite "anyAttribute".
fr: Pas de prise en charge pour 'anyAttribute'.
it: 'anyAttribute' non è supportato.
ja: 'anyAttribute' はサポートされていません。
ko: 'anyAttribute'가 지원되지 않습니다.
pl: Atrybut „anyAttribute” nie jest obsługiwany.
pt_br: Não há suporte para 'anyAttribute'.
ru: anyAttribute не поддерживается.
tr: 'anyAttribute' desteklenmiyor.
zh_hans: "anyAttribute" 不受支持。
zh_hant: 不支援 'anyAttribute'。

# ArrayExceededSize
source: Array length '{0}' provided by the get-only collection of type '{1}' is less than the number of array elements found in the input stream. Consider increasing the length of the array.
cs: Délka pole {0} poskytnutá kolekcí typu pouze pro získání (get) {1} je kratší než počet elementů pole nalezených ve vstupním streamu. Zvažte zvýšení délky pole.
de: Die durch die nur abrufbare Sammlung vom Typ "{1}" angegebene Arraylänge "{0}" ist kleiner als die Anzahl von Elementen im Eingabestream. Erhöhen Sie ggf die Arraylänge.
es: La longitud de matriz "{0}" proporcionada por la colección get-only de tipo "{1}" es menor que el número de elementos de matriz encontrados en el flujo de entrada. Considere aumentar la longitud de la matriz.
fr: La longueur de tableau '{0}' fournie par le type de collection get-only '{1}' est inférieure au nombre d'éléments de tableau trouvé dans le flux d'entrée. Augmentez la longueur du tableau.
it: La lunghezza '{0}' della matrice fornita dalla raccolta con sola funzione di accesso get di tipo '{1}' è minore del numero di elementi della matrice trovati nel flusso di input. Provare ad aumentare la lunghezza della matrice.
ja: 型 '{1}' の get-only コレクションで指定された配列の長さ '{0}' が入力ストリームの配列要素の数を下回っています。配列の長さを増やしてください。
ko: '{1}' 형식의 get-only 컬렉션에서 제공한 배열 길이 '{0}'이(가) 입력 스트림에 있는 배열 요소 수보다 짧습니다. 배열 길이를 늘여 보세요.
pl: Długość tablicy „{0}” dostarczona przez kolekcję get-only typu „{1}” jest mniejsza niż liczba elementów tablicy znalezionych w strumieniu wejściowym. Rozważ zwiększenie długości tablicy.
pt_br: O comprimento da matriz '{0}' fornecido pelo tipo de coleção '{1}' somente obtenção é menor que o número de elementos de matriz encontrados no fluxo de entrada. Considere aumentar o comprimento da matriz.
ru: Длина массива "{0}", определяемая коллекцией типа "{1}", предназначенной только для получения, меньше количества элементов массива, найденных во входном потоке. Попробуйте увеличить длину массива.
tr: '{1}' türündeki yalnızca alma koleksiyonu tarafından sağlanan dizi uzunluğu '{0}', giriş akışında bulunan dizi öğesi sayısından küçük. Dizinin uzunluğunu artırmayı deneyin.
zh_hans: 由类型“{1}”的 get-only 集合提供的数组长度“{0}”小于在输入流中找到的数组元素数量。请考虑增加数组的长度。
zh_hant: 類型 '{1}' 的 get-only 集合所提供的陣列長度 '{0}'，小於輸入資料流中找到的陣列元素數。請考慮加大陣列長度。

# ArrayExceededSizeAttribute
source: Array length '{0}' provided by Size attribute is not equal to the number of array elements '{1}' from namespace '{2}' found.
cs: Délka pole {0} poskytnutá atributem Size (Velikost) se nerovná nalezenému počtu elementů pole {1} z oboru názvů {2}.
de: Die mit dem Size-Attribut angegebene Arraylänge "{0}" ist ungleich der Anzahl von gefundenen Arrayelementen "{1}" aus dem Namespace "{2}".
es: La longitud de matriz "{0}" que proporciona el atributo Size no es igual al número de elementos de matriz "{1}" del espacio de nombres "{2}" que se encontraron.
fr: La longueur de tableau '{0}' fournie par l'attribut Size n'est pas égale au nombre d'éléments de tableau '{1}' provenant de l'espace de noms '{2}' trouvé.
it: La lunghezza '{0}' della matrice specificata dall'attributo Size non è uguale al numero di elementi di matrice '{1}' dello spazio dei nomi '{2}' trovati.
ja: Size 属性で指定された配列長 '{0}' は、名前空間 '{2}' から見つかった配列要素 '{1}' の数と等しくありません。
ko: Size 특성이 제공한 배열 길이 '{0}'이(가) 발견된 네임스페이스 '{2}'의 배열 요소 수 '{1}'과(와) 다릅니다.
pl: Długość tablicy „{0}” podana przez atrybut Size nie jest równa liczbie znalezionych elementów tablicy „{1}” z przestrzeni nazw „{2}”.
pt_br: O comprimento da matriz '{0}' fornecido pelo atributo Size não é igual ao número de elementos da matriz '{1}' do namespace '{2}' encontrado.
ru: Длина массива "{0}", определяемая атрибутом Size, не равна числу элементов массива "{1}" из найденного пространства имен "{2}".
tr: "Size" özniteliği tarafından sağlanan dizi uzunluğu '{0}', '{2}' ad alanında bulunan '{1}' dizi öğesi sayısına eşit değil.
zh_hans: Size 特性提供的数组长度“{0}”与从命名空间“{2}”中发现的数组元素“{1}”的数目不相等。
zh_hant: Size 屬性提供的陣列長度 '{0}' 不等於從命名空間 '{2}' 找到的陣列元素 '{1}' 數。

# ArrayItemFormMustBe
source: Form for element '{0}' must be qualified.
cs: Musí být určen formulář pro element {0}.
de: Das Element "{0}" muss in qualifizierter Form angegeben werden.
es: El elemento "{0}" debe tener una forma completa.
fr: Le formulaire pour l'élément '{0}' doit être qualifié.
it: Il formato dell'elemento '{0}' deve essere qualificato.
ja: 要素 '{0}' に対するフォームが修飾される必要があります。
ko: 요소 '{0}'에 대한 양식을 정규화해야 합니다.
pl: Element Form dla elementu „{0}” musi być kwalifikowany.
pt_br: O formulário para o elemento '{0}' deve ser qualificado.
ru: Форма элемента "{0}" должна быть квалифицирована.
tr: '{0}' öğesinin Form değeri uygun olmalı.
zh_hans: 用于元素“{0}”的格式必须进行限定。
zh_hant: 元素 '{0}' 的格式必須符合規定。

# ArrayTypeCannotBeImported
source: Array type '{0}' in namespace '{1}' cannot be imported. {2}
cs: Typ pole {0} v oboru názvů {1} nelze importovat. {2}
de: Der Arraytyp "{0}" im Namespace "{1}" kann nicht importiert werden. {2}
es: No se puede importar una matriz del tipo "{0}" en el espacio de nombres "{1}". {2}
fr: Impossible d'importer le type de tableau '{0}' dans l'espace de noms '{1}'. {2}
it: Non è possibile importare il tipo di matrice '{0}' nello spazio dei nomi '{1}'. {2}
ja: 名前空間 '{1}' 内の配列型 '{0}' をインポートできません。{2}
ko: 네임스페이스 '{1}'의 배열 형식 '{0}'을(를) 가져올 수 없습니다. {2}
pl: Nie można zaimportować typu tablicy „{0}” w przestrzeni nazw „{1}”. {2}
pt_br: O tipo da matriz '{0}' no namespace '{1}' não pode ser importado. {2}
ru: Невозможно импортировать тип массива "{0}" в пространстве имен "{1}". {2}
tr: '{1}' ad alanındaki '{0}' dizi türü içeri aktarılamıyor. {2}
zh_hans: 位于命名空间“{1}”中的数组类型“{0}”无法导入。{2}
zh_hant: 無法匯入命名空間 '{1}' 中的陣列類型 '{0}'。 {2}

# ArrayTypeIsNotSupported
source: An internal error has occurred. '{0}[]' is not supported when generating code for serialization.
cs: Došlo k vnitřní chybě. {0}[] není při generování kódu pro serializaci podporováno.
de: Ein interner Fehler ist aufgetreten. "{0}[]" wird beim Generieren von Code für die Serialisierung nicht unterstützt.
es: Error interno. No se admite "{0}[]" al generar código para la serialización.
fr: Une erreur interne s'est produite. Pas de prise en charge de '{0}[]' durant la génération de code pour la sérialisation.
it: Si è verificato un errore interno. '{0}[]' non è supportato durante la generazione di codice per la serializzazione.
ja: 内部エラーが発生しました。シリアル化用コードを生成する際には '{0}[]' はサポートされません。
ko: 내부 오류가 발생했습니다. serialization을 위한 코드를 생성할 때 '{0}[]'이(가) 지원되지 않습니다.
pl: Wystąpił błąd wewnętrzny. Typ „{0}[]” nie jest obsługiwany podczas generowania kodu dla serializacji.
pt_br: Erro interno. Não há suporte para '{0}[]' durante a geração do código para serialização.
ru: Произошла внутренняя ошибка. При генерировании кода для сериализации "{0}[]" не поддерживается.
tr: Bir iç hata oluştu. Serileştirme kodu oluşturulurken '{0}[]' desteklenmez.
zh_hans: 出现内部错误。生成用于序列化的代码时，“{0}[]”不受支持。
zh_hant: 發生內部錯誤。產生序列化的程式碼時，不支援 '{0}[]'。

# AssemblyNotFound
source: Assembly '{0}' is not found.
cs: Sestavení {0} nebylo nalezeno.
de: Die Assembly "{0}" wurde nicht gefunden.
es: No se encuentra el ensamblado "{0}".
fr: Assembly '{0}' introuvable.
it: L'assembly '{0}' non è stato trovato.
ja: アセンブリ '{0}' が見つかりません。
ko: '{0}' 어셈블리를 찾을 수 없습니다.
pl: Nie znaleziono zestawu „{0}”.
pt_br: Assembly '{0}' não encontrado.
ru: Сборка "{0}" не найдена.
tr: '{0}' bütünleştirilmiş kodu bulunamadı.
zh_hans: 未找到程序集“{0}”。
zh_hant: 找不到組件 '{0}'。
