Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PartialTrustCollectionContractTypeNotPublic
source: The collection data contract type '{0}' is not serializable in partial trust because it is not public.
cs: Typ kontraktu dat kolekce {0} není serializovatelný v částečném vztahu důvěryhodnosti, protože není veřejný.
de: Der Sammlungsdatenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert werden, weil er nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque no es público.
fr: Le type de contrat de données de collection '{0}' ne peut pas être sérialisé en confiance partielle, car il n'est pas public.
it: Il tipo di contratto di dati della raccolta '{0}' non può essere serializzato in attendibilità parziale perché non è pubblico.
ja: パブリックでないため、部分的な信頼でコレクション データ コントラクト型 '{0}' をシリアル化できません。
ko: 컬렉션 데이터 계약 형식 '{0}'이(가) public이 아니기 때문에 해당 형식을 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych kolekcji „{0}” w częściowej relacji zaufania, ponieważ nie jest on publiczny.
pt_br: O tipo de contrato de dados da coleção '{0}' não é serializável em confiança parcial, pois não é público.
ru: Тип контракта данных коллекции "{0}" не может быть сериализован при отношении частичного доверия, поскольку он не является общим.
tr: Genel olmadığından, '{0}' koleksiyon veri anlaşması türü kısmi güvende serileştirilebilir değil.
zh_hans: 无法在部分信任中序列化集合数据约定类型“{0}”，因为它不是公共类型。
zh_hant: 集合資料合約類型 '{0}' 無法在部分信任中序列化，因為它不是公用的。

# PartialTrustDataContractFieldGetNotPublic
source: The data contract type '{0}' cannot be serialized in partial trust because the member '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být serializován v částečném vztahu důvěryhodnosti, protože člen {1} není veřejný.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert sein, weil der Member "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque el miembro "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé en confiance partielle, car le membre '{1}' n'est pas public.
it: Il tipo di contratto di dati '{0}' non può essere serializzato in attendibilità parziale perché il membro '{1}' non è pubblico.
ja: メンバー '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' をシリアル化できません。
ko: '{1}' 멤버가 public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ składowa „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser serializado em confiança parcial, pois o membro '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть сериализован при отношении частичного доверия, поскольку член "{1}" не является общим.
tr: '{1}' üyesi genel olmadığından, '{0}' veri anlaşması türü kısmi güvende serileştirilemiyor.
zh_hans: 无法在部分信任中序列化数据协定类型“{0}”，因为成员“{1}”不是公共成员。
zh_hant: 因為成員 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中序列化。

# PartialTrustDataContractFieldSetNotPublic
source: The data contract type '{0}' cannot be deserialized in partial trust because the member '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože člen {1} není veřejný.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil der Member "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque el miembro "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé en confiance partielle, car le membre '{1}' n'est pas public.
it: Il tipo di contratto di dati '{0}' non può essere deserializzato in attendibilità parziale perché il membro '{1}' non è pubblico.
ja: メンバー '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' のシリアル化を解除できません。
ko: '{1}' 멤버가 public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ składowa „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado em confiança parcial, pois o membro '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть десериализован при отношении частичного доверия, поскольку член "{1}" не является общим.
tr: '{1}' üyesi genel olmadığından, '{0}' veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化数据约定类型“{0}”，因为成员“{1}”不是公共成员。
zh_hant: 因為成員 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中還原序列化。

# PartialTrustDataContractMemberGetNotPublic
source: The data contract type '{0}' cannot be serialized because the member '{1}' is not public. Making the member public will fix this error. Alternatively, you can make it internal, and use the InternalsVisibleToAttribute attribute on your assembly in order to enable serialization of internal members - see documentation for more details. Be aware that doing so has certain security implications.
cs: Typ kontraktu dat {0} nelze serializovat, protože člen {1} není veřejný. Převedení tohoto členu na veřejný tuto chybu opraví. Alternativně můžete tento člen převést na interní a použít v sestavení atribut InternalsVisibleToAttribute, aby byla povolena serializace interních členů. Další podrobnosti naleznete v dokumentaci. Nezapomeňte však, že tento postup má určitý vliv na zabezpečení.
de: Der Datenvertragstyp "{0}" kann nicht serialisiert werden, weil der Member "{1}" nicht öffentlich ist. Der Fehler kann durch Festlegen des Members als öffentlich behoben werden. Alternativ können Sie den Member als intern festlegen und das InternalsVisibleToAttribute-Attribut in der Assembly verwenden, um die Serialisierung interner Member zu ermöglichen (weitere Informationen finden Sie in der Dokumentation). Beachten Sie, dass diese Vorgehensweise gewisse Auswirkungen auf die Sicherheit hat.
es: El tipo de contrato de datos "{0}" no se puede deserializar porque el miembro "{1}" no es público. Si convierte el miembro en público, se solucionará el error. También tiene la posibilidad de hacerlo interno y utilizar el atributo InternalsVisibleToAttribute en el ensamblado a fin de habilitar la serialización de los miembros internos (vea la documentación para obtener más detalles). Tenga en cuenta que esta acción puede tener algunas implicaciones para la seguridad.
fr: Impossible de sérialiser le type de contrat de données '{0}', car le membre '{1}' n'est pas public. Pour corriger cette erreur, rendez le membre public. Vous pouvez également le rendre interne et utiliser l'attribut InternalsVisibleToAttribute sur votre assembly pour permettre la sérialisation des membres internes. Pour plus d'informations, consultez la documentation. Notez que cela entraîne des répercussions sur la sécurité.
it: Non è possibile serializzare il tipo di contratto di dati '{0}' perché il membro '{1}' non è pubblico. Per risolvere il problema, rendere pubblico il membro. In alternativa, è possibile renderlo interno e usare l'attributo InternalsVisibleToAttribute sull'assembly per abilitare la serializzazione dei membri interni. Per maggiori dettagli, vedere la documentazione. Tenere presente che questa operazione può avere implicazioni in termini di sicurezza.
ja: メンバー '{1}' がパブリックでないため、データ コントラクト型 '{0}' をシリアル化できません。メンバーをパブリックにすることで、このエラーを修正できます。または、内部としておき、内部メンバーのシリアル化を有効にするためにアセンブリで InternalsVisibleToAttribute 属性を使用することも可能です。詳細については、ドキュメントを参照してください。ただし、これを実行すると、セキュリティへの影響が生じることに注意してください。
ko: '{1}' 멤버는 public이 아니므로 데이터 계약 형식 '{0}'을(를) 직렬화할 수 없습니다. 멤버를 public으로 지정하면 이 오류가 수정됩니다. 또는 internal로 지정하고, 내부 멤버의 serialization을 사용하도록 설정하기 위해 어셈블리의 InternalsVisibleToAttribute 특성을 사용할 수 있습니다. 자세한 내용은 설명서를 참조하세요. 이렇게 할 경우 보안에 미치는 영향에 주의해야 합니다.
pl: Nie można serializować typu kontraktu danych „{0}”, ponieważ składowa „{1}” nie jest publiczna. Przekształcenie składowej w publiczną usunie ten błąd. Alternatywnie możesz przekształcić ją w wewnętrzną i użyć atrybutu InternalsVisibleToAttribute w swoim zestawie, aby umożliwić serializację wewnętrznych składowych — więcej szczegółów można znaleźć w dokumentacji. Należy zdawać sobie sprawę, że takie postępowania ma pewne skutki dla bezpieczeństwa.
pt_br: O tipo do contrato de dados '{0}' não pode ser serializado porque o membro '{1}' não é público. Tornar o membro público corrigirá esse erro. Como alternativa, você pode torná-lo interno e usar o atributo InternalsVisibleToAttribute no assembly para habilitar a serialização de membros internos. Consulte a documentação para obter mais detalhes. Observe que fazer isso resultará em algumas implicações de segurança.
ru: Невозможно сериализовать тип контракта данных "{0}", так как член "{1}" не является общим. Преобразуйте член в общий, чтобы исправить эту ошибку. Кроме того, можно сделать его внутренним и использовать атрибут InternalsVisibleToAttribute для сборки, чтобы включить сериализацию внутренних членов (подробнее см. в документации). Имейте в виду, что это может влиять на безопасность.
tr: '{1}' üyesi genel olmadığından '{0}' veri anlaşması türü serileştirilemiyor. Üyenin genel yapılması bu sorunu çözer. Alternatif olarak, üyeyi iç üye yapabilir ve bütünleştirilmiş kodunuzda iç üyelerin serileştirilmesini etkinleştirmek için InternalsVisibleToAttribute özniteliğini kullanabilirsiniz. Ayrıntılı bilgi edinmek için belgelere bakın. Bunu yapmanın güvenlik açısından belirli sonuçlar doğuracağını unutmayın.
zh_hans: 数据协定类型“{0}”无法序列化，因为成员“{1}”不是公共成员。使该成员成为公共成员将修复此错误。或者，你可以使其成为内部成员，并在程序集中使用 InternalsVisibleToAttribute 属性以启用内部成员的序列化 - 有关更多详细信息，请参阅文档。请注意，这样做具有一定的安全隐患。
zh_hant: 因為成員 '{1}' 並非公用，所以無法將資料合約類型 '{0}' 序列化。將成員設為公用將可修正此錯誤。或者，您可以將其設為內部，並在您的組件上使用 InternalsVisibleToAttribute 屬性，以啟用內部成員的序列化 - 如需詳細資料，請參閱相關文件。請注意，如此將會對安全性造成特定影響。

# PartialTrustDataContractMemberSetNotPublic
source: The data contract type '{0}' cannot be deserialized because the member '{1}' is not public. Making the member public will fix this error. Alternatively, you can make it internal, and use the InternalsVisibleToAttribute attribute on your assembly in order to enable serialization of internal members - see documentation for more details. Be aware that doing so has certain security implications.
cs: Typ kontraktu dat {0} nelze deserializovat, protože člen {1} není veřejný. Převedení tohoto členu na veřejný tuto chybu opraví. Alternativně můžete tento člen převést na interní a použít v sestavení atribut InternalsVisibleToAttribute, aby byla povolena serializace interních členů. Další podrobnosti naleznete v dokumentaci. Nezapomeňte však, že tento postup má určitý vliv na zabezpečení.
de: Der Datenvertragstyp "{0}" kann nicht deserialisiert werden, weil der Member "{1}" nicht öffentlich ist. Der Fehler kann durch Festlegen des Members als öffentlich behoben werden. Alternativ können Sie den Member als intern festlegen und das InternalsVisibleToAttribute-Attribut in der Assembly verwenden, um die Serialisierung interner Member zu ermöglichen (weitere Informationen finden Sie in der Dokumentation). Beachten Sie, dass diese Vorgehensweise gewisse Auswirkungen auf die Sicherheit hat.
es: El tipo de contrato de datos "{0}" no se puede deserializar porque el miembro "{1}" no es público. Si convierte el miembro en público, se solucionará el error. También tiene la posibilidad de hacerlo interno y utilizar el atributo InternalsVisibleToAttribute en el ensamblado a fin de habilitar la serialización de los miembros internos (vea la documentación para obtener más detalles). Tenga en cuenta que esta acción puede tener algunas implicaciones para la seguridad.
fr: Impossible de désérialiser le type de contrat de données '{0}', car le membre '{1}' n'est pas public. Pour corriger cette erreur, rendez le membre public. Vous pouvez également le rendre interne et utiliser l'attribut InternalsVisibleToAttribute sur votre assembly pour permettre la sérialisation des membres internes. Pour plus d'informations, consultez la documentation. Notez que cela entraîne des répercussions sur la sécurité.
it: Non è possibile deserializzare il tipo di contratto di dati '{0}' perché il membro '{1}' non è pubblico. Per risolvere il problema, rendere pubblico il membro. In alternativa, è possibile renderlo interno e usare l'attributo InternalsVisibleToAttribute sull'assembly per abilitare la serializzazione dei membri interni. Per maggiori dettagli, vedere la documentazione. Tenere presente che questa operazione può avere implicazioni in termini di sicurezza.
ja: メンバー '{1}' がパブリックでないため、データ コントラクト型 '{0}' の逆シリアル化できません。メンバーをパブリックにすることで、このエラーを修正できます。または、内部としておき、内部メンバーのシリアル化を有効にするためにアセンブリで InternalsVisibleToAttribute 属性を使用することも可能です。詳細については、ドキュメントを参照してください。ただし、これを実行すると、セキュリティへの影響が生じることに注意してください。
ko: '{1}' 멤버는 public이 아니므로 데이터 계약 형식 '{0}'을(를) deserialize할 수 없습니다. 멤버를 public으로 지정하면 이 오류가 수정됩니다. 또는 internal로 지정하고, 내부 멤버의 serialization을 사용하도록 설정하기 위해 어셈블리의 InternalsVisibleToAttribute 특성을 사용할 수 있습니다. 자세한 내용은 설명서를 참조하세요. 이렇게 할 경우 보안에 미치는 영향에 주의해야 합니다.
pl: Nie można zdeserializować typu kontraktu danych „{0}”, ponieważ składowa „{1}” nie jest publiczna. Przekształcenie składowej w publiczną usunie ten błąd. Alternatywnie możesz przekształcić ją w wewnętrzną i użyć atrybutu InternalsVisibleToAttribute w swoim zestawie, aby umożliwić serializację wewnętrznych składowych — więcej szczegółów można znaleźć w dokumentacji. Należy zdawać sobie sprawę, że takie postępowania ma pewne skutki dla bezpieczeństwa.
pt_br: O tipo do contrato de dados '{0}' não pode ser desserializado porque o membro '{1}' não é público. Tornar o membro público corrigirá esse erro. Como alternativa, você pode torná-lo interno e usar o atributo InternalsVisibleToAttribute no assembly para habilitar a serialização de membros internos. Consulte a documentação para obter mais detalhes. Observe que fazer isso resultará em algumas implicações de segurança.
ru: Невозможно десериализовать тип контракта данных "{0}", так как член "{1}" не является общим. Преобразуйте член в общий, чтобы исправить эту ошибку. Кроме того, можно сделать его внутренним и использовать атрибут InternalsVisibleToAttribute для сборки, чтобы включить сериализацию внутренних членов (подробнее см. в документации). Имейте в виду, что это может влиять на безопасность.
tr: '{1}' üyesi genel olmadığından '{0}' veri anlaşması türü seri durumdan çıkarılamıyor. Üyenin genel yapılması bu sorunu çözer. Alternatif olarak, üyeyi iç üye yapabilir ve bütünleştirilmiş kodunuzda iç üyelerin serileştirilmesini etkinleştirmek için InternalsVisibleToAttribute özniteliğini kullanabilirsiniz. Ayrıntılı bilgi edinmek için belgelere bakın. Bunu yapmanın güvenlik açısından belirli sonuçlar doğuracağını unutmayın.
zh_hans: 数据协定类型“{0}”无法反序列化，因为成员“{1}”不是公共成员。使该成员成为公共成员将修复此错误。或者，你可以使其成为内部成员，并在程序集中使用 InternalsVisibleToAttribute 属性以启用内部成员的序列化 - 有关更多详细信息，请参阅文档。请注意，这样做具有一定的安全隐患。
zh_hant: 因為成員 '{1}' 並非公用，所以無法將資料合約類型 '{0}' 還原序列化。將成員設為公用將可修正此錯誤。或者，您可以將其設為內部，並在您的組件上使用 InternalsVisibleToAttribute 屬性，以啟用內部成員的序列化 - 如需詳細資料，請參閱相關文件。請注意，如此將會對安全性造成特定影響。

# PartialTrustDataContractOnDeserializedNotPublic
source: The data contract type '{0}' cannot be deserialized in partial trust because the OnDeserialized method '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože metoda OnDeserialized {1} není veřejná.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil die OnDeserialized-Methode "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque el método OnDeserialized "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé en confiance partielle, car la méthode OnDeserialized '{1}' n'est pas publique.
it: Il tipo di contratto di dati '{0}' non può essere deserializzato in attendibilità parziale perché il metodo '{1}' di OnDeserialized non è pubblico.
ja: OnDeserialized メソッド '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' のシリアル化を解除できません。
ko: OnDeserialized 메서드 '{1}'이(가) public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ metoda OnDeserialized „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado em confiança parcial, pois o método OnDeserialized '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть десериализован при отношении частичного доверия, поскольку метод OnDeserialized "{1}" не является общим.
tr: '{1}' OnDeserialized metodu genel olmadığından, '{0}' veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化数据约定类型“{0}”，因为 OnDeserialized 方法“{1}”不是公共方法。
zh_hant: 因為 OnDeserialized 方法 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中還原序列化。

# PartialTrustDataContractOnDeserializingNotPublic
source: The data contract type '{0}' cannot be deserialized in partial trust because the OnDeserializing method '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože metoda OnDeserializing {1} není veřejná.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil die OnDeserializing-Methode "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque el método OnDeserializing "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être désérialisé en confiance partielle, car la méthode OnDeserializing '{1}' n'est pas publique.
it: Il tipo di contratto di dati '{0}' non può essere deserializzato in attendibilità parziale perché il metodo '{1}' di OnDeserializing non è pubblico.
ja: OnDeserializing メソッド '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' のシリアル化を解除できません。
ko: OnDeserializing 메서드 '{1}'이(가) public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ metoda OnDeserializing „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser desserializado em confiança parcial, pois o método OnDeserializing '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть десериализован при отношении частичного доверия, поскольку метод OnDeserializing "{1}" не является общим.
tr: '{1}' OnDeserializing metodu genel olmadığından, '{0}' veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化数据约定类型“{0}”，因为 OnDeserializing 方法“{1}”不是公共方法。
zh_hant: 因為 OnDeserializing 方法 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中還原序列化。

# PartialTrustDataContractOnSerializedNotPublic
source: The data contract type '{0}' cannot be serialized in partial trust because the OnSerialized method '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být serializován v částečném vztahu důvěryhodnosti, protože metoda OnSerialized {1} není veřejná.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert sein, weil die OnSerialized-Methode "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque el método OnSerialized "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé en confiance partielle, car la méthode OnSerialized '{1}' n'est pas publique.
it: Il tipo di contratto di dati '{0}' non può essere serializzato in attendibilità parziale perché il metodo '{1}' di OnSerialized non è pubblico.
ja: OnSerialized メソッド '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' をシリアル化できません。
ko: OnSerialized 메서드 '{1}'이(가) public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ metoda OnSerialized „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser serializado em confiança parcial, pois o método OnSerialized '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть сериализован при отношении частичного доверия, поскольку метод OnSerialized "{1}" не является общим.
tr: '{1}' OnSerialized metodu genel olmadığından, '{0}' veri anlaşması türü kısmi güvende serileştirilemiyor.
zh_hans: 无法在部分信任中序列化数据约定类型“{0}”，因为 OnSerialized 方法“{1}”不是公共方法。
zh_hant: 因為 OnSerialized 方法 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中序列化。

# PartialTrustDataContractOnSerializingNotPublic
source: The data contract type '{0}' cannot be serialized in partial trust because the OnSerializing method '{1}' is not public.
cs: Typ kontraktu dat {0} nemůže být serializován v částečném vztahu důvěryhodnosti, protože metoda OnSerializing {1} není veřejná.
de: Der Datenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht serialisiert sein, weil die OnSerializing-Methode "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede serializar en una confianza parcial porque el método OnSerializing "{1}" no es público.
fr: Le type de contrat de données '{0}' ne peut pas être sérialisé en confiance partielle, car la méthode OnSerializing '{1}' n'est pas publique.
it: Il tipo di contratto di dati '{0}' non può essere serializzato in attendibilità parziale perché il metodo '{1}' di OnSerializing non è pubblico.
ja: OnSerializing メソッド '{1}' がパブリックでないため、部分的な信頼でデータ コントラクト型 '{0}' をシリアル化できません。
ko: OnSerializing 메서드 '{1}'이(가) public이 아니기 때문에 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 직렬화할 수 없습니다.
pl: Nie można zserializować typu kontraktu danych „{0}” w częściowej relacji zaufania, ponieważ metoda OnSerializing „{1}” nie jest publiczna.
pt_br: O tipo de contrato de dados '{0}' não pode ser serializado em confiança parcial, pois o método OnSerializing '{1}' não é público.
ru: Тип контракта данных "{0}" не может быть сериализован при отношении частичного доверия, поскольку метод OnSerializing "{1}" не является общим.
tr: '{1}' OnSerializing metodu genel olmadığından, '{0}' veri anlaşması türü kısmi güvende serileştirilemiyor.
zh_hans: 无法在部分信任中序列化数据约定类型“{0}”，因为 OnSerializing 方法“{1}”不是公共方法。
zh_hant: 因為 OnSerializing 方法 '{1}' 不是公用的，所以資料合約類型 '{0}' 無法在部分信任中序列化。
