Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ErrorWriteEndObject
source: There was an error writing end element of object {0}. {1}
cs: Při zápisu koncového elementu objektu {0} došlo k chybě. {1}
de: Fehler beim Schreiben des Endelements des Objekts {0}. {1}
es: Error al escribir el elemento final del objeto {0}. {1}
fr: Une erreur s'est produite durant l'écriture de l'élément de fin de l'objet {0}. {1}
it: Si è verificato un errore durante la scrittura dell'elemento finale dell'oggetto {0}. {1}
ja: オブジェクト {0} の終了要素を書き込んでいるときにエラーが発生しました。{1}
ko: 개체 {0}의 끝 요소를 쓰는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas zapisu elementu końcowego obiektu {0}. {1}
pt_br: Erro ao gravar o elemento final do objeto {0}. {1}
ru: Ошибка записи конечного элемента объекта {0}. {1}
tr: {0} nesnesinin bitiş öğesine yazma hatası oluştu. {1}
zh_hans: 写入对象 {0} 的结束元素时出现错误。{1}
zh_hant: 寫入物件 {0} 的結束元素時發生錯誤。 {1}

# ErrorWriteStartObject
source: There was an error writing start element of object {0}. {1}
cs: Při zápisu počátečního elementu objektu {0} došlo k chybě. {1}
de: Fehler beim Schreiben des Startelements des Objekts {0}. {1}
es: Error al escribir el elemento inicial del objeto {0}. {1}
fr: Une erreur s'est produite durant l'écriture de l'élément de début de l'objet {0}. {1}
it: Si è verificato un errore durante la scrittura dell'elemento iniziale dell'oggetto {0}. {1}
ja: オブジェクト {0} の開始要素を書き込んでいるときにエラーが発生しました。{1}
ko: 개체 {0}의 시작 요소를 쓰는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas zapisu elementu początkowego obiektu {0}. {1}
pt_br: Erro ao gravar o elemento inicial do objeto {0}. {1}
ru: Ошибка записи начального элемента объекта {0}. {1}
tr: {0} nesnesinin başlangıç öğesine yazma hatası oluştu. {1}
zh_hans: 写入对象 {0} 的开始元素时出现错误。{1}
zh_hant: 寫入物件 {0} 的啟動元素時發生錯誤。 {1}

# ExceededMaxItemsQuota
source: Maximum number of items that can be serialized or deserialized in an object graph is '{0}'. Change the object graph or increase the MaxItemsInObjectGraph quota.
cs: Maximální počet položek, které lze serializovat nebo deserializovat v grafu objektů, je {0}. Změňte graf objektů nebo zvyšte kvótu MaxItemsInObjectGraph.
de: Die maximale Anzahl von Elementen in einem Objektgraphen, die serialisiert bzw. deserialisiert werden können, beträgt "{0}". Ändern Sie den Objektgraphen, oder erhöhen Sie das MaxItemsInObjectGraph-Kontingent.
es: El número máximo de elementos que se pueden serializar o deserializar en un gráfico de objeto es "{0}". Cambie el gráfico de objeto o aumente la cuota de MaxItemsInObjectGraph.
fr: Le nombre maximal d'éléments pouvant être sérialisés ou désérialisés dans un graphique d'objet est '{0}'. Changez le graphique d'objet ou augmentez le quota MaxItemsInObjectGraph.
it: Il numero massimo di elementi che possono essere serializzati o deserializzati in un oggetto grafico è pari a '{0}'. Modificare l'oggetto grafico o incrementare la quota MaxItemsInObjectGraph.
ja: 1 つのオブジェクト グラフ内でシリアル化が可能な項目の最大数、またはシリアル化の解除が可能な項目の最大数は '{0}' です。オブジェクト グラフを変更するか、MaxItemsInObjectGraph クォータを増やしてください。
ko: 개체 그래프에서 직렬화 또는 deserialize할 수 있는 최대 항목 수는 '{0}'개입니다. 개체 그래프를 변경하거나 MaxItemsInObjectGraph 할당량을 늘리세요.
pl: Maksymalna liczba elementów, które można serializować lub deserializować na podstawie wykresu obiektu, wynosi „{0}”. Zmień wykres obiektu lub zwiększ przedział CMaxItemsInObjectGraph.
pt_br: O número máximo de itens que pode ser serializado ou desserializado em um grafo de objeto é '{0}'. Altere o grafo de objeto ou aumente a cota do MaxItemsInObjectGraph.
ru: Максимальное количество объектов, которые могут быть сериализованы или десериализованы в графе объекта, равно "{0}". Измените граф объекта или увеличьте квоту MaxItemsInObjectGraph.
tr: Bir nesne grafında serileştirilebilen ya da seri durumdan çıkarılabilen öğelerin sayısını üst sınırı: '{0}'. Nesne grafını değiştirin ya da MaxItemsInObjectGraph kotasını artırın.
zh_hans: 对象图中可以序列化或反序列化的项目数目上限为“{0}”。请更改对象图或增加 MaxItemsInObjectGraph 的配额。
zh_hant: 物件圖形中可序列化或還原序列化的項目數目上限為 '{0}'。請變更物件圖形或加大 MaxItemsInObjectGraph 的配額。

# ExpectingElement
source: Expecting element '{1}' from namespace '{0}'.
cs: Očekává se element {1} z oboru názvů {0}.
de: Das Element "{1}" aus dem Namespace "{0}" wird erwartet.
es: Se espera el elemento "{1}" del espacio de nombres "{0}".
fr: Élément attendu '{1}' provenant de l'espace de noms '{0}'.
it: È previsto l'elemento '{1}' dello spazio dei nomi '{0}'.
ja: 名前空間 '{0}' の要素 '{1}' を指定してください。
ko: 네임스페이스 '{0}'의 '{1}' 요소가 필요합니다.
pl: Oczekiwany element „{1}” z przestrzeni nazw „{0}”.
pt_br: Esperando elemento '{1}' do namespace '{0}'.
ru: Ожидается элемент "{1}" из пространства имен "{0}".
tr: '{0}' ad alanından '{1}' öğesi bekleniyor.
zh_hans: 应为来自命名空间“{0}”的元素“{1}”。
zh_hant: 應為命名空間 '{0}' 的元素 '{1}'。

# ExpectingElementAtDeserialize
source: Expecting state '{0}' when ReadObject is called.
cs: Pro volání ReadObject je očekáván stav {0}.
de: Beim Aufruf von ReadObject wird der Zustand "{0}" erwartet.
es: Se espera el estado "{0}" al llamar al objeto ReadObject.
fr: État attendu '{0}' quand ReadObject est appelé.
it: Quando viene chiamato ReadObject, è previsto lo stato '{0}'.
ja: ReadObject が呼び出されるときは、状態が '{0}' である必要があります。
ko: ReadObject가 호출된 경우 '{0}' 상태가 필요합니다.
pl: Oczekiwany stan „{0}” podczas wywołania obiektu ReadObject.
pt_br: Esperando estado '{0}' quando ReadObject é chamado.
ru: При вызове ReadObject ожидается состояние "{0}".
tr: ReadObject çağrıldığında, '{0}' durumu beklenir.
zh_hans: 调用 ReadObject 时应为状态“{0}”。
zh_hant: 呼叫 ReadObject 時應為狀態 '{0}'。

# ExpectingEnd
source: Expecting End'{0}'.
cs: Očekává se ukončení {0}.
de: End"{0}" wird erwartet.
es: Se espera "{0}" final.
fr: Fin attendue : '{0}'.
it: È previsto End'{0}'.
ja: 最後の部分として '{0}' が必要です。
ko: 끝 '{0}'이(가) 필요합니다.
pl: Oczekiwano elementu End„{0}”.
pt_br: Esperando o Fim '{0}'.
ru: Ожидается завершение "{0}".
tr: End'{0}' bekleniyor.
zh_hans: 应为结束“{0}”。
zh_hant: 需要 End'{0}'。

# ExpectingState
source: Expecting state '{0}'.
cs: Očekává se stav {0}.
de: Der Zustand "{0}" wird erwartet.
es: Se espera el estado "{0}".
fr: État attendu : '{0}'.
it: È previsto lo stato '{0}'.
ja: 状態は '{0}' である必要があります。
ko: 상태 '{0}'이(가) 필요합니다.
pl: Oczekiwano stanu „{0}”.
pt_br: Esperando o estado '{0}'.
ru: Ожидается состояние "{0}".
tr: '{0}' durumu bekleniyor.
zh_hans: 应为状态“{0}”。
zh_hant: 需要狀態 '{0}'。

# FactoryObjectContainsSelfReference
source: Object graph of type '{0}' with Id '{2}' contains a reference to itself. The object has been replaced with a new object of type '{1}' either because it implements IObjectReference or because it is surrogated. The serializer does not support fixing up the nested reference to the new object and cannot deserialize this object. Consider changing the object to remove the nested self-reference.
cs: Graf objektů typu {0} s identifikátorem {2} obsahuje odkaz na sebe. Objekt byl nahrazen novým objektem typu {1} buď proto, že implementuje odkaz IObjectReference, nebo proto, že je nahrazen. Serializátor nepodporuje připojení vnořeného odkazu k novému objektu a nemůže tento objekt deserializovat. Zvažte možnost změnit objekt, aby se odebral zanořený odkaz na sebe sama.
de: Der Objektgraph vom Typ "{0}" mit der ID "{2}" enthält einen Verweis auf sich selbst. Das Objekt wurde durch ein neues Objekt vom Typ "{1}" ersetzt, da es IObjectReference implementiert oder ersetzt wird. Das Serialisierungsmodul unterstützt das Korrigieren des geschachtelten Verweises auf das neue Objekt nicht und kann dieses Objekt nicht deserialisieren. Ändern Sie ggf. das Objekt, um den geschachtelten Verweis auf sich selbst zu entfernen.
es: El gráfico de objeto del tipo "{0}" con el id. "{2}" contiene una referencia a sí mismo. El objeto se sustituyó por un objeto del tipo "{1}" porque implementa IObjectReference o es su suplente. El serializador no admite la corrección de la referencia anidada al nuevo objeto y no lo puede deserializar. Se recomienda cambiar el objeto para quitar la autoreferencia anidada.
fr: Le graphique d'objet de type '{0}' avec l'ID '{2}' contient une référence à lui-même. L'objet a été remplacé par un nouvel objet de type '{1}', car il implémente IObjectReference ou est substitué. Le sérialiseur ne prend pas en charge la fixation de la référence imbriquée au nouvel objet ni la désérialisation de cet objet. Changez l'objet pour supprimer l'autoréférence imbriquée.
it: L'oggetto grafico di tipo '{0}' con ID '{2}' contiene un riferimento a se stesso. L'oggetto è stato sostituito con un nuovo oggetto di tipo '{1}' perché implementa IObjectReference o perché è surrogato. Il serializzatore non è in grado di ricondurre il riferimento annidato al nuovo oggetto e non può deserializzare questo oggetto. Provare a modificare l'oggetto per rimuovere il riferimento annidato a se stesso.
ja: ID '{2}' を持つ型 '{0}' のオブジェクト グラフには自己参照が含まれています。このオブジェクトは、IObjectReference を実装しているかまたはサロゲートされているため、型 '{1}' の新しいオブジェクトに置き換えられました。シリアライザーは新しいオブジェクトへのネストされた参照の修正をサポートしておらず、このオブジェクトをシリアル化解除できません。このオブジェクトを変更して、ネストされた自己参照を削除してください。
ko: ID가 '{2}'인 '{0}' 형식의 개체 그래프에 자신에 대한 참조가 포함되어 있습니다. 개체가 IObjectReference를 구현하거나 대신 사용된 것이므로 '{1}' 형식의 새 개체로 바뀌었습니다. 직렬 변환기는 새 개체에 대한 중첩 참조의 수정을 지원하지 않으므로 이 개체를 deserialize할 수 없습니다. 개체를 변경하여 중첩된 자체 참조를 제거해 보세요.
pl: Wykres obiektu typu „{0}” z identyfikatorem „{2}” zawiera odwołanie do samego siebie. Obiekt został zastąpiony nowym obiektem typu „{1}” dlatego, że ma zaimplementowany element IObjectReference lub jest zastąpiony surogatem. Serializator nie umożliwia naprawy zagnieżdżonego odwołania do nowego obiektu i obiekt nie może być poddany deserializacji. Zmień obiekt, aby usunąć zagnieżdżone odwołanie do samego siebie.
pt_br: O grafo de objeto do tipo '{0}' com ID '{2}' contém uma referência a ele mesmo. O objeto foi substituído por um novo objeto do tipo '{1}' porque ele implementa IObjectReference ou porque ele é alternativo. O serializador não dá suporte à correção da referência aninhada ao novo objeto e não pode desserializar esse objeto. Considere alterar o objeto para remover a autorreferência aninhada.
ru: Граф объекта типа "{0}" с идентификатором "{2}" содержит ссылку на самого себя. Объект был заменен новым объектом типа "{1}", так как он реализует IObjectReference или является суррогатом. Сериализатор не поддерживает исправление вложенной ссылки на новый объект и не может десериализовать объект. Измените объект для удаления вложенной ссылки на самого себя.
tr: '{2}' kimlikli '{0}' türündeki nesne grafı, kendisine bir başvuru içeriyor. Nesne, IObjectReference uyguladığından ya da yerine temsilci konulduğundan '{1}' türünde yeni bir nesneyle değiştirildi. Serileştirici, yeni nesneye yapılan iç içe geçmiş başvuruyu düzeltmeyi desteklemiyor ve bu nesneyi seri durumdan çıkaramıyor. İç içe geçen kendine başvuruyu kaldırmak için nesneyi değiştirmeyi deneyin.
zh_hans: ID 为“{2}”的类型“{0}”的对象图含有一个对其自身的引用。该对象已经被类型为“{1}”的新对象替换，因为它实现 IObjectReference 或因为它为代理项。序列化程序不支持修复对新对象的嵌套引用并且无法反序列化此对象。请考虑更改该对象以便删除其对自身的嵌套引用。
zh_hant: 識別碼為 '{2}' 的類型 '{0}'，它的物件圖形包含自我參考。已經以類型 '{1}' 的新物件取代此物件，因為它實行 IObjectReference，或是已被代理。序列化程式不支援固定新物件的巢狀參考，且無法還原序列化此物件。請考慮變更物件以移除巢狀自我參考。

# FixedOnElementNotSupported
source: Fixed value on element '{0}' is not supported.
cs: Pevná hodnota u elementu {0} není podporována.
de: Ein fester Wert für das Element "{0}" wird nicht unterstützt.
es: No se admite el valor fijo del elemento "{0}".
fr: Une valeur fixe sur l'élément '{0}' n'est pas prise en charge.
it: Il valore fisso nell'elemento '{0}' non è supportato.
ja: 要素 '{0}' の固定値はサポートされていません。
ko: 요소 '{0}'의 고정 값이 지원되지 않습니다.
pl: Stała wartość elementu „{0}” nie jest obsługiwana.
pt_br: Não há suporte para valor fixo no elemento '{0}'.
ru: Фиксированное значение элемента "{0}" не поддерживается.
tr: '{0}' öğesindeki sabitlenmiş değer desteklenmiyor.
zh_hans: 不支持元素“{0}”上的固定值。
zh_hant: 不支援元素 '{0}' 上的固定值。

# FormMustBeQualified
source: Form on element '{0}' must be qualified.
cs: Formulář u elementu {0} musí být určen.
de: Das Element "{0}" muss in qualifizierter Form angegeben werden.
es: El elemento "{0}" debe tener una forma completa.
fr: Le formulaire sur l'élément '{0}' doit être qualifié.
it: Il formato dell'elemento '{0}' deve essere qualificato.
ja: 要素 '{0}' のフォームが修飾される必要があります。
ko: 요소 '{0}'의 양식을 정규화해야 합니다.
pl: Element Form w elemencie „{0}” musi być kwalifikowany.
pt_br: O formulário no elemento '{0}' deve ser qualificado.
ru: Форма элемента "{0}" должна быть квалифицирована.
tr: '{0}' öğesindeki biçim uygun olmalıdır.
zh_hans: 必须限定元素“{0}”上的格式。
zh_hant: 元素 '{0}' 上的格式必須符合規定。

# GenericAnnotationAttributeNotFound
source: Annotation for generic type '{0}' did not have attribute '{1}'.
cs: Poznámka pro obecný typ {0} neměla atribut {1}.
de: In der Anmerkung für den generischen Typ "{0}" fehlte das Attribut "{1}".
es: La anotación del tipo genérico "{0}" no tenía el atributo "{1}".
fr: L'annotation pour le type générique '{0}' n'avait pas l'attribut '{1}'.
it: L'annotazione per il tipo generico '{0}' non contiene l'attributo '{1}'.
ja: ジェネリック型 '{0}' の注釈に属性 '{1}' が含まれていませんでした。
ko: 제네릭 형식 '{0}'에 대한 주석에 '{1}' 특성이 없습니다.
pl: Adnotacja dla typu ogólnego „{0}” nie ma atrybutu „{1}”.
pt_br: A anotação para o tipo genérico '{0}' não teve atributo '{1}'.
ru: Заметка для универсального типа "{0}" не имела атрибута "{1}".
tr: '{0}' genel türü açıklamasında '{1}' özniteliği bulunmuyor.
zh_hans: 泛型类型“{0}”的注释不具有属性“{1}”。
zh_hant: 一般類型 '{0}' 的註釋沒有屬性 '{1}'。

# GenericAnnotationForNestedLevelMustBeIncreasing
source: Nested level on annotation elements '{0}' from namespace '{1}' for generic type '{2}' must be in increasing order.
cs: Vnořená úroveň u elementů poznámky {0} z oboru názvů {1} pro obecný typ {2} musí být ve zvyšujícím se pořadí.
de: Die Schachtelungsebene der Anmerkungselemente "{0}" aus dem Namespace "{1}" für den generischen Typ "{2}" muss in aufsteigender Reihenfolge angegeben werden.
es: El nivel anidado de los elementos de anotación "{0}" del espacio de nombres "{1}" para el tipo genérico "{2}" debe tener un orden ascendente.
fr: Le niveau imbriqué sur les éléments d'annotation '{0}' provenant de l'espace de noms '{1}' pour le type générique '{2}' doit être organisé selon l'ordre croissant.
it: Il livello annidato negli elementi di annotazione '{0}' dello spazio dei nomi '{1}' per il tipo generico '{2}' deve essere in ordine crescente.
ja: ジェネリック型 '{2}' の名前空間 '{1}' の annotation 要素 '{0}' の入れ子レベルは、昇順である必要があります。
ko: 제네릭 형식 '{2}'에 대한 네임스페이스 '{1}'의 주석 요소 '{0}'에서 중첩 수준은 오름차순이어야 합니다.
pl: Poziom zagnieżdżony elementów adnotacji „{0}” z przestrzeni nazw „{1}” dla typu ogólnego „{2}” musi występować w porządku rosnącym.
pt_br: O nível aninhado nos elementos de anotação '{0}' do namespace '{1}' do tipo genérico '{2}' deve estar em ordem crescente.
ru: Уровень вложенности элементов заметок "{0}" из пространства имен "{1}" для универсального типа "{2}" должен располагаться в порядке возрастания.
tr: '{2}' genel türü için '{1}' ad alanındaki '{0}' ek açıklama öğelerinin iç içe geçme düzeyi artan sırada olmalıdır.
zh_hans: 来自泛型类型“{2}”的命名空间“{1}”的注释元素“{0}”上的嵌套层次必须为递增顺序。
zh_hant: 一般類型 '{2}' 的命名空間 '{1}' 之註釋元素 '{0}' 上的巢狀層級，必須依序遞增。

# GenericAnnotationHasInvalidAttributeValue
source: Annotation element '{0}' from namespace '{1}' for generic type '{2}' has an invalid value '{3}' for attribute '{4}'. Expecting value to be of type '{5}'.
cs: Element poznámky {0} z oboru názvů {1} pro obecný typ {2} má neplatnou hodnotu {3} pro atribut {4}. Očekávaný typ hodnoty je {5}.
de: Das Anmerkungselement "{0}" aus dem Namespace "{1}" für den generischen Typ "{2}" weist einen ungültigen Wert "{3}" für das Attribut "{4}" auf. Erwartet wird ein Wert vom Typ "{5}".
es: El elemento de anotación "{0}" del espacio de nombres "{1}" para el tipo genérico "{2}" tiene un valor "{3}" no válido para el atributo "{4}". Se espera que el valor sea del tipo "{5}".
fr: L'élément d'annotation '{0}' provenant de l'espace de noms '{1}' pour le type générique '{2}' comporte une valeur non valide '{3}' pour l'attribut '{4}'. La valeur attendue doit être de type '{5}'.
it: L'elemento di annotazione '{0}' dello spazio dei nomi '{1}' per il tipo generico '{2}' contiene un valore non valido '{3}' per l'attributo '{4}'. È previsto un valore di tipo '{5}'.
ja: ジェネリック型 '{2}' の名前空間 '{1}' の annotation 要素 '{0}' には、属性 '{4}' として無効な値 '{3}' が含まれています。型 '{5}' の値である必要があります。
ko: 제네릭 형식 '{2}'에 대한 네임스페이스 '{1}'의 주석 요소 '{0}'에 특성 '{4}'에 대한 잘못된 값 '{3}'이(가) 있습니다. '{5}' 형식의 값이 필요합니다.
pl: Element adnotacji „{0}” z przestrzeni nazw „{1}” dla typu ogólnego „{2}” ma nadaną nieprawidłową wartość „{3}” dla atrybutu „{4}”. Oczekiwana wartość typu „{5}”.
pt_br: O elemento de anotação '{0}' do namespace '{1}' do tipo genérico '{2}' tem um valor inválido '{3}' para o atributo '{4}'. Espera-se que o valor seja do tipo '{5}'.
ru: Элемент заметки "{0}" из пространства имен "{1}" для универсального типа "{2}" имеет недопустимое значение "{3}" для атрибута "{4}". Ожидаемое значение должно иметь тип "{5}".
tr: '{2}' genel türünde '{1}' ad alanındaki '{0}' ek açıklama öğesi '{4}' özniteliği için '{3}' geçersiz değerine sahip. Değerin '{5}' türünde olması bekleniyordu.
zh_hans: 来自泛型类型“{2}”的命名空间“{1}”的注释元素“{0}”的属性“{4}”具有无效的值“{3}”。该值应属于类型“{5}”。
zh_hant: 對於一般類型 '{2}' 來說，命名空間 '{1}' 的註釋元素 '{0}'，對於屬性 '{4}' 有無效的值 '{3}'。應為類型 '{5}' 的值。

# GenericAnnotationHasInvalidElement
source: Annotation for generic type '{2}' has an invalid element '{0}' from namespace '{1}'.
cs: Poznámka pro obecný typ {2} má neplatný element {0} z oboru názvů {1}.
de: Die Anmerkung für den generischen Typ "{2}" enthält ein ungültiges Element "{0}" aus dem Namespace "{1}".
es: La anotación del tipo genérico "{2}" tiene un elemento "{0}" no válido del espacio de nombres "{1}".
fr: L'annotation pour le type générique '{2}' comporte un élément non valide '{0}' provenant de l'espace de noms '{1}'.
it: L'annotazione per il tipo generico '{2}' contiene un elemento non valido '{0}' dello spazio dei nomi '{1}'.
ja: ジェネリック型 '{2}' の注釈には、名前空間 '{1}' の無効な要素 '{0}' が含まれています。
ko: 제네릭 형식 '{2}'에 대한 주석에 네임스페이스 '{1}'의 잘못된 요소 '{0}'이(가) 있습니다.
pl: Adnotacja dla typu ogólnego „{2}” ma nieprawidłowy element „{0}” z przestrzeni nazw „{1}”.
pt_br: A anotação do tipo genérico '{2}' tem um elemento inválido '{0}' do namespace '{1}'.
ru: Заметка для универсального типа "{2}" имеет недопустимый элемент "{0}" из пространства имен "{1}".
tr: '{2}' genel türü, '{1}' ad alanındaki geçersiz '{0}' öğesini içeriyor.
zh_hans: 泛型类型“{2}”的注释具有来自命名空间“{1}”的无效元素“{0}”。
zh_hant: 一般類型 '{2}' 的註釋有來自命名空間 '{1}' 的無效元素 '{0}'。

# GenericCallbackException
source: A user callback threw an exception. Check the exception stack and inner exception to determine the callback that failed.
cs: Při zpětném volání uživatele došlo k výjimce. Podle zásobníku výjimky a informací o vnitřní výjimce určete, které zpětné volání selhalo.
de: Ein Benutzerrückruf hat eine Ausnahme ausgelöst. Prüfen Sie den Ausnahmestapel und die innere Ausnahme, um den Rückruf zu ermitteln, bei dem ein Fehler aufgetreten ist.
es: La devolución de llamada de un usuario inició una excepción. Compruebe la pila de la excepción y la excepción interna para averiguar la devolución de llamada donde se produjo el error.
fr: Un rappel d'utilisateur a généré une exception. Vérifiez la pile d'exception et l'exception interne pour identifier le rappel non réussi.
it: Un callback utente ha generato un'eccezione. Controllare lo stack dell'eccezione e l'eccezione interna per determinare il callback interessato dal problema.
ja: ユーザー コールバックが例外をスローしました。例外スタックや内部例外を確認して、失敗したコールバックを特定してください。
ko: 사용자 콜백에서 예외가 발생했습니다. 예외 스택 및 내부 예외를 점검하여 오류가 있는 콜백을 확인하세요.
pl: Wywołanie zwrotne użytkownika zgłosiło wyjątek. Sprawdź stos wyjątków i wewnętrzny wyjątek w celu określenia wywołania zwrotnego, które zakończyło się niepowodzeniem.
pt_br: O retorno de chamada de usuário gerou uma exceção. Verifique a pilha de exceção e a exceção interna para determinar o retorno de chamada com falha.
ru: Ответный вызов вызвал исключение. Проверьте стек исключений и внутреннее исключение, чтобы установить факт сбоя обратного вызова.
tr: Kullanıcı geri çağırması özel bir durum oluşturdu. Özel durum yığınını ve iç özel durumu denetleyerek başarısız olan geri çağırmayı belirleyin.
zh_hans: 用户回调引发异常。请检查异常堆栈和内部异常，以确定失败的回调。
zh_hant: 使用者回呼擲回例外狀況。請檢查例外狀況堆疊及內部例外狀況，以判斷失敗的回呼。

# GenericNameBraceMismatch
source: The data contract name '{0}' for type '{1}' has a curly brace '{{' that is not matched with a closing curly brace. Curly braces have special meaning in data contract names - they are used to customize the naming of data contracts for generic types.
cs: Název kontraktu dat {0} pro typ {1} má složenou závorku {{, která není uzavřena. Složené závorky mají v názvech kontraktů dat zvláštní význam – používají se k úpravě názvů kontraktů dat pro obecné typy.
de: Der Datenvertragsname "{0}" für den Typ "{1}" enthält eine geschwungene Klammer "{{", die nicht mit einer schließenden geschwungenen Klammer übereinstimmt. Geschwungene Klammern haben in Datenvertragsnamen eine spezielle Bedeutung: Sie werden verwendet, um die Benennung von Datenverträgen für generische Typen anzupassen.
es: El nombre de contrato de datos "{0}" del tipo "{1}" tiene una llave "{{" sin su correspondiente llave de cierre. Las llaves tienen un significado especial en los nombres de contrato de datos: se usan para personalizar la nomenclatura de los contratos de datos para tipos genéricos.
fr: Le nom de contrat de données '{0}' pour le type '{1}' contient une accolade ouvrante '{{' qui n'est associée à aucune accolade fermante. Les accolades ont une signification particulière dans les noms de contrats de données, elles sont utilisées afin de personnaliser l'affectation de noms aux contrats de données pour les types génériques.
it: Il nome di contratto di dati '{0}' per il tipo '{1}' include una parentesi graffa aperta '{{', ma manca la parentesi graffa chiusa corrispondente. Le parentesi graffe hanno un significato speciale nei nomi di contratto di dati. Vengono infatti usate per personalizzare la denominazione dei contratti di dati per i tipi generici.
ja: 型 '{1}' のデータ コントラクト名 '{0}' には、右中かっこと対応しない中かっこ '{{' が含まれています。中かっこは、データ コントラクト名では特別な意味を持ち、ジェネリック型のデータ コントラクトの名前付けをカスタマイズするために使用されます。
ko: 형식 '{1}'에 대한 데이터 계약 이름 '{0}'에 닫는 중괄호와 일치하지 않는 '{{' 중괄호가 있습니다. 중괄호는 데이터 계약 이름에서 특별한 의미가 있습니다. 즉, 중괄호는 제네릭 형식에 대한 데이터 계약 이름 지정을 사용자 지정하는 데 사용됩니다.
pl: Nazwa kontraktu danych „{0}” dla typu „{1}” zawiera nawias klamrowy „{{” pozbawiony klamry zamykającej. Nawiasy klamrowe mają w nazwach kontraktów danych specjalne znaczenie — są używane do dostosowywania nazw kontraktów danych do typów ogólnych.
pt_br: O nome do contrato de dados '{0}' para o tipo '{1}' tem uma chave '{{' que não corresponde à chave de fechamento. As chaves têm significado especial nos nomes de contrato de dados – elas são usadas para personalizar a nomenclatura de contratos de dados de tipos genéricos.
ru: В имени контракта данных "{0}" для типа "{1}" имеется фигурная скобка "{{", которой не сопоставлена закрывающая скобка. Фигурным скобкам отводится особая роль в именах контрактов данных — они используются для настройки именования контрактов данных для универсальных типов.
tr: '{1}' türü için '{0}' veri anlaşması adında bir kapanış büyük ayracıyla eşleşmeyen '{{' büyük ayracı bulunuyor. Büyük ayraçların veri anlaşması adlarında özel anlamları vardır, genel türler için veri anlaşması adlandırmasını özelleştirmek için kullanılırlar.
zh_hans: 类型“{1}”的数据协定名称“{0}”具有与右花括号不匹配的花括号“{{”。在数据协定名称中花括号具有特殊的含义 - 它们用来自定义用于泛型类型的数据协定的命名。
zh_hant: 類型 '{1}' 的資料合約名稱 '{0}' 有一個大括號 '{{'，但與右大括號不相符。大括號在資料合約名稱中具有特殊意義 - 它們可用於自訂一般類型的資料合約名稱。
