Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NullKnownType
source: One of the known types provided to the serializer via '{0}' argument was invalid because it was null. All known types specified must be non-null values.
cs: Jeden ze známých typů poskytnutých serializátoru přes argument {0} nebyl platný, protože měl hodnotu null. Všechny známé typy musejí mít hodnoty jiné než null.
de: Einer der über das Argument "{0}" für das Serialisierungsmodul bereitgestellten bekannten Typen war NULL und somit ungültig. Alle angegebenen bekannten Typen dürfen nicht NULL sein.
es: Uno de los tipos conocidos proporcionados al serializador a través del argumento "{0}" no era válido por tener un valor nulo. Todos los tipos conocidos especificados deben tener valores que no sean nulos.
fr: L'un des types connus fournis au sérialiseur via l'argument '{0}' est non valide, car il a une valeur null. Tous les types connus spécifiés doivent contenir des valeurs non null.
it: Uno dei tipi noti forniti al serializzatore tramite l'argomento '{0}' non è valido perché è Null. Tutti i tipi noti specificati devono essere valori non Null.
ja: '{0}' 引数を介してシリアライザーに渡された既知の型のいずれかが null のため無効です。指定されるすべての既知の型は、null 以外の値である必要があります。
ko: '{0}' 인수를 통해 직렬 변환기에 제공된 알려진 형식 중 하나가 null이기 때문에 잘못되었습니다. 지정되어 있는 알려진 모든 형식은 null이 아닌 값이어야 합니다.
pl: Jeden ze znanych typów dostarczonych do serializatora za pośrednictwem argumentu „{0}” był nieprawidłowy, ponieważ miał wartość null. Wszystkie określone znane typy muszą mieć wartości inne niż null.
pt_br: Um dos tipos conhecidos fornecido para o serializador por meio do argumento '{0}' era inválido, pois era nulo. Todos os tipos conhecidos especificados devem ter valores diferentes de nulo.
ru: Один из известных типов, предоставленных в аргументе "{0}", недопустим, так как имеет значение null. Все указываемые известные типы должны иметь значения, отличные от null.
tr: Serileştiriciye '{0}' bağımsız değişkeniyle sağlanan bilinen türlerden biri, null olduğundan geçersizdi. Belirtilen tüm bilinen türler boş olmayan değerlere sahip olmalıdır.
zh_hans: 通过“{0}”参数向序列化程序提供的已知类型之一无效，因为该类型为 Null。所有指定的已知类型都必须是非 Null 值。
zh_hant: 透過 '{0}' 引數提供給序列化程式的其中一個已知類型無效，因為它是 Null。指定的所有已知類型必須是非 Null 值。

# NullValueReturnedForGetOnlyCollection
source: The get-only collection of type '{0}' returned a null value. The input stream contains collection items which cannot be added if the instance is null. Consider initializing the collection in the getter.
cs: Kolekce typu pouze pro získání {0} vrátila hodnotu null. Vstupní stream obsahuje položky kolekce, které nelze přidat, pokud má instance hodnotu null. Zvažte možnost inicializovat kolekci v metodě get.
de: Die nur abrufbare Sammlung vom Typ "{0}" hat den Wert NULL zurückgegeben. Der Eingabestream enthält Sammlungselemente, die nicht hinzugefügt werden können, wenn die Instanz den Wert NULL hat. Initialisieren Sie die Sammlung ggf. im Getter.
es: La colección get-only de tipo "{0}" devolvió un valor nulo. El flujo de entrada contiene elementos de colección que no se pueden agregar si la instancia es nula. Considere inicializar la colección en el captador.
fr: La collection get-only de type '{0}' a retourné une valeur null. Le flux d'entrée contient des éléments de collection impossibles à ajouter si l'instance a une valeur null. Initialisez la collection dans la méthode getter.
it: La raccolta con sola funzione di accesso get di tipo '{0}' ha restituito un valore Null. Il flusso di input contiene elementi della raccolta che non è possibile aggiungere se l'istanza è Null. Provare a inizializzare la raccolta nel getter.
ja: 型 '{0}' の get-only コレクションで null 値が返されました。インスタンスが null の場合に追加できないコレクション アイテムが入力ストリームに含まれています。ゲッターのコレクションを初期化してください。
ko: '{0}' 형식의 get-only 컬렉션에서 null 값을 반환했습니다. 입력 스트림에 인스턴스가 null일 경우 추가할 수 없는 컬렉션 항목이 있습니다. getter에서 컬렉션을 초기화해 보세요.
pl: Kolekcja get-only typu „{0}” zwróciła wartość null. Strumień wejściowy zawiera elementy kolekcji, których nie można dodać, jeśli wystąpienie jest wartością null. Rozważ zainicjowanie tej kolekcji w metodzie pobierającej.
pt_br: O tipo de coleção somente obtenção '{0}' retornou um valor nulo. O fluxo de entrada contém itens de coleção que não podem ser adicionados se a instância é nula. Considere inicializar a coleção no getter.
ru: Коллекция типа "{0}", предназначенная только для получения, вернула значение null. Входной поток включает элементы коллекции, которые невозможно добавить, если значением экземпляра является null. Попробуйте инициализировать коллекцию в методе получения.
tr: '{0}' türündeki salt alma koleksiyonu null bir değer döndürdü. Giriş akışı, örnek null olduğunda eklenemeyen koleksiyon öğeleri içeriyor. Koleksiyonu alıcının içinde başlatmayı deneyin.
zh_hans: 类型“{0}”的 get-only 集合返回了 null 值。输入流包含当实例为 null 时，无法添加的集合项。请考虑在 Getter 中初始化集合。
zh_hant: 類型 '{0}' 的 get-only 集合傳回 null 值。輸入資料流包含當執行個體為 null 時無法新增的集合項目。請考慮在 getter 中初始化集合。

# ObjectDeserializer_BadEscape
source: Invalid escape code encountered in a JSON string.
cs: V řetězci JSON byl zjištěn neplatný řídicí kód.
de: In einer JSON-Zeichenfolge wurde eine ungültige Escapesequenz gefunden.
es: Código de escape no válido detectado en una cadena JSON.
fr: Code d'échappement non valide rencontré dans une chaîne JSON.
it: In una stringa JSON è stato rilevato codice di escape non valido.
ja: JSON 文字列で無効なエスケープ コードが見つかりました。
ko: JSON 문자열에 잘못된 이스케이프 코드가 있습니다.
pl: W ciągu JSON wykryto nieprawidłowy kod escape.
pt_br: Código de escape inválido encontrado em uma cadeia de caracteres JSON.
ru: Недопустимый escape-код в строке JSON.
tr: Bir JSON dizesinde geçersiz bir kaçış koduyla karşılaşıldı.
zh_hans: JSON 字符串中遇到无效转义码。
zh_hant: JSON 字串中發現無效的逸出程式碼。

# ObjectDeserializer_IllegalPrimitive
source: '{0}' is not a valid JSON primitive. This error can also occur when extraneous data is present after the JSON data.
cs: {0} není platný primitivní typ formátu JSON. K této chybě může dojít i v případě, že se za daty formátu JSON nalézají i další data.
de: "{0}" ist kein gültiger JSON-Grundtyp. Dieser Fehler kann auch auftreten, wenn nach den JSON-Daten zusätzliche Daten vorhanden sind.
es: "{0}" no es un tipo primitivo JSON válido. Este error puede producirse si hay datos extraños presentes tras los datos de JSON.
fr: '{0}' n'est pas une primitive JSON valide. Cette erreur peut également se produire quand des données étrangères sont présentes à la suite des données JSON.
it: '{0}' non è una primitiva JSON valida. Questo errore può verificarsi anche quando dopo i dati JSON sono presenti dati estranei.
ja: '{0}' は有効な JSON プリミティブではありません。このエラーは、JSON データの後に無関係なデータが存在するときにも発生する可能性があります。
ko: '{0}'은(는) 유효한 JSON 기본 형식이 아닙니다. 이 오류는 JSON 데이터 뒤에 불필요한 데이터가 있는 경우에도 발생할 수 있습니다.
pl: „{0}” nie jest poprawnym elementem podstawowym JSON. Ten błąd może też wystąpić, gdy po danych JSON występują nadmiarowe dane.
pt_br: '{0}' não é uma primitiva JSON válida. Esse erro também pode ocorrer quando dados incorretos são encontrados após os dados JSON.
ru: "{0}" не является допустимым примитивом JSON. Эта ошибка может также возникнуть при наличии избыточных данных после данных JSON.
tr: '{0}' geçerli bir JSON temel türü değil. Bu hata, JSON verilerinden sonra fazla veri olduğunda da gerçekleşebilir.
zh_hans: “{0}”不是有效的 JSON 基元。当 JSON 数据后存在无关数据时，也会发生此错误。
zh_hant: '{0}' 是無效的 JSON 基本項目。當 JSON 資料後面出現沒有直接關聯的資料時，也會發生此錯誤。

# ObjectDeserializer_InvalidArrayExtraComma
source: JSON array ended with a trailing comma.
cs: Pole JSON bylo ukončeno čárkou.
de: Das JSON-Array endete mit einem nachgestellten Komma.
es: La matriz de JSON finalizó con una coma.
fr: Le tableau JSON s'est terminé par une virgule.
it: La matrice JSON è terminata con una virgola finale.
ja: JSON 配列の末尾がコンマになっています。
ko: JSON 배열이 뒤에 오는 쉼표로 종료되었습니다.
pl: Tablica JSON została zakończona końcowym przecinkiem.
pt_br: A matriz JSON terminou com um vírgula à direita.
ru: Массив JSON завершается конечной запятой.
tr: JSON dizesi sonda bir virgülle bitti.
zh_hans: JSON 数组以尾随逗号结尾。
zh_hant: JSON 陣列以尾端逗號結尾。

# ObjectDeserializer_InvalidMemberName
source: Invalid member name encountered in a JSON object.
cs: V objektu JSON se zjistil neplatný název členu.
de: In einem JSON-Objekt wurde ein ungültiger Membername gefunden.
es: Se encontró un nombre de miembro no válido en un objeto JSON.
fr: Nom de membre non valide rencontré dans un objet JSON.
it: In un oggetto JSON è stato rilevato un nome di membro non valido.
ja: JSON オブジェクトに無効なメンバー名が見つかりました。
ko: JSON 개체에 잘못된 멤버 이름이 있습니다.
pl: W obiekcie JSON napotkano nieprawidłową nazwę składowej.
pt_br: Nome de membro inválido encontrado em um objeto JSON.
ru: Недопустимое имя члена в объекте JSON.
tr: Bir JSON nesnesinde geçersiz üye adıyla karşılaşıldı.
zh_hans: JSON 对象中遇到无效的成员名称。
zh_hant: JSON 物件中發現無效的成員名稱。

# ObjectDeserializer_StringNotQuoted
source: An internal error has occurred. JSON string not properly quoted.
cs: Došlo k vnitřní chybě. Řetězec JSON není správně uzavřen do uvozovek.
de: Ein interner Fehler ist aufgetreten. Eine JSON-Zeichenfolge ist nicht korrekt in Anführungszeichen gesetzt.
es: Error interno. La cadena JSON no está correctamente entrecomillada.
fr: Une erreur interne s'est produite. La chaîne JSON n'est pas correctement mise entre guillemets.
it: Si è verificato un errore interno. La stringa JSON non è delimitata in modo corretto.
ja: 内部エラーが発生しました。JSON 文字列が正しく引用符で囲まれていません。
ko: 내부 오류가 발생했습니다. JSON 문자열이 제대로 따옴표로 묶여 있지 않습니다.
pl: Wystąpił błąd wewnętrzny. Ciąg JSON nie jest poprawnie ujęty w cudzysłów.
pt_br: Erro interno. A cadeia de caracteres JSON não está corretamente entre aspas.
ru: Произошла внутренняя ошибка. Неправильные кавычки для строки JSON.
tr: Bir iç hata oluştu. JSON dizesi düzgün alıntılanmadı.
zh_hans: 出现内部错误。JSON 字符串未正确引用。
zh_hant: 發生內部錯誤。未正確地以引號括住 JSON 字串。

# ObjectDeserializer_UnexpectedToken
source: Unexpected character encountered in JSON. Expected '{1}', got '{0}'.
cs: Ve formátu JSON byl zjištěn neočekávaný znak. Očekávaný znak: {1}, obdrženo: {0}
de: In JSON wurde ein unerwartetes Zeichen gefunden. Erwartet wurde "{1}", gefunden wurde "{0}".
es: Se ha encontrado un carácter no esperado en JSON. Se esperaba "{1}"; se encontró "{0}".
fr: Caractère inattendu rencontré dans la chaîne JSON. '{1}' attendu, '{0}' reçu.
it: È stato rilevato un carattere imprevisto in JSON. Previsto: '{1}'. Restituito: '{0}'.
ja: JSON に予期しない文字が見つかりました。'{1}' が必要でしたが、'{0}' が取得されました。
ko: JSON에 예기치 않은 문자가 있습니다. '{1}'이(가) 필요한데 '{0}'을(를) 얻었습니다.
pl: W kodzie JSON napotkano nieoczekiwany znak. Oczekiwano „{1}”, uzyskano „{0}”.
pt_br: Caractere inesperado encontrado no JSON. Esperado '{1}', recebido '{0}'.
ru: Непредвиденный символ в JSON. Ожидается "{1}", получен "{0}".
tr: JSON'da beklenmeyen karakterle karşılaşıldı. '{1}' bekleniyordu, '{0}' alındı.
zh_hans: JSON 中遇到意外字符。预期“{1}”，得到“{0}”。
zh_hant: JSON 中發現未預期的字元。應為 '{1}'，但得到 '{0}'。

# ObjectDeserializer_UnterminatedString
source: Unterminated JSON string encountered. JSON strings must start with a single or double quote character and end with the same character.
cs: Byl zjištěn neukončený řetězec JSON. Řetězce JSON musí začínat znakem jednoduché nebo dvojité uvozovky a končit stejným znakem.
de: Eine nicht abgeschlossene JSON-Zeichenfolge wurde gefunden. JSON-Zeichenfolgen müssen mit einem einfachen oder doppelten Anführungszeichen beginnen und mit demselben Zeichen enden.
es: Se ha encontrado una cadena JSON no terminada. Las cadenas JSON deben comenzar con un carácter de comillas dobles o sencillas y terminar con el mismo carácter.
fr: Chaîne JSON inachevée rencontrée. Les chaînes JSON doivent commencer par un guillemet simple ou double, et finir par le même caractère.
it: È stata rilevata una stringa JSON senza terminazione. Le stringhe JSON devono iniziare con un carattere di virgoletta singola o doppia e terminare con lo stesso carattere.
ja: 未終了の JSON 文字列が見つかりました。JSON 文字列は、単一引用符または二重引用符で始まり、同じ文字で終了する必要があります。
ko: 종결되지 않은 JSON 문자열이 있습니다. JSON 문자열은 작은따옴표 또는 큰따옴표 문자로 시작하고 동일한 문자로 끝나야 합니다.
pl: Napotkano niezakończony ciąg JSON. Ciągi JSON muszą się rozpoczynać znakiem pojedynczego lub podwójnego cudzysłowu oraz kończyć takim samym znakiem.
pt_br: Cadeia de caracteres JSON não finalizada encontrada. As cadeias de caracteres JSON devem começar com um caractere de aspa simples ou dupla e terminar com o mesmo caractere.
ru: Обнаружена незавершенная строка JSON. Строки JSON должны начинаться с одинарной или двойной кавычки и заканчиваться тем же символом.
tr: Sonlandırılmayan JSON dizesiyle karşılaşıldı. JSON dizeleri tek veya çift tırnak karakteriyle başlamalı ve aynı karakterle bitmelidir.
zh_hans: 遇到未终止的 JSON 字符串。JSON 字符串必须以单引号或双引号字符开头，并以相同的字符结尾。
zh_hant: 發現未終止的 JSON 字串。JSON 字串必須以單引號或雙引號開頭，並以相同的字元結尾。

# ObjectSerializer_DictionaryNotSupported
source: An internal error has occurred. JSON dictionary type {0} not supported.
cs: Došlo k vnitřní chybě. Typ slovníku JSON {0} není podporován.
de: Ein interner Fehler ist aufgetreten. Der JSON-Wörterbuchtyp {0} wird nicht unterstützt.
es: Error interno. Tipo de diccionario de JSON {0} no admitido.
fr: Une erreur interne s'est produite. Le type de dictionnaire JSON {0} n'est pas pris en charge.
it: Si è verificato un errore interno. Il tipo di dizionario JSON {0} non è supportato.
ja: 内部エラーが発生しました。JSON 辞書型 {0} はサポートされていません。
ko: 내부 오류가 발생했습니다. JSON 사전 형식 {0}은(는) 지원되지 않습니다.
pl: Wystąpił błąd wewnętrzny. Typ słownika JSON {0} nie jest obsługiwany.
pt_br: Erro interno. Não há suporte para o tipo de dicionário JSON {0}.
ru: Произошла внутренняя ошибка. Тип словаря JSON {0} не поддерживается.
tr: Bir iç hata oluştu. JSON sözlük türü {0} desteklenmiyor.
zh_hans: 出现内部错误。不支持 JSON 字典类型 {0}。
zh_hant: 發生內部錯誤。不支援 JSON 字典類型 {0}。

# ObjectTableOverflow
source: An internal error has occurred. Object table overflow. This could be caused by serializing or deserializing extremely large object graphs.
cs: Došlo k vnitřní chybě. Přetečení tabulky objektů. Může to být způsobeno serializací nebo deserializací velmi velkých grafů objektů.
de: Ein interner Fehler ist aufgetreten. Ein Überlauf der Objekttabelle hat stattgefunden. Dies kann auf die Serialisierung oder Deserialisierung extrem großer Objektgraphen zurückzuführen sein.
es: Error interno. Desbordamiento de la tabla de objetos. La causa puede ser la serialización o deserialización de gráficos de objetos de gran tamaño.
fr: Une erreur interne s'est produite. Dépassement de la capacité de la table Object. Ceci est peut-être dû à la sérialisation ou à la désérialisation de graphiques d'objets extrêmement volumineux.
it: Si è verificato un errore interno. Overflow nella tabella degli oggetti. Il problema potrebbe essere causato dalla serializzazione o deserializzazione di oggetti grafici molto grandi.
ja: 内部エラーが発生しました。オブジェクト テーブルのオーバーフローです。この原因としては、非常に大きなオブジェクト グラフをシリアル化またはシリアル化解除したことが考えられます。
ko: 내부 오류가 발생했습니다. 개체 테이블이 오버플로되었습니다. 너무 큰 개체 그래프를 직렬화 또는 deserialize했기 때문일 수 있습니다.
pl: Wystąpił błąd wewnętrzny. Przepełnienie tabeli obiektów. Może to być spowodowane serializacją lub deserializacją bardzo dużych wykresów obiektów.
pt_br: Erro interno. Estouro de tabela de objetos. Isso pode ser causado pela serialização ou desserialização de grafos de objeto extremamente grandes.
ru: Произошла внутренняя ошибка. Переполнение таблицы объектов. Это могло быть вызвано сериализацией или десериализацией чрезмерно больших графов объектов.
tr: Bir iç hata oluştu. Nesne tablosu taşması gerçekleşti. Bunun nedeni, çok büyük nesne graflarının serileştirilmesi ya da seri durumdan çıkarılması olabilir.
zh_hans: 出现内部错误。对象表溢出。这可能是由于序列化或反序列化过大的对象图而引起的。
zh_hant: 發生內部錯誤。物件資料表溢位。可能是因為將相當大的物件圖形序列化或還原序列化所導致。

# OffsetExceedsBufferSize
source: The specified offset exceeds the buffer size ({0} bytes).
cs: Zadaný posun překračuje velikost vyrovnávací paměti (počet bajtů: {0}).
de: Der angegebene Offset überschreitet die Puffergröße ({0} Bytes).
es: El desplazamiento especificado supera el tamaño del búfer ({0} bytes).
fr: Le décalage spécifié est supérieur à la taille de la mémoire tampon ({0} octets).
it: L'offset specificato supera le dimensioni del buffer ({0} byte).
ja: 指定したオフセットは、バッファー サイズ ({0} バイト) を超えています。
ko: 지정된 오프셋이 버퍼 크기({0}바이트)를 초과합니다.
pl: Określone przesunięcie przekracza rozmiar buforu ({0} B).
pt_br: O deslocamento especificado excede o tamanho do buffer ({0} bytes).
ru: Заданное смещение превышает размер буфера ({0} байт).
tr: Belirtilen uzaklık arabellek boyutunu ({0} bayt) aşıyor.
zh_hans: 指定的偏移量超出了缓冲区大小({0} 个字节)。
zh_hant: 指定的位移超過緩衝區大小 ({0} 個位元組)。

# OrderCannotBeNegative
source: Property 'Order' in DataMemberAttribute attribute cannot be a negative number.
cs: Vlastnost Order v atributu DataMemberAttribute nemůže být záporné číslo.
de: Die Order-Eigenschaft im DataMemberAttribute-Attribut darf keine negative Zahl sein.
es: La propiedad "Order" del atributo DataMemberAttribute no puede ser un número negativo.
fr: La propriété 'Order' dans l'attribut DataMemberAttribute ne peut pas être un nombre négatif.
it: La proprietà 'Order' dell'attributo DataMemberAttribute non può essere un numero negativo.
ja: DataMemberAttribute 属性のプロパティ 'Order' に負の数を指定することはできません。
ko: DataMemberAttribute 특성의 'Order' 속성은 음수일 수 없습니다.
pl: Właściwość „Order” w atrybucie DataMemberAttribute nie może być liczbą ujemną.
pt_br: A propriedade 'Order' no atributo DataMemberAttribute não pode ser um número negativo.
ru: Значение свойства Order в атрибуте DataMemberAttribute не может быть отрицательным.
tr: DataMemberAttribute özniteliğindeki özellik 'Sırası' negatif bir sayı olamaz.
zh_hans: DataMemberAttribute 特性中的属性 "Order" 不能为负数。
zh_hant: DataMemberAttribute 屬性中的屬性 'Order' 不可以是負數。

# OutParametersMustBeByRefTypeReceived
source: Out parameters must be ByRef. Type received: '{0}'.
cs: Výstupní parametry musejí být typu ByRef. Přijatý typ: {0}.
de: Out-Parameter müssen mit ByRef deklariert werden. Empfangener Typ: "{0}".
es: Los parámetros de salida deben ser ByRef. Tipo recibido: "{0}".
fr: Les paramètres de sortie doivent être ByRef. Type reçu : '{0}'.
it: I parametri Out devono essere ByRef. Tipo ricevuto: '{0}'.
ja: 外部パラメーターは ByRef である必要があります。受信した型: '{0}'。
ko: Out 매개 변수는 ByRef여야 합니다. 다음 형식이 수신되었습니다. '{0}'.
pl: Parametry wyjściowe muszą być typu ByRef. Otrzymany typ: „{0}”.
pt_br: Os parâmetros de saída devem ser ByRef. Tipo recebido: '{0}'.
ru: Выходные параметры должны иметь тип ByRef. Полученный тип: "{0}".
tr: Out parametreleri ByRef olmalıdır. Alınan tür: '{0}'.
zh_hans: Out 参数必须为 ByRef。接收到的类型为:“{0}”。
zh_hant: Out 參數必須是 ByRef，但收到的類型: '{0}'.

# ParameterCountMismatch
source: Invalid number of parameters to call method '{0}'. Expected '{1}' parameters, but '{2}' were provided.
cs: Neplatný počet parametrů pro volání metody {0}. Očekáván byl tento počet parametrů: {1}. Počet poskytnutých parametrů je však {2}.
de: Ungültige Anzahl von Parametern zum Aufrufen der {0}-Methode. {1} Parameter wurden erwartet, aber {2} Parameter wurden bereitgestellt.
es: Número de parámetros no válido para la llamada al método "{0}". Se esperaban "{1}" parámetros, pero se proporcionaron "{2}".
fr: Nombre non valide de paramètres pour appeler la méthode '{0}'. '{1}' paramètres attendus contre '{2}' fournis.
it: Il numero di parametri del metodo di chiamata '{0}' non è valido. Sono previsti '{1}' parametri, ma ne sono stati specificati '{2}'.
ja: メソッド '{0}' を呼び出すためのパラメーターの数が無効です。'{1}' 個のパラメーターが必要ですが、'{2}' 個が指定されました。
ko: '{0}' 메서드를 호출하기 위한 매개 변수 수가 잘못되었습니다. '{1}'개의 매개 변수가 필요하지만 '{2}'개가 제공되었습니다.
pl: Nieprawidłowa liczba parametrów do wywołania metody „{0}”. Oczekiwano „{1}” parametrów, ale dostarczono „{2}”.
pt_br: Número inválido de parâmetros para chamar o método '{0}'. Espera-se '{1}' parâmetros, mas '{2}' foram fornecidos.
ru: Неверное количество параметров для вызова метода "{0}". Ожидалось "{1}" параметров, предоставлено "{2}".
tr: '{0}' metodunu çağıran geçersiz sayıda parametre var. Beklenen '{1}' parametre, ancak '{2}' sağlandı.
zh_hans: 调用方法“{0}”的参数数目无效。需要“{1}”个参数，但却提供了“{2}”个。
zh_hant: 用於呼叫方法 '{0}' 的參數數目無效。應為 '{1}' 個參數，但提供了 '{2}' 個參數。

# PartialTrustCollectionContractAddMethodNotPublic
source: The collection data contract type '{0}' cannot be deserialized in partial trust because the method '{1}' is not public.
cs: Typ kontraktu dat kolekce {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože metoda {1} není veřejná.
de: Der Sammlungsdatenvertragstyp "{0}" darf bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil die Methode "{1}" nicht öffentlich ist.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque el método "{1}" no es público.
fr: Le type de contrat de données de collection '{0}' ne peut pas être désérialisé en confiance partielle, car la méthode '{1}' n'est pas publique.
it: Il tipo di contratto di dati della raccolta '{0}' non può essere deserializzato in attendibilità parziale perché il metodo '{1}' non è pubblico.
ja: メソッド '{1}' がパブリックでないため、部分的な信頼でコレクション データ コントラクト型 '{0}' のシリアル化を解除できません。
ko: '{1}' 메서드가 public이 아니기 때문에 컬렉션 데이터 계약 형식 '{0}'을(를) 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych kolekcji „{0}” w częściowej relacji zaufania, ponieważ metoda „{1}” nie jest metodą publiczną.
pt_br: O tipo de contrato de dados da coleção '{0}' não pode ser desserializado em confiança parcial, pois o método '{1}' não é público.
ru: Тип контракта данных коллекции "{0}" не может быть десериализован при отношении частичного доверия, поскольку метод не является "{1}" общим.
tr: '{1}' metodu genel olmadığından, '{0}' koleksiyon veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化集合数据约定类型“{0}”，因为方法“{1}”不是公共方法。
zh_hant: 集合資料合約類型 '{0}' 無法在部分信任中還原序列化，因為方法 '{1}' 並非公用的方法。

# PartialTrustCollectionContractNoPublicConstructor
source: The collection data contract type '{0}' cannot be deserialized in partial trust because it does not have a public parameterless constructor.
cs: Typ kontraktu dat kolekce {0} nemůže být rekonstruován v částečném vztahu důvěryhodnosti, protože nemá veřejný konstruktor bez parametrů.
de: Der Sammlungsdatenvertragstyp "{0}" kann bei teilweiser Vertrauenswürdigkeit nicht deserialisiert sein, weil er keinen öffentlichen parameterlosen Konstruktor hat.
es: El tipo de contrato de datos de colección "{0}" no se puede deserializar en una confianza parcial porque no tiene ningún constructor público y sin parámetros.
fr: Le type de contrat de données de collection '{0}' ne peut pas être désérialisé en confiance partielle, car il n'a pas de constructeur sans paramètre public.
it: Il tipo di contratto di dati della raccolta '{0}' non può essere deserializzato in attendibilità parziale perché non contiene un costruttore pubblico senza parametri.
ja: パブリックなパラメーターなしのコンストラクターがないため、部分的な信頼でコレクション データ コントラクト型 '{0}' のシリアル化を解除できません。
ko: 컬렉션 데이터 계약 형식 '{0}'에 매개 변수가 없는 public 생성자가 없기 때문에 해당 형식을 부분 신뢰에서 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu kontraktu danych kolekcji „{0}” w częściowej relacji zaufania, ponieważ nie ma on publicznego konstruktora bez parametrów.
pt_br: O tipo de contrato de dados da coleção '{0}' não pode ser desserializado em confiança parcial, pois ele não tem um construtor público sem parâmetros.
ru: Тип контракта данных коллекции "{0}" не может быть десериализован при отношении частичного доверия, поскольку не содержит общий конструктор без параметров.
tr: Genel parametresiz oluşturucusu olmadığından, '{0}' koleksiyon veri anlaşması türü kısmi güvende seri durumdan çıkarılamıyor.
zh_hans: 无法在部分信任中反序列化集合数据约定类型“{0}”，因为它没有公共的无参数构造函数。
zh_hant: 集合資料合約類型 '{0}' 無法在部分信任中還原序列化，因為它沒有公用的無參數建構函式。
