Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# JsonUnexpectedAttributeValue
source: The attribute 'type' must have one of the following strings as its values: 'string', 'number', 'array', 'object', 'null', or 'boolean'. Encountered unexpected value '{0}'
cs: Atribut type musí mít jako hodnotu nastaven některý z následujících řetězců: string, number, array, object, null nebo boolean. Byla zjištěna neočekávaná hodnota {0}.
de: Das Attribut "type" muss eine der folgenden Zeichenfolgen als Werte aufweisen: "string", "number", "array", "object", "null" oder "boolean". Ein unerwarteter Wert "{0}" wurde gefunden.
es: El atributo "type" debe tener una de las siguientes cadenas como valor: "string", "number", "array", "object", "null" o "boolean". Valor inesperado "{0}"
fr: L'attribut 'type' doit avoir une valeur parmi l'une des chaînes suivantes : 'string', 'number', 'array', 'object', 'null' ou 'boolean'. Valeur '{0}' inattendue
it: Il valore dell'attributo 'type' deve essere una delle stringhe seguenti: 'string', 'number', 'array', 'object', 'null' o 'boolean'. È stato rilevato il valore '{0}' imprevisto
ja: 属性 'type' の値には、次の文字列のうちの 1 つを指定しなければなりません: 'string'、'number'、'array'、'object'、'null'、または 'boolean'。予期しない値 '{0}' が見つかりました
ko: 'type' 특성은 'string', 'number', 'array', 'object', 'null' 또는 'boolean' 문자열 중 하나를 값으로 가져야 합니다. 예기치 않은 값 '{0}'이(가) 발견되었습니다.
pl: Wartością atrybutu „type” musi być jeden z następujących ciągów: „string”, „number”, „array”, „object”, „null” lub „boolean”. Napotkano nieoczekiwaną wartość „{0}”
pt_br: O atributo 'type' deve ter uma das cadeias de caracteres a seguir como seus valores: 'string', 'number', 'array', 'object', 'null' ou 'boolean'. Valor inesperado encontrado '{0}'
ru: Атрибут type должен иметь в качестве значений одну из следующих строк: string, number, array, object, NULL или boolean. Обнаружено непредвиденное значение "{0}".
tr: 'Tür' özniteliği değer olarak şu dizelerden birine sahip olmalıdır: 'string', 'number', 'array', 'object', 'null' veya 'boolean'. Beklenmeyen '{0}' değeriyle karşılaşıldı
zh_hans: 特性 "type" 必须使用以下字符串之一作为其值: "string"、"number"、"array"、"object"、"null" 或 "boolean"。遇到意外值“{0}”
zh_hant: 屬性 'type' 必須具有下列其中一個字串作為其值: 'string'、'number'、'array'、'object'、'null' 或 'boolean'。發生未預期的值 '{0}'

# JsonUnexpectedEndOfFile
source: Unexpected end of file.
cs: Neočekávaný konec souboru
de: Unerwartetes Dateiende.
es: Final de archivo inesperado.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりです。
ko: 예기치 않은 파일의 끝입니다.
pl: Nieoczekiwany koniec pliku.
pt_br: Final de arquivo inesperado.
ru: Непредусмотренный конец файла.
tr: Beklenmeyen dosya sonu.
zh_hans: 意外的文件尾。
zh_hant: 未預期的檔案結尾。

# JsonUnsupportedForIsReference
source: The type '{0}' cannot be serialized to JSON because its IsReference setting is '{1}'. The JSON format does not support references because there is no standardized format for representing references. To enable serialization, disable the IsReference setting on the type or an appropriate parent class of the type.
cs: Typ {0} nelze serializovat do třídy JSON, protože jeho nastavení IsReference je {1}. Formát JSON nepodporuje odkazy, protože neexistuje standardizovaný formát pro uvádění odkazů. Pokud chcete umožnit serializaci, deaktivujte nastavení IsReference u daného typu nebo odpovídající nadřazené třídy typu.
de: Der Typ "{0}" kann nicht in JSON serialisiert werden, da seine IsReference-Einstellung "{1}" ist. Das JSON-Format unterstützt keine Verweise, da für die Darstellung von Verweisen kein standardisiertes Format verfügbar ist. Zum Aktivieren der Serialisierung deaktivieren Sie die IsReference-Einstellung für den Typ oder eine geeignete übergeordnete Klasse des Typs.
es: El tipo "{0}" no se puede deserializar en JSON porque su configuración de IsReference es "{1}". El formato JSON no admite referencias porque no hay un formato estandarizado para representar referencias. Al habilitar la serialización, deshabilite la configuración IsReference en el tipo o en una clase primaria adecuada del tipo.
fr: Le type '{0}' ne peut pas être sérialisé vers JSON, car son paramètre IsReference est '{1}'. Le format JSON ne prend pas en charge les références, car il n'existe aucun format de représentation des références normalisé. Pour activer la sérialisation, désactivez le paramètre IsReference sur le type ou une classe parent appropriée du type.
it: Non è possibile serializzare in JSON il tipo '{0}' perché l'impostazione IsReference è '{1}'. Il formato JSON non supporta i riferimenti perché non esiste un formato standardizzato per rappresentare i riferimenti. Per abilitare la serializzazione, disabilitare l'impostazione IsReference del tipo o di una classe padre del tipo appropriata.
ja: 型 '{0}' は、IsReference 設定が '{1}' であるため、JSON にシリアル化できません。JSON 形式は、参照を表示するための標準化された形式がないため、参照をサポートしません。シリアル化を有効にするには、型の IsReference 設定または型の適切な親クラスを無効にしてください。
ko: IsReference 설정이 '{1}'이므로 '{0}' 형식을 JSON으로 직렬화할 수 없습니다. 참조를 나타내는 표준화된 형식이 없기 때문에 JSON 형식은 참조를 지원하지 않습니다. serialization이 가능하도록 하려면 해당 형식의 IsReference 설정 또는 적절한 부모 클래스를 사용하지 않음으로 설정하세요.
pl: Nie można serializować typu „{0}” do notacji JSON, ponieważ ma on ustawienie IsReference o wartości „{1}”. Format notacji JSON nie obsługuje odwołań, ponieważ nie istnieje ustandaryzowany format służący do reprezentowania odwołań. Aby włączyć serializację, wyłącz ustawienie IsReference w typie lub odpowiedniej klasie nadrzędnej typu.
pt_br: O tipo '{0}' não pode ser serializado no JSON porque sua configuração IsReference é '{1}'. O formato JSON não dá suporte a referências porque não há um formato padronizado para representar referências. Para habilitar a serialização, desabilite a configuração IsReference no tipo ou em uma classe pai apropriada do tipo.
ru: Тип "{0}" не может быть сериализован в JSON, поскольку его параметр IsReference имеет значение "{1}". Формат JSON не поддерживает ссылки, поскольку для представления ссылок отсутствует стандартизированный формат. Чтобы включить сериализацию, отключите параметр IsReference для типа или соответствующего родительского класса типа.
tr: IsReference ayarı '{1}' olduğundan, '{0}' türü JSON'a serileştirilemiyor. Başvuruları göstermek için standartlaştırılmış biçim olmadığından, JSON biçimi başvuruları desteklemiyor. Serileştirmeyi etkinleştirmek için, türde veya türün uygun bir üst sınıfında IsReference ayarını devre dışı bırakın.
zh_hans: 无法将“{0}”类型序列化为 JSON，因为它的 IsReference 设置是“{1}”。JSON 格式不支持引用，因为不存在表示引用的标准化格式。若要启用序列化，请禁用此类型的 IsReference 设置，或禁用此类型的适当父类。
zh_hant: 類型 '{0}' 無法序列化為 JSON，因為其 IsReference 設定為 '{1}'。JSON 格式不支援參考，因為沒有標準化的格式可表示參考資料。若要啟用序列化，請在類型上或類型的適當父類別上停用 IsReference 設定。

# JsonWriteArrayNotSupported
source: To write JSON arrays, use XML writer methods to write the attribute type="array" followed by methods like WriteStartElement (with the local name "item"), WriteAttributeString, and WriteEndElement to write the JSON array items.
cs: Pokud chcete zapisovat pole JSON, použijte metodu zapisovacího modulu XML a zapište typ atributu array a za ním uveďte metody typu WriteStartElement (s místním názvem item), WriteAttributeString nebo WriteEndElement zajišťující zápis položek pole JSON.
de: Verwenden Sie zum Schreiben von JSON-Arrays XML-Writer-Methoden, um das Attribut type="array" zu schreiben, gefolgt von Methoden wie WriteStartElement (mit dem lokalen Namen "item"), WriteAttributeString und WriteEndElement, um die JSON-Arrayelemente zu schreiben.
es: Para escribir matrices JSON, use métodos de escritor XML para escribir el tipo de atributo="array" seguido de métodos como WriteStartElement (con el nombre local "item"), WriteAttributeString y WriteEndElement para escribir los elementos de matriz JSON.
fr: Pour écrire des tableaux JSON, utilisez des méthodes d'enregistrement XML pour écrire l'attribut type="array" suivi de méthodes, telles que WriteStartElement (avec le nom local "item"), WriteAttributeString et WriteEndElement, afin d'écrire les éléments de tableaux JSON.
it: Per scrivere matrici JSON, usare metodi writer XML per scrivere l'attributo type="array" seguito da metodi come WriteStartElement (con nome locale "item"), WriteAttributeString e WriteEndElement per scrivere gli elementi delle matrici JSON.
ja: JSON 配列を書き込むには、XML ライター メソッドを使用して、type="array" 属性を書き込み、その後に WriteStartElement (ローカル名 "項目" 付き)、WriteAttributeString、WriteEndElement などのメソッドを続けて、JSON 配列項目を書き込みます。
ko: JSON 배열을 쓰려면 XML 기록기 메서드를 사용하여 type="array" 특성을 쓴 다음 WriteStartElement(로컬 이름 "item"), WriteAttributeString 및 WriteEndElement와 같은 메서드를 덧붙여 JSON 배열 항목을 쓰면 됩니다.
pl: Aby zapisać tablice notacji JSON, użyj metod składnika zapisywania XML w celu zapisania atrybutu type="array", a następnie użyj metod, takich jak WriteStartElement (z nazwą lokalną item), WriteAttributeString i WriteEndElement, aby zapisać elementy tablicy notacji JSON.
pt_br: Para gravar matrizes JSON, use métodos do gravador XML para gravar o atributo type="array" seguido por métodos como WriteStartElement (com o nome local "item"), WriteAttributeString e WriteEndElement para gravar os itens da matriz JSON.
ru: Чтобы записать массивы JSON, используйте методы модуля записи XML для записи атрибутов type="array", после чего необходимо указать такие методы, как WriteStartElement (с локальным именем item), WriteAttributeString и WriteEndElement для записи элементов массивов JSON.
tr: JSON dizileri yazmak için, öznitelik türü="array" yazmak üzere XML yazıcısı metotlarını ve ardından JSON dizisi öğelerini yazmak üzere WriteStartElement ("item" yerel adıyla), WriteAttributeString ve WriteEndElement gibi metotları kullanın.
zh_hans: 若要写入 JSON 数组，请使用 XML 编写器方法来写入类型为 "array" 的特性，然后用 WriteStartElement (本地名称为 "item")、WriteAttributeString 和 WriteEndElement 等方法写入 JSON 数组项。
zh_hant: 若要寫入 JSON 陣列，可以使用 XML 寫入器方法來寫入屬性 type="array"，其後緊接著方法 (例如 WriteStartElement (本機名稱為 "item")、WriteAttributeString 及 WriteEndElement)，以寫入 JSON 陣列項目。

# JsonWriterClosed
source: The writer is closed.
cs: Zapisovací modul je uzavřen.
de: Der Writer ist geschlossen.
es: El escritor está cerrado.
fr: Le writer est fermé.
it: Il writer è chiuso.
ja: ライターが閉じています。
ko: 기록기가 닫혀 있습니다.
pl: Składnik zapisywania jest zamknięty.
pt_br: O gravador está fechado.
ru: Модуль записи закрыт.
tr: Yazıcı kapalı.
zh_hans: 编写器已关闭。
zh_hant: 寫入器已關閉。

# JsonXmlInvalidDeclaration
source: XML declaration can only be written at the beginning of the document.
cs: Deklaraci XML lze zapsat jen na začátku dokumentu.
de: Die XML-Deklaration kann nur am Anfang des Dokuments geschrieben werden.
es: La declaración XML solo se puede escribir al comienzo del documento.
fr: Une déclaration XML ne peut être écrite qu'au début du document.
it: La dichiarazione XML può essere scritta solo all'inizio del documento.
ja: XML 宣言を記述できるのはドキュメントの先頭のみです。
ko: XML 선언은 문서의 시작 부분에만 쓸 수 있습니다.
pl: Deklarację XML można zapisać tylko na początku dokumentu.
pt_br: A declaração XML pode ser gravada apenas no início do documento.
ru: XML-объявление может быть записано только в начале документа.
tr: XML bildirimi, yalnızca belgenin başında yazılabilir.
zh_hans: 只能在文档的开头写入 XML 声明。
zh_hant: XML 宣告只可寫入文件開頭。

# JsonXmlProcessingInstructionNotSupported
source: Processing instructions (other than the XML declaration) are not supported.
cs: Instrukce zpracování (kromě deklarace XML) nejsou podporovány.
de: Verarbeitungsanweisungen (mit Ausnahme der XML-Deklaration) werden nicht unterstützt.
es: No se admiten las instrucciones de procesamiento (excepto la declaración XML).
fr: Les instructions de traitement (autres que la déclaration XML) ne sont pas prises en charge.
it: Le istruzioni di elaborazione che non siano la dichiarazione XML non sono supportate.
ja: 命令の処理 (XML 宣言は除く) はサポートされていません。
ko: XML 선언 이외의 처리 명령은 지원되지 않습니다.
pl: Przetwarzanie instrukcji (innych niż deklaracja XML) jest nieobsługiwane.
pt_br: Não há suporte para instruções de processamento (além da declaração XML).
ru: Другие инструкции по обработке (кроме XML-декларации) не поддерживаются.
tr: Yönergelerin (XML bildirimi dışındaki) işlenmesi desteklenmez.
zh_hans: 不支持处理指令(非 XML 声明)。
zh_hant: 不支援處理指示 (XML 宣告以外的項目)。

# KeyTypeCannotBeParsedInSimpleDictionary
source: The dictionary of type '{0}' cannot be deserialized as a simple dictionary because its key type '{1}' does not have a public static Parse method.
cs: Slovník typu {0} nelze deserializovat jako jednoduchý slovník, protože jeho typ klíče {1} nemá veřejnou statickou metodu Parse.
de: Das Wörterbuch vom Typ "{0}" kann nicht als einfaches Wörterbuch deserialisiert werden, da sein Schlüsseltyp "{1}" nicht über eine öffentliche statische Parse-Methode verfügt.
es: El diccionario de tipo "{0}" no se puede deserializar como un diccionario sencillo porque su tipo de clave "{1}" no dispone de un método de análisis público estático.
fr: Impossible de désérialiser le dictionnaire de type '{0}' en dictionnaire simple, car son type de clé '{1}' n'a pas de méthode Parse statique publique.
it: Non è possibile deserializzare il dizionario di tipo '{0}' come un dizionario semplice perché il tipo di chiave '{1}' non contiene un metodo Parse statico pubblico.
ja: 種類が '{0}' の辞書は、そのキーの種類 '{1}' にパブリックな静的 Parse メソッドが含まれていないため単純な辞書としてシリアル化解除できません。
ko: 해당 키 형식 '{1}'에 공용 정적 구문 분석 메서드가 없기 때문에 '{0}' 형식의 사전을 단순 사전으로 deserialize할 수 없습니다.
pl: Nie można zdeserializować słownika typu „{0}” jako słownika prostego, ponieważ typ jego klucza („{1}”) nie ma publicznej statycznej metody Parse.
pt_br: O dicionário do tipo '{0}' não pode ser desserializado como um dicionário simples porque seu tipo de chave '{1}' não tem um método Parse estático público.
ru: Словарь типа "{0}" не может быть десериализован как простой словарь, так как для типа его ключей "{1}" не определен общий статический метод Parse.
tr: Anahtar türü '{1}', genel bir statik Parse metoduna sahip olmadığından '{0}' türündeki sözlük basit bir sözlük olarak seri durumdan çıkarılamıyor.
zh_hans: 类型为“{0}”的字典无法反序列化为简单字典，因为其密钥类型“{1}”没有公共静态 Parse 方法。
zh_hant: 無法將類型 '{0}' 的字典還原序列化為簡單的字典，因為其金鑰類型 '{1}' 沒有公開的靜態 Parse 方法。

# KnownTypeAttributeEmptyString
source: Method name specified by KnownTypeAttribute attribute on type '{0}' cannot be the empty string.
cs: Název metody určený atributem KnownTypeAttribute u typu {0} nemůže být prázdný řetězec.
de: Der vom Attribut KnownTypeAttribute für den Typ "{0}" angegebene Methodenname darf keine leere Zeichenfolge sein.
es: El nombre de método que especifica el atributo KnownTypeAttribute en el tipo "{0}" no puede ser una cadena vacía.
fr: Le nom de la méthode qui est spécifié par l'attribut KnownTypeAttribute sur le type '{0}' ne peut pas être la chaîne vide.
it: Il nome di metodo specificato dall'attributo KnownTypeAttribute nel tipo '{0}' non può essere una stringa vuota.
ja: 型 '{0}' の KnownTypeAttribute 属性によって指定されたメソッド名を空の文字列にすることはできません。
ko: 형식 '{0}'의 KnownTypeAttribute 특성에 의해 지정된 메서드 이름은 빈 문자열일 수 없습니다.
pl: Nazwa metody określona przez atrybut KnownTypeAttribute w typie „{0}” nie może być pustym ciągiem.
pt_br: O nome do método especificado pelo atributo KnownTypeAttribute no tipo '{0}' não pode ser uma cadeia de caracteres vazia.
ru: Имя метода, указанное атрибутом KnownTypeAttribute типа "{0}", не может быть пустой строкой.
tr: '{0}' türündeki KnownTypeAttribute özniteliği tarafından belirtilen metot adı boş dize olamaz.
zh_hans: 类型“{0}”的 KnownTypeAttribute 特性指定的方法名称不能为空字符串。
zh_hant: 類型 '{0}' 的 KnownTypeAttribute 屬性所指定之方法名稱，不可為空字串。

# KnownTypeAttributeMethodNull
source: Method specified by KnownTypeAttribute attribute on type '{0}' returned null.
cs: Metoda určená atributem KnownTypeAttribute u typu {0} vrátila hodnotu null.
de: Die vom Attribut KnownTypeAttribute für den Typ "{0}" angegebene Methode hat NULL zurückgegeben.
es: El método que especifica el atributo KnownTypeAttribute en el tipo "{0}" devolvió un valor nulo.
fr: La méthode spécifiée par l'attribut KnownTypeAttribute sur le type '{0}' a retourné une valeur null.
it: Il metodo specificato dall'attributo KnownTypeAttribute nel tipo '{0}' ha restituito Null.
ja: 型 '{0}' の KnownTypeAttribute 属性により指定されたメソッドが null を返しました。
ko: 형식 '{0}'의 KnownTypeAttribute 특성에 의해 지정된 메서드가 null을 반환했습니다.
pl: Metoda określona przez atrybut KnownTypeAttribute w typie „{0}” zwróciła wartość null.
pt_br: O método especificado pelo atributo KnownTypeAttribute no tipo '{0}' retornou nulo.
ru: Метод, указанный атрибутом KnownTypeAttribute типа "{0}", вернул значение null.
tr: '{0}' türündeki KnownTypeAttribute özniteliği tarafından belirtilen metot null döndürdü.
zh_hans: 类型“{0}”的 KnownTypeAttribute 特性指定的方法返回 null。
zh_hant: 類型 '{0}' 的 KnownTypeAttribute 屬性所指定之方法傳回了 Null。

# KnownTypeAttributeNoData
source: KnownTypeAttribute attribute on type '{0}' contains no data.
cs: Atribut KnownTypeAttribute u typu {0} neobsahuje žádná data.
de: Das Attribut KnownTypeAttribute für den Typ "{0}" enthält keine Daten.
es: El atributo KnownTypeAttribute del tipo "{0}" no contiene ningún dato.
fr: L'attribut KnownTypeAttribute sur le type '{0}' ne contient aucune donnée.
it: L'attributo KnownTypeAttribute nel tipo '{0}' non contiene dati.
ja: 型 '{0}' の KnownTypeAttribute 属性にはデータが含まれていません。
ko: 형식 '{0}'의 KnownTypeAttribute 특성에 데이터가 없습니다.
pl: Atrybut KnownTypeAttribute w typie „{0}” nie zawiera żadnych danych.
pt_br: O atributo KnownTypeAttribute no tipo '{0}' não contém dados.
ru: Атрибут KnownTypeAttribute типа "{0}" не содержит данных.
tr: '{0}' türündeki KnownTypeAttribute özniteliğinde veri yok.
zh_hans: 类型“{0}”的 KnownTypeAttribute 特性不包含数据。
zh_hant: 類型 '{0}' 上的 KnownTypeAttribute 屬性並未包含任何資料。

# KnownTypeAttributeOneScheme
source: Type '{0}': If a KnownTypeAttribute attribute specifies a method it must be the only KnownTypeAttribute attribute on that type.
cs: Typ {0}: Když atribut KnownTypeAttribute určuje metodu, musí jít o jediný atribut KnownTypeAttribute u daného typu.
de: Typ "{0}": Wenn ein Attribut KnownTypeAttribute eine Methode angibt, darf kein weiteres Attribut KnownTypeAttribute für diesen Typ angegeben sein.
es: Tipo "{0}": si un atributo KnownTypeAttribute especifica un método, debe ser el único atributo KnownTypeAttribute que haya en ese tipo.
fr: Type '{0}' : si un attribut KnownTypeAttribute spécifie une méthode, il doit être le seul attribut KnownTypeAttribute sur ce type.
it: Tipo '{0}': se un attributo KnownTypeAttribute specifica un metodo, deve essere il solo attributo KnownTypeAttribute in tale metodo.
ja: 型 '{0}': KnownTypeAttribute 属性がメソッドを指定する場合、この属性はその型の唯一の KnownTypeAttribute 属性である必要があります。
ko: 형식 '{0}': KnownTypeAttribute 특성이 메서드를 지정할 경우 이 특성은 해당 형식의 유일한 KnownTypeAttribute 특성이어야 합니다.
pl: Typ „{0}”: w przypadku określenia metody w atrybucie KnownTypeAttribute musi to być jedyny atrybut KnownTypeAttribute w tym typie.
pt_br: Tipo '{0}': se um atributo KnownTypeAttribute especificar o método, ele deverá ser o único atributo KnownTypeAttribute nesse tipo.
ru: Тип "{0}": если атрибут KnownTypeAttribute указывает метод, то он должен быть единственным атрибутом KnownTypeAttribute в данном типе.
tr: '{0}' türü: KnownTypeAttribute özniteliği bir metot belirttiğinde, bu ilgili türdeki tek KnownTypeAttribute özniteliği olmalıdır.
zh_hans: 类型“{0}”: 如果 KnownTypeAttribute 特性指定一个方法，该方法必须是该类型的唯一一个 KnownTypeAttribute 特性。
zh_hant: 類型 '{0}': 若 KnownTypeAttribute 屬性指定了方法，則其必須是該類型唯一的 KnownTypeAttribute 屬性。

# KnownTypeAttributeReturnType
source: KnownTypeAttribute attribute on type '{0}' specifies a method named '{1}' to provide known types. The return type of this method is invalid because it is not assignable to IEnumerable<Type>. Ensure that the method exists and has a valid signature.
cs: Atribut KnownTypeAttribute u typu {0} určuje metodu s názvem {1} , která bude poskytovat známé typy. Vrácený typ této metody není platný, protože jej nelze přiřadit k typu IEnumerable<typ>. Ujistěte se, že metoda existuje a že má platnou signaturu.
de: Das Attribut KnownTypeAttribute für den Typ "{0}" definiert eine Methode namens "{1}", um bekannte Typen bereitzustellen. Der Rückgabetyp dieser Methode ist ungültig, da er nicht IEnumerable<Type> zugewiesen werden kann. Vergewissern Sie sich, dass die Methode vorhanden ist und eine gültige Signatur besitzt.
es: El atributo KnownTypeAttribute del tipo "{0}" especifica un método denominado "{1}" para proporcionar tipos conocidos. El tipo de valor que devuelve este método no es válido porque no se puede asignar a IEnumerable<Type>. Asegúrese de que el método existe y de que tiene una signatura válida.
fr: L'attribut KnownTypeAttribute sur le type '{0}' spécifie une méthode nommée '{1}' pour fournir des types connus. Le type de retour de cette méthode est non valide, car il ne peut pas être affecté à IEnumerable<Type>. Vérifiez que cette méthode existe et qu'elle a une signature valide.
it: L'attributo KnownTypeAttribute del tipo '{0}' specifica un metodo denominato '{1}' per fornire tipi noti. Il tipo restituito da questo metodo non è valido perché non è assegnabile a IEnumerable<Type>. Assicurarsi che il metodo esista e che contenga una firma valida.
ja: 型 '{0}' の KnownTypeAttribute 属性では、既知の型を提供する '{1}' という名前のメソッドが指定されています。このメソッドの戻り値の型は、IEnumerable<Type> に割り当てできないため無効です。このメソッドが存在しており、有効な署名が適用されていることを確認してください。
ko: 형식 '{0}'의 KnownTypeAttribute 특성이 알려진 형식을 제공하기 위해 '{1}'(이)라는 메서드를 지정합니다. 이 메서드의 반환 형식은 IEnumerable<Type>에 할당할 수 없기 때문에 잘못되었습니다. 메서드가 있으며 유효한 시그니처를 갖고 있는지 확인하세요.
pl: Atrybut KnownTypeAttribute typu „{0}” wskazuje metodę o nazwie „{1}” dostarczającą znane typy. Typ zwracany przez tę metodę jest nieprawidłowy, ponieważ nie można go przypisać do interfejsu IEnumerable<Type>. Upewnij się, że metoda istnieje i ma prawidłową sygnaturę.
pt_br: O atributo KnownTypeAttribute no tipo '{0}' especifica o método denominado '{1}' para fornecer tipos conhecidos. O tipo de retorno desse método é inválido porque ele não pode ser atribuído a IEnumerable<Type>. Verifique se o método existe e se tem uma assinatura válida.
ru: Атрибут KnownTypeAttribute типа "{0}" указывает метод с именем "{1}" для предоставления известных типов. Возвращаемый тип этого метода недопустим, так как он не может быть назначен IEnumerable<Type>. Убедитесь, что метод существует и имеет правильную сигнатуру.
tr: '{0}' türündeki KnownTypeAttribute özniteliği, bilinen türleri sağlamak için '{1}' adlı bir metot belirtiyor. IEnumerable<Type> öğesine atanamadığından, bu metodun dönüş türü geçersiz. Metodun mevcut olduğundan ve geçerli bir imzaya sahip olduğundan emin olun.
zh_hans: 类型“{0}”的 KnownTypeAttribute 特性指定一个名为“{1}”的方法，以提供已知类型。此方法的返回类型无效，因为无法将其分配给 IEnumerable<Type>。请确保此方法存在且具有有效签名。
zh_hant: 類型 '{0}' 上的 KnownTypeAttribute 屬性，指定了名為 '{1}' 的方法以提供已知類型。因為無法將其指派給 IEnumerable<Type>，所以此方法的傳回型別無效。請確定該方法存在且具備有效的簽章。
