Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidClrNameGeneratedForISerializable
source: ISerializable type with data contract name '{0}' in namespace '{1}' cannot be imported. The data contract name cannot be customized for ISerializable type and the generated name '{2}' does not match the expected name '{0}'. Check if the required name has been mapped to a different type or if it is an invalid CLR name which cannot be generated or if the type requires an outer type which is not present.
cs: Typ ISerializable s názvem kontraktu dat {0} v oboru názvů {1} nelze importovat. Název kontraktu dat nelze pro typ ISerializable upravit a generovaný název {2} se neshoduje s očekávaným názvem {0}. Zkontrolujte, zda nebyl požadovaný název namapován na jiný typ nebo zda nejde o neplatný název CLR, který nelze generovat, případně zda typ nevyžaduje vnější typ, který není k dispozici.
de: Der ISerializable-Typ mit dem Datenvertragsnamen "{0}" im Namespace "{1}" kann nicht importiert werden. Der Datenvertragsname kann nicht für den ISerializable-Typ angepasst werden, und der generierte Name "{2}" entspricht nicht dem erwarteten Namen "{0}". Überprüfen Sie, ob der erforderliche Name einem anderen Typ zugeordnet wurde, ein ungültiger CLR-Namen ist, der nicht generiert werden kann, oder der Typ einen nicht vorhandenen äußeren Typ erfordert.
es: No se puede importar el tipo ISerializable con el nombre de contrato de datos "{0}" en el espacio de nombres "{1}". El nombre del contrato de datos no se puede personalizar para el tipo ISerializable, y el nombre "{2}" generado no coincide con el nombre "{0}" esperado. Compruebe si el nombre requerido se asignó a otro tipo o si es un nombre CLR no válido que no se puede generar o si el tipo requiere un tipo externo que no está presente.
fr: Impossible d'importer le type ISerializable comportant le nom de contrat de données '{0}' dans l'espace de noms '{1}'. Le nom de contrat de données ne peut pas être personnalisé pour le type ISerializable, et le nom généré '{2}' ne correspond pas au nom attendu '{0}'. Vérifiez si le nom nécessaire a été mappé à un type différent, ou s'il s'agit d'un nom CLR non valide qui ne peut pas être généré, ou enfin si le type nécessite un type externe qui est absent.
it: Non è possibile importare il tipo ISerializable con nome di contratto di dati '{0}' nello spazio dei nomi '{1}'. Il nome del contratto di dati non può essere personalizzato per il tipo ISerializable e il nome generato '{2}' non corrisponde al nome previsto '{0}'. Verificare se è stato eseguito il mapping del nome richiesto a un tipo diverso, se si tratta di un nome CLR non valido che non può essere generato o se il tipo richiede un tipo esterno non presente.
ja: 名前空間 '{1}' のデータ コントラクト名 '{0}' を持つ ISerializable 型をインポートできません。このデータ コントラクト名は ISerializable 型についてはカスタマイズできず、生成された名前 '{2}' は必要な名前 '{0}' と一致しません。必要な名前が既に異なる型にマッピングされているかどうか、この名前が生成できない無効な CLR 名であるかどうか、またはこの型に必要なのは存在しない外部の型であるかどうかを確認してください。
ko: 네임스페이스 '{1}'의 데이터 계약 이름 '{0}'을(를) 가진 ISerializable 형식을 가져올 수 없습니다. 데이터 계약 이름을 ISerializable 형식에 대해 사용자 지정할 수 없으며 생성된 이름 '{2}'이(가) 필요한 이름 '{0}'과(와) 일치하지 않습니다. 필요한 이름이 다른 형식에 매핑되었거나 생성할 수 없는 잘못된 CLR 이름이거나 존재하지 않는 외부 형식을 해당 형식에서 요구하는지 확인하세요.
pl: Nie można zaimportować typu ISerializable z nazwą kontraktu danych „{0}” w przestrzeni nazw „{1}”. Nie można dostosować nazwy kontraktu danych do typu ISerializable, a wygenerowana nazwa „{2}” nie pasuje do oczekiwanej nazwy „{0}”. Sprawdź, czy żądana nazwa została zamapowana na inny typ, czy nazwa nie jest nieprawidłową nazwą CLR, która nie może być wygenerowana, oraz czy typ nie wymaga nieistniejącego typu zewnętrznego.
pt_br: Não é possível importar o tipo ISerializable com nome de contrato de dados '{0}' no namespace '{1}'. O nome do contrato de dados não pode ser personalizado para o tipo ISerializable e o nome gerado '{2}' não corresponde ao nome esperado '{0}'. Verifique se o nome exigido foi mapeado para um tipo diferente ou se é um nome CLR inválido que não pode ser gerado ou se o tipo requer um tipo externo que não está presente.
ru: Невозможно импортировать тип ISerializable с именем контракта данных "{0}" в пространстве имен "{1}". Имя контракта данных не может быть использовано для типов ISerializable, и сгенерированное имя "{2}" недопустимо, так как оно отличается от ожидаемого имени "{0}". Возможно, требуемое имя сопоставлено другому типу, является недопустимым CLR-именем, которое невозможно генерировать, или отсутствует внешний тип, требуемый для данного типа.
tr: '{1}' ad alanındaki '{0}' veri anlaşması adına sahip ISerializable türü içeri aktarılamıyor. Veri anlaşması adı ISerializable türü için özelleştirilemiyor ve oluşturulan '{2}' adı beklenen '{0}' adıyla eşleşmiyor. Gereken adın farklı bir türle eşlenip eşlenmediğini ya da oluşturulamayan geçersiz bir CLR adı olup olmadığını veya tür için burada bulunmayan bir dış türün gerekli olup olmadığını denetleyin.
zh_hans: 无法导入命名空间“{1}”中数据协定名称为“{0}”的 ISerializable 类型。无法为 ISerializable 类型自定义该数据协定名称，并且生成的名称“{2}”与所需的名称“{0}”不匹配。请检查是否将所需的名称映射到不同的类型、该名称是否为无法生成的无效 CLR 名称或该类型是否要求不存在的外部类型。
zh_hant: 無法匯入命名空間 '{1}' 中資料合約名稱為 '{0}' 的 ISerializable 類型。無法為 ISerializable 類型自訂資料合約名稱，且產生的名稱 '{2}' 與應有的名稱 '{0}' 不相符。請檢查必要的名稱是否對應到其他類型，或是否為無法產生的無效 CLR 名稱，或該類型要求的外部類型並不存在。

# InvalidClrNamespaceGeneratedForISerializable
source: ISerializable type with data contract name '{0}' in namespace '{1}' cannot be imported. The data contract namespace cannot be customized for ISerializable types and the generated namespace '{3}' does not match the required CLR namespace '{2}'. Check if the required namespace has been mapped to a different data contract namespace and consider mapping it explicitly using the namespaces collection.
cs: Typ ISerializable s názvem kontraktu dat {0} v oboru názvů {1} nelze importovat. Název kontraktu dat nelze pro typy ISerializable upravit a generovaný obor názvů {3} se neshoduje s požadovaným oborem názvů CLR {2}. Zkontrolujte, zda nebyl požadovaný obor názvů namapován na jiný obor názvů kontraktu dat, a namapujte ho explicitně pomocí kolekce oborů názvů.
de: Der ISerializable-Typ mit dem Datenvertragsnamen "{0}" aus dem Namespace "{1}" kann nicht importiert werden. Der Datenvertragsnamespace kann nicht für den ISerializable-Typ angepasst werden, und der generierte Namespace "{3}" entspricht nicht dem erforderlichen CLR-Namespace "{2}". Überprüfen Sie, ob der erforderliche Namespace einem anderen Datenvertragsnamespace zugeordnet wurde, und ordnen Sie ihn ggf. explizit mithilfe der Namespacesammlung zu.
es: No se puede importar el tipo ISerializable con el nombre de contrato de datos "{0}" en el espacio de nombres "{1}". El espacio de nombres de contrato de datos no se puede personalizar para tipos ISerializable, y el espacio de nombres "{3}" generado no coincide con el espacio de nombres CLR "{2}" requerido. Compruebe si el espacio de nombres requerido se asignó a otro espacio de nombres de contrato de datos y pruebe a asignarlo explícitamente mediante la colección de espacios de nombres.
fr: Impossible d'importer le type ISerializable comportant le nom de contrat de données '{0}' dans l'espace de noms '{1}'. L'espace de noms de contrat de données ne peut pas être personnalisé pour les types ISerializable, et l'espace de noms généré '{3}' ne correspond pas à l'espace de noms CLR nécessaire '{2}'. Vérifiez que l'espace de noms nécessaire a été mappé à un espace de noms de contrat de données différent et mappez-le explicitement à l'aide de la collection d'espaces de noms.
it: Non è possibile importare il tipo ISerializable con nome di contratto di dati '{0}' nello spazio dei nomi '{1}'. Lo spazio dei nomi del contratto di dati non è personalizzabile per i tipi ISerializable e lo spazio dei nomi generato '{3}' non corrisponde allo spazio dei nomi di CLR richiesto '{2}'. Verificare se è stato eseguito il mapping dello spazio dei nomi richiesto a uno spazio dei nomi del contratto di dati diverso e provare a eseguirne il mapping in modo esplicito usando la raccolta degli spazi dei nomi.
ja: 名前空間 '{1}' のデータ コントラクト名 '{0}' を持つ ISerializable 型をインポートできません。このデータ コントラクト名前空間は ISerializable 型についてはカスタマイズできず、生成された名前空間 '{3}' は必要な CLR 名前空間 '{2}' と一致しません。必要な名前空間が既に異なるデータ コントラクト名前空間にマッピングされているかどうかを確認して、名前空間コレクションを使用してこの名前空間を明示的にマッピングしてください。
ko: 네임스페이스 '{1}'의 데이터 계약 이름 '{0}'을(를) 가진 ISerializable 형식을 가져올 수 없습니다. 데이터 계약 네임스페이스를 ISerializable 형식에 대해 사용자 지정할 수 없으며 생성된 네임스페이스 '{3}'이(가) 필요한 CLR 네임스페이스 '{2}'과(와) 일치하지 않습니다. 필요한 네임스페이스가 다른 데이터 계약 네임스페이스에 매핑되었는지 확인하고 네임스페이스 컬렉션을 사용하여 명시적으로 매핑해 보세요.
pl: Nie można zaimportować typu ISerializable z nazwą kontraktu danych „{0}” w przestrzeni nazw „{1}”. Nie można dostosować przestrzeni nazw kontraktu danych do typów ISerializable, a wygenerowana przestrzeń nazw „{3}” nie pasuje do wymaganej przestrzeni nazw CLR „{2}”. Sprawdź, czy żądana przestrzeń nazw nie została zamapowana na inną przestrzeń nazw kontraktu danych i zamapuj ją jawnie za pomocą kolekcji przestrzeni nazw.
pt_br: Não é possível importar o tipo ISerializable com o nome de contrato de dados '{0}' no namespace '{1}'. O namespace do contrato de dados não pode ser personalizado para tipos ISerializable e o namespace '{3}' gerado não corresponde ao namespace CLR '{2}' necessário. Verifique se o namespace necessário foi mapeado para um namespace de contrato de dados diferente e considere mapeá-lo explicitamente usando a coleção de namespaces.
ru: Невозможно импортировать тип ISerializable с именем контракта данных "{0}" в пространстве имен "{1}". Пространство имен контракта данных не может использоваться для типов ISerializable, и сгенерированное пространство имен "{3}" отличается от требуемого пространства имен CLR "{2}". Возможно, требуемое пространство имен сопоставлено другому пространству имен контракта данных. Тогда его необходимо сопоставлять явным образом с помощью коллекции пространств имен.
tr: '{1}' ad alanındaki '{0}' veri anlaşması adlı ISerializable türü içeri aktarılamıyor. Veri anlaşması ad alanı ISerializable türü için özelleştirilemiyor ve oluşturulan '{3}' adı gerekli olan '{2}' CLR ad alanıyla eşleşmiyor. Gereken ad alanının farklı bir veri anlaşması ad alanına eşlenip eşlenmediğini denetleyin ve ad alanı koleksiyonunu kullanarak bunu açık olarak eşlemeyi deneyin.
zh_hans: 法导入命名空间“{1}”中数据协定名称为“{0}”的 ISerializable 类型无。无法为 ISerializable 类型自定义该数据协定命名空间，并且生成的命名空间“{3}”与所需的 CLR 命名空间“{2}”不匹配。请检查是否将所需的命名空间映射到不同的数据协定命名空间，然后考虑使用命名空间集合对其进行显式映射。
zh_hant: 無法匯入命名空間 '{1}' 中資料合約名稱為 '{0}' 的 ISerializable 類型。無法為 ISerializable 類型自訂資料合約命名空間，且產生的命名空間 '{3}' 與必要的 CLR 命名空間 '{2}' 不相符。請檢查必要的命名空間是否對應到其他資料合約命名空間，並考慮使用命名空間集合明確對應。

# InvalidCollectionContractItemName
source: Type '{0}' cannot have CollectionDataContractAttribute attribute ItemName set to null or empty string.
cs: U typu {0} nemůže být název ItemName u atributu CollectionDataContractAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf ItemName für das Attribut CollectionDataContractAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento ItemName del atributo CollectionDataContractAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un ItemName d'attribut CollectionDataContractAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo CollectionDataContractAttribute in cui ItemName è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、CollectionDataContractAttribute 属性の ItemName を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 CollectionDataContractAttribute 특성 ItemName을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości ItemName atrybutu CollectionDataContractAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo ItemName de CollectionDataContractAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут CollectionDataContractAttribute с параметром ItemName, имеющим в качестве значения null или пустую строку.
tr: '{0}' türünde CollectionDataContractAttribute özniteliğinin ItemName değeri null ya da boş dize olarak ayarlanamaz.
zh_hans: 类型“{0}”不能将 CollectionDataContractAttribute 特性 ItemName 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 CollectionDataContractAttribute 屬性 ItemName 設為 Null 或空字串。

# InvalidCollectionContractKeyName
source: Type '{0}' cannot have CollectionDataContractAttribute attribute KeyName set to null or empty string.
cs: U typu {0} nemůže být název KeyName u atributu CollectionDataContractAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf KeyName für das Attribut CollectionDataContractAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento KeyName del atributo CollectionDataContractAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un KeyName d'attribut CollectionDataContractAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo CollectionDataContractAttribute in cui KeyName è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、CollectionDataContractAttribute 属性の KeyName を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 CollectionDataContractAttribute 특성 KeyName을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości KeyName atrybutu CollectionDataContractAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo KeyName de CollectionDataContractAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут CollectionDataContractAttribute с параметром KeyName, имеющим в качестве значения null или пустую строку.
tr: '{0}' türünde CollectionDataContractAttribute özniteliğinin KeyName değeri null ya da boş dize olarak ayarlanamaz.
zh_hans: 类型“{0}”无法将 CollectionDataContractAttribute 特性 KeyName 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 CollectionDataContractAttribute 屬性 KeyName 設為 Null 或空字串。

# InvalidCollectionContractKeyNoDictionary
source: The collection data contract type '{0}' specifies '{1}' for the KeyName property. This is not allowed since the type is not IDictionary. Remove the setting for the KeyName property.
cs: Typ kontraktu dat kolekce {0} udává pro vlastnost KeyName hodnotu {1}. To není povoleno, protože typ není IDictionary. Odeberte nastavení pro vlastnost KeyName.
de: Der Sammlungsdatenvertragstyp "{0}" gibt "{1}" für die KeyName-Eigenschaft an. Dies ist nicht zulässig, da der Typ nicht IDictionary ist. Entfernen Sie die Einstellung für die KeyName-Eigenschaft.
es: El tipo de contrato de datos de colección "{0}" especifica el valor "{1}" para la propiedad KeyName, lo cual no está permitido, ya que este tipo no está en IDictionary. Quite el valor de la propiedad KeyName.
fr: Le type de contrat de données de collection '{0}' indique '{1}' pour la propriété KeyName. Ceci n'est pas autorisé, car le type n'est pas IDictionary. Supprimez le paramètre pour la propriété KeyName.
it: Nel tipo di contratto di dati '{0}' della raccolta viene specificato '{1}' per la proprietà KeyName. Questa impostazione non è consentita perché il tipo non è IDictionary. Rimuovere l'impostazione per la proprietà KeyName.
ja: コレクション データ コントラクト型 '{0}' では、KeyName プロパティに '{1}' が指定されています。この型は IDictionary ではないため、これは許可されません。KeyName プロパティの設定を削除してください。
ko: 컬렉션 데이터 계약 형식 '{0}'이(가) KeyName 속성에 대해 '{1}'을(를) 지정합니다. 형식이 IDictionary가 아니므로 이것은 허용되지 않습니다. KeyName 속성에 대한 설정을 제거하세요.
pl: W typie kontraktu danych kolekcji „{0}” właściwość KeyName ma wartość „{1}”. Nie jest to dozwolone, ponieważ nie jest to typ IDictionary. Usuń ustawienie właściwości KeyName.
pt_br: O tipo de contrato de dados da coleção '{0}' especifica '{1}' para a propriedade KeyName. Isso não é permitido porque o tipo não é IDictionary. Remova a configuração da propriedade KeyName.
ru: Тип контракта данных коллекции "{0}" указывает "{1}" для свойства KeyName. Это недопустимо, так как тип не IDictionary. Удалите этот параметр свойства KeyName.
tr: Koleksiyon veri anlaşması türü '{0}', KeyName özelliği '{1}' değerini belirtiyor. Tür IDictionary olmadığından buna izin verilmiyor. KeyName özelliği için ayarı kaldırın.
zh_hans: 集合数据协定类型“{0}”将 KeyName 属性指定为“{1}”。但由于此类型并非 IDictionary，因此不允许这样做。请删除 KeyName 属性的此设置。
zh_hant: 集合資料合約類型 '{0}' 指定 KeyName 屬性的 '{1}'。因為此類型不是 IDictionary，所以不允許此情況。請移除 KeyName 屬性的設定。

# InvalidCollectionContractName
source: Type '{0}' cannot have CollectionDataContractAttribute attribute Name set to null or empty string.
cs: U typu {0} nemůže být název Name u atributu CollectionDataContractAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf der Name für das Attributs CollectionDataContractAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento Name del atributo CollectionDataContractAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un Name d'attribut CollectionDataContractAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo CollectionDataContractAttribute in cui Name è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、CollectionDataContractAttribute 属性の Name を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 CollectionDataContractAttribute 특성 이름을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości Name atrybutu CollectionDataContractAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo Name de CollectionDataContractAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут CollectionDataContractAttribute с параметром Name, имеющим в качестве значения null или пустую строку.
tr: '{0}' türü, CollectionDataContractAttribute özniteliği Name öğesinin null ya da boş dize olarak ayarlanmasına izin vermez.
zh_hans: 类型“{0}”无法将 CollectionDataContractAttribute 特性 Name 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 CollectionDataContractAttribute 屬性 Name 設為 Null 或空字串。

# InvalidCollectionContractNamespace
source: Type '{0}' cannot have CollectionDataContractAttribute attribute Namespace set to null.
cs: U typu {0} nemůže být obor názvů Namespace u atributu CollectionDataContractAttribute nastaven na hodnotu null.
de: Für den Typ "{0}" darf der Namespace für das Attribut CollectionDataContractAttribute nicht auf NULL festgelegt sein.
es: El tipo "{0}" no puede tener el elemento Namespace del atributo CollectionDataContractAttribute con un valor nulo.
fr: Le type '{0}' ne peut pas avoir un Namespace d'attribut CollectionDataContractAttribute avec une valeur null.
it: Il tipo '{0}' non può contenere un attributo CollectionDataContractAttribute in cui Namespace è impostato su Null.
ja: 型 '{0}' では、CollectionDataContractAttribute 属性の Namespace を null に設定することはできません。
ko: '{0}' 형식은 CollectionDataContractAttribute 특성 네임스페이스를 null로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości Namespace atrybutu CollectionDataContractAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo Namespace de CollectionDataContractAttribute definido como nulo.
ru: Тип "{0}" не может иметь атрибут CollectionDataContractAttribute с параметром Namespace, имеющим значение null.
tr: '{0}' türü, CollectionDataContractAttribute özniteliği Namespace öğesinin null ya da boş dize olarak ayarlanmasına izin vermez.
zh_hans: 类型“{0}”无法将 CollectionDataContractAttribute 特性 Namespace 设置为 null。
zh_hant: 類型 '{0}' 無法將 CollectionDataContractAttribute 屬性 Namespace 設為 Null。

# InvalidCollectionContractValueName
source: Type '{0}' cannot have CollectionDataContractAttribute attribute ValueName set to null or empty string.
cs: U typu {0} nemůže být ValueName u atributu CollectionDataContractAttribute nastaven na hodnotu null nebo prázdný řetězec.
de: Für den Typ "{0}" darf ValueName für das Attribut CollectionDataContractAttribute nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El tipo "{0}" no puede tener el elemento ValueName del atributo CollectionDataContractAttribute definido como una cadena nula o vacía.
fr: Le type '{0}' ne peut pas avoir un ValueName d'attribut CollectionDataContractAttribute avec une valeur null ou une chaîne vide.
it: Il tipo '{0}' non può contenere un attributo CollectionDataContractAttribute in cui ValueName è impostato su una stringa vuota o su Null.
ja: 型 '{0}' では、CollectionDataContractAttribute 属性の ValueName を null や空の文字列に設定することはできません。
ko: '{0}' 형식은 CollectionDataContractAttribute 특성 ValueName을 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Typ „{0}” nie może mieć właściwości ValueName atrybutu CollectionDataContractAttribute ustawionej na wartość null lub pusty ciąg.
pt_br: O tipo '{0}' não pode ter o atributo ValueName de CollectionDataContractAttribute definido como uma cadeia de caracteres nula ou vazia.
ru: Тип "{0}" не может иметь атрибут CollectionDataContractAttribute с параметром ValueName, имеющим в качестве значения null или пустую строку.
tr: '{0}' türü, CollectionDataContractAttribute özniteliği ValueName öğesinin null ya da boş dize olarak ayarlanmasına izin vermez.
zh_hans: 类型“{0}”无法将 CollectionDataContractAttribute 特性 ValueName 设置为 null 或空字符串。
zh_hant: 類型 '{0}' 無法將 CollectionDataContractAttribute 屬性 ValueName 設為 Null 或空字串。

# InvalidCollectionContractValueNoDictionary
source: The collection data contract type '{0}' specifies '{1}' for the ValueName property. This is not allowed since the type is not IDictionary. Remove the setting for the ValueName property.
cs: Typ kontraktu dat kolekce {0} udává pro vlastnost ValueName hodnotu {1}. To není povoleno, protože typ není IDictionary. Odeberte nastavení pro vlastnost ValueName.
de: Der Sammlungsdatenvertragstyp "{0}" gibt "{1}" für die ValueName-Eigenschaft an. Dies ist nicht zulässig, da der Typ nicht IDictionary ist. Entfernen Sie die Einstellung für die ValueName-Eigenschaft.
es: El tipo de contrato de datos de colección "{0}" especifica el valor "{1}" para la propiedad ValueName, lo cual no está permitido, ya que ese tipo no se encuentra en IDictionary. Quite el valor de la propiedad ValueName.
fr: Le type de contrat de données de collection '{0}' indique '{1}' pour la propriété ValueName. Ceci n'est pas autorisé, car le type n'est pas IDictionary. Supprimez le paramètre pour la propriété ValueName.
it: Nel tipo di contratto di dati '{0}' della raccolta viene specificato '{1}' per la proprietà ValueName. Questa impostazione non è consentita perché il tipo non è IDictionary. Rimuovere l'impostazione per la proprietà ValueName.
ja: コレクション データ コントラクト型 '{0}' では、ValueName プロパティに '{1}' が指定されています。この型は IDictionary ではないため、これは許可されません。ValueName プロパティの設定を削除してください。
ko: 컬렉션 데이터 계약 형식 '{0}'이(가) ValueName 속성에 대해 '{1}'을(를) 지정합니다. 형식이 IDictionary가 아니므로 이것은 허용되지 않습니다. ValueName 속성에 대한 설정을 제거하세요.
pl: W typie kontraktu danych kolekcji „{0}” właściwość ValueName ma wartość „{1}”. Nie jest to dozwolone, ponieważ nie jest to typ IDictionary. Usuń ustawienie właściwości ValueName.
pt_br: O tipo de contrato de dados de coleção '{0}' especifica '{1}' para a propriedade ValueName. Isso não é permitido porque o tipo não é IDictionary. Remova a configuração da propriedade ValueName.
ru: Тип контракта данных коллекции "{0}" указывает "{1}" для свойства ValueName. Это недопустимо, так как тип не IDictionary. Удалите этот параметр свойства ValueName.
tr: Koleksiyon veri anlaşması türü '{0}', ValueName özelliği olarak '{1}' öğesini belirtiyor. Tür IDictionary olmadığından, buna izin verilmiyor. ValueName özelliği ayarını kaldırın.
zh_hans: 集合数据协定类型“{0}”将 ValueName 属性指定为“{1}”。但由于此类型并非 IDictionary，因此不允许这样做。请删除 ValueName 属性的此设置。
zh_hant: 集合資料合約類型 '{0}' 指定 ValueName 屬性的 '{1}'。因為此類型不是 IDictionary，所以不允許此情況。請移除 ValueName 屬性的設定。
