Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DupTypeContractInDataContractSet
source: DataContract for type '{0}' cannot be added to DataContractSet since type '{1}' with the same data contract name '{2}' in namespace '{3}' is already present and the contracts are not equivalent.
cs: Kontrakt DataContract pro typ {0} nelze přidat do sady DataContractSet, protože již existuje typ {1} se stejným názvem kontraktu dat {2} v oboru názvů {3} a kontrakty nejsou rovnocenné.
de: Der DataContract für den Typ "{0}" kann dem DataContractSet nicht hinzugefügt werden, da der Typ "{1}" mit demselben Datenvertragsnamen "{2}" im Namespace "{3}" bereits vorhanden ist und die Verträge einander nicht entsprechen.
es: El elemento DataContract del tipo "{0}" no se puede agregar a DataContractSet, ya que el tipo "{1}" con el mismo nombre de contrato de datos "{2}" en el espacio de nombres "{3}" ya está presente y los contratos no son equivalentes.
fr: Impossible d'ajouter DataContract pour le type '{0}' à DataContractSet, car le type '{1}' portant le même nom de contrat de données '{2}' dans l'espace de noms '{3}' est déjà présent et les contrats ne sont pas équivalents.
it: Non è possibile aggiungere l'elemento DataContract per il tipo '{0}' a DataContractSet perché esiste già un tipo '{1}' con lo stesso nome di contratto di dati '{2}' nello spazio dei nomi '{3}' e i contratti non sono equivalenti.
ja: 名前空間 '{3}' で同じデータ コントラクト名 '{2}' を持つ型 '{1}' が既に存在し、それらのコントラクトが等しくないため、型 '{0}' に対する DataContract を DataContractSet に追加できません。
ko: 네임스페이스 '{3}'의 같은 데이터 계약 이름 '{2}'을(를) 가진 '{1}' 형식이 이미 있고 계약이 서로 동일하지 않기 때문에 '{0}' 형식에 대한 DataContract를 DataContractSet에 추가할 수 없습니다.
pl: Nie można dodać schematu DataContract dla typu „{0}” do kolekcji DataContractSet, ponieważ istnieje już typ „{1}” z tą samą nazwą kontraktu danych „{2}” w przestrzeni nazw „{3}” i kontrakty te nie są równoważne.
pt_br: O DataContract para o tipo '{0}' não pode ser adicionado ao DataContractSet porque o tipo '{1}' com o mesmo nome de contrato de dados '{2}' no namespace '{3}' já está presente e os contratos não são equivalentes.
ru: Невозможно добавить DataContract для типа "{0}" к DataContractSet, так как уже имеется тип "{1}" с тем же именем контракта данных "{2}" в пространстве имен "{3}" и эти контракты не эквивалентны.
tr: '{3}' ad alanında, aynı veri anlaşması adına ('{2}') sahip '{1}' türü zaten mevcut olduğundan ve anlaşmalar eşdeğer olmadığından, '{0}' türü için DataContract, DataContractSet içine eklenemiyor.
zh_hans: 无法将类型“{0}”的 DataContract 添加到 DataContractSet，因为已经存在数据协定名称也为命名空间“{3}”中“{2}”的类型“{1}”，并且这些协定并不是等效的。
zh_hant: 類型 '{0}' 的 DataContract 無法新增到 DataContractSet，因為命名空間 '{3}' 中已經有資料合約名稱同為 '{2}' 的類型 '{1}' ，且合約並不相等。

# DuplicateAttribute
source: Invalid Callback. Method '{3}' in type '{2}' has both '{0}' and '{1}'.
cs: Neplatné zpětné volání. Metoda {3} v typu {2} má {0} i {1}.
de: Ungültiger Rückruf. Die Methode "{3}" im Typ "{2}" enthält sowohl "{0}" als auch "{1}".
es: Devolución de llamada no válida. El método "{3}" del tipo "{2}" tiene "{0}" y "{1}".
fr: Rappel non valide. La méthode '{3}' dans le type '{2}' a '{0}' et '{1}'.
it: Callback non valido. Il metodo '{3}' nel tipo '{2}' contiene sia '{0}' che '{1}'.
ja: 無効なコールバックです。型 '{2}' のメソッド '{3}' には、'{0}' と '{1}' の両方が含まれています。
ko: 잘못된 콜백입니다. 형식 '{2}'의 메서드 '{3}'에 '{0}' 및 '{1}'이(가) 모두 있습니다.
pl: Nieprawidłowe wywołanie zwrotne. Metoda „{3}” w typie „{2}” ma zarówno element „{0}”, jak i „{1}”.
pt_br: Retorno de Chamada inválido. O método '{3}' no tipo '{2}' tem tanto '{0}' quanto '{1}'.
ru: Неверный обратный вызов. Метод "{3}" в типе "{2}" имеет и "{0}", и "{1}".
tr: Geçersiz Geri Çağırma. '{2}' türündeki '{3}' metodunda hem '{0}', hem de '{1}' var.
zh_hans: 无效的回调。类型“{2}”中的方法“{3}”同时具有“{0}”和“{1}”。
zh_hant: 回呼無效。類型 '{2}' 中的方法 '{3}' 同時具有 '{0}' 及 '{1}'。

# DuplicateCallback
source: Invalid attribute. Both '{0}' and '{1}' in type '{2}' have '{3}'.
cs: Neplatný atribut. {0} i {1} v typu {2} mají {3}.
de: Ungültiges Attribut. "{0}" und "{1}" im Typ "{2}" enthalten "{3}".
es: Atributo no válido. Los elementos "{0}" y "{1}" del tipo "{2}" tienen "{3}".
fr: Attribut non valide. '{0}' et '{1}' dans le type '{2}' ont '{3}'.
it: Attributo non valido. Sia '{0}' che '{1}' nel tipo '{2}' contengono '{3}'.
ja: 無効な属性です。型 '{2}' の '{0}' と '{1}' の両方に '{3}' が含まれています。
ko: 잘못된 특성입니다. 형식 '{2}'의 '{0}' 및 '{1}' 모두에 '{3}'이(가) 있습니다.
pl: Nieprawidłowy atrybut. Atrybut „{0}” i atrybut „{1}” w typie „{2}” mają wywołanie zwrotne „{3}”.
pt_br: Atributo inválido. Tanto '{0}' quanto '{1}' no tipo '{2}' têm '{3}'.
ru: Неверный атрибут. И "{0}", и "{1}" в типе "{2}" имеют "{3}".
tr: Geçersiz öznitelik. '{2}' türünde hem '{0}', hem de '{1}' '{3}' öğesine sahiptir.
zh_hans: 无效的特性。类型“{2}”中的“{0}”和“{1}”均具有“{3}”。
zh_hant: 屬性無效。類型 '{2}' 中的 '{0}' 及 '{1}' 都具有 '{3}'。

# ElementMaxOccursMustBe
source: 'maxOccurs' on element '{0}' must be 1.
cs: Hodnota vlastnosti maxOccurs u elementu {0} musí být 1.
de: "maxOccurs" für das Element "{0}" muss 1 sein.
es: El valor "maxOccurs" del elemento "{0}" debe ser 1.
fr: La valeur 'maxOccurs' sur l'élément '{0}' doit être 1.
it: Il valore di 'maxOccurs' nell'elemento '{0}' deve essere 1.
ja: 要素 '{0}' の 'maxOccurs' は 1 である必要があります。
ko: 요소 '{0}'의 'maxOccurs'가 1이어야 합니다.
pl: Wartość parametru „maxOccurs” w elemencie „{0}” musi wynosić 1.
pt_br: 'maxOccurs' no elemento '{0}' deve ser 1.
ru: Параметр maxOccurs элемента "{0}" должен равняться 1.
tr: '{0}' öğesindeki 'maxOccurs' değeri 1 olmalı.
zh_hans: 元素“{0}”上的 "maxOccurs" 必须为 1。
zh_hant: 元素 '{0}' 上的 'maxOccurs' 必須是 1。

# ElementMinOccursMustBe
source: 'minOccurs' on element '{0}' must be 0 or 1.
cs: Hodnota vlastnosti minOccurs u elementu {0} musí být 0 nebo 1.
de: "minOccurs" für das Element "{0}" muss 0 oder 1 sein.
es: El valor "minOccurs" del elemento "{0}" debe ser 0 o 1.
fr: La valeur 'minOccurs' sur l'élément '{0}' doit être 0 ou 1.
it: Il valore di 'minOccurs' nell'elemento '{0}' deve essere 0 o 1.
ja: 要素 '{0}' の 'minOccurs' は 0 または 1 である必要があります。
ko: 요소 '{0}'의 'minOccurs'가 0 또는 1이어야 합니다.
pl: Wartość parametru „minOccurs” w elemencie „{0}” musi wynosić 0 lub 1.
pt_br: 'minOccurs' no elemento '{0}' deve ser 0 ou 1.
ru: Параметр minOccurs элемента "{0}" должен равняться 0 или 1.
tr: '{0}' öğesindeki 'minOccurs' değeri 0 veya 1 olmalı.
zh_hans: 元素“{0}”上的 "minOccurs" 必须为 0 或 1。
zh_hant: 元素 '{0}' 上的 'minOccurs' 必須是 0 或 1。

# ElementRefOnLocalElementNotSupported
source: Ref to element '{0}' in '{1}' namespace is not supported.
cs: Odkaz na element {0} v oboru názvů {1} není podporován.
de: Ein Verweis auf das Element "{0}" im Namespace "{1}" wird nicht unterstützt.
es: No se admite la referencia al elemento "{0}" del espacio de nombres "{1}".
fr: La référence à l'élément '{0}' dans l'espace de noms '{1}' n'est pas prise en charge.
it: Il riferimento all'elemento '{0}' nello spazio dei nomi '{1}' non è supportato.
ja: 名前空間 '{1}' の要素 '{0}' に対する ref はサポートされていません。
ko: '{1}' 네임스페이스의 '{0}' 요소에 대한 참조가 지원되지 않습니다.
pl: Odwołanie do elementu „{0}” w przestrzeni nazw „{1}” nie jest obsługiwane.
pt_br: Não há suporte para Ref ao elemento '{0}' no namespace '{1}'.
ru: Ссылка на элемент "{0}" в пространстве имен "{1}" не поддерживается.
tr: '{1}' ad alanı içindeki '{0}' öğesine yapılan başvuru desteklenmiyor.
zh_hans: 不支持对命名空间“{1}”中元素“{0}”的引用。
zh_hant: 不支援參考命名空間 '{1}' 中的元素 '{0}'。

# EncounteredWithNameNamespace
source: {0}. Encountered '{1}' with name '{2}', namespace '{3}'.
cs: {0}. Nalezeno {1} s názvem {2}, obor názvů {3}.
de: {0}. Gefunden: "{1}" mit dem Namen "{2}", Namespace "{3}".
es: {0}. Se encontró "{1}" con el nombre "{2}", espacio de nombres "{3}".
fr: {0}. Détection de '{1}' comportant le nom '{2}' et l'espace de noms '{3}'.
it: {0}. È stato rilevato l'elemento '{1}' denominato '{2}' con spazio dei nomi '{3}'.
ja: {0}。名前が '{2}'、名前空間が '{3}' の '{1}' が検出されました。
ko: {0}. 이름 '{2}', 네임스페이스 '{3}'을(를) 가진 '{1}'이(가) 발견되었습니다.
pl: {0}. Napotkano element „{1}” o nazwie „{2}”, przestrzeń nazw „{3}”.
pt_br: {0}. Encontrado '{1}' com nome '{2}', namespace '{3}'.
ru: {0}. Обнаружен "{1}" с именем "{2}", пространство имен "{3}".
tr: {0}. Karşılaşılan: '{1}' adı: '{2}', ad alanı: '{3}'.
zh_hans: {0}。遇到名称为“{2}”、命名空间为“{3}”的“{1}”。
zh_hant: {0}。發生了名為 '{2}' 且命名空間為 '{3}' 的 '{1}'。

# EnumEnumerationFacetsMustHaveValue
source: Enumeration facets without 'value' are not supported.
cs: Omezující vlastnosti výčtu bez hodnoty nejsou podporovány.
de: Enumerationsfacets ohne "value" werden nicht unterstützt.
es: No se admiten las facetas de enumeración sin "value".
fr: Des facettes d'énumération sans 'value' ne sont pas prises en charge.
it: I facet di enumerazione senza 'value' non sono supportati.
ja: '値' のない列挙ファセットはサポートされていません。
ko: 'value'가 없는 열거형 패싯이 지원되지 않습니다.
pl: Aspekty wyliczenia bez parametru „value” nie są obsługiwane.
pt_br: Não há suporte para facetas de enumeração sem 'value'.
ru: Аспекты перечисления без параметра value не поддерживаются.
tr: 'value' bulunmayan sabit listesi modelleri desteklenmez.
zh_hans: 不支持不带 "value" 的枚举方面。
zh_hant: 不支援沒有 'value' 的列舉 Facet。

# EnumListInAnonymousTypeNotSupported
source: Anonymous type with <list> cannot be used to create Flags enumeration because it is not a valid enum type.
cs: Anonymní typ s elementem <list> nelze použít k vytvoření výčtu Flags, protože to není platný typ výčtu.
de: Der anonyme Typ mit <list> kann nicht zum Erstellen der Flagenumeration verwendet werden, da er kein gültiger Enumerationstyp ist.
es: No se puede usar el tipo anónimo con <list> para crear una enumeración Flags porque no es un tipo de enumeración válido.
fr: Impossible d'utiliser le type anonyme avec <list> pour créer l'énumération Flags, car il ne s'agit pas d'un type enum valide.
it: Non è possibile usare il tipo anonimo con <list> per creare una enumerazione Flags perché non è un tipo di enumerazione valido.
ja: <list> を持つ匿名型は有効な列挙型ではないため、この型を使用して Flags 列挙を作成することはできません。
ko: <list>가 있는 무명 형식은 유효한 열거형 형식이 아니기 때문에 플래그 열거를 만드는 데 사용할 수 없습니다.
pl: Typ anonimowy z elementem <list> nie może być używany do tworzenia wyliczenia flag, ponieważ nie jest prawidłowym typem wyliczeniowym.
pt_br: Um tipo anônimo com <list> não pode ser usado para criar enumeração de Sinalizadores porque ele não é um tipo de enumeração válido.
ru: Анонимный тип с элементом <list> не может использоваться для создания перечисления Flags, так как он не является допустимым типом перечисления.
tr: <list> içeren anonim tür geçerli bir sabit listesi türü olmadığından, Flags sabit listesi oluşturmak için kullanılamaz.
zh_hans: 带 <list> 的匿名类型无法用来创建标志枚举，因为它不是有效的枚举类型。
zh_hant: 具有 <list> 的匿名類型無法用於建立 Flags 列舉，因為該類型不是有效的列舉類型。

# EnumListMustContainAnonymousType
source: Simple type list must contain an anonymous type specifying enumeration facets.
cs: Seznam jednoduchých typů musí obsahovat anonymní typ udávající omezující vlastnosti výčtu.
de: Eine Liste einfacher Typen muss einen anonymen Typ enthalten, der Enumerationsfacets angibt.
es: La lista de tipos simple debe contener un tipo anónimo que especifique las facetas de enumeración.
fr: Une liste de type simple doit contenir un type anonyme spécifiant des facettes d'énumération.
it: Un elenco di tipi semplici deve contenere un tipo anonimo che specifica i facet di enumerazione.
ja: 単純型リストには、列挙ファセットを指定する匿名型が含まれている必要があります。
ko: 단순 형식 목록에는 열거형 패싯을 지정하는 무명 형식이 있어야 합니다.
pl: Lista typów prostych musi zawierać typ anonimowy określający aspekty wyliczenia.
pt_br: A lista de tipo simples deve conter um tipo anônimo especificando as facetas de enumeração.
ru: Список простых типов должен содержать анонимный тип, определяющий аспекты перечисления.
tr: Basit tür listesi, sabit listesi modellerini belirten bir anonim tür içermelidir.
zh_hans: 简单类型列表必须含有指定枚举方面的匿名类型。
zh_hant: 簡單型別清單必須包含指定列舉 Facet 的匿名類型。

# EnumOnlyEnumerationFacetsSupported
source: Facets other than enumeration facets are not supported.
cs: Jiné omezující vlastnosti než omezující vlastnosti výčtu nejsou podporovány.
de: Außer Enumerationsfacets werden keine weiteren Facets unterstützt.
es: No se admiten las facetas que no sean de enumeración.
fr: Des facettes autres que les facettes d'énumération ne sont pas prises en charge.
it: Non sono supportati facet diversi da quelli di enumerazione.
ja: 列挙ファセット以外のファセットはサポートされていません。
ko: 열거형 패싯이 아닌 패싯은 지원되지 않습니다.
pl: Aspekty inne niż wyliczenia nie są obsługiwane.
pt_br: Não há suporte para facetas diferentes das facetas de enumeração.
ru: Аспекты, отличные от аспектов перечисления, не поддерживаются.
tr: Sabit listesi modelleri dışındaki modeller desteklenmez.
zh_hans: 不支持除枚举方面之外的方面。
zh_hant: 不支援列舉 Facet 的 Facet。

# EnumRestrictionInvalid
source: Anonymous type with <restriction> cannot be used to create Flags enumeration because it is not a valid enum type.
cs: Anonymní typ s elementem <restriction> nelze použít k vytvoření výčtu Flags, protože to není platný typ výčtu.
de: Der anonyme Typ mit <restriction> kann nicht zum Erstellen der Flagenumeration verwendet werden, da er kein gültiger Enumerationstyp ist.
es: El tipo anónimo con <restriction> no se puede usar para crear una enumeración Flags, ya que no es un tipo de enumeración válido.
fr: Impossible d'utiliser le type anonyme avec <restriction> pour créer l'énumération Flags, car il ne s'agit pas d'un type enum valide.
it: Non è possibile usare il tipo anonimo con <restriction> per creare una enumerazione Flags perché non è un tipo di enumerazione valido.
ja: <restriction> を持つ匿名型は、有効な列挙型ではないため、Flags 列挙を作成するために使用することはできません。
ko: <restriction>이 있는 무명 형식은 유효한 열거형 형식이 아니기 때문에 플래그 열거를 만드는 데 사용할 수 없습니다.
pl: Typ anonimowy z elementem <restriction> nie może być używany do tworzenia wyliczenia flag, ponieważ nie jest prawidłowym typem wyliczeniowym.
pt_br: Um tipo anônimo com <restriction> não pode ser usado para criar enumeração de Sinalizadores porque ele não é um tipo de enumeração válido.
ru: Анонимный тип с элементом <restriction> не может использоваться для создания перечисления Flags, так как он не является допустимым типом перечисления.
tr: <restriction> içeren anonim tür geçerli bir sabit listesi türü olmadığından, Flags sabit listesi oluşturmak için kullanılamaz.
zh_hans: 带 <restriction> 的匿名类型无法用来创建标志枚举，因为它不是有效的枚举类型。
zh_hant: 具有 <restriction> 的匿名類型無法用來建立 Flags 列舉，因為該類型不是有效的列舉類型。

# EnumTypeCannotBeImported
source: Enum type '{0}' in namespace '{1}' cannot be imported. {2}
cs: Typ výčtu {0} v oboru názvů {1} nelze importovat. {2}
de: Der Enumerationstyp "{0}" im Namespace "{1}" kann nicht importiert werden. {2}
es: No se puede importar el tipo de enumeración "{0}" en el espacio de nombres "{1}". {2}
fr: Le type enum '{0}' dans l'espace de noms '{1}' ne peut pas être importé. {2}
it: Non è possibile importare il tipo di enumerazione '{0}' nello spazio dei nomi '{1}'. {2}
ja: 名前空間 '{1}' の列挙型 '{0}' をインポートできません。{2}
ko: 네임스페이스 '{1}'의 열거형 형식 '{0}'을(를) 가져올 수 없습니다. {2}
pl: Nie można zaimportować typu wyliczeniowego „{0}” w przestrzeni nazw „{1}”. {2}
pt_br: O tipo de enumeração '{0}' no namespace '{1}' não pode ser importado. {2}
ru: Не удается импортировать перечисляемый тип "{0}" в пространстве имен "{1}". {2}
tr: '{1}' ad alanındaki '{0}' sabit listesi türü içeri aktarılamıyor. {2}
zh_hans: 无法导入命名空间“{1}”中的枚举类型“{0}”。{2}
zh_hant: 無法匯入命名空間 '{1}' 中的列舉類型 '{0}'。 {2}

# EnumTypeCannotHaveIsReference
source: Enum type '{0}' cannot have the IsReference setting of '{1}'. Either change the setting to '{2}', or remove it completely.
cs: Typ výčtu {0} nemůže mít nastavení IsReference {1}. Změňte nastavení na {2}, nebo jej zcela odeberte.
de: Für den Enumerationstyp "{0}" kann die IsReference-Einstellung nicht auf "{1}" festgelegt werden. Ändern Sie die Einstellung in "{2}", oder entfernen Sie sie vollständig.
es: El tipo de enumeración "{0}" no puede tener el valor IsReference de "{1}". Cambie el valor a "{2}" o quítelo por completo.
fr: Le type enum '{0}' ne peut pas avoir le paramètre IsReference de '{1}'. Attribuez la valeur '{2}' au paramètre ou supprimez-le complètement.
it: L'impostazione IsReference del tipo enumerazione '{0}' non può essere '{1}'. Modificare l'impostazione in '{2}' o rimuoverla.
ja: 列挙型 '{0}' は、IsReference 設定の '{1}' を持てません。設定を '{2}' に変更するか、完全に削除してください。
ko: 열거형 형식 '{0}'의 IsReference 설정으로 '{1}'을(를) 사용할 수 없습니다. 설정을 '{2}'(으)로 변경하거나 완전히 제거하세요.
pl: Typ wyliczeniowy „{0}” nie może mieć ustawienia IsReference równego „{1}”. Zmień to ustawienie na „{2}” lub je usuń.
pt_br: O tipo de enumeração '{0}' não pode ter IsReference definido como '{1}'. Altere a configuração para '{2}' ou remova-a por completo.
ru: Перечисляемый тип "{0}" не может содержать параметр IsReference для "{1}". Измените параметр для "{2}" или удалите его.
tr: '{0}' sabit listesi türünün IsReference ayarı '{1}' olamaz. Ayarı '{2}' olarak değiştirin ya da tamamen kaldırın.
zh_hans: 枚举类型“{0}”不能具有值为“{1}”的 IsReference 设置。请将此设置改为“{2}”，或将其完全移除。
zh_hant: 列舉類型 '{0}' 的 IsReference 設定不可為 '{1}'。請將設定變更為 '{2}'，或將其完全移除。

# EnumTypeNotSupportedByDataContractJsonSerializer
source: DataContractJsonSerializer does not support data members of type '{0}'. Consider using int, System.Object, or a concrete enum definition instead.
cs: Metoda DataContractJsonSerializer nepodporuje datové členy typu {0}. Zvažte použití typu int, System.Object nebo konkrétní definice výčtu.
de: DataContractJsonSerializer unterstützt Datenmember vom Typ "{0}" nicht. Verwenden Sie stattdessen "int", System.Object oder eine konkrete Enumerationsdefinition.
es: El elemento DataContractJsonSerializer no admite los miembros de datos de tipo "{0}". Considere la posibilidad de usar int, System.Object o una definición de enumeración concreta en su lugar.
fr: DataContractJsonSerializer ne prend pas en charge les membres de données de type '{0}'. Utilisez int, System.Object ou une définition enum concrète à la place.
it: DataContractJsonSerializer non supporta membri dati di tipo '{0}'. Provare a usare int, System.Object o una definizione di enumerazione concreta.
ja: DataContractJsonSerializer は、型 '{0}' のデータ メンバーをサポートしていません。代わりに、int 型、System.Object 型、または具体的な列挙型の定義を使用してください。
ko: DataContractJsonSerializer에서는 '{0}' 형식의 데이터 멤버를 사용할 수 없습니다. 그 대신 정수(int), System.Object 또는 구체적 열거(enum) 정의를 사용해 보세요.
pl: Klasa DataContractJsonSerializer nie obsługuje składowych danych typu „{0}”. Rozważ użycie typu int lub System.Object albo definicji konkretnego wyliczenia.
pt_br: DataContractJsonSerializer não dá suporte a membros de dados do tipo '{0}'. Considere usar int, System.Object ou uma definição de enumeração concreta.
ru: DataContractJsonSerializer не поддерживает элементы данных типа "{0}". Вместо этого можно использовать тип int, System.Object или определение конкретного перечисляемого типа.
tr: DataContractJsonSerializer, '{0}' türünde veri üyelerini desteklemez. Onun yerine, int, System.Object veya somut bir sabit listesi tanımı kullanmayı deneyin.
zh_hans: DataContractJsonSerializer 不支持“{0}”类型的数据成员。请考虑改用 int、System.Object 或具体的 enum 定义。
zh_hant: DataContractJsonSerializer 不支援類型 '{0}' 的資料成員。請考慮改用 int、System.Object 或具象列舉定義。

# EnumUnionInAnonymousTypeNotSupported
source: Anonymous type with <union>. cannot be used to create Flags enumeration because it is not a valid enum type.
cs: Anonymní typ s elementem <union> nelze použít k vytvoření výčtu Flags, protože to není platný typ výčtu.
de: Der anonyme Typ mit <union> kann nicht zum Erstellen der Flagenumeration verwendet werden, da er kein gültiger Enumerationstyp ist.
es: El tipo anónimo con <union> no se puede usar para crear una enumeración Flags, ya que no es un tipo de enumeración válido.
fr: Impossible d'utiliser le type anonyme avec <union> pour créer l'énumération Flags, car il ne s'agit pas d'un type enum valide.
it: Non è possibile usare il tipo anonimo con <union> per creare una enumerazione Flags perché non è un tipo di enumerazione valido.
ja: <union> を持つ匿名型は有効な列挙型ではないため、この型を使用して Flags 列挙を作成することはできません。
ko: <union>.이 있는 무명 형식은 유효한 열거형 형식이 아니기 때문에 플래그 열거형을 만드는 데 사용할 수 없습니다.
pl: Nie można użyć typu anonimowego z elementem <union> do tworzenia wyliczenia flag, ponieważ nie jest on prawidłowym typem wyliczeniowym.
pt_br: Um tipo anônimo com <union>. não pode ser usado para criar enumeração de Sinalizadores porque ele não é um tipo de enumeração válido.
ru: Анонимный тип с элементом <union> не может использоваться для создания перечисления Flags, так как он не является допустимым перечисляемым типом.
tr: <union> içeren anonim tür geçerli bir sabit listesi türü olmadığından, Flags sabit listesi oluşturmak için kullanılamaz.
zh_hans: 带 <union> 的匿名类型无法用来创建标志枚举，因为它不是有效的枚举类型。
zh_hant: 具有 <union> 的匿名類型無法用來建立 Flags 列舉，因為該類型不是有效的列舉類型。

# ErrorDeserializing
source: There was an error deserializing the object {0}. {1}
cs: Při deserializaci objektu {0} došlo k chybě. {1}
de: Fehler beim Deserialisieren des Objekts {0}. {1}
es: Error al deserializar el objeto {0}. {1}
fr: Une erreur s'est produite durant la désérialisation de l'objet {0}. {1}
it: Si è verificato un errore durante la deserializzazione dell'oggetto {0}. {1}
ja: オブジェクト {0} のシリアル化を解除しているときにエラーが発生しました。{1}
ko: {0} 개체를 역직렬화하는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas deserializacji obiektu {0}. {1}
pt_br: Erro ao desserializar o objeto {0}. {1}
ru: Ошибка десериализации объекта {0}. {1}
tr: {0} nesnesi seri durumdan çıkarılırken bir hata oluştu. {1}
zh_hans: 反序列化对象 {0} 时出现错误。{1}
zh_hant: 將物件 {0} 還原序列化時發生錯誤。 {1}

# ErrorInLine
source: Error in line {0} position {1}.
cs: Chyba na řádku {0} a pozici {1}
de: Fehler in Zeile {0}, Position {1}.
es: Error en la línea {0}, posición {1}.
fr: Erreur à la ligne {0} position {1}.
it: Errore alla riga {0} posizione {1}.
ja: {0} 行目の位置 {1} にエラーがあります。
ko: 선 {0} 위치 {1}에 오류가 있습니다.
pl: Błąd w wierszu {0} w pozycji {1}.
pt_br: Erro na linha {0}, posição {1}.
ru: Ошибка в строке {0}, позиция {1}.
tr: {0}. satır {1}. konumda hata.
zh_hans: 行 {0}、位置 {1} 处出现错误。
zh_hant: 行 {0} 位置 {1} 處發生錯誤。

# ErrorIsStartObject
source: There was an error checking start element of object {0}. {1}
cs: Při kontrole počátečního elementu objektu {0} došlo k chybě. {1}
de: Fehler beim Überprüfen des Startelements des Objekts {0}. {1}
es: Error al comprobar el elemento inicial del objeto {0}. {1}
fr: Une erreur s'est produite durant la vérification de l'élément de début de l'objet {0}. {1}
it: Si è verificato un errore durante il controllo dell'elemento iniziale dell'oggetto {0}. {1}
ja: オブジェクト {0} の開始要素を確認しているときにエラーが発生しました。{1}
ko: 개체 {0}의 시작 요소를 확인하는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas sprawdzania elementu początkowego obiektu {0}. {1}
pt_br: Erro ao verificar o elemento inicial do objeto {0}. {1}
ru: Ошибка проверки начального элемента объекта {0}. {1}
tr: {0} nesnesi başlangıç öğesini denetlemede bir hata oluştu. {1}
zh_hans: 检查对象 {0} 的开始元素时出现错误。{1}
zh_hant: 檢查物件 {0} 的啟動元素時發生錯誤。 {1}

# ErrorSerializing
source: There was an error serializing the object {0}. {1}
cs: Při serializaci objektu {0} došlo k chybě. {1}
de: Fehler beim Serialisieren des Objekts {0}. {1}
es: Error al serializar el objeto {0}. {1}
fr: Une erreur s'est produite durant la sérialisation de l'objet {0}. {1}
it: Si è verificato un errore durante la serializzazione dell'oggetto {0}. {1}
ja: オブジェクト {0} のシリアル化でエラーが発生しました。{1}
ko: {0} 개체를 직렬화하는 동안 오류가 발생했습니다. {1}
pl: Wystąpił błąd podczas serializacji obiektu {0}. {1}
pt_br: Erro ao serializar o objeto {0}. {1}
ru: Ошибка сериализации объекта {0}. {1}
tr: {0} nesnesi serileştirilirken bir hata oluştu. {1}
zh_hans: 序列化对象 {0} 时出现错误。{1}
zh_hant: 序列化物件 {0} 時發生錯誤。 {1}

# ErrorTypeInfo
source: of type {0}
cs: typu {0}
de: vom Typ "{0}"
es: del tipo {0}
fr: de type {0}
it: di tipo {0}
ja: (型 {0})
ko: {0} 형식의
pl: typu {0}
pt_br: do tipo {0}
ru: типа {0}
tr: {0} türünde
zh_hans: 属于类型 {0}
zh_hant: 類型為 {0}
