Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Runtime.Serialization/Resources/xlf/SRSerialization.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidKeyValueType
source: It is an invalid dictionary type. Element '{0}' must reference a complex type containing a sequence with two required elements. Either fix the schema or remove the IsDictionary annotation.
cs: Jde o neplatný typ slovníku. Element {0} musí odkazovat na komplexní typ obsahující sekvenci se dvěma požadovanými elementy. Upravte schéma nebo odeberte poznámku IsDictionary.
de: Der Wörterbuchtyp ist ungültig. Das Element "{0}" muss auf einen komplexen Typ verweisen, der eine Sequenz mit zwei erforderlichen Elementen enthält. Korrigieren Sie das Schema, oder entfernen Sie die IsDictionary-Anmerkung.
es: Es un tipo de diccionario no válido. El elemento "{0}" debe hacer referencia a un tipo complejo que contenga una secuencia con dos elementos necesarios. Corrija el esquema o quite la anotación de IsDictionary.
fr: Il s'agit d'un type dictionnaire non valide. L'élément '{0}' doit référencer un type complexe contenant une séquence avec deux éléments obligatoires. Vous avez le choix entre corriger le schéma ou supprimer l'annotation IsDictionary.
it: È un tipo di dizionario non valido. L'elemento '{0}' deve fare riferimento a un tipo complesso contenente una sequenza con due elementi obbligatori. Correggere lo schema o rimuovere l'annotazione IsDictionary.
ja: これは、無効な辞書の型です。要素 '{0}' は、2 つの必要な要素を持つシーケンスを含んでいる複合型を参照する必要があります。スキーマを修正するか、IsDictionary 注釈を削除してください。
ko: 잘못된 사전 형식입니다. '{0}' 요소는 두 개의 필수 요소가 있는 시퀀스를 포함하는 복합 형식을 참조해야 합니다. 스키마를 수정하거나 IsDictionary 주석을 제거하세요.
pl: Jest to nieprawidłowy typ słownikowy. Element „{0}” musi odwoływać się do typu złożonego zawierającego sekwencję dwóch wymaganych elementów. Popraw schemat albo usuń adnotację IsDictionary.
pt_br: Este é um tipo de dicionários inválido. O elemento '{0}' deve referenciar um tipo complexo contendo uma sequência com dois elementos exigidos. Corrija o esquema ou remova a anotação IsDictionary.
ru: Это недопустимый тип словаря. Элемент "{0}" должен ссылаться на составной тип, содержащий последовательность из двух требуемых элементов. Исправьте схему или удалите заметку IsDictionary.
tr: Geçersiz bir sözlük türüdür. '{0}' öğesi iki gerekli öğeye sahip olan bir sıra bulunduran karmaşık bir türe başvurmalıdır. Şemayı düzeltin ya da IsDictionary açıklamasını kaldırın.
zh_hans: 这是无效的词典类型。元素“{0}”必须引用包含具有两个必需元素的序列的复杂类型。修复架构或删除 IsDictionary 注释。
zh_hant: 此為無效的字典類型。元素 '{0}' 必須參考一個複雜類型，此類型含有一個具有兩個必要元素的序列。請修正該結構描述，或移除 IsDictionary 註釋。

# InvalidKeyValueTypeNamespace
source: It is an invalid dictionary type since element '{0}' references a type from a different namespace '{1}'. Either fix the schema or remove the IsDictionary annotation.
cs: Jde o neplatný typ slovníku, protože element {0} odkazuje na typ z jiného oboru názvů {1}. Upravte schéma nebo odeberte poznámku IsDictionary.
de: Der Wörterbuchtyp ist ungültig, da das Element "{0}" auf einen Typ aus einem anderen Namespace "{1}" verweist. Korrigieren Sie das Schema, oder entfernen Sie die IsDictionary-Anmerkung.
es: Es un tipo de diccionario no válido, puesto que el elemento "{0}" hace referencia a un tipo de otro espacio de nombres: "{1}". Corrija el esquema o quite la anotación de IsDictionary.
fr: Il s'agit d'un type dictionnaire non valide, car l'élément '{0}' référence un type à partir d'un autre espace de noms '{1}'. Vous avez le choix entre corriger le schéma ou supprimer l'annotation IsDictionary.
it: È un tipo di dizionario non valido. L'elemento '{0}' fa riferimento a un tipo di uno spazio dei nomi diverso ('{1}'). Correggere lo schema o rimuovere l'annotazione IsDictionary.
ja: 異なる名前空間 '{1}' からの型を要素 '{0}' が参照しているため、これは無効な辞書の型です。スキーマを修正するか、IsDictionary 注釈を削除してください。
ko: '{0}' 요소는 다른 네임스페이스 '{1}'의 형식을 참조하므로 잘못된 사전 형식입니다. 스키마를 수정하거나 IsDictionary 주석을 제거하세요.
pl: Jest to nieprawidłowy typ słownikowy, ponieważ element „{0}” odwołuje się do typu z innej przestrzeni nazw „{1}”. Popraw schemat albo usuń adnotację IsDictionary.
pt_br: Este é um tipo de dicionário inválido porque o elemento '{0}' referencia um tipo de um namespace diferente '{1}'. Corrija o esquema ou remova a anotação IsDictionary.
ru: Это недопустимый тип словаря, так как элемент "{0}" ссылается на тип из другого пространства имен "{1}". Исправьте схему или удалите заметку IsDictionary.
tr: '{0}' öğesi farklı bir '{1}' ad alanındaki bir türe başvuru yaptığından, bu geçerli bir sözlük türü değildir. Şemayı düzeltin ya da IsDictionary açıklamasını kaldırın.
zh_hans: 由于元素“{0}”从另一个命名空间“{1}”中引用类型，因此为无效的词典类型。修复架构或删除 IsDictionary 注释。
zh_hant: 因為元素 '{0}' 參考來自其他命名空間 '{1}'的類型，所以此為無效的字典類型。請修正該結構描述，或移除 IsDictionary 註釋。

# InvalidLocalNameEmpty
source: The empty string is not a valid local name.
cs: Prázdný řetězec není platný místní název.
de: Die leere Zeichenfolge ist kein gültiger lokaler Name.
es: La cadena vacía no es un nombre local válido.
fr: La chaîne vide n'est pas un nom local valide.
it: La stringa vuota non è un nome locale valido.
ja: 空の文字列はローカル名として無効です。
ko: 빈 문자열은 유효한 로컬 이름이 아닙니다.
pl: Pusty ciąg nie jest prawidłową nazwą lokalną.
pt_br: A cadeia de caracteres vazia não é um nome local válido.
ru: Пустая строка не является допустимым локальным именем.
tr: Boş dize geçerli bir yerel ad değil.
zh_hans: 空字符串不是有效的本地名称。
zh_hant: 空字串不是有效的本機名稱。

# InvalidMember
source: Member '{0}.{1}' cannot be serialized since it is neither a field nor a property, and therefore cannot be marked with the DataMemberAttribute attribute. Remove the DataMemberAttribute attribute from the '{1}' member.
cs: Člen {0}.{1} nelze serializovat, protože to není pole ani vlastnost, takže ho není možné označit atributem DataMemberAttribute. Odeberte atribut DataMemberAttribute ze členu {1}.
de: Der Member "{0}.{1}" kann nicht serialisiert werden, da er weder ein Feld noch eine Eigenschaft ist. Er kann daher nicht mit dem Attribut DataMemberAttribute markiert werden. Entfernen Sie das Attribut DataMemberAttribute aus dem {1}-Member.
es: El miembro "{0}.{1}" no se puede serializar, ya que no es un campo ni una propiedad y, por consiguiente, no se puede marcar con el atributo DataMemberAttribute. Quite el atributo DataMemberAttribute del miembro "{1}".
fr: Sérialisation du membre '{0}.{1}' impossible, car ce n'est ni un champ ni une propriété ; ainsi il ne peut pas être marqué avec l'attribut DataMemberAttribute. Supprimez l'attribut DataMemberAttribute du membre '{1}'.
it: Non è possibile serializzare il membro '{0}.{1}' perché non è un campo né una proprietà e non può quindi essere contrassegnato con l'attributo DataMemberAttribute. Rimuovere l'attributo DataMemberAttribute dal membro '{1}'.
ja: メンバー '{0}.{1}' は、フィールドでもプロパティでもないためシリアル化できず、したがって DataMemberAttribute 属性を設定できません。DataMemberAttribute 属性を '{1}' メンバーから削除してください。
ko: '{0}.{1}' 멤버는 필드 또는 속성이 아니어서 직렬화할 수 없으므로 DataMemberAttribute 특성으로 표시할 수 없습니다. '{1}' 멤버에서 DataMemberAttribute 특성을 제거하세요.
pl: Nie można serializować składowej „{0}.{1}”, ponieważ nie jest ona polem ani właściwością i dlatego nie może być oznaczona za pomocą atrybutu DataMemberAttribute. Usuń atrybut DataMemberAttribute ze składowej „{1}”.
pt_br: O membro '{0}.{1}' não pode ser serializado porque ele não é um campo nem uma propriedade e, portanto, não pode ser marcado com o atributo DataMemberAttribute. Remova o atributo DataMemberAttribute do membro '{1}'.
ru: Член "{0}.{1}" не может быть сериализован, так как он не является полем или свойством и поэтому не может быть помечен атрибутом DataMemberAttribute. Удалите атрибут DataMemberAttribute члена "{1}".
tr: Bir alan ya da özellik olmadığından '{0}.{1}' üyesi serileştirilemiyor, bu nedenle DataMemberAttribute özniteliğiyle işaretlenemiyor. '{1}' üyesinden DataMemberAttribute özniteliğini kaldırın.
zh_hans: 由于成员“{0}.{1}”既不是字段也不是属性，而无法序列化，因此无法将其标记为 DataMemberAttribute 特性。从“{1}”成员中删除 DataMemberAttribute 特性。
zh_hant: 無法將成員 '{0}.{1}' 序列化，因為它既不是欄位也不是屬性，因此不可標示有 DataMemberAttribute 屬性。請從 '{1}' 成員移除 DataMemberAttribute 屬性。

# InvalidNodeType
source: '{0}' is an invalid node type.
cs: {0} není platný typ uzlu.
de: "{0}" ist ein ungültiger Knotentyp.
es: "{0}" es un tipo de nodo no válido.
fr: '{0}' est un type de nœud non valide.
it: '{0}' è un tipo di nodo non valido.
ja: '{0}' は無効なノード型です。
ko: '{0}'이(가) 잘못된 노드 형식입니다.
pl: Typ „{0}” jest nieprawidłowym typem węzła.
pt_br: '{0}' é um tipo de nó inválido.
ru: "{0}" является недопустимым типом узла.
tr: '{0}' geçersiz bir düğüm türüdür.
zh_hans: “{0}”为无效节点类型。
zh_hant: '{0}' 是無效的節點類型。

# InvalidNonNullReturnValueByIsAny
source: Method '{0}.{1}()' returns a non-null value. The return value must be null since IsAny=true.
cs: Metoda {0}.{1}() vrací hodnotu jinou než null. Vrácená hodnota musí být null, protože vlastnost IsAny=true.
de: Die {0}.{1}()-Methode gibt einen Wert ungleich NULL zurück. Der Rückgabewert muss NULL sein, da "IsAny=true" festgelegt ist.
es: El método "{0}.{1}()" devuelve un valor que no es nulo. El valor devuelto debe ser nulo, ya que IsAny=true.
fr: La méthode '{0}.{1}()' retourne une valeur non null. La valeur retournée doit être une valeur null, car IsAny=true.
it: Il metodo '{0}.{1}()' restituisce un valore diverso da Null. Il valore restituito deve essere Null perché IsAny=true.
ja: メソッド '{0}.{1}()' が null 以外の値を返しています。IsAny=true であるため、戻り値は null である必要があります。
ko: '{0}.{1}()' 메서드가 null이 아닌 값을 반환합니다. IsAny=true이므로 반환 값은 null이어야 합니다.
pl: Metoda „{0}.{1}()” zwraca wartość inną niż null. Wymagana zwracana wartość to null, ponieważ określono warunek IsAny=true.
pt_br: O método '{0}.{1}()' retorna um valor não nulo. O valor retornado deve ser nulo desde que IsAny=true.
ru: Метод "{0}.{1}()" возвращает значение, отличное от null. Возвращенное значение должно быть null, так как IsAny=true.
tr: '{0}.{1}()' metodu boş olmayan bir değer döndürüyor. IsAny=true olduğundan döndürülen değerin null olması gerekir.
zh_hans: 方法“{0}.{1}()”返回一个非 null 值。由于 IsAny=true，因此返回值必须为 null。
zh_hant: 方法 '{0}.{1}()' 傳回了非 Null 值。因為 IsAny=true，所以傳回值必須為 Null。

# InvalidPrimitiveType
source: Type '{0}' is not a valid serializable type.
cs: Typ {0} není platný serializovatelný typ.
de: Der Typ "{0}" ist kein gültiger serialisierbarer Typ.
es: El tipo "{0}" no es un tipo serializable válido.
fr: Le type '{0}' n'est pas un type sérialisable valide.
it: Il tipo '{0}' non è un tipo serializzabile valido.
ja: 型 '{0}' はシリアル化可能な有効な型ではありません。
ko: '{0}' 형식은 잘못된 직렬화 가능 형식입니다.
pl: Typ „{0}” nie jest prawidłowym typem, który można serializować.
pt_br: O tipo '{0}' não é um tipo serializável válido.
ru: Тип "{0}" не является допустимым сериализуемым типом.
tr: '{0}' türü, geçerli bir serileştirilebilir tür değil.
zh_hans: 类型“{0}”不是有效的可序列化类型。
zh_hant: 類型 '{0}' 不是有效的可序列化類型。

# InvalidReturnTypeOnGetSchemaMethod
source: Method '{0}.{1}()' returns '{2}'. The return type must be compatible with '{3}' or '{4}'.
cs: Metoda {0}.{1}() vrací typ {2}. Vrácený typ musí být kompatibilní s {3} nebo {4}.
de: Die Methode {0}.{1}() gibt "{2}" zurück. Der Rückgabetyp muss mit "{3}" oder "{4}" kompatibel sein.
es: El método "{0}.{1}()" devuelve "{2}". El tipo de valor devuelto debe ser compatible con "{3}" o "{4}".
fr: La méthode '{0}.{1}()' retourne '{2}'. Le type de retour doit être compatible avec '{3}' ou '{4}'.
it: Il metodo '{0}.{1}()' restituisce '{2}'. Il tipo restituito deve essere compatibile con '{3}' o '{4}'.
ja: メソッド '{0}.{1}()' は '{2}' を返します。戻り値の型は、'{3}' または '{4}' と互換性がある必要があります。
ko: '{0}.{1}()' 메서드가 '{2}'을(를) 반환합니다. 반환 형식은 '{3}' 또는 '{4}'과(와) 호환되어야 합니다.
pl: Metoda „{0}.{1}()” zwraca wartość „{2}”. Zwracany typ musi być zgodny z elementem „{3}” lub „{4}”.
pt_br: O método '{0}.{1}()' retorna '{2}'. O tipo de retorno deve ser compatível com '{3}' ou '{4}'.
ru: Метод "{0}.{1}()" вернул "{2}". Тип возвращаемого значения должен быть совместим с "{3}" или "{4}".
tr: '{0}.{1}()' metodu, '{2}' döndürüyor. Dönüş türü '{3}' veya '{4}' ile uyumlu olmalıdır.
zh_hans: 方法“{0}.{1}()”返回“{2}”。返回类型必须与“{3}”或“{4}”兼容。
zh_hant: 方法 '{0}.{1}()' 傳回了 '{2}'。傳回型別必須與 '{3}' 或 '{4}' 相容。

# InvalidSizeDefinition
source: Invalid Size '{0}'. Must be non-negative integer.
cs: Neplatná velikost {0}. Musí být nezáporné celé číslo.
de: Ungültige Größe "{0}". Die Größe muss eine nicht negative ganze Zahl sein.
es: Tamaño no válido, "{0}". Debe ser un número entero no negativo.
fr: Taille non valide '{0}'. Doit être un entier non négatif.
it: Le dimensioni '{0}' non sono valide. Devono essere un numero intero non negativo.
ja: サイズ '{0}' は無効です。負でない整数である必要があります。
ko: '{0}' 크기가 잘못되었습니다. 음수가 아닌 정수여야 합니다.
pl: Nieprawidłowy rozmiar: „{0}”. Wartość musi być nieujemną liczbą całkowitą.
pt_br: Tamanho inválido '{0}'. Deve ser inteiro não negativo.
ru: Недопустимый размер "{0}". Должен быть неотрицательным целым числом.
tr: Geçersiz "Size" '{0}'. Negatif olmayan tamsayı olmalı.
zh_hans: 大小“{0}”无效。它必须为非负的整数。
zh_hant: 大小 '{0}' 無效。必須是非負數的整數。

# InvalidStateInExtensionDataReader
source: An internal error has occurred. ExtensionDataReader is in an invalid state.
cs: Došlo k vnitřní chybě. ExtensionDataReader je v neplatném stavu.
de: Ein interner Fehler ist aufgetreten. ExtensionDataReader befindet sich in einem ungültigen Zustand.
es: Error interno. El estado de ExtensionDataReader no es válido.
fr: Une erreur interne s'est produite. ExtensionDataReader présente un état non valide.
it: Si è verificato un errore interno. ExtensionDataReader non è in uno stato valido.
ja: 内部エラーが発生しました。ExtensionDataReader の状態が無効です。
ko: 내부 오류가 발생했습니다. ExtensionDataReader가 잘못된 상태입니다.
pl: Wystąpił wewnętrzny błąd. Stan elementu ExtensionDataReader jest nieprawidłowy.
pt_br: Erro interno. O ExtensionDataReader está em um estado inválido.
ru: Произошла внутренняя ошибка. ExtensionDataReader находится в недопустимом состоянии.
tr: Bir iç hata oluştu. ExtensionDataReader geçersiz bir durumda.
zh_hans: 出现内部错误。ExtensionDataReader 处于无效状态。
zh_hant: 發生內部錯誤。ExtensionDataReader 處於無效的狀態。

# InvalidXmlDataContractName
source: XML data contract Name for type '{0}' cannot be set to null or empty string.
cs: Název kontraktu dat XML pro typ {0} nemůže být nastaven na hodnotu null nebo prázdný řetězec.
de: Der XML-Datenvertragsname für den Typ "{0}" darf nicht auf NULL oder eine leere Zeichenfolge festgelegt sein.
es: El nombre de contrato de datos XML para el tipo "{0}" no puede ser una cadena nula o vacía.
fr: Le nom de contrat de données XML pour le type '{0}' ne peut pas avoir une valeur null ou être une chaîne vide.
it: Il nome del contratto di dati XML per il tipo '{0}' non può essere una stringa vuota o Null.
ja: 型 '{0}' に対する XML データ コントラクト名を、null および空の文字列に設定することはできません。
ko: '{0}' 형식에 대한 XML 데이터 계약 이름은 null 또는 빈 문자열로 설정할 수 없습니다.
pl: Wartość elementu Name kontraktu danych XML w przypadku typu „{0}” nie może mieć wartości null ani nie może być pustym ciągiem.
pt_br: O Nome do contrato de dados XML do tipo '{0}' não pode ser definido como uma cadeia de caracteres nula ou vazia.
ru: Параметр Name контракта данных XML для типа "{0}" не может иметь в качестве значения null или пустую строку.
tr: '{0}' türü için XML veri anlaşması Name değeri null ya da boş dize olarak ayarlanamaz.
zh_hans: 类型为“{0}”的 XML 数据协定 Name 无法设置为 Null 或空字符串。
zh_hant: 無法將類型 '{0}' 的 XML 資料合約 Name 設為 Null 或空字串。

# InvalidXmlDeserializingExtensionData
source: The XML encountered when deserializing extension data is invalid.
cs: Data XML nalezená při deserializaci dat rozšíření nejsou platná.
de: Der beim Deserialisieren von Erweiterungsdaten gefundene XML-Code ist ungültig.
es: Los datos XML encontrados al deserializar los datos de extensión no son válidos.
fr: Le flux XML rencontré durant la désérialisation des données d'extension est non valide.
it: I dati XML rilevati durante la deserializzazione dei dati di estensione non sono validi.
ja: 拡張データのシリアル化を解除する際に検出された XML は無効です。
ko: 확장 데이터를 deserialize하는 동안 잘못된 XML을 찾았습니다.
pl: Podczas deserializacji danych rozszerzenia napotkano nieprawidłowe dane XML.
pt_br: O XML encontrado ao desserializar os dados da extensão é inválido.
ru: Недопустимый параметр XML при десериализации данных расширения.
tr: Uzantı verileri seri durumdan çıkarılırken karşılaşılan XML geçersiz.
zh_hans: 反序列化扩展数据无效时遇到的 XML。
zh_hant: 將延伸模組資料還原序列化時的 XML 無效。

# InvalidXsIdDefinition
source: Invalid Id '{0}'. Must not be null or empty.
cs: Neplatný identifikátor {0}. Nesmí být prázdný nebo mít hodnotu null.
de: Ungültige ID "{0}". Die ID darf nicht NULL oder leer sein.
es: Id. "{0}" no válido. No debe ser nulo ni estar vacío.
fr: ID '{0}' non valide. Doit avoir une valeur null ou être vide.
it: ID '{0}' non valido. Deve essere Null o vuoto.
ja: ID '{0}' が無効です。null および空であってはなりません。
ko: '{0}'은(는) 잘못된 ID입니다. ID는 Null이거나 비어 있을 수 없습니다.
pl: Nieprawidłowy identyfikator „{0}”. Musi on mieć wartość null lub być pusty.
pt_br: ID Inválida '{0}'. Não deve ser nula nem vazia.
ru: Недопустимый идентификатор "{0}". Он не должен быть пустым или иметь значение NULL.
tr: Geçersiz kimlik: '{0}'. Null veya boş olmamalıdır.
zh_hans: 无效的 ID“{0}”。不能为 Null 或为空。
zh_hant: 識別碼 '{0}' 無效。不可為 null 或空白。

# InvalidXsRefDefinition
source: Invalid Ref '{0}'. Must not be null or empty.
cs: Neplatný odkaz {0}. Nesmí být prázdný nebo mít hodnotu null.
de: Ungültiger Verweis "{0}". Der Verweis darf nicht NULL oder leer sein.
es: Referencia "{0}" no válida. No debe ser nula ni estar vacía.
fr: Réf. non valide '{0}'. Doit avoir une valeur null ou être vide.
it: Riferimento '{0}' non valido. Deve essere Null o vuoto.
ja: Ref '{0}' は無効です。null および空であってはなりません。
ko: '{0}'은(는) 잘못된 참조입니다. 참조는 Null이거나 비어 있을 수 없습니다.
pl: Nieprawidłowy parametr Ref „{0}”. Musi on mieć wartość null lub być pusty.
pt_br: Referência Inválida '{0}'. Não deve ser nula nem vazia.
ru: Недопустимая ссылка "{0}. Она не должна быть пустой или иметь значение null.
tr: Geçersiz başvuru: '{0}'. Null veya boş olmamalıdır.
zh_hans: 无效的引用“{0}”。不能为 Null 或为空。
zh_hant: Ref '{0}' 無效。不可為 null 或空白。

# IsAnyCannotBeNull
source: A null value cannot be serialized at the top level for IXmlSerializable root type '{0}' since its IsAny setting is 'true'. This type must write all its contents including the root element. Verify that the IXmlSerializable implementation is correct.
cs: Hodnotu null nelze na nejvyšší úrovni pro kořenový typ IXmlSerializable {0} serializovat, protože její nastavení IsAny má hodnotu true. Tento typ musí zapsat všechen obsah včetně kořenového prvku. Ověřte, že implementace IXmlSerializable je správná.
de: Ein NULL-Wert kann nicht auf oberster Ebene für den IXmlSerializable-Stammtyp "{0}" serialisiert werden, da die IsAny-Einstellung auf "true" gesetzt ist. Dieser Typ muss seinen gesamten Inhalt einschließlich des Stammelements schreiben. Stellen Sie sicher, dass die IXmlSerializable-Implementierung korrekt ist.
es: No se puede serializar un valor nulo en el nivel superior el tipo raíz IXmlSerializable "{0}", ya que el valor de su opción IsAny es "true". Este tipo debe escribir todo su contenido, incluido el elemento raíz. Compruebe que la implementación de IXmlSerializable es correcta.
fr: Sérialisation impossible d'une valeur null au niveau supérieur pour le type racine IXmlSerializable '{0}', car son paramètre IsAny a la valeur 'true'. Ce type doit écrire tout son contenu, en incluant l'élément racine. Vérifiez que l'implémentation IXmlSerializable est correcte.
it: Non è possibile serializzare un valore Null al primo livello per il tipo radice '{0}' di IXmlSerializable perché IsAny è 'true'. Questo tipo deve scrivere l'intero contenuto, compreso l'elemento radice. Verificare che l'implementazione di IXmlSerializable sia corretta.
ja: IXmlSerializable ルート型 '{0}' の IsAny は 'true' に設定されているため、この型のトップ レベルで null 値をシリアル化できません。この型は、ルート要素を含むそのすべての内容を書き込む必要があります。IXmlSerializable の実装が正しいことを確認してください。
ko: 해당 IsAny 설정이 'true'이기 때문에 IXmlSerializable 루트 형식 '{0}'의 최상위 수준에서 null 값을 직렬화할 수 없습니다. 이 형식은 루트 요소를 포함한 모든 내용을 기록해야 합니다. IXmlSerializable 구현이 올바른지 확인하세요.
pl: Wartości null nie można serializować na najwyższym poziomie w przypadku typu głównego „{0}” interfejsu IXmlSerializable, ponieważ wartość jego parametru IsAny to „true”. W przypadku tego typu musi być zapisana cała jego zawartość, łącznie z elementem głównym. Upewnij się, że implementacja interfejsu IXmlSerializable jest prawidłowa.
pt_br: Um valor nulo não pode ser serializado no nível superior do tipo de raiz IXmlSerializable '{0}' porque sua configuração IsAny é 'true'. Esse tipo deve gravar todo o seu conteúdo, inclusive o elemento raiz. Verifique se a implementação do IXmlSerializable está correta.
ru: Значение null не может быть сериализовано на самом верхнем уровне, так как тип корня IXmlSerializable "{0}" с IsAny=true должен записать все свое содержимое, включая корневой элемент. Проверьте правильность реализации IXmlSerializable.
tr: IsAny ayarı 'true' olduğundan, IXmlSerializable kök türü '{0}' en üst düzeyinde bir null değeri serileştirilemez. Bu tür, kök öğeyi de içeren içerik değerlerinin tümünü yazmalıdır. IXmlSerializable uygulamasının doğru olduğundan emin olun.
zh_hans: 由于 IXmlSerializable 根类型“{0}”的 IsAny 设置为 "true"，因此无法在其顶层序列化 null 值。此类型必须写入包括根元素在内的所有内容。请验证 IXmlSerializable 实现是否正确。
zh_hant: 因為其 IsAny 設定為 'true'，所以無法在 IXmlSerializable 根類型 '{0}' 的最上層序列化 Null 值。此類型必須寫入其所有內容，包括根項目在內。請確定 IXmlSerializable 實作正確。
