Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Web.Services/xlf/ResWebServices.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# WebDuplicateFormatExtension
source: More than one format extension named '{0}' was specified. Each format extension must have a unique name.
cs: Bylo určeno více rozšíření formátu s názvem {0}. Každé rozšíření formátu musí mít jedinečný název.
de: Es wurden mehrere Formaterweiterungen mit dem Namen "{0}" angegeben. Jede Formaterweiterung muss einen eindeutigen Namen haben.
es: Se especificó más de una extensión de formato denominada "{0}". Cada extensión de formato debe tener un nombre único.
fr: Plusieurs extensions de format nommées '{0}' ont été spécifiées. Chaque extension de format doit avoir un nom unique.
it: Sono state specificate più estensioni di formato denominate '{0}'. I nomi delle estensioni di formato devono essere univoci.
ja: '{0}' という名前のフォーマット拡張が 1 つ以上指定されました。各フォーマット拡張には一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 형식 확장이 두 개 이상 지정되었습니다. 각 형식 확장은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedno rozszerzenie formatu o nazwie „{0}”. Nazwa każdego rozszerzenia formatu musi być unikatowa.
pt_br: Mais de uma extensão de formato denominada '{0}' foi especificada. Cada extensão de formato deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla biçim uzantısı belirtildi. Biçim uzantısı adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的格式扩展。每个格式扩展必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的格式延伸。每個格式延伸都必須要有唯一的名稱。

# WebDuplicateImport
source: More than one import named '{0}' was specified. Each import must have a unique name.
cs: Bylo určeno více importů s názvem {0}. Každý import musí mít jedinečný název.
de: Es wurden mehrere Importvorgänge mit dem Namen "{0}" angegeben. Jeder Importvorgang muss einen eindeutigen Namen haben.
es: Se especificó más de una importación denominada "{0}". Cada importación debe tener un nombre único.
fr: Plusieurs importations nommées '{0}' ont été spécifiées. Chaque importation doit avoir un nom unique.
it: Sono state specificate più importazioni denominate '{0}'. I nomi delle importazioni devono essere univoci.
ja: '{0}' という名前のインポートが 1 つ以上指定されました。各インポートに一意の名前の指定しなければなりません。
ko: 이름이 '{0}'인 가져오기가 두 개 이상 지정되었습니다. 각 가져오기는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedną operację importowania o nazwie „{0}”. Nazwa każdej operacji importowania musi być unikatowa.
pt_br: Mais de uma importação denominada '{0}' foi especificada. Cada importação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla içeri aktarma işlemi belirtildi. İçeri aktarma işlemi adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的导入。每个导入必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的匯入。每個匯入都必須要有唯一的名稱。

# WebDuplicateMessage
source: More than one message named '{0}' was specified. Each message must have a unique name.
cs: Bylo určeno více zpráv s názvem {0}. Každá zpráva musí mít jedinečný název.
de: Es wurden mehrere Nachrichten mit dem Namen "{0}" angegeben. Jede Nachricht muss einen eindeutigen Namen haben.
es: Se especificó más de un mensaje denominado "{0}". Cada mensaje debe tener un nombre único.
fr: Plusieurs messages nommés '{0}' ont été spécifiés. Chaque message doit avoir un nom unique.
it: Sono stati specificati più messaggi denominati '{0}'. I nomi dei messaggi devono essere univoci.
ja: '{0}' という名前のメッセージが 1 つ以上指定されました。各メッセージに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 메시지가 두 개 이상 지정되었습니다. 각 메시지는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden komunikat o nazwie „{0}”. Nazwa każdego komunikatu musi być unikatowa.
pt_br: Mais de uma mensagem denominada '{0}' foi especificada. Cada mensagem deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla ileti belirtildi. İleti adları benzersiz olmalıdır.
zh_hans: 指定了多条名为“{0}”的消息。每条消息必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的訊息。每個訊息都必須要有唯一的名稱。

# WebDuplicateMessagePart
source: More than one message part named '{0}' was specified. Each message part must have a unique name.
cs: Bylo určeno více částí zprávy s názvem {0}. Každá část zprávy musí mít jedinečný název.
de: Es wurden mehrere Nachrichtenteile mit dem Namen "{0}" angegeben. Jeder Nachrichtenteil muss einen eindeutigen Namen haben.
es: Se especificó más de una parte de mensaje denominada "{0}". Cada parte de mensaje debe tener un nombre único.
fr: Plusieurs parties de message nommées '{0}' ont été spécifiées. Chaque partie de message doit avoir un nom unique.
it: Sono state specificate più parti di messaggio denominate '{0}'. I nomi delle parti di messaggio devono essere univoci.
ja: '{0}' という名前のメッセージ パーツが 1 つ以上指定されました。各メッセージ パーツに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 메시지 부분이 두 개 이상 지정되었습니다. 각 메시지 부분은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedną część komunikatu o nazwie „{0}”. Nazwa każdej części komunikatu musi być unikatowa.
pt_br: Mais de uma parte de mensagem denominada '{0}' foi especificada. Cada parte de mensagem deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla ileti parçası belirtildi. İleti parçası adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的消息部分。每个消息部分必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的訊息組件。每個訊息組件都必須要有唯一的名稱。

# WebDuplicateOperation
source: More than one operation named '{0}' was specified. Each operation must have a unique name.
cs: Bylo určeno více operací s názvem {0}. Každá operace musí mít jedinečný název.
de: Es wurden mehrere Vorgänge mit dem Namen "{0}" angegeben. Jeder Vorgang muss einen eindeutigen Namen haben.
es: Se especificó más de una operación denominada "{0}". Cada operación debe tener un nombre único.
fr: Plusieurs opérations nommées '{0}' ont été spécifiées. Chaque opération doit avoir un nom unique.
it: Sono state specificate più operazioni denominate '{0}'. I nomi delle operazioni devono essere univoci.
ja: '{0}' という名前の操作が 1 つ以上指定されました。各操作に一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 작업이 두 개 이상 지정되었습니다. 각 작업은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedną operację o nazwie „{0}”. Nazwa każdej operacji musi być unikatowa.
pt_br: Mais de uma operação denominada '{0}' foi especificada. Cada operação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla işlem belirtildi. İşlem adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的操作。每个操作必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的作業。每個作業都必須要有唯一的名稱。

# WebDuplicateOperationBinding
source: More than one operation binding named '{0}' was specified. Each operation binding must have a unique name.
cs: Bylo určeno více operačních vazeb s názvem {0}. Každá operační vazba musí mít jedinečný název.
de: Es wurden mehrere Vorgangsbindungen mit dem Namen "{0}" angegeben. Jede Vorgangsbindung muss einen eindeutigen Namen haben.
es: Se especificó más de un enlace de operación denominado "{0}". Cada enlace de operación debe tener un nombre único.
fr: Plusieurs liaisons d'opération nommées '{0}' ont été spécifiées. Chaque liaison d'opération doit avoir un nom unique.
it: Sono stati specificati più binding di operazione denominati '{0}'. I nomi dei binding di operazione devono essere univoci.
ja: '{0}' という名前の操作バインドが 1 つ以上指定されました。各操作バインドに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 작업 바인딩이 두 개 이상 지정되었습니다. 각 작업 바인딩은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedno powiązanie operacji o nazwie „{0}”. Nazwa każdego powiązania operacji musi być unikatowa.
pt_br: Mais de uma associação de operação denominada '{0}' foi especificada. Cada associação de operação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla işlem bağlaması belirtildi. İşlem bağlaması adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的操作绑定。每个操作绑定必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的作業繫結。每個作業繫結都必須要有唯一的名稱。

# WebDuplicateOperationFault
source: More than one operation fault named '{0}' was specified. Each operation fault must have a unique name.
cs: Bylo určeno více operačních chyb s názvem {0}. Každá operační chyba musí mít jedinečný název.
de: Es wurden mehrere Vorgangsfehler mit dem Namen "{0}" angegeben. Jeder Vorgangsfehler muss einen eindeutigen Namen haben.
es: Se especificó más de un error de operación denominado "{0}". Cada error de operación debe tener un nombre único.
fr: Plusieurs erreurs d'opération nommées '{0}' ont été spécifiées. Chaque erreur d'opération doit avoir un nom unique.
it: Sono stati specificati più errori di operazione denominati '{0}'. I nomi degli errori di operazione devono essere univoci.
ja: '{0}' という名前の操作フォールトが 1 つ以上指定されました。各操作フォールトに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 작업 오류가 두 개 이상 지정되었습니다. 각 작업 오류는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden błąd operacji o nazwie „{0}”. Nazwa każdego błędu operacji musi być unikatowa.
pt_br: Mais de uma falha de operação denominada '{0}' foi especificada. Cada falha de operação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla işlem hatası belirtildi. İşlem hatası adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的操作错误。每个操作错误必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的作業錯誤。每個作業錯誤都必須要有唯一的名稱。

# WebDuplicateOperationMessage
source: More than one operation message named '{0}' was specified. Each operation message must have a unique name.
cs: Bylo určeno více operačních zpráv s názvem {0}. Každá operační zpráva musí mít jedinečný název.
de: Es wurden mehrere Vorgangsmeldungen mit dem Namen "{0}" angegeben. Jede Vorgangsmeldung muss einen eindeutigen Namen haben.
es: Se especificó más de un mensaje de operación denominado "{0}". Cada mensaje de operación debe tener un nombre único.
fr: Plusieurs messages d'opération nommés '{0}' ont été spécifiés. Chaque message d'opération doit avoir un nom unique.
it: Sono stati specificati più messaggi di operazione denominati '{0}'. I nomi dei messaggi di operazione devono essere univoci.
ja: '{0}' という名前の操作メッセージが 1 つ以上指定されました。各操作メッセージに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 작업 메시지가 두 개 이상 지정되었습니다. 각 작업 메시지는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden komunikat operacji o nazwie „{0}”. Nazwa każdego komunikatu operacji musi być unikatowa.
pt_br: Mais de uma mensagem de operação denominada '{0}' foi especificada. Cada mensagem de operação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla işlem iletisi belirtildi. İşlem iletisi adları benzersiz olmalıdır.
zh_hans: 指定了多条名为“{0}”的操作消息。每条操作消息必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的作業訊息。每個作業訊息都必須要有唯一的名稱。

# WebDuplicatePort
source: More than one port named '{0}' was specified. Each port must have a unique name.
cs: Bylo určeno více portů s názvem {0}. Každý port musí mít jedinečný název.
de: Es wurden mehrere Ports mit dem Namen "{0}" angegeben. Jeder Port muss einen eindeutigen Namen haben.
es: Se especificó más de un puerto denominado "{0}". Cada puerto debe tener un nombre único.
fr: Plusieurs ports nommés '{0}' ont été spécifiés. Chaque port doit avoir un nom unique.
it: Sono state specificate più porte denominate '{0}'. I nomi delle porte devono essere univoci.
ja: '{0}' という名前のポートが 1 つ以上指定されました。各ポートに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 포트가 두 개 이상 지정되었습니다. 각 포트는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden port o nazwie „{0}”. Nazwa każdego portu musi być unikatowa.
pt_br: Mais de uma porta denominada '{0}' foi especificada. Cada porta deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla bağlantı noktası belirtildi. Bağlantı noktası adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的端口。每个端口必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的連接埠。每個連接埠都必須要有唯一的名稱。

# WebDuplicatePortType
source: More than one port type named '{0}' was specified. Each port type must have a unique name.
cs: Bylo určeno více typů portů s názvem {0}. Každý typ portu musí mít jedinečný název.
de: Es wurden mehrere Porttypen mit dem Namen "{0}" angegeben. Jeder Porttyp muss einen eindeutigen Namen haben.
es: Se especificó más de un tipo de puerto denominado "{0}". Cada tipo de puerto debe tener un nombre único.
fr: Plusieurs types de port nommés '{0}' ont été spécifiés. Chaque type de port doit avoir un nom unique.
it: Sono stati specificati più tipi di porta denominati '{0}'. I nomi dei tipi di porta devono essere univoci.
ja: '{0}' という名前のポートの種類が 1 つ以上指定されました。各ポートの種類に一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 포트 종류가 두 개 이상 지정되었습니다. 각 포트 종류는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden typ portu o nazwie „{0}”. Nazwa każdego typu portu musi być unikatowa.
pt_br: Mais de um tipo de porta denominado '{0}' foi especificado. Cada tipo de porta deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla bağlantı noktası türü belirtildi. Bağlantı noktası türü adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的端口类型。每个端口类型必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的連接埠類型。每個連接埠類型都必須要有唯一的名稱。

# WebDuplicateService
source: More than one service named '{0}' was specified. Each service must have a unique name.
cs: Bylo určeno více služeb s názvem {0}. Každá služba musí mít jedinečný název.
de: Es wurden mehrere Dienste mit dem Namen "{0}" angegeben. Jeder Dienst muss einen eindeutigen Namen haben.
es: Se especificó más de un servicio denominado "{0}". Cada servicio debe tener un nombre único.
fr: Plusieurs services nommés '{0}' ont été spécifiés. Chaque service doit avoir un nom unique.
it: Sono stati specificati più servizi denominati '{0}'. I nomi dei servizi devono essere univoci.
ja: '{0}' という名前のサービスが 1 つ以上指定されました。各サービスに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 서비스가 두 개 이상 지정되었습니다. 각 서비스는 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedną usługę o nazwie „{0}”. Nazwa każdej usługi musi być unikatowa.
pt_br: Mais de um serviço denominado '{0}' foi especificado. Cada serviço deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla hizmet belirtildi. Hizmet adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的服务。每个服务必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的服務。每個服務都必須要有唯一的名稱。

# WebDuplicateUnknownElement
source: More than one {0} named '{1}' was specified. Each {0} must have a unique name.
cs: Bylo určeno více prvků {0} s názvem {1}. Každý prvek {0} musí mít jedinečný název.
de: Es wurden mehrere {0}-Elemente mit dem Namen "{1}" angegeben. Jedes {0}-Element muss einen eindeutigen Namen haben.
es: Se especificó más de un {0} denominado "{1}". Cada {0} debe tener un nombre único.
fr: Plusieurs {0} nommés '{1}' ont été spécifiés. Chaque {0} doit avoir un nom unique.
it: Sono stati specificati più elementi {0} denominati '{1}'. I nomi degli elementi {0} devono essere univoci.
ja: '{1}' という名前の {0} が 1 つ以上指定されました。各 {0} に一意の名前を指定しなければなりません。
ko: 이름이 '{1}'인 {0}이(가) 두 개 이상 지정되었습니다. 각 {0}은(는) 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jeden element {0} o nazwie „{1}”. Nazwa każdego elementu {0} musi być unikatowa.
pt_br: Mais de um {0} denominado '{1}' foi especificado. Cada {0} deve ter um nome exclusivo.
tr: '{1}' adlı birden fazla {0} belirtildi. {0} adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{1}”的 {0}。每个 {0} 必须具有唯一的名称。
zh_hant: 已指定多個名為 {1} 的 {0}。每個 {0} 都必須要有唯一的名稱。

# WebNegativeValue
source: The value for '{0}' cannot be negative.
cs: Hodnota {0} nemůže být záporná.
de: Der Wert für "{0}" darf nicht negativ sein.
es: El valor de "{0}" no puede ser negativo.
fr: La valeur pour '{0}' ne peut pas être négative.
it: Il valore di '{0}' non può essere negativo.
ja: '{0}' を負の値にすることはできません。
ko: '{0}'의 값은 음수일 수 없습니다.
pl: Wartość „{0}” nie może być ujemna.
pt_br: O valor de '{0}' não pode ser negativo.
tr: '{0}' değeri negatif olamaz.
zh_hans: “{0}”的值不能为负。
zh_hant: {0} 的值不能為負。

# WsdlInstanceValidation
source: Warning: {0}
cs: Upozornění: {0}
de: Warnung: {0}
es: Advertencia: {0}
fr: Avertissement : {0}
it: Avviso: {0}
ja: 警告: {0}
ko: 경고: {0}
pl: Ostrzeżenie: {0}
pt_br: Aviso: {0}
tr: Uyarı: {0}
zh_hans: 警告: {0}
zh_hant: 警告: {0}

# WsdlInstanceValidationDetails
source: Warning: {0} Line {1}, position {2}.
cs: Upozornění: {0} Řádek {1}, pozice {2}
de: Warnung: {0}, Zeile {1}, Position {2}.
es: Advertencia: {0} Línea {1}, posición {2}.
fr: Avertissement : {0} ligne {1}, position {2}.
it: Avviso: {0} Riga {1}, posizione {2}.
ja: 警告: {0} 行 {1}、位置 {2}。
ko: 경고: {0} 줄 {1}, 위치 {2}.
pl: Ostrzeżenie: {0}, wiersz {1}, pozycja {2}.
pt_br: Aviso: {0} Linha {1}, posição {2}.
tr: Uyarı: {0} Satır {1}, konum {2}.
zh_hans: 警告: {0} 行 {1}，位置 {2}。
zh_hant: 警告: {0} 行 {1}，位置 {2}。

# XmlLang
source: en
cs: cs
de: de
es: es
fr: fr
it: it
ja: ja
ko: ko
pl: pl
pt_br: pt
tr: tr
zh_hans: zh
zh_hant: zh-Hant

# XmlSchema
source: Schema with targetNamespace='{0}' has invalid syntax. {1}
cs: Schéma s oborem názvů targetNamespace={0} má neplatnou syntaxi. {1}
de: Das Schema mit targetNamespace="{0}" weist eine ungültige Syntax auf. {1}
es: El esquema con targetNamespace="{0}" tiene una sintaxis no válida. {1}
fr: Le schéma avec targetNamespace='{0}' a une syntaxe non valide. {1}
it: La sintassi dello schema con targetNamespace='{0}' non è valida. {1}
ja: targetNamespace='{0}' を持つスキーマの構文が無効です。{1}
ko: targetNamespace='{0}'인 스키마의 구문이 잘못되었습니다. {1}
pl: Schemat z elementem targetNamespace=„{0}” ma nieprawidłową składnię. {1}
pt_br: O esquema com targetNamespace='{0}' tem sintaxe inválida. {1}
tr: targetNamespace='{0}' olan şemanın sözdizimi geçersiz. {1}
zh_hans: targetNamespace='{0}' 的架构具有无效的语法。{1}
zh_hant: 包含 targetNamespace='{0}' 的結構描述有無效的語法。{1}

# XmlSchemaAttributeReference
source: Attribute reference '{0}' declared in schema type '{1}' from namespace '{2}'.
cs: Ve schématu typu {1} z oboru názvů {2} byl deklarován odkaz na atribut {0}.
de: Attributverweis "{0}" im Schematyp "{1}" aus dem Namespace "{2}" deklariert.
es: Referencia de atributo "{0}" declarada en el tipo de esquema "{1}" del espacio de nombres "{2}".
fr: Référence d'attribut '{0}' déclarée dans le type de schéma '{1}' de l'espace de noms '{2}'.
it: Riferimento di attributo '{0}' dichiarato nel tipo di schema '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' のスキーマの型 '{1}' に属性の参照 '{0}' が宣言されています。
ko: 네임스페이스 '{2}'의 스키마 형식 '{1}'에서 특성 참조 '{0}'이(가) 선언되었습니다.
pl: Odwołanie do atrybutu „{0}” zostało zadeklarowane w typie schematu „{1}” z przestrzeni nazw „{2}”.
pt_br: Referência de atributo '{0}' declarada no tipo de esquema '{1}' do namespace '{2}'.
tr: '{0}' öznitelik başvurusu, '{2}' ad alanındaki '{1}' şema türünde bildirildi.
zh_hans: 特性引用“{0}”在来自命名空间“{2}”的架构类型“{1}”中声明。
zh_hant: 已在命名空間 '{2}' 的結構描述類型 '{1}' 中，宣告屬性參考 '{0}'。

# XmlSchemaContentDef
source: Check content definition of schema type '{0}' from namespace '{1}'. {2}
cs: Zkontrolujte definici obsahu schématu typu {0} z oboru názvů {1}. {2}
de: Überprüfen Sie die Inhaltsdefinition des Schematyps "{0}" aus dem Namespace "{1}". {2}
es: Compruebe la definición de contenido del tipo de esquema "{0}" del espacio de nombres "{1}". {2}
fr: Vérifiez la définition de contenu du type de schéma '{0}' dans l'espace de noms '{1}'. {2}
it: Controllare la definizione del contenuto del tipo di schema '{0}' dello spazio dei nomi '{1}'. {2}
ja: 名前空間 '{1}' のスキーマの型 '{0}' のコンテンツの定義を確認してください。{2}
ko: 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 콘텐츠 정의를 확인하세요. {2}
pl: Sprawdź definicję zawartości typu schematu „{0}” z przestrzeni nazw „{1}”. {2}
pt_br: Verifique a definição de conteúdo do tipo de esquema'{0}' do namespace '{1}'. {2}
tr: '{1}' ad alanındaki '{0}' şema türünün içerik tanımını denetleyin. {2}
zh_hans: 检查来自命名空间“{1}”的架构类型“{0}”的内容定义。{2}
zh_hant: 請檢查命名空間 '{1}' 結構描述類型 '{0}' 的內容定義。{2}

# XmlSchemaElementReference
source: Element reference '{0}' declared in schema type '{1}' from namespace '{2}'.
cs: Ve schématu typu {1} z oboru názvů {2} byl deklarován odkaz na element {0}.
de: Elementverweis "{0}" im Schematyp "{1}" aus dem Namespace "{2}" deklariert.
es: Referencia de elemento "{0}" declarada en el tipo de esquema "{1}" del espacio de nombres "{2}".
fr: Référence d'élément '{0}' déclarée dans le type de schéma '{1}' de l'espace de noms '{2}'.
it: Riferimento all'elemento '{0}' dichiarato nel tipo di schema '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' のスキーマの型 '{1}' に要素の参照 '{0}' が宣言されています。
ko: 네임스페이스 '{2}'의 스키마 테이블 '{1}'에서 요소 참조 '{0}'이(가) 선언되었습니다.
pl: Odwołanie do elementu „{0}” zostało zadeklarowane w typie schematu „{1}” z przestrzeni nazw „{2}”.
pt_br: Referência de elemento '{0}' declarada no tipo de esquema '{1}' do namespace '{2}'.
tr: '{0}' öğe başvurusu '{2}' ad alanındaki '{1}' şema türünde bildirildi.
zh_hans: 元素引用“{0}”在来自命名空间“{2}”的架构类型“{1}”中声明。
zh_hant: 已在命名空間 '{2}' 的結構描述類型 '{1}' 中，宣告了元素參考 '{0}'。

# XmlSchemaItem
source: Schema item '{1}' from namespace '{0}'. {2}
cs: Položka schématu {1} z oboru názvů {0}. {2}
de: Schemaelement "{1}" aus dem Namespace "{0}". {2}
es: Elemento de esquema "{1}" del espacio de nombres "{0}". {2}
fr: Élément de schéma '{1}' de l'espace de noms '{0}'. {2}
it: Elemento dello schema '{1}' dello spazio dei nomi '{0}'. {2}
ja: 名前空間 '{0}' のスキーマ アイテム '{1}'。{2}
ko: 네임스페이스 '{0}'의 스키마 항목 '{1}'입니다. {2}
pl: Element schematu „{1}” z przestrzeni nazw „{0}”. {2}
pt_br: Item de esquema '{1}' do namespace '{0}'. {2}
tr: '{0}' ad alanındaki '{1}' şema öğesi. {2}
zh_hans: 来自命名空间“{0}”的架构项“{1}”。{2}
zh_hant: 命名空間 '{0}' 的結構描述項目 '{1}'。{2}

# XmlSchemaNamedItem
source: Schema item '{1}' named '{2}' from namespace '{0}' is invalid. {3}
cs: Položka schématu {1} s názvem {2} z oboru názvů {0} není platná. {3}
de: Das Schemaelement "{1}" mit dem Namen "{2}" aus dem Namespace "{0}" ist ungültig. {3}
es: El elemento de esquema "{1}" denominado "{2}" del espacio de nombres "{0}" no es válido. {3}
fr: L'élément de schéma '{1}' nommé '{2}' de l'espace de noms '{0}' est non valide. {3}
it: L'elemento dello schema '{1}' denominato '{2}' dello spazio dei nomi '{0}' non è valido. {3}
ja: 名前空間 '{1}' からの {2} という名前のスキーマ アイテム '{0}' は無効です。{3}
ko: 네임스페이스 '{0}'의 '{2}'(이)라는 스키마 항목 '{1}'이(가) 잘못되었습니다. {3}
pl: Element schematu „{1}” o nazwie „{2}” z przestrzeni nazw „{0}” jest nieprawidłowy. {3}
pt_br: O item de esquema '{1}' denominado '{2}' do namespace '{0}' é inválido. {3}
tr: '{0}' ad alanındaki '{2}' adlı '{1}' şema öğesi geçersiz. {3}
zh_hans: 来自命名空间“{0}”、名为“{2}”的架构项“{1}”无效。{3}
zh_hant: 命名空間 {0} 中，名為 {2} 的結構描述項目 {1} 無效。{3}
