Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.Web.Services/xlf/ResWebServices.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, tr, zh_hans, zh_hant

# Binding
source: Binding '{0}' from namespace '{1}'.
cs: Vazba {0} z oboru názvů {1}
de: Bindung "{0}" aus dem Namespace "{1}".
es: Enlace "{0}" del espacio de nombres "{1}".
fr: Liaison '{0}' de l'espace de noms '{1}'.
it: Binding '{0}' dello spazio dei nomi '{1}'.
ja: 名前空間 '{1}' のバインド '{0}' です。
ko: 네임스페이스 '{1}'의 바인딩 '{0}'입니다.
pl: Powiązanie „{0}” z przestrzeni nazw „{1}”.
pt_br: Associação '{0}' do namespace '{1}'.
tr: '{1}' ad alanındaki '{0}' bağlaması.
zh_hans: 来自命名空间“{1}”的绑定“{0}”。
zh_hant: 命名空間 '{1}' 的繫結 '{0}'。

# CanTSpecifyElementOnEncodedMessagePartsPart
source: The element attribute is not allowed on encoded message parts. The erroneous part is named '{0}' in message '{1}'.
cs: Atribut prvku není povolen v částech kódované zprávy. Zpráva: {1}, chybová část: {0}.
de: Das Elementattribut ist bei codierten Nachrichtenteilen nicht zulässig. Der fehlerhafte Teil in der Nachricht "{1}" hat den Namen "{0}".
es: El atributo element no se permite en partes de mensaje codificadas. La parte errónea del mensaje "{1}" se denomina "{0}".
fr: L'attribut element n'est pas autorisé sur les parties de message encodées. La partie erronée s'appelle '{0}' dans le message '{1}'.
it: L'attributo element non è consentito in parti di messaggio codificate. Il nome della parte non corretta è '{0}' nel messaggio '{1}'.
ja: 要素属性をエンコードされたメッセージ パーツで使用することはできません。エラーを含んだパーツには、メッセージ '{1}' で '{0}' という名前が指定されています。
ko: 인코딩된 메시지 부분에는 요소 특성을 사용할 수 없습니다. '{1}' 메시지에서 오류 부분은 '{0}'(으)로 명명됩니다.
pl: Atrybut elementu jest niedozwolony w zakodowanych częściach komunikatu. Cześć zawierająca błąd ma nazwę „{0}” i znajduje się w komunikacie „{1}”.
pt_br: O atributo de elemento não é permitido nas partes da mensagem codificada. A parte incorreta é chamada '{0}' na mensagem '{1}'.
tr: Kodlanmış ileti bölümlerinde öğe özniteliğine izin verilmiyor. '{1}' iletisindeki hatalı bölüm '{0}' olarak adlandırılmış.
zh_hans: 编码的消息部分不能使用元素属性。消息“{1}”中不正确部分的名称是“{0}”。
zh_hant: 編碼的訊息組件不允許有元素屬性。訊息 {1} 中錯誤的組件名稱為 {0}。

# Description
source: Service description with targetNamespace='{0}'.
cs: Popis služby s oborem názvů targetNamespace={0}
de: Dienstbeschreibung mit targetNamespace="{0}".
es: Descripción del servicio con targetNamespace="{0}".
fr: Description de service avec targetNamespace='{0}'.
it: Descrizione del servizio con targetNamespace='{0}'.
ja: targetNamespace='{0}' のサービスの説明です。
ko: targetNamespace='{0}'인 서비스 설명입니다.
pl: Opis usługi z elementem targetNamespace=„{0}”.
pt_br: Descrição de serviço com targetNamespace='{0}'.
tr: targetNamespace='{0}' içeren hizmet açıklaması.
zh_hans: targetNamespace='{0}' 的服务说明。
zh_hant: 具有 targetNamespace={0} 的服務描述。

# Element
source: {0} from service description with targetNamespace='{1}'.
cs: {0} z popisu služby s oborem názvů targetNamespace {1}
de: {0} aus Dienstbeschreibung mit targetNamespace="{1}".
es: {0} de la descripción del servicio con targetNamespace="{1}".
fr: {0} de la description de service avec targetNamespace='{1}'.
it: Elemento {0} della descrizione del servizio con targetNamespace='{1}'.
ja: targetNamespace='{1}' のサービスの説明 {0} です。
ko: targetNamespace='{1}'인 서비스 설명의 {0}입니다.
pl: Obiekt {0} z opisu usługi z elementem targetNamespace=„{1}”.
pt_br: {0} da descrição de serviço com targetNamespace='{1}'.
tr: targetNamespace='{1}' içeren hizmet açıklamasından {0}.
zh_hans: {0} 来自具有 targetNamespace='{1}' 的服务说明。
zh_hant: 來自 targetNamespace='{1}' 的服務描述之 {0}。

# Fault
source: soapbind:fault '{0}' on operation '{1}' on portType '{2}' from namespace '{3}'. {4}
cs: Položka soapbind:fault {0} u operace {1} v oddílu portType {2} z oboru názvů {3}. {4}
de: soapbind:fault "{0}" für den Vorgang "{1}" des portType "{2}" aus dem Namespace "{3}". {4}
es: El elemento soapbind:fault "{0}" en la operación "{1}" en el objeto portType "{2}" del espacio de nombres "{3}". {4}
fr: soapbind:fault '{0}' durant l'opération '{1}' sur le portType '{2}' de l'espace de noms '{3}'. {4}
it: Elemento soapbind:fault '{0}' per l'operazione '{1}' su portType '{2}' dello spazio dei nomi '{3}'. {4}
ja: 名前空間 '{3}' の portType '{2}' にある操作 '{1}' の soapbind:fault '{0}' です。{4}
ko: soapbind: 네임스페이스 '{3}'의 portType '{2}'에 대한 작업 '{1}'의 오류 '{0}'입니다. {4}
pl: Element soapbind:fault „{0}” w operacji „{1}” dotyczącej elementu portType „{2}” z przestrzeni nazw „{3}”. {4}
pt_br: soapbind:fault '{0}' na operação '{1}' em portType '{2}' do namespace '{3}'. {4}
tr: '{3}' ad alanındaki portType '{2}' üzerindeki '{1}' işleminde soapbind:fault '{0}' var. {4}
zh_hans: 来自命名空间“{3}”的 portType“{2}”上的操作“{1}”出现 soapbind:fault“{0}”。{4}
zh_hant: 命名空間 '{3}' portType '{2}' 上作業 '{1}' 的 soapbind:fault '{0}'。{4}

# FaultBinding
source: Fault '{0}' on operation '{1}' on binding '{2}' from namespace '{3}'.
cs: Chyba {0} u operace {1} u vazby {2} z oboru názvů {3}
de: Fehler "{0}" für den Vorgang "{1}" der Bindung "{2}" aus dem Namespace "{3}".
es: Error "{0}" en la operación "{1}" en el enlace "{2}" del espacio de nombres "{3}".
fr: Erreur '{0}' durant l'opération '{1}' sur la liaison '{2}' de l'espace de noms '{3}'.
it: Errore '{0}' nell'operazione '{1}' sul binding '{2}' dello spazio dei nomi '{3}'.
ja: 名前空間 '{3}' のバインド '{2}' にある操作 '{1}' のフォールト '{0}' です。
ko: 네임스페이스 '{3}'의 바인딩 '{2}'에 대한 작업 '{1}'의 오류 '{0}'입니다.
pl: Błąd „{0}” w operacji „{1}” dotyczącej powiązania „{2}” z przestrzeni nazw „{3}”.
pt_br: Falha '{0}' na operação '{1}' na associação '{2}' do namespace '{3}'.
tr: '{3}' ad alanındaki '{2}' bağlaması üzerindeki '{1}' işleminde '{0}' hatası var.
zh_hans: 来自命名空间“{3}”的绑定“{2}”上的操作“{1}”出现错误“{0}”。
zh_hant: 命名空間 {3} 的繫結 {2} 上之作業 {1}，出現錯誤 {0}。

# HeaderFault
source: {0} on operation '{1}' on portType '{2}' from namespace '{3}'. {4}
cs: {0} u operace {1} v oddílu portType {2} z oboru názvů {3}. {4}
de: {0} für den Vorgang "{1}" des portType "{2}" aus dem Namespace "{3}". {4}
es: {0} en la operación "{1}" en el objeto portType "{2}" del espacio de nombres "{3}". {4}
fr: {0} durant l'opération '{1}' sur le portType '{2}' de l'espace de noms '{3}'. {4}
it: Elemento {0} nell'operazione '{1}' su portType '{2}' dello spazio dei nomi '{3}'. {4}
ja: 名前空間 '{3}' の portType '{2}' にある操作 '{1}' の '{0}' です。{4}
ko: 네임스페이스 '{3}'의 portType '{2}'에 대한 작업 '{1}'의 {0}입니다. {4}
pl: Element {0} w operacji „{1}” dotyczącej elementu portType „{2}” z przestrzeni nazw „{3}”. {4}
pt_br: {0} na operação '{1}' em portType '{2}' do namespace '{3}'. {4}
tr: '{3}' ad alanındaki portType '{2}' üzerindeki '{1}' işleminde '{0}' var. {4}
zh_hans: 来自命名空间“{3}”的 portType“{2}”上的操作“{1}”出现“{0}”。{4}
zh_hant: 命名空間 '{3}' portType '{2}' 上作業 '{1}' 的 {0}。{4}

# Message
source: Message '{0}' from service description with targetNamespace='{1}'.
cs: Zpráva {0} z popisu služby s oborem názvů targetNamespace={1}
de: Nachricht "{0}" aus der Dienstbeschreibung mit targetNamespace="{1}".
es: Mensaje "{0}" de la descripción del servicio con targetNamespace="{1}".
fr: Message '{0}' de la description de service avec targetNamespace='{1}'.
it: Messaggio '{0}' della descrizione del servizio con targetNamespace='{1}'.
ja: targetNamespace='{1}' のサービスの説明にあるメッセージ '{0}' です。
ko: targetNamespace='{1}'인 서비스 설명의 '{0}' 메시지입니다.
pl: Komunikat „{0}” z opisu usługi z elementem targetNamespace=„{1}”.
pt_br: Mensagem '{0}' da descrição de serviço com targetNamespace='{1}'.
tr: targetNamespace='{1}' içeren hizmet açıklamasından '{0}' iletisi.
zh_hans: 来自 targetNamespace='{1}' 的服务说明的消息“{0}”。
zh_hant: 來自 targetNamespace='{1}' 的服務描述之訊息 {0}。

# MissingMessagePartForMessageFromNamespace3
source: Missing message part '{0}' for message '{1}' from namespace '{2}'.
cs: Část zprávy {0} pro zprávu {1} z oboru názvů {2} nebyla nalezena.
de: Der Nachrichtenteil "{0}" für die Nachricht "{1}" aus dem Namespace "{2}" fehlt.
es: Falta la parte "{0}" del mensaje "{1}" del espacio de nombres "{2}".
fr: Partie du message '{0}' manquante pour le message '{1}' de l'espace de noms '{2}'.
it: Manca la parte '{0}' del messaggio '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' からのメッセージ '{1}' でメッセージ パーツ '{0}' がありません。
ko: 네임스페이스 '{2}'에서 '{1}' 메시지에 대한 메시지 부분 '{0}'이(가) 없습니다.
pl: Brak części „{0}” komunikatu „{1}” z przestrzeni nazw „{2}”.
pt_br: Parte '{0}' da mensagem '{1}' ausente do namespace '{2}'.
tr: '{2}' ad alanındaki '{1}' iletisinin '{0}' parçası yok.
zh_hans: 命名空间“{2}”中的消息“{1}”缺少消息部分“{0}”。
zh_hant: 遺漏命名空間 '{2}' 的訊息 '{1}' 之訊息組件 '{0}'。

# OnlyOperationInputOrOperationOutputTypes
source: Only objects of type OperationInput or OperationOutput may be added.
cs: Přidat lze pouze objekty typu OperationInput nebo OperationOutput.
de: Es können nur Objekte vom Typ OperationInput oder OperationOutput hinzugefügt werden.
es: Solo se pueden agregar objetos de tipo OperationInput u OperationOutput.
fr: Seuls des objets de type OperationInput ou OperationOutput peuvent être ajoutés.
it: È possibile aggiungere solo oggetti di tipo OperationInput o OperationOutput.
ja: 型 OperationInput または OperationOutput のオブジェクトのみを追加できます。
ko: OperationInput 또는 OperationOutput 형식의 개체만 추가할 수 있습니다.
pl: Dodawane mogą być tylko obiekty typu OperationInput lub OperationOutput.
pt_br: Somente objetos do tipo OperationInput ou OperationOutput podem ser adicionados.
tr: Yalnızca OperationInput veya OperationOutput türünde nesneler eklenebilir.
zh_hans: 只能添加 OperationInput 或 OperationOutput 类型的对象。
zh_hant: 只能新增類型 OperationInput 或 OperationOutput 的物件。

# OnlyXmlElementsOrTypesDerivingFromServiceDescriptionFormatExtension0
source: Only XmlElements or types deriving from ServiceDescriptionFormatExtension may be added.
cs: Přidat lze pouze atributy XmlElements nebo typy odvozené od typu ServiceDescriptionFormatExtension.
de: Es können nur XmlElements oder Typen hinzugefügt werden, die von ServiceDescriptionFormatExtension abgeleitet sind.
es: Solo se pueden agregar objetos XmlElement o tipos que deriven de ServiceDescriptionFormatExtension.
fr: Seuls les XmlElements ou les types dérivant de ServiceDescriptionFormatExtension peuvent être ajoutés.
it: È possibile aggiungere solo XmlElement o tipi che derivano da ServiceDescriptionFormatExtension.
ja: ServiceDescriptionFormatExtension から派生する XmlElements または型のみを追加できます。
ko: XmlElements 또는 ServiceDescriptionFormatExtension에서 파생되는 형식만 추가할 수 있습니다.
pl: Dodawane mogą być tylko elementy XmlElement lub typy pochodzące od elementu ServiceDescriptionFormatExtension.
pt_br: Somente XmlElements ou tipos derivados de ServiceDescriptionFormatExtension podem ser adicionados.
tr: Yalnızca XmlElements'ler veya ServiceDescriptionFormatExtension'dan türetilen türler eklenebilir.
zh_hans: 只能添加 XmlElements 或从 ServiceDescriptionFormatExtension 派生的类型。
zh_hant: 只可新增 XmlElements 或衍生自 ServiceDescriptionFormatExtension 的類型。

# Operation
source: Operation '{0}' on portType '{1}' from namespace '{2}'.
cs: Operace {0} v oddílu portType {1} z oboru názvů {2}
de: Vorgang "{0}" für portType "{1}" aus Namespace "{2}".
es: Operación "{0}" en el objeto portType "{1}" del espacio de nombres "{2}".
fr: Opération '{0}' sur le portType '{1}' de l'espace de noms '{2}'.
it: Operazione '{0}' su portType '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' からの portType '{1}' 上の操作 '{0}' です。
ko: 네임스페이스 '{2}'의 portType '{1}'에 대한 작업 '{0}'입니다.
pl: Operacja „{0}” dotycząca elementu portType „{1}” z przestrzeni nazw „{2}”.
pt_br: Operação '{0}' em portType '{1}' do namespace '{2}'.
tr: '{2}' ad alanındaki portType '{1}' üzerindeki '{0}' işlemi.
zh_hans: 来自命名空间“{2}”的 portType“{1}”上的操作“{0}”。
zh_hant: 命名空間 {2} 的 portType {1} 的作業 {0}。

# OperationBinding
source: Operation '{0}' on binding '{1}' from namespace '{2}'.
cs: Operace {0} u vazby {1} z oboru názvů {2}
de: Vorgang "{0}" für Bindung "{1}" aus Namespace "{2}".
es: Operación "{0}" en el enlace "{1}" del espacio de nombres "{2}".
fr: Opération '{0}' sur la liaison '{1}' de l'espace de noms '{2}'.
it: Operazione '{0}' sul binding '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' からのバインディング '{1}' 上の操作 '{0}' です。
ko: 네임스페이스 '{2}'의 바인딩 '{1}'에 대한 작업 '{0}'입니다.
pl: Operacja „{0}” dotycząca powiązania „{1}” z przestrzeni nazw „{2}”.
pt_br: Operação '{0}' na associação '{1}' do namespace '{2}'.
tr: '{2}' ad alanındaki '{1}' bağlaması üzerindeki '{0}' işlemi.
zh_hans: 来自命名空间“{2}”的绑定“{1}”上的操作“{0}”。
zh_hant: 命名空間 '{2}' 繫結 '{1}' 上的作業 '{0}'。

# Part
source: Part '{0}' of message '{1}' from service description with targetNamespace='{2}'.
cs: Část {0} zprávy {1} z popisu služby s oborem názvů targetNamespace={2}
de: Teil "{0}" der Nachricht "{1}" der Dienstbeschreibung mit targetNamespace="{2}".
es: Parte "{0}" del mensaje "{1}" de la descripción del servicio con targetNamespace="{2}".
fr: Partie '{0}' du message '{1}' de la description de service avec targetNamespace='{2}'.
it: Parte '{0}' del messaggio '{1}' della descrizione del servizio con targetNamespace='{2}'.
ja: targetNamespace='{2}' を含むサービスの説明の、メッセージ '{1}' のパート '{0}' です。
ko: targetNamespace='{2}'인 서비스 설명자의 '{1}' 메시지 중 '{0}' 부분입니다.
pl: Część „{0}” komunikatu „{1}” z opisu usługi z elementem targetNamespace=„{2}”.
pt_br: Parte '{0}' da mensagem '{1}' da descrição de serviço com targetNamespace='{2}'.
tr: targetNamespace='{2}' içeren hizmet açıklamasından '{1}' iletisinin '{0}' bölümü.
zh_hans: 来自 targetNamespace='{2}' 的服务描述的消息“{1}”的部分“{0}”。
zh_hant: 來自 targetNamespace='{2}' 之服務描述的訊息 '{1}' 之組件 '{0}'。

# Port
source: Port '{0}' on service {1} from namespace='{2}'.
cs: Port {0} u služby {1} z oboru názvů={2}
de: Port "{0}" des Diensts {1} aus Namespace="{2}".
es: Puerto "{0}" en el servicio {1} del espacio de nombres "{2}".
fr: Port '{0}' du service {1} de l'espace de noms='{2}'.
it: Porta '{0}' sul servizio {1} dello spazio dei nomi '{2}'.
ja: namespace='{2}' からのサービス {1} 上のポート '{0}' です。
ko: namespace='{2}'의 {1} 서비스에 대한 '{0}' 포트입니다.
pl: Port „{0}” dotyczący usługi „{1}” z przestrzeni nazw „{2}”.
pt_br: Porta '{0}' no serviço {1} do namespace='{2}'.
tr: '{2}' ad alanındaki '{1}' hizmetindeki '{0}' bağlantı noktası.
zh_hans: 来自 namespace='{2}' 的服务 {1} 上的端口“{0}”。
zh_hant: 命名空間 {2} 的服務 {1} 的連接埠 {0}。

# ProtocolWithNameIsNotRecognized1
source: Protocol with name '{0}' is not recognized.
cs: Protokol s názvem {0} není rozpoznán.
de: Das Protokoll mit dem Namen "{0}" ist unbekannt.
es: No se reconoce el protocolo con el nombre "{0}".
fr: Le protocole portant le nom '{0}' n'est pas reconnu.
it: Il protocollo denominato '{0}' non è riconosciuto.
ja: '{0}' という名前のプロトコルは認識されません。
ko: 이름이 '{0}'인 프로토콜을 인식할 수 없습니다.
pl: Nie rozpoznano protokołu o nazwie „{0}”.
pt_br: O protocolo chamado '{0}' não é reconhecido.
tr: '{0}' adlı protokol tanınmıyor.
zh_hans: 无法识别名称为“{0}”的协议。
zh_hant: 無法辨識名稱為 {0} 的通訊協定。

# RequiredXmlFormatExtensionAttributeIsMissing1
source: Required XmlFormatExtension attribute is missing on class {0}.
cs: Povinný atribut XmlFormatExtension nebyl ve třídě {0} nalezen.
de: Das für die {0}-Klasse erforderliche XmlFormatExtension-Attribut ist nicht vorhanden.
es: El atributo XmlFormatExtension requerido falta en la clase {0}.
fr: L'attribut XmlFormatExtension nécessaire est manquant dans la classe {0}.
it: Manca l'attributo obbligatorio XmlFormatExtension per la classe {0}.
ja: 必要な XmlFormatExtension 属性がクラス {0} に見つかりません。
ko: 필요한 XmlFormatExtension 특성이 {0} 클래스에 없습니다.
pl: Brak wymaganego atrybutu XmlFormatExtension dla klasy {0}.
pt_br: Atributo XmlFormatExtension necessário ausente da classe {0}.
tr: {0} sınıfında gerekli XmlFormatExtension özniteliği eksik.
zh_hans: 类 {0} 上缺少所需的 XmlFormatExtension 属性。
zh_hant: 在類別 {0} 上遺漏必要的 XmlFormatExtension 屬性。

# SchemaSyntaxErrorDetails
source: Schema with targetNamespace='{0}' has invalid syntax. {1} Line {2}, position {3}.
cs: Schéma s oborem názvů targetNamespace={0} má neplatnou syntaxi. {1} řádek {2}, pozice {3}
de: Schema mit targetNamespace="{0}" weist eine ungültige Syntax auf. {1} Zeile {2}, Position {3}.
es: El esquema con targetNamespace="{0}" tiene una sintaxis no válida. {1} Línea {2}, posición {3}.
fr: Le schéma avec targetNamespace='{0}' a une syntaxe non valide. {1} Ligne {2}, position {3}.
it: La sintassi dello schema con targetNamespace='{0}' non è valida. {1} Riga {2}, posizione {3}.
ja: targetNamespace='{0}' を持つスキーマの構文が無効です。{1} 行 {2}、位置 {3}。
ko: targetNamespace='{0}'인 스키마에 잘못된 구문이 있습니다. {1} 줄 {2}, 위치 {3}.
pl: Schemat z elementem targetNamespace=„{0}” ma nieprawidłową składnię. {1} — wiersz: {2}, pozycja: {3}.
pt_br: O esquema com targetNamespace='{0}' tem sintaxe inválida. {1} Linha {2}, posição {3}.
tr: targetNamespace='{0}' olan şemanın sözdizimi geçersiz. {1}, Satır {2}, konum {3}.
zh_hans: targetNamespace='{0}' 的架构具有无效的语法。{1} 行 {2}，位置 {3}。
zh_hant: 包含 targetNamespace='{0}' 的結構描述有無效的語法。{1} 行 {2}，位置 {3}。

# SchemaValidationError
source: Schema validation error: {0}
cs: Chyba ověřování schématu: {0}
de: Schemavalidierungsfehler: {0}
es: Error de validación de esquema: {0}
fr: Erreur de validation de schéma : {0}
it: Errore di convalida dello schema: {0}
ja: スキーマの検証エラー: {0}
ko: 스키마 유효성 검사 오류: {0}
pl: Błąd weryfikacji schematu: {0}
pt_br: Erro de validação do esquema: {0}
tr: Şema doğrulama hatası: {0}
zh_hans: 架构验证错误: {0}
zh_hant: 結構描述驗證錯誤: {0}

# TheSyntaxOfTypeMayNotBeExtended1
source: The syntax of type {0} may not be extended.
cs: Syntaxi typu {0} nelze rozšířit.
de: Die Syntax des {0}-Typs kann nicht erweitert werden.
es: La sintaxis de tipo {0} no se puede extender.
fr: La syntaxe du type {0} ne doit pas être étendue.
it: Non è possibile estendere la sintassi di tipo {0}.
ja: 型 {0} の構文を拡張することはできません。
ko: {0} 형식의 구문을 확장할 수 없습니다.
pl: Składnia typu {0} nie może zostać rozszerzona.
pt_br: A sintaxe do tipo {0} pode não ser estendida.
tr: {0} türünün sözdizimi genişletilemez.
zh_hans: 类型 {0} 的语法不可以扩展。
zh_hant: 類型 {0} 的語法無法擴充。

# ValidationError
source: Error: {0} Line {1}, position {2}.
cs: Chyba: {0} Řádek {1}, pozice {2}
de: Fehler: {0} Zeile {1}, Position {2}.
es: Error: {0} Línea {1}, posición {2}.
fr: Erreur : {0} ligne {1}, position {2}.
it: Errore: {0} Riga {1}, posizione {2}.
ja: エラー: {0} 行 {1}、位置 {2}。
ko: 오류: {0} 줄 {1}, 위치 {2}.
pl: Błąd: {0}, wiersz {1}, pozycja {2}.
pt_br: Erro: {0} Linha {1}, posição {2}.
tr: Hata: {0} Satır {1}, konum {2}.
zh_hans: 错误: {0} 行 {1}，位置 {2}。
zh_hant: 錯誤: {0} 行 {1}，位置 {2}。

# WebDescriptionMissing
source: Cannot find definition for {0}. Service Description with namespace {1} is missing.
cs: Definice {0} nebyla nalezena. Chybí popis služby s oborem názvů {1}.
de: Die Definition für {0} wurde nicht gefunden. Die Dienstdefinition mit dem Namespace {1} fehlt.
es: No se puede encontrar la definición para {0}. Falta la descripción de servicios con el espacio de nombres "{1}".
fr: Impossible de localiser une définition pour {0}. Description du service manquante avec l'espace de noms {1}.
it: Non è stata trovata alcuna definizione per {0}. Manca la descrizione del servizio con spazio dei nomi {1}.
ja: {0} の定義が見つかりません。名前空間 {1} のサービスの説明がありません。
ko: {0}에 대한 정의를 찾을 수 없습니다. 네임스페이스가 {1}인 서비스 정의가 없습니다.
pl: Nie można odnaleźć definicji {0}. Brak opisu usługi z przestrzenią nazw {1}.
pt_br: Não é possível encontrar a definição para {0}. A Descrição de Serviço com namespace {1} está ausente.
tr: {0} tanımı bulunamadı. {1} ad alanına sahip Hizmet Tanımı yok.
zh_hans: 找不到 {0} 的定义。缺少命名空间为 {1} 的服务说明。
zh_hant: 找不到 {0} 的定義。遺漏命名空間為 {1} 的服務描述。

# WebDescriptionMissingItem
source: Element {0} named {1} from namespace {2} is missing.
cs: Prvek {0} s názvem {1} z oboru názvů {2} nebyl nalezen.
de: Das {0}-Element mit dem Namen {1} aus dem Namespace {2} fehlt.
es: Falta el elemento {0} denominado {1} del espacio de nombres {2}.
fr: Élément {0} manquant nommé {1} de l'espace de noms {2}.
it: Manca l'elemento {0} denominato {1} dello spazio dei nomi {2}.
ja: 名前空間 '{2}' からの '{1}' という名前の要素 {0} がありません。
ko: 네임스페이스 {2}에 이름이 {1}인 {0} 요소가 없습니다.
pl: Brak elementu {0} o nazwie {1} z przestrzeni nazw {2}.
pt_br: O elemento {0} denominado {1} do namespace {2} está ausente.
tr: {2} ad alanında {1} adını taşıyan {0} öğesi yok.
zh_hans: 命名空间 {2} 中缺少名为 {1} 的元素 {0}。
zh_hant: 遺漏來自命名空間 {2} 且名為 {1} 的元素 {0}。

# WebDescriptionTooManyMessages
source: No more than one input and one output message may be specified.
cs: Specifikovat lze pouze jednu vstupní a jednu výstupní zprávu.
de: Es kann maximal eine Eingabe- und eine Ausgabenachricht angegeben werden.
es: No puede especificar más de un mensaje entrante y uno saliente.
fr: Seule une entrée et un message d'entrée peuvent être spécifiés.
it: Non è possibile specificare più di un messaggio di input e di un messaggio di output.
ja: 2 つ以上の入力および出力メッセージを指定することはできません。
ko: 입력/출력 메시지를 하나씩만 지정할 수 있습니다.
pl: Nie można określić więcej niż jednego komunikatu wejściowego i jednego komunikatu wyjściowego.
pt_br: Não é possível especificar mais de uma mensagem de entrada e uma de saída.
tr: Bir giriş ve bir çıkış iletisinden fazlası belirtilemez.
zh_hans: 不能指定一个以上的输入消息和输出消息。
zh_hant: 不可指定多個輸入與輸出訊息。

# WebDuplicateBinding
source: More than one binding named '{0}' was specified. Each binding must have a unique name.
cs: Bylo určeno více vazeb s názvem {0}. Každá vazba musí mít jedinečný název.
de: Es wurden mehrere Bindungen mit dem Namen "{0}" angegeben. Jede Bindung muss einen eindeutigen Namen haben.
es: Se especificó más de un enlace denominado "{0}". Cada enlace debe tener un nombre único.
fr: Plusieurs liaisons nommées '{0}' ont été spécifiées. Chaque liaison doit avoir un nom unique.
it: Sono stati specificati più binding denominati '{0}'. I nomi dei binding devono essere univoci.
ja: '{0}' という名前のバインドが 1 つ以上指定されました。各バインドに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 바인딩이 두 개 이상 지정되었습니다. 각 바인딩은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedno powiązanie o nazwie „{0}”. Nazwa każdego powiązania musi być unikatowa.
pt_br: Mais de uma associação denominada '{0}' foi especificada. Cada associação deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla bağlama belirtildi. Bağlama adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的绑定。每个绑定必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的繫結。每個繫結都必須要有唯一的名稱。

# WebDuplicateFaultBinding
source: More than one fault binding named '{0}' was specified. Each fault binding must have a unique name.
cs: Bylo určeno více chybových vazeb s názvem {0}. Každá chybová vazba musí mít jedinečný název.
de: Es wurden mehrere Fehlerbindungen mit dem Namen "{0}" angegeben. Jede Fehlerbindung muss einen eindeutigen Namen haben.
es: Se especificó más de un enlace de error denominado "{0}". Cada enlace de error debe tener un nombre único.
fr: Plusieurs liaisons d'erreur nommées '{0}' ont été spécifiées. Chaque liaison d'erreur doit avoir un nom unique.
it: Sono stati specificati più binding di errore denominati '{0}'. I nomi dei binding di errore devono essere univoci.
ja: '{0}' という名前のフォールト バインドが 1 つ以上指定されました。各フォールト バインドに一意の名前を指定しなければなりません。
ko: 이름이 '{0}'인 오류 바인딩이 두 개 이상 지정되었습니다. 각 오류 바인딩은 고유한 이름을 가져야 합니다.
pl: Określono więcej niż jedno powiązanie błędu o nazwie „{0}”. Nazwa każdego powiązania błędu musi być unikatowa.
pt_br: Mais de uma associação de falha denominada '{0}' foi especificada. Cada associação de falha deve ter um nome exclusivo.
tr: '{0}' adlı birden fazla hata bağlama belirtildi. Hata bağlama adları benzersiz olmalıdır.
zh_hans: 指定了多个名为“{0}”的错误绑定。每个错误绑定必须具有唯一的名称。
zh_hant: 已指定多個名為 {0} 的錯誤繫結。每個錯誤繫結都必須要有唯一的名稱。
