Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.CodeDom/xlf/SRCodeDom.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# InvalidTypeName
source: The type name:"{0}" on the property:"{1}" of type:"{2}" is not a valid language-independent type name.
cs: Název typu {0} u vlastnosti {1} typu {2} není platným názvem typu nezávislým na jazyku.
de: Der Typname "{0}" der {1}-Eigenschaft vom Typ "{2}" ist kein gültiger sprachunabhängiger Typname.
es: El nombre de tipo: "{0}" de la propiedad: "{1}" del tipo: "{2}" no es un nombre de tipo válido independiente del lenguaje.
fr: Le nom de type "{0}" de la propriété "{1}" de type "{2}" n'est pas un nom de type indépendant du langage valide.
it: Il nome di tipo "{0}" nella proprietà "{1}" del tipo "{2}" non è un nome di tipo valido indipendente dal linguaggio.
ja: 型 "{2}" のプロパティ "{1}" の型名 "{0}" は、有効な言語依存の型名ではありません。
ko: 형식이 "{2}"인 속성 "{1}"의 형식 이름 "{0}"은(는) 유효한 언어 독립 형식 이름이 아닙니다.
pl: Nazwa typu „{0}” we właściwości „{1}” typu „{2}” nie jest prawidłową nazwą typu niezależną od języka.
pt_br: O nome de tipo:"{0}" na propriedade: "{1}" do tipo: "{2}" não é um nome de tipo válido independente de idioma.
ru: Имя типа "{0}" для свойства "{1}" типа "{2}" не является допустимым именем типа, независимым от языка.
tr: "{2}" türünün "{1}" özelliğindeki "{0}" tür adı, geçerli bir dilden bağımsız tür adı değil.
zh_hans: 类型为“{2}”的属性“{1}”上的类型名称“{0}”不是与语言无关的有效类型名称。
zh_hant: 屬性 "{1}" 上類型 "{2}" 的類型名稱 "{0}"，不是和語言無關的有效類型名稱。

# Invalid_nonnegative_integer_attribute
source: The '{0}' attribute must be a non-negative integer.
cs: Atribut {0} musí být nastaven na nezáporné celé číslo.
de: Das {0}-Attribut muss eine nicht negative ganze Zahl sein.
es: El atributo "{0}" debe ser un valor entero no negativo.
fr: L'attribut '{0}' doit être un entier non négatif.
it: L'attributo '{0}' deve essere un numero intero non negativo.
ja: '{0}' 属性は負でない整数値に設定しなければなりません。
ko: '{0}' 특성은 음수가 아닌 정수여야 합니다.
pl: Atrybut „{0}” musi być nieujemną liczbą całkowitą.
pt_br: O atributo '{0}' deve ser um inteiro não negativo.
ru: Значение атрибута "{0}" должно быть целым неотрицательным числом.
tr: '{0}' özniteliği, negatif olmayan bir tamsayı olmalıdır.
zh_hans: “{0}”特性必须为非负整数。
zh_hant: '{0}' 屬性必須是非負整數。

# Language_Names_Cannot_Be_Empty
source: You need to specify a non-empty String for a language name in the CodeDom configuration section.
cs: V konfiguračním oddílu CodeDom je pro název jazyka třeba zadat neprázdný řetězec.
de: Sie müssen im CodeDom-Konfigurationsabschnitt eine nicht leere Zeichenfolge für einen Sprachennamen angeben.
es: Debe especificar una cadena que no esté vacía para un nombre de lenguaje en la sección de configuración de CodeDom.
fr: Vous devez spécifier une chaîne non vide pour un nom de langage dans la section de configuration CodeDom.
it: Nella sezione di configurazione CodeDom è necessario specificare una stringa non vuota per un nome di linguaggio.
ja: CodeDom 構成セクションの言語名に対して空でない文字列を指定しなければなりません。
ko: CodeDOM 구성 섹션의 언어 이름에는 비어 있지 않은 문자열을 지정해야 합니다.
pl: Jako nazwę języka należy zdefiniować niepusty ciąg w sekcji konfiguracji CodeDom.
pt_br: É necessário especificar uma Cadeia de Caracteres não vazia para um nome de idioma na seção de configuração CodeDom.
ru: Имя языка в разделе конфигурации CodeDOM должно быть непустой строкой.
tr: CodeDom yapılandırma bölümünde dil adı için boş olmayan bir Dize belirtmelisiniz.
zh_hans: 需要在 CodeDom 配置部分中为语言名称指定一个非空字符串。
zh_hant: 您必須在 CodeDom 組態區段中，指定非空白的字串作為語言名稱。

# NotSupported_CodeDomAPI
source: This CodeDomProvider does not support this method.
cs: Tento poskytovatel CodeDomProvider nepodporuje tuto metodu.
de: Dieser CodeDomProvider unterstützt diese Methode nicht.
es: Este CodeDomProvider no admite este método.
fr: Le CodeDomProvider ne prend pas en charge cette méthode.
it: L'elemento CodeDomProvider non supporta questo metodo.
ja: CodeDomProvider はこのメソッドをサポートしません。
ko: 이 CodeDomProvider는 이 메서드를 지원하지 않습니다.
pl: Ten dostawca CodeDomProvider nie obsługuje tej metody.
pt_br: Esse CodeDomProvider não dá suporte para esse método.
ru: Этот CodeDomProvider не поддерживает этот метод.
tr: Bu CodeDomProvider bu metodu desteklemiyor.
zh_hans: 此 CodeDomProvider 不支持该方法。
zh_hant: 此 CodeDomProvider 不支援這個方法。

# Provider_does_not_support_options
source: This CodeDomProvider type does not have a constructor that takes providerOptions - "{0}"
cs: Typ CodeDomProvider nemá konstruktor, který přijímá vlastnost providerOptions – {0}
de: Dieser CodeDomProvider-Typ weist keinen Konstruktor auf, der providerOptions verwendet – "{0}".
es: Este tipo CodeDomProvider no tiene un constructor que acepte providerOptions: "{0}"
fr: Ce type CodeDomProvider ne contient pas de constructeur qui accepte providerOptions - "{0}"
it: Questo tipo di CodeDomProvider non contiene un costruttore che accetta providerOptions: "{0}"
ja: この CodeDomProvider 型には、providerOptions を受け取るコンストラクターがありません - "{0}"
ko: 이 CodeDomProvider 형식에는 providerOptions를 받는 생성자가 없습니다. "{0}"
pl: Typ dostawcy CodeDomProvider nie ma konstruktora, który przyjmuje opcje providerOptions - „{0}”
pt_br: Este tipo de CodeDomProvider não tem um construtor que aceite providerOptions – "{0}"
ru: Этот тип CodeDomProvider не содержит конструктор, принимающий providerOptions, — "{0}"
tr: Bu CodeDomProvider türünün providerOptions alan bir oluşturucusu yok - "{0}"
zh_hans: 此 CodeDomProvider 类型不具有采用 providerOptions 的构造函数 -“{0}”
zh_hant: 這個 CodeDomProvider 類型沒有接受 providerOptions 的建構函式 - "{0}"

# Unable_To_Locate_Type
source: The CodeDom provider type "{0}" could not be located.
cs: Typ poskytovatele CodeDom {0} nebyl nalezen.
de: Der CodeDom-Anbietertyp "{0}" wurde nicht gefunden.
es: No se pudo ubicar el tipo de proveedor de CodeDom "{0}".
fr: Impossible de localiser le type de fournisseur CodeDom "{0}".
it: Il provider CodeDom di tipo "{0}" non è stato individuato.
ja: CodeDom プロバイダー型 "{0}" を読み込めませんでした。
ko: CodeDOM 공급자 형식 "{0}"을(를) 찾을 수 없습니다.
pl: Nie można zlokalizować typu dostawcy CodeDom „{0}”.
pt_br: Não foi possível localizar o tipo de provedor CodeDom "{0}".
ru: Не удалось найти тип поставщика CodeDom "{0}".
tr: "{0}" CodeDom sağlayıcısı türü bulunamadı.
zh_hans: 无法找到 CodeDom 提供程序类型“{0}”。
zh_hant: 找不到 CodeDom 提供者類型 "{0}"。

# toStringUnknown
source: (unknown)
cs: (neznámý)
de: (unbekannt)
es: (se desconoce)
fr: (inconnu)
it: (sconosciuta)
ja: (不明)
ko: (알 수 없음)
pl: (nieznane)
pt_br: (desconhecido)
ru: (неизвестно)
tr: (bilinmeyen)
zh_hans: (未知)
zh_hant: (未知)
