Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.CodeDom/xlf/SRCodeDom.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Argument_NullComment
source: The 'Comment' property of the CodeCommentStatement '{0}' cannot be null.
cs: Vlastnost Comment třídy CodeCommentStatement {0} nemůže mít hodnotu null.
de: Die Comment-Eigenschaft von CodeCommentStatement "{0}" kann nicht NULL sein.
es: La propiedad "Comment" de CodeCommentStatement "{0}" no puede ser nula.
fr: La propriété 'Comment' du CodeCommentStatement '{0}' ne peut pas avoir une valeur null.
it: La proprietà 'Comment' dell'elemento CodeCommentStatement '{0}' non può essere Null.
ja: CodeCommentStatement '{0}' の 'Comment' プロパティを null にすることはできません。
ko: CodeCommentStatement '{0}'의 'Comment' 속성은 null일 수 없습니다.
pl: Właściwość „Comment” klasy CodeCommentStatement „{0}” nie może mieć wartości null.
pt_br: A propriedade 'Comment' de CodeCommentStatement '{0}' não pode ser nula.
ru: Свойство "Comment" CodeCommentStatement "{0}" не может иметь значение null.
tr: CodeCommentStatement '{0}' için 'Comment' null olamaz.
zh_hans: CodeCommentStatement“{0}”的 "Comment" 属性不能为 null。
zh_hant: CodeCommentStatement '{0}' 的 'Comment' 屬性不可為 null。

# ArityDoesntMatch
source: The total arity specified in '{0}' does not match the number of TypeArguments supplied. There were '{1}' TypeArguments supplied.
cs: Celková arita zadaná v {0} neodpovídá počtu zadaných argumentů TypeArguments. Byl zadán tento počet argumentů TypeArguments: {1}
de: Der in "{0}" angegebene Stelligkeitsgesamtwert entspricht nicht der Anzahl angegebener TypeArguments. Es wurden {1} TypeArguments angegeben.
es: La aridad total especificada en "{0}" no coincide con el número de TypeArguments suministrados. Se suministraron "{1}" valores TypeArguments.
fr: L'arité totale spécifiée dans '{0}' ne correspond pas au nombre de TypeArguments fournis. '{1}' TypeArguments ont été fournis.
it: Il grado totale specificato in '{0}' non corrisponde al numero di elementi TypeArgument specificati. Elementi TypeArgument specificati: '{1}'.
ja: '{0}' で指定されたアリティの合計が指定された TypeArguments の数と一致しません。'{1}' 個の TypeArguments が指定されました。
ko: '{0}'에 지정된 총 인자 수가 제공된 TypeArguments 수와 일치하지 않습니다. 제공된 TypeArguments는 '{1}'개입니다.
pl: Całkowita liczba argumentów funkcji podana w „{0}” nie jest zgodna z liczbą wprowadzonych argumentów TypeArgument. Wprowadzono następującą liczbę argumentów TypeArguments „{1}”.
pt_br: A aridade total especificada em '{0}' não corresponde ao número de TypeArguments fornecido. Foram fornecidos '{1}' TypeArguments.
ru: Общая арность, указанная в "{0}", не соответствует полученному количеству аргументов TypeArguments. Получено аргументов TypeArguments: {1}.
tr: '{0}' içinde belirtilen toplam parametre sayısı sağlanan TypeArguments sayısıyla eşleşmiyor. '{1}' TypeArguments sağlanmıştı.
zh_hans: “{0}”中指定的实参总数与提供的 TypeArgument 数量不匹配。提供了“{1}”个 TypeArgument。
zh_hant: '{0}' 中指定的 Arity 總數與所提供的 TypeArguments 數目不符。提供 '{1}' 個 TypeArguments。

# AutoGen_Comment_Line2
source: This code was generated by a tool.
cs: Tento kód byl vygenerován nástrojem.
de: Dieser Code wurde von einem Tool generiert.
es: Este código fue generado por una herramienta.
fr: Ce code a été généré par un outil.
it: Questo codice è stato generato da uno strumento.
ja: このコードはツールによって生成されました。
ko: 이 코드는 도구를 사용하여 생성되었습니다.
pl: Ten kod został wygenerowany przez narzędzie.
pt_br: Esse código foi gerado por uma ferramenta.
ru: Этот код создан программой.
tr: Bu kod bir araç tarafından oluşturuldu.
zh_hans: 此代码由工具生成。
zh_hant: 這段程式碼是由工具產生的。

# AutoGen_Comment_Line3
source: Runtime Version:
cs: Verze modulu runtime:
es: Versión en tiempo de ejecución:
fr: Version du runtime :
it: Versione runtime:
ja: ランタイム バージョン:
ko: 런타임 버전:
pl: Wersja środowiska uruchomieniowego:
pt_br: Versão do Runtime:
ru: Версия среды выполнения:
tr: Çalışma Zamanı Sürümü:
zh_hans: 运行时版本:
zh_hant: 執行階段版本:

# AutoGen_Comment_Line4
source: Changes to this file may cause incorrect behavior and will be lost if
cs: Změny tohoto souboru mohou způsobit nesprávné chování a budou ztraceny, pokud
de: Änderungen an dieser Datei können fehlerhaftes Verhalten verursachen und gehen verloren, wenn
es: Los cambios en este archivo podrían causar un comportamiento incorrecto y se perderán si
fr: Les changements apportés à ce fichier peuvent provoquer un comportement incorrect et seront perdus si
it: Le modifiche apportate a questo file possono causare un comportamento non corretto e andranno perse se
ja: このファイルへの変更は、正しくない動作の原因になる可能性があり、
ko: 파일 내용을 변경하면 잘못된 동작이 발생할 수 있으며, 코드를 다시 생성하면
pl: Zmiany w tym pliku mogą spowodować niewłaściwe zachowanie i zostaną utracone
pt_br: As alterações no arquivo poderão causar comportamento incorreto e serão perdidas se
ru: Изменения в этом файле могут привести к неправильной работе и будут потеряны в случае
tr: Bu dosyada yapılacak değişiklikler hatalı davranışa neden olabilir ve
zh_hans: 对此文件的更改可能导致不正确的行为，并在以下条件下丢失:
zh_hant: 變更此檔案可能會導致不正確的行為，而且若已重新產生

# AutoGen_Comment_Line5
source: the code is regenerated.
cs: pokud bude kód znovu vygenerován.
de: der Code erneut generiert wird.
es: se vuelve a generar el código.
fr: le code est regénéré.
it: il codice viene rigenerato.
ja: コードが再生成されると失われます。
ko: 이러한 변경 내용이 손실됩니다.
pl: w przypadku ponownego wygenerowania kodu.
pt_br: o código for gerado novamente.
ru: повторного создания кода.
tr: kod yeniden oluşturulursa kaybolur.
zh_hans: 代码重新生成。
zh_hant: 程式碼，則會遺失變更。

# Cannot_Specify_Both_Compiler_Path_And_Version
source: Cannot specify both the '{0}' and '{1}' CodeDom provider options to choose a compiler. Please remove one of them.
cs: Pro výběr kompilátoru nelze zadat možnosti poskytovatele CodeDom {0} a {1} najednou. Jednu z nich prosím odeberte.
de: Es können nicht beide CodeDom-Anbieter "{0}" und "{1}" zur Auswahl eines Compilers angegeben werden. Entfernen Sie einen der Anbieter.
es: No se pueden especificar las opciones del proveedor CodeCom "{0}" y "{1}" al mismo tiempo para elegir un compilador. Quite una de ellas.
fr: Impossible de spécifier les deux options de fournisseur CodeDom '{0}' et '{1}' pour choisir un compilateur. Supprimez l'une de ces options.
it: Non è possibile specificare entrambe le opzioni '{0}' e '{1}' del provider CodeDom per la scelta di un compilatore. Rimuoverne una.
ja: '{0}' と '{1}' の両方の CodeDom プロバイダー オプションを指定してコンパイラーを選択することはできません。どちらか一方を削除してください。
ko: 컴파일러를 선택하기 위해 '{0}'과(와) '{1}' CodeDOM 공급자 옵션을 모두 지정할 수 없습니다. 둘 중 하나를 제거하세요.
pl: Nie można określić jednocześnie opcji dostawcy CodeDom „{0}” i „{1}”. Usuń jedną z nich.
pt_br: Não é possível especificar as opções do provedor de CodeDom '{0}' e '{1}' para escolher um compilador. Remova uma delas.
ru: При выборе компилятора параметры поставщика CodeDom "{0}" и "{1}" не могут быть указаны одновременно. Удалите один из них.
tr: Derleyici seçmek için '{0}' ve '{1}' CodeDom sağlayıcı seçenekleri birlikte belirtilemez. Lütfen birini kaldırın.
zh_hans: 不能同时指定“{0}”和“{1}”这两个 CodeDom 提供程序选项来选择编译器。请移除其中一个选项。
zh_hant: 選擇編譯器時不可同時指定 '{0}' 與 '{1}' CodeDom 提供者選項。請移除其中一個。

# CodeDomProvider_NotDefined
source: There is no CodeDom provider defined for the language.
cs: Pro jazyk není definován žádný poskytovatel CodeDom.
de: Es ist kein CodeDom-Anbieter für die Sprache definiert.
es: No hay ningún proveedor CodeDom definido para el lenguaje.
fr: Aucun fournisseur CodeDom n'est défini pour le langage.
it: Non è stato definito alcun provider CodeDom per il linguaggio.
ja: 言語に定義されている CodeDom プロバイダーがありません。
ko: 언어에 CodeDOM 공급자가 정의되어 있지 않습니다.
pl: Nie zdefiniowano dostawcy CodeDom dla języka.
pt_br: Não há nenhum provedor de CodeDom definido para o idioma.
ru: Для языка не задан поставщик CodeDom.
tr: Dil için tanımlanmış CodeDom sağlayıcısı yok.
zh_hans: 没有为此语言定义的 CodeDom 提供程序。
zh_hant: 沒有為語言定義 CodeDom 提供者。

# CodeGenOutputWriter
source: The output writer for code generation and the writer supplied don't match and cannot be used. This is generally caused by a bad implementation of a CodeGenerator derived class.
cs: Modul pro zápis výstupu za účelem generování kódu a uvedený modul pro zápis si neodpovídají a nelze je použít. Tento problém je většinou způsoben chybnou implementací odvozené třídy CodeGenerator.
de: Der Ausgabewriter für die Codegenerierung und der angegebene Writer stimmen nicht überein und können nicht verwendet werden. Dieses Problem tritt normalerweise auf, wenn eine von CodeGenerator abgeleitete Klasse falsch implementiert wird.
es: El sistema de escritura de resultados para generación de código y el sistema de escritura proporcionado no coinciden y no se pueden utilizar. Normalmente se debe a una implementación incorrecta de una clase derivada CodeGenerator.
fr: Le writer de sortie pour la génération de code et le writer fourni ne correspondent pas et ne peuvent pas être utilisés. En règle générale, cela est dû à une mauvaise implémentation d'une classe dérivée CodeGenerator.
it: Il writer di output per la generazione del codice non corrisponde a quello specificato e non è possibile usarli. Il problema è in genere causato da un'implementazione errata di una classe derivata da CodeGenerator.
ja: コード生成のための出力ライターと指定されたライターが一致しないため、使用できません。通常、CodeGenerator 派生クラスの実装が不適切な場合に、このエラーが発生します。
ko: 제공된 기록기가 코드 생성에 사용할 출력 기록기와 일치하지 않으므로 사용할 수 없습니다. 일반적으로 CodeGenerator 파생 클래스를 잘못 구현했을 때 발생합니다.
pl: Moduł zapisujący dane wyjściowe w celu generowania kodu i dostarczony moduł zapisujący nie są zgodne i nie mogą być używane. Jest to zazwyczaj spowodowane złą implementacją klasy pochodzącej od elementu CodeGenerator.
pt_br: O gravador de saída para geração de código e o gravador fornecido não coincidem e não podem ser usados. Normalmente, isso é gerado por uma implementação errada de uma classe derivada de CodeGenerator.
ru: Выходное устройство записи для создания кода и указанное устройство записи не соответствуют друг другу и не могут быть использованы. Обычно это вызывается неправильной реализацией класса, производного от CodeGenerator.
tr: Kod oluşturma için çıkış yazıcısı ile sağlanan yazıcı eşleşmediğinden kullanılamaz. Bunun nedeni genellikle CodeGenerator öğesinden türetilen sınıfın hatalı uygulanmasıdır.
zh_hans: 代码生成的输出编写器与提供的编写器不匹配，无法使用。这通常是由 CodeGenerator 派生类的错误实现引起的。
zh_hant: 用於產生程式碼的輸出寫入器和提供的寫入器不相符，無法使用。這通常是由於 CodeGenerator 衍生類別實作不正確所導致。

# CodeGenReentrance
source: This code generation API cannot be called while the generator is being used to generate something else.
cs: Toto rozhraní API pro generování kódu nelze volat, dokud je generátor používán ke generování jiného kódu.
de: Diese API für die Codegenerierung kann nicht aufgerufen werden, während der Generator anderweitig verwendet wird.
es: No se puede llamar a esta API de generación de código mientras se esté utilizando el generador para generar algo más.
fr: Impossible d'appeler cette API de génération de code tant que vous utilisez le générateur pour générer autre chose.
it: Non è possibile chiamare l'API di generazione del codice mentre il generatore viene usato per generare altri elementi.
ja: ジェネレーターが他の何かを生成するために使用されている間は、このコード生成 API を呼び出すことはできません。
ko: 생성기를 사용하여 다른 항목을 생성하고 있는 동안에는 이 코드 생성 API를 호출할 수 없습니다.
pl: Nie można wywołać tego interfejsu API generowania kodu, gdy za pomocą generatora generowane są inne elementy.
pt_br: Não será possível chamar a API de geração de código enquanto o gerador estiver sendo usado para gerar outro item.
ru: Вызов этого API для генерации кода невозможен, если генератор используется в другом месте.
tr: Oluşturucunun başka bir şey oluşturmak için kullanıldığı sırada bu kod oluşturma API'si çağrılamaz.
zh_hans: 当生成器正用于生成其他内容时，无法调用此代码生成 API。
zh_hant: 當產生器正用來產生其他東西時，無法呼叫此程式碼產生 API 。

# DuplicateFileName
source: The file name '{0}' was already in the collection.
cs: Název souboru {0} byl již v kolekci obsažen.
de: Der Dateiname "{0}" war bereits in der Sammlung vorhanden.
es: El nombre del archivo "'{0}" ya estaba en la colección.
fr: Le nom de fichier '{0}' figurait déjà dans la collection.
it: Il nome file '{0}' è già presente nella raccolta.
ja: ファイル名 '{0}' は既にコレクションにありました。
ko: 파일 이름 '{0}'이(가) 이미 컬렉션에 있습니다.
pl: Nazwa pliku „{0}” istnieje już w kolekcji.
pt_br: O nome de arquivo '{0}' já estava na coleção.
ru: Имя файла "{0}" уже присутствует в коллекции.
tr: '{0}' dosya adı bu koleksiyonda zaten vardı.
zh_hans: 文件名“{0}”已存在于集合中。
zh_hant: 集合中已存在檔名 '{0}'。

# Empty_attribute
source: The '{0}' attribute cannot be an empty string.
cs: Atribut {0} nemůže být prázdným řetězcem.
de: Das {0}-Attribut darf keine leere Zeichenfolge sein.
es: El atributo "{0}" no puede ser una cadena vacía.
fr: L'attribut '{0}' ne peut pas être une chaîne vide.
it: L'attributo '{0}' non può essere una stringa vuota.
ja: '{0}' 属性を空の文字列にすることはできません。
ko: '{0}' 특성은 빈 문자열일 수 없습니다.
pl: Atrybut „{0}” nie może być ciągiem pustym.
pt_br: O atributo '{0}' não pode ser uma cadeia de caracteres vazia.
ru: Атрибут "{0}" не может быть пустой строкой.
tr: '{0}' özniteliği boş bir dize olamaz.
zh_hans: “{0}”特性不能为空字符串。
zh_hant: '{0}' 屬性不可是空字串。

# Extension_Names_Cannot_Be_Empty_Or_Non_Period_Based
source: An extension name in the CodeDom configuration section must be a non-empty string which starts with a period.
cs: Názvem rozšíření v konfiguračním oddílu CodeDom musí být neprázdný řetězec začínající tečkou.
de: Ein Erweiterungsname im CodeDom-Konfigurationsabschnitt muss eine nicht leere Zeichenfolge sein, die mit einem Punkt beginnt.
es: Un nombre de extensión en la sección de configuración de CodeDom debe ser una cadena que no esté vacía y que empiece con un punto.
fr: Un nom d'extension dans la section de configuration CodeDom doit être une chaîne non vide débutant par un point.
it: Un nome di estensione nella sezione di configurazione CodeDom deve essere costituito da una stringa non vuota che inizia con un punto.
ja: CodeDom 構成セクションの拡張子名は、ピリオドで始まる空でない文字列を指定しなければなりません。
ko: CodeDOM 구성 섹션의 확장 이름은 마침표로 시작하는 비어 있지 않은 문자열이어야 합니다.
pl: Nazwa rozszerzenia w sekcji konfiguracji CodeDom musi być niepustym ciągiem rozpoczynającym się kropką.
pt_br: Um nome de extensão na seção de configuração CodeDom deve ser uma cadeia de caracteres não vazia, iniciada por um ponto.
ru: Имя расширения в разделе конфигурации CodeDom должно быть непустой строкой и начинаться с точки.
tr: CodeDom yapılandırma bölümündeki uzantı adı boş olmayan ve noktayla başlayan bir dize olmalıdır.
zh_hans: CodeDom 配置部分中的扩展名必须是以句点开头的非空字符串。
zh_hant: 在 CodeDom 組態區段中的副檔名必須是以句號 (.) 為開頭的非空白字串。

# InvalidElementType
source: Element type {0} is not supported.
cs: Typ prvku {0} není podporován.
de: Der Elementtyp {0} wird nicht unterstützt.
es: El tipo de elemento {0} no es compatible.
fr: Le type d'élément {0} n'est pas pris en charge.
it: Il tipo di elemento {0} non è supportato.
ja: 要素型 {0} はサポートされません。
ko: 요소 형식 {0}은(는) 지원되지 않습니다.
pl: Typ elementu {0} nie jest obsługiwany.
pt_br: Não há suporte para tipo de elemento {0}.
ru: Тип элемента {0} не поддерживается.
tr: {0} öğe türü desteklenmiyor.
zh_hans: 不支持元素类型 {0}。
zh_hant: 不支援元素類型 {0}。

# InvalidIdentifier
source: Identifier '{0}' is not valid.
cs: Identifikátor {0} je neplatný.
de: Der Bezeichner "{0}" ist ungültig.
es: El identificador "{0}" no es válido.
fr: L'identificateur '{0}' est non valide.
it: L'identificatore '{0}' non è valido.
ja: 識別子 '{0}' は有効ではありません。
ko: 식별자 '{0}'이(가) 잘못되었습니다.
pl: Identyfikator „{0}” nie jest prawidłowy.
pt_br: O identificador "{0}" é inválido.
ru: Недопустимый идентификатор "{0}".
tr: '{0}' tanımlayıcısı geçerli değil.
zh_hans: 标识符“{0}”无效。
zh_hant: 識別碼 '{0}' 無效。

# InvalidLanguageIdentifier
source: The identifier:"{0}" on the property:"{1}" of type:"{2}" is not a valid language-independent identifier name. Check to see if CodeGenerator.IsValidLanguageIndependentIdentifier allows the identifier name.
cs: Identifikátor {0} u vlastnosti {1} typu {2} není platným názvem identifikátoru nezávislým na jazyku. Zkontrolujte, zda parametr CodeGenerator.IsValidLanguageIndependentIdentifier umožňuje daný název identifikátoru.
de: Der Bezeichner "{0}" der {1}-Eigenschaft vom Typ "{2}" ist kein gültiger sprachunabhängiger Bezeichnername. Überprüfen Sie, ob CodeGenerator.IsValidLanguageIndependentIdentifier den Bezeichnernamen zulässt.
es: El identificador: "{0}" de la propiedad: "{1}" del tipo: "{2}" no es un nombre de identificador válido independiente del lenguaje. Compruebe si CodeGenerator.IsValidLanguageIndependentIdentifier admite el nombre del identificador.
fr: L'identificateur "{0}" de la propriété "{1}" de type "{2}" n'est pas un nom d'identificateur indépendant du langage valide. Vérifiez si CodeGenerator.IsValidLanguageIndependentIdentifier autorise le nom de l'identificateur.
it: L'identificatore "{0}" nella proprietà "{1}" del tipo "{2}" non è un nome di identificatore valido indipendente dal linguaggio. Verificare se CodeGenerator.IsValidLanguageIndependentIdentifier consente il nome dell'identificatore.
ja: 型 "{2}" のプロパティ "{1}" の識別子 "{0}" は、有効な言語依存の識別子名ではありません。CodeGenerator.IsValidLanguageIndependentIdentifier が識別子名を許可するかどうかを確認してください。
ko: 형식이 "{2}"인 속성 "{1}"의 식별자 "{0}"은(는) 유효한 언어 독립 식별자 이름이 아닙니다. CodeGenerator.IsValidLanguageIndependentIdentifier에서 식별자 이름을 사용할 수 있는지 확인하세요.
pl: Identyfikator „{0}” we właściwości „{1}” typu „{2}” nie jest prawidłową nazwą identyfikatora niezależną od języka. Sprawdź, czy element CodeGenerator.IsValidLanguageIndependentIdentifier umożliwia stosowanie tej nazwy identyfikatora.
pt_br: O identificador: "{0}" da propriedade: "{1}" do tipo: "{2}" não é um nome de identificador válido independente de idioma. Verifique se CodeGenerator.IsValidLanguageIndependentIdentifier permite o nome do identificador.
ru: Идентификатор "{0}" для свойства "{1}" типа "{2}" не является допустимым независимым от языка именем идентификатора. Проверьте, допускает ли CodeGenerator.IsValidLanguageIndependentIdentifier использование этого имени идентификатора.
tr: "{2}" türünün "{1}" özelliğindeki "{0}" tanımlayıcısı, geçerli bir dilden bağımsız tanımlayıcı adı değil. CodeGenerator.IsValidLanguageIndependentIdentifier için tanımlayıcı adına izin verilip verilmediğini denetleyin.
zh_hans: 类型为“{2}”的属性“{1}”上的标识符“{0}”不是与语言无关的有效标识符名称。请检查 CodeGenerator.IsValidLanguageIndependentIdentifier 是否允许该标识符名称。
zh_hant: 類型 "{2}" 之屬性 "{1}" 上的識別碼 "{0}"，不是與語言無關的有效識別碼名稱。請檢查以了解 CodeGenerator.IsValidLanguageIndependentIdentifier 是否允許該識別碼名稱。

# InvalidNullEmptyArgument
source: Argument {0} cannot be null or zero-length.
cs: Argument {0} nemůže nabývat hodnoty null nebo mít nulovou délku.
de: Das {0}-Argument kann nicht NULL sein oder eine Länge von 0 (null) haben.
es: El argumento {0} no puede ser nulo ni tener una longitud de cero.
fr: L'argument {0} ne peut pas avoir une valeur null, ni être de longueur nulle.
it: L'argomento {0} non può essere Null o di lunghezza pari a zero.
ja: 引数 {0} を null または長さ 0 にすることはできません。
ko: {0} 인수는 null이거나 길이가 0일 수 없습니다.
pl: Argument {0} nie może mieć wartości null ani długości wynoszącej zero.
pt_br: O argumento {0} não pode ser nulo nem ter comprimento zero.
ru: Аргумент {0} не может иметь значение NULL или нулевую длину.
tr: {0} bağımsız değişkeni null veya sıfır uzunluğunda olamaz.
zh_hans: 参数 {0} 不能为 null 或长度为零。
zh_hant: 引數 {0} 不可為 null 或長度為零。

# InvalidPathCharsInChecksum
source: The CodeChecksumPragma file name '{0}' contains invalid path characters.
cs: Název souboru CodeChecksumPragma {0} obsahuje znaky, které nejsou v cestě platné.
de: Der CodeChecksumPragma-Dateiname "{0}" enthält ungültige Pfadzeichen.
es: El nombre de archivo "{0}" de CodeChecksumPragma contiene caracteres no válidos de ruta de acceso.
fr: Le nom de fichier CodeChecksumPragma '{0}' contient des caractères de chemin non valides.
it: Il nome file '{0}' di CodeChecksumPragma contiene caratteri non validi per un percorso.
ja: CodeChecksumPragma ファイル名 '{0}' に無効なパス文字が含まれています。
ko: CodeChecksumPragma 파일 이름 '{0}'에 잘못된 경로 문자가 있습니다.
pl: Nazwa pliku CodeChecksumPragma „{0}” zawiera nieprawidłowe znaki ścieżki.
pt_br: O nome do arquivo CodeChecksumPragma '{0}' contém caracteres de caminho inválidos.
ru: Имя файла CodeChecksumPragma "{0}" содержит недопустимые символы пути.
tr: '{0}' CodeChecksumPragma dosya adı geçersiz yol karakterleri içeriyor.
zh_hans: CodeChecksumPragma 文件名“{0}”包含无效的路径字符。
zh_hant: CodeChecksumPragma 檔名 '{0}' 包含無效的路徑字元。

# InvalidPrimitiveType
source: Invalid Primitive Type: {0}. Consider using CodeObjectCreateExpression.
cs: Neplatný primitivní typ {0}. Zvažte možnost použít třídu CodeObjectCreateExpression.
de: Ungültiger primitiver Typ: {0}. Verwenden Sie ggf. CodeObjectCreateExpression.
es: Tipo primitivo no válido: {0}. Utilice CodeObjectCreateExpression.
fr: Type primitif non valide : {0}. Si possible, utilisez CodeObjectCreateExpression.
it: Tipo primitivo non valido: {0}. Provare a usare CodeObjectCreateExpression.
ja: 無効な Primitive 型 {0} です。CodeObjectCreateExpression を使ってください。
ko: 기본 형식이 잘못되었습니다. {0}. CodeObjectCreateExpression을 사용하세요.
pl: Nieprawidłowy typ pierwotny: {0}. Rozważ możliwość użycia elementu CodeObjectCreateExpression.
pt_br: Tipo primitivo inválido: {0}. Considere usar CodeObjectCreateExpression.
ru: Недопустимый тип примитива: {0}. Рекомендуется использовать класс CodeObjectCreateExpression.
tr: Geçersiz Temel Tür: {0}. CodeObjectCreateExpression kullanmayı deneyin.
zh_hans: 无效的基元类型: {0}。请考虑使用 CodeObjectCreateExpression。
zh_hant: 基本類型無效: {0}。請考慮使用 CodeObjectCreateExpression。

# InvalidRegion
source: The region directive '{0}' contains invalid characters. RegionText cannot contain any new line characters.
cs: Direktiva oblasti {0} obsahuje neplatné znaky. Vlastnost RegionText nemůže obsahovat žádné znaky pro nový řádek.
de: Die Regionsanweisung "{0}" enthält ungültige Zeichen. RegionText darf keine Zeilenumbruchzeichen enthalten.
es: La directiva de región "{0}" contiene caracteres no válidos. RegionText no puede contener ningún carácter de nueva línea.
fr: La directive region '{0}' contient des caractères non valides. RegionText ne peut pas contenir de caractères de nouvelle ligne.
it: La direttiva region '{0}' contiene caratteri non validi. RegionText non può contenere caratteri di nuova riga.
ja: 領域ディレクティブ '{0}' に無効な文字が含まれています。RegionText は改行文字を含むことができません。
ko: region 지시문 '{0}'에 잘못된 문자가 있습니다. RegionText에는 줄 바꿈 문자를 사용할 수 없습니다.
pl: Dyrektywa regionu „{0}” zawiera nieprawidłowe znaki. RegionText nie może zawierać znaków nowego wiersza.
pt_br: A diretiva de região '{0}' contém caracteres inválidos. RegionText não pode conter nenhum caractere de nova linha.
ru: Директива области "{0}" содержит недопустимые символы. RegionText не может содержать символы новой строки.
tr: '{0}' bölge yönergesi geçersiz karakterler içeriyor. RegionText yeni satır karakteri içeremez.
zh_hans: 区域指令“{0}”包含无效字符。RegionText 中不能包含任何新的行字符。
zh_hant: 區域指示詞 '{0}' 包含無效的字元。RegionText 不可以包含任何新行字元。
