Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Federation/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ActivityProcessAction
source: Process action '{0}'.
cs: Zpracujte akci {0}.
de: Aktion "{0}" verarbeiten.
es: Procese la acción "{0}".
fr: Traiter l'action '{0}'.
it: Elaborazione dell'azione '{0}'.
ja: アクション '{0}' を処理します。
pl: Przetwarzaj akcję „{0}”.
pt_br: Processar a ação '{0}'.
ru: Обработка действия "{0}".
tr: '{0}' eylemini işleyin.
zh_hans: 处理操作“{0}”。
zh_hant: 處理動作 '{0}'。

# BearerKeyShouldNotIincludeAProofToken
source: Bearer key scenarios should not include a proof token or issuer entropy in the response.
cs: Scénáře nosných klíčů by v odpovědi neměly obsahovat ověřovací token nebo entropii vystavitele.
de: Bearerschlüsselszenarien sollten kein Nachweistoken oder eine Ausstellerentropie in der Antwort enthalten.
es: Los escenarios de clave del portador no deben incluir un token de prueba o una entropía de emisor en la respuesta.
fr: Les scénarios de clé de porteur ne doivent pas inclure de jeton de preuve ou d’entropie d’émetteur dans la réponse.
it: Gli scenari chiave di connessione non devono includere un token di prova o un'entropia dell'autorità di certificazione nella risposta.
ja: ベアラーの主要なシナリオでは、応答に証明トークンまたは発行者エントロピを含めない必要があります。
ko: 전달자 키 시나리오는 응답에 증명 토큰 또는 발급자 엔트로피를 포함하지 않아야 합니다.
pl: Scenariusze klucza elementu nośnego nie powinny zawierać tokenu potwierdzającego ani entropii wystawcy w odpowiedzi.
pt_br: Os cenários principais do portador não devem incluir um token de prova ou entropia do emissor na resposta.
ru: Сценарии с ключом носителем не должны включать в ответ маркер проверки или энтропию издателя.
tr: Taşıyıcı anahtar senaryoları yanıtta bir kanıt belirteci veya veren entropi içermemelidir.
zh_hans: 持有者关键方案不应在响应中包含证明令牌或证书颁发者熵。
zh_hant: Bearer 金鑰案例不應在回應中包含證明權杖或簽發者 Entropy。

# CannotDetermineSPNBasedOnAddress
source: Client cannot determine the Service Principal Name based on the identity in the target address '{0}' for the purpose of SspiNegotiation/Kerberos. The target address identity must be a UPN identity (like acmedomain\alice) or SPN identity (like host/bobs-machine).
cs: Klient nemůže určit hlavní název služby založený na identitě v cílové adrese {0} pro účel třídy SspiNegotiation nebo protokolu Kerberos. Identitou cílové adresy musí být identita UPN (jako například acmedomain\alice) nebo identita SPN (například host/honzuv-pocitac).
de: Der Client kann den Dienstprinzipalnamen auf der Basis der Identität in der Zieladresse "{0}" für die Verwendung durch SspiNegotiation/Kerberos nicht bestimmen. Bei der Zieladressenidentität muss es sich um eine UPN-Identität (wie gipfeldomäne\alice) oder SPN-Identität (wie host/bobs-computer) handeln.
es: El cliente no puede determinar el Nombre principal de servicio en función de la identidad de la dirección de destino '{0}' para los fines de SspiNegotiation/Kerberos. La identidad de la dirección de destino debe ser una identidad UPN (como acmedomain\alice) o una identidad SPN (como host/bobs-machine).
fr: Le client ne peut pas déterminer le nom de principal de service (SPN) basé sur l'identité dans l'adresse cible '{0}' pour les besoins de SspiNegotiation/Kerberos. L'identité de l'adresse cible doit être une identité UPN (comme acmedomain\alice) ou une identité SPN (comme host/bobs-machine).
it: Il client non è in grado di determinare il nome dell'entità servizio in base all'identità nell'indirizzo di destinazione '{0}' per SspiNegotiation/Kerberos. L'identità indirizzo di destinazione deve essere un'identità UPN (ad esempio dominioacme\nomeutente) o un'identità SPN (ad esempio host/nomecomputer).
ja: SspiNegotiation/Kerberos に使用される対象アドレス '{0}' の ID からサービス プリンシパル名を特定できません。対象アドレス ID は、UPN ID (例: acmedomain\alice) または SPN ID (例: host/bobs-machine) である必要があります。
pl: Klient nie może określić głównej nazwy usługi na podstawie tożsamości z adresu docelowego „{0}” na potrzeby SspiNegotiation/Kerberos. Tożsamość adresu docelowego musi być tożsamością UPN (jak domena_abc\alicja) lub tożsamością SPN (jak host/komputer1).
pt_br: O cliente não pode determinar o Nome Principal de Serviço com base na identidade presente no endereço de destino '{0}' destinado a SspiNegotiation/Kerberos. A identidade do endereço de destino deve ser uma identidade UPN (como acmedomain\alice) ou uma identidade SPN (como host/bobs-machine).
ru: Клиент не может определить основное имя службы на основании имени в конечном адресе "{0}" для SspiNegotiation/Kerberos. Имя, соответствующее целевому адресу, должно быть представлено в виде имени участника-пользователя (пример: acmedomain\alice) или основного имени службы (пример: host/bobs-machine).
tr: İstemci, SspiNegotiation/Kerberos amacıyla, '{0}' hedef adresindeki varlığa dayanan Service Principal Name öğesini belirleyemiyor. Hedef adres varlığı, bir UPN varlığı (örneketkialanı\başak gibi) ya da SPN varlığı (anamakine/ebrunun-makinesi gibi) olmalıdır.
zh_hans: 客户端无法以 SspiNegotiation/Kerberos 为目的根据目标地址“{0}”中的标识确定服务主体名称。目标地址标识必须是 UPN 标识(例如 acmedomain\alice)或 SPN 标识(例如 host/bobs-machine)。
zh_hant: 用戶端無法根據目標位址 '{0}' 中的身分識別判斷服務主要名稱，以用於 SspiNegotiation/Kerberos。目標位址身分識別必須是 UPN 身分識別 (像是 acmedomain\alice) 或 SPN 身分識別 (像是 host/bobs-machine)。

# ChannelFactoryMustSupportIRequestChannel
source: ChannnelFactory must support 'System.ServiceModel.Channels.IRequestChannel' interface.
cs: Třída ChannnelFactory musí podporovat rozhraní 'System.ServiceModel.Channels.IRequestChannel'.
de: Die ChannnelFactory muss die Schnittstelle "System.ServiceModel.Channels.IRequestChannel" unterstützen.
es: ChannnelFactory debe admitir la interfaz "System.ServiceModel.Channels.IRequestChannel".
fr: ChannnelFactory doit prise en charge de l’interface 'System.ServiceModel.Channels.IRequestChannel'.
it: ChannelnnelFactory deve supportare l'interfaccia 'System.ServiceModel.Channels.IRequestChannel'.
ja: ChannnelFactory は 'System.ServiceModel.Channels.IRequestChannel' インターフェイスをサポートする必要があります。
ko: ChannelFactory는 'System.ServiceModel.Channels.IRequestChannel' 인터페이스를 지원해야 합니다.
pl: Element ChannnelFactory musi obsługiwać interfejs „System.ServiceModel.Channels.IRequestChannel”.
pt_br: ChannnelFactory deve dar suporte à interface 'System.ServiceModel.Channels.IRequestChannel'.
ru: ChannnelFactory должен поддерживать интерфейс "System.ServiceModel.Channels.IRequestChannel".
tr: ChannnelFactory öğesi 'System.ServiceModel.Channels.IRequestChannel' arabirimini desteklemelidir.
zh_hans: ChannnelFactory 必须支持“System.ServiceModel.Channels.IRequestChannel”接口。
zh_hant: ChannnelFactory 必須支援 'System.ServiceModel.Channels.IRequestChannel' 介面。

# CommunicationObjectCannotBeUsed
source: The communication object, {0}, is in the {1} state. Communication objects cannot be used for communication unless they are in the Opened state.
cs: Objekt komunikace {0} je ve stavu {1}. Pokud objekty komunikace nejsou ve stavu Opened, nelze je použít ke komunikaci.
de: Das Kommunikationsobjekt {0} befindet sich im {1}-Zustand. Die Kommunikationsobjekte können nicht zur Kommunikation verwendet werden, wenn sie sich nicht im Opened-Zustand befinden.
es: El objeto de comunicación, {0}, se encuentra en el estado {1}. Los objetos de comunicación no se pueden usar para la comunicación a menos que se encuentren en el estado Opened.
fr: L'objet de communication {0} est dans l'état {1}. Les objets de communication ne peuvent pas être utilisés à moins d'être dans l'état Opened.
it: L'oggetto comunicazione {0} si trova nello stato {1}. Non è possibile usare oggetti comunicazione per la comunicazione a meno che non siano nello stato Opened.
ja: 通信オブジェクト {0} は {1} 状態です。通信オブジェクトは、Opened 状態でないと通信に使用できません。
ko: 통신 개체 {0}이(가) {1} 상태입니다. 통신 개체는 열림 상태가 아닌 경우 통신에 사용할 수 없습니다.
pl: Obiekt komunikacyjny {0} jest w stanie {1}. Obiektów komunikacyjnych nie można używać do komunikacji, jeśli nie są w stanie Opened.
pt_br: O objeto de comunicação, {0}, está no estado {1}. Objetos de comunicação não poderão ser usados para comunicação, a não ser que estejam no estado Aberto.
ru: Объект связи {0} находится в состоянии {1}. Объекты связи можно использовать для связи только в состоянии Opened.
tr: {0} iletişim nesnesi {1} durumunda. Opened durumunda olmadıkları sürece, iletişim nesneleri iletişim için kullanılamaz.
zh_hans: 通信对象 {0} 处于 {1} 状态。除非通信对象处于“已打开”状态，否则无法将其用于通信。
zh_hant: 通訊物件 {0} 為 {1} 狀態。除非通訊物件為「已開啟」狀態，否則無法用於通訊。

# CommunicationObjectFaulted1
source: The communication object, {0}, cannot be used for communication because it is in the Faulted state.
cs: Objekt komunikace {0} nelze použít ke komunikaci, protože je ve stavu Faulted.
de: Das Kommunikationsobjekt {0} kann nicht zur Kommunikation verwendet werden, weil es sich im Faulted-Zustand befindet.
es: El objeto de comunicación, {0}, no se puede usar para la comunicación porque se encuentra en el estado Faulted.
fr: L'objet de communication {0} ne peut pas être utilisé pour la communication, car il est dans l'état Faulted.
it: Non è possibile usare l'oggetto comunicazione {0} per la comunicazione perché si trova nello stato Faulted.
ja: 通信オブジェクト {0} は、状態が Faulted であるため通信に使用できません。
ko: 통신 개체 {0}은(는) Faulted 상태이기 때문에 통신에 사용할 수 없습니다.
pl: Obiektu komunikacyjnego {0} nie można używać do komunikacji, ponieważ jest w stanie Faulted.
pt_br: O objeto de comunicação, {0}, não pode ser usado para comunicação porque está no estado Com Falha.
ru: Объект связи {0} нельзя использовать для связи, так как он находится в состоянии Faulted.
tr: {0} iletişim nesnesi, Faulted durumunda olduğundan iletişim için kullanılamıyor.
zh_hans: 通信对象 {0} 无法用于通信，因为其处于“出错”状态。
zh_hant: 因為通訊物件 {0} 為「出錯」狀態，所以無法用於通訊。

source: Computed key proof tokens are only supported with symmetric key types.
cs: Vypočítané ověřovací tokeny klíče se podporují jen s typy symetrických klíčů.
de: Berechnete Schlüsselnachweistoken werden nur mit symmetrischen Schlüsseltypen unterstützt.
es: Los tokens de prueba de clave calculados solo se admiten con tipos de clave simétrica.
fr: Les jetons de preuve de clé calculés sont uniquement pris en charge avec les types de clés symétriques.
it: I token di prova della chiave calcolati sono supportati solo con tipi di chiave simmetrica.
ja: 計算されたキー証明トークンは、対称キーの種類でのみサポートされます。
ko: 계산 키 증명 토큰은 대칭 키 유형에서만 지원됩니다.
pl: Obliczone tokeny sprawdzania kluczy są obsługiwane tylko w przypadku typów kluczy symetrycznych.
pt_br: Só há suporte para tokens de prova de chave computados com tipos de chave simétrica.
ru: Вычисляемые маркеры проверки ключа поддерживаются только с симметричными типами ключей.
tr: Hesaplanan anahtar kanıt belirteçleri yalnızca simetrik anahtar türlerinde destekleniyor.
zh_hans: 计算的密钥证明令牌仅支持对称密钥类型。
zh_hant: 只有對稱金鑰類型才支援計算金鑰證明權杖。

source: Computed key proof tokens require issuer to supply key material via entropy.
cs: Vypočítané ověřovací tokeny klíčů vyžadují, aby žadatel dodal materiál klíče prostřednictvím entropie.
de: Für berechnete Schlüsselnachweistoken muss der Aussteller Schlüsselmaterial über Entropie bereitstellen.
es: Los tokens de prueba de clave calculados requieren que el emisor proporcione material de clave a través de la entropía.
fr: Les jetons de preuve de clé calculés nécessitent que l’émetteur fournisse du matériel de clé par le biais d’une entropie.
it: I token di prova della chiave calcolati richiedono all'autorità emittente di fornire il materiale della chiave tramite entropia.
ja: 計算されたキー証明トークンでは、発行者がエントロピを介してキー マテリアルを提供する必要があります。
ko: 계산 키 증명 토큰은 발급자가 엔트로피를 통해 키 자료를 제공해야 합니다.
pl: Obliczone tokeny potwierdzające klucz wymagają od wystawcy dostarczenia materiału klucza za pomocą entropii.
pt_br: Tokens de prova de chave computados exigem que o emissor forneça material de chave por meio de entropia.
ru: Вычисляемые маркеры проверки ключа требуют, чтобы издатель предоставил материал ключа через энтропию.
tr: Hesaplanan anahtar kanıt belirteçleri verenin anahtar malzemesini entropi aracılığıyla sağlamasını gerektiriyor.
zh_hans: 计算的密钥证明令牌要求证书颁发者通过熵提供密钥材料。
zh_hant: 計算金鑰證明權杖要求簽發者透過 Entropy 提供金鑰資料。

source: Computed key proof tokens require requester to supply key material via entropy.
cs: Vypočítané ověřovací tokeny klíčů vyžadují, aby žadatel dodal materiál klíče prostřednictvím entropie.
de: Für berechnete Schlüsselnachweistoken muss der Anforderer Schlüsselmaterial über Entropie bereitstellen.
es: Los tokens de prueba de clave calculados requieren que el solicitante proporcione material de clave a través de la entropía.
fr: Les jetons de preuve de clé calculés nécessitent que le demandeur fournisse du matériel de clé par le biais d’une entropie.
it: I token di prova della chiave calcolati richiedono al richiedente di fornire il materiale della chiave tramite entropia.
ja: 計算されたキー証明トークンでは、要求者がエントロピを介してキー マテリアルを提供する必要があります。
ko: 계산 키 증명 토큰은 요청자가 엔트로피를 통해 키 자료를 제공해야 합니다.
pl: Obliczone tokeny potwierdzające klucz wymagają, aby żądający dostarczał materiał klucza za pomocą entropii.
pt_br: Os tokens de prova de chave computados exigem que o solicitante forneça o material da chave via entropia.
ru: Вычисляемые маркеры проверки ключа требуют, чтобы инициатор запроса предоставил материал ключа через энтропию.
tr: Hesaplanan anahtar kanıt belirteçleri istek sahibinin anahtar malzemesini entropi aracılığıyla sağlamasını gerektiriyor.
zh_hans: 计算的密钥证明令牌要求请求者通过熵提供密钥材料。
zh_hant: 計算金鑰證明權杖要求要求者透過 Entropy 提供金鑰資料。

# EncryptedKeysForProofTokensNotSupported
source: Encrypted keys for proof tokens are not supported.
cs: Šifrované klíče pro ověřovací tokeny nejsou podporovány.
de: Verschlüsselte Schlüssel für Nachweistoken werden nicht unterstützt.
es: No se admiten claves cifradas para tokens de prueba.
fr: Les clés chiffrées pour les jetons de preuve ne sont pas prises en charge.
it: Le chiavi crittografate per i token di prova non sono supportate.
ja: 証明トークンの暗号化されたキーはサポートされていません。
ko: 증명 토큰에 대한 암호화된 키는 지원되지 않습니다.
pl: Zaszyfrowane klucze dla tokenów potwierdzających nie są obsługiwane.
pt_br: Não há suporte para chaves criptografadas para tokens de prova.
ru: Зашифрованные ключи для маркеров проверки не поддерживаются.
tr: Kanıt belirteçlerinde şifreli anahtarlar desteklenmiyor.
zh_hans: 不支持证明令牌使用加密密钥。
zh_hant: 不支援證明權杖的加密金鑰。

# IRequestChannelMustBeCreated
source: The IRequestChannel must be in the created state. Was: '{0}'.
cs: IRequestChannel musí být ve vytvořeném stavu. Bylo: '{0}'.
de: "IRequestChannel" muss sich im Zustand "Erstellt" befinden. War: '{0}'.
es: IRequestChannel debe estar en el estado creado. Era: "{0}".
fr: IRequestChannel doit être dans l’état créé. Was: '{0}'.
it: IRequestChannel deve essere nello stato creato. Era: '{0}'.
ja: IRequestChannel は、作成された状態である必要があります。 '{0}' でした。
ko: IRequestChannel은 생성된 상태여야 합니다. 이전: '{0}'.
pl: Element IRequestChannel musi być w stanie utworzenia. Był: „{0}”.
pt_br: O IRequestChannel deve estar no estado criado. Era: '{0}'.
ru: Канал IRequestChannel должен быть в созданном состоянии. Было: "{0}".
tr: IRequestChannel öğesi oluşturuldu durumda olmalıdır. Durum şuydu: '{0}'.
zh_hans: IRequestChannel 必须处于已创建状态。之前的状态为:“{0}”。
zh_hant: IRequestChannel 必須處於建立狀態，但卻是 '{0}'。

# InsufficentMemory
source: Insufficient memory avaliable to complete the operation.
cs: K dokončení operace není dostatek paměti.
de: Es ist nicht ausreichend Arbeitsspeicher verfügbar, um den Vorgang abzuschließen.
es: No hay suficiente memoria disponible para completar la operación.
fr: Mémoire disponible insuffisante pour effectuer l'opération.
it: La memoria disponibile non è sufficiente per completare l'operazione.
ja: 利用可能なメモリが不足しているため、この操作を完了できません。
pl: Brak wystarczającej ilości pamięci, aby ukończyć operację.
pt_br: Memória insuficiente disponível para concluir a operação.
ru: Недостаточно памяти для завершения операции.
tr: İşlemi tamamlamak için yetersiz kullanılabilir bellek.
zh_hans: 可用内存不足，无法完成操作。
zh_hant: 記憶體不足，無法完成作業。

# IssuedSecurityTokenParametersIncorrectType
source: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> must be of type: WSTrustTokenParameters. Was: '{0}.
cs: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> musí být typu WSTrustTokenParameters. Bylo: '{0}.
de: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> muss vom Typ "WSTrustTokenParameters" sein. War: '{0}.
es: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> debe ser de tipo: WSTrustTokenParameters. Fue: "{0}.
fr: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> doit être de type : WSTrustTokenParameters. Was: '{0}.
it: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> deve essere di tipo: WSTrustTokenParameters. Era: '{0}.
ja: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> の型は: WSTrustTokenParameters である必要があります。 '{0}.でした。
ko: tokenRequirement.GetProperty<IssuedSecurityTokenParameters>는 WSTrustTokenParameters 유형이어야 합니다. 이전: '{0}.
pl: Element tokenRequirement.GetProperty<IssuedSecurityTokenParameters> musi być typu: WSTrustTokenParameters. Był „{0}”.
pt_br: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> deve ser do tipo: WSTrustTokenParameters. Era: '{0}.
ru: Параметр tokenRequirement.GetProperty<IssuedSecurityTokenParameters> должен иметь тип WSTrustTokenParameters. Было: "{0}.
tr: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> şu türde olmalıdır: WSTrustTokenParameters. Tür şuydu: '{0}.
zh_hans: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> 必须是以下类型: WSTrustTokenParameters。其过去的类型是: '{0}。
zh_hant: tokenRequirement.GetProperty<IssuedSecurityTokenParameters> 必須是 WSTrustTokenParameters 類型，但卻是 '{0}。

# IssuedTokenRenewalThresholdPercentageIncorrect
source: IssuedTokenRenewalThresholdPercentage must be greater than or equal to 1 and less than or equal to 100. Was: '{0}'.
cs: IssuedTokenRenewalThresholdPercentage musí být větší nebo rovno 1 a menší nebo rovno 100. Bylo: '{0}'.
de: "IssuedTokenRenewalThresholdPercentage" muss größer oder gleich 1 und kleiner oder gleich 100 sein. War: '{0}'.
es: IssuedTokenRenewalThresholdPercentage debe ser mayor o igual que 1 y menor o igual que 100. Era: "{0}".
fr: IssuedTokenRenewalThresholdPercentage doit être supérieur ou égal à 1 et inférieur ou égal à 100. Was: '{0}'.
it: IssuedTokenRenewalThresholdPercentage deve essere maggiore o uguale a 1 e minore o uguale a 100. Era: '{0}'.
ja: IssuedTokenRenewalThresholdPercentage は 1 以上 100 以下である必要があります。 '{0}' でした。
ko: IssuedTokenRenewalThresholdPercentage는 1보다 크거나 같고 100보다 작거나 같아야 합니다. 이전: '{0}'.
pl: Wartość IssuedTokenRenewalThresholdPercentage musi być większa lub równa 1 i mniejsza lub równa 100. Była: „{0}”.
pt_br: IssuedTokenRenewalThresholdPercentage deve ser maior ou igual a 1 e menor ou igual a 100. Era: '{0}'.
ru: Значение IssuedTokenRenewalThresholdPercentage должно быть больше или равно 1 и меньше или равно 100. Было: "{0}".
tr: IssuedTokenRenewalThresholdPercentage değeri en az 1 ve en fazla 100 olmalıdır. Değer şuydu: '{0}'.
zh_hans: IssuedTokenRenewalThresholdPercentage 必须大于或等于 1，且小于或等于 100。之前的值为:“{0}”。
zh_hant: IssuedTokenRenewalThresholdPercentage 必須大於或等於 1 且小於或等於 100，但卻是 '{0}'。

# MaxIssuedTokenCachingTimeMustBeGreaterThanTimeSpanZero
source: MaxIssuedTokenCachingTime must be greater than TimeSpan.Zero. Was: '{0}'.
cs: MaxIssuedTokenCachingTime musí být větší než TimeSpan.Zero. Bylo: '{0}'.
de: MaxIssuedTokenCachingTime muss größer als TimeSpan.Zero sein. War: '{0}'.
es: MaxIssuedTokenCachingTime debe ser mayor que TimeSpan.Zero. Era: "{0}".
fr: MaxIssuedTokenCachingTime doit être supérieur à TimeSpan.Zero. Was: '{0}'.
it: MaxIssuedTokenCachingTime deve essere maggiore di TimeSpan.Zero. Era: '{0}'.
ja: MaxIssuedTokenCachingTime は TimeSpan.Zero より大きくする必要があります。 '{0}' でした。
ko: MaxIssuedTokenCachingTime은 TimeSpan.Zero보다 커야 합니다. 이전: '{0}'.
pl: Wartość MaxIssuedTokenCachingTime musi być większa niż wartość TimeSpan.Zero. Była: „{0}”.
pt_br: MaxIssuedTokenCachingTime deve ser maior que TimeSpan.Zero. Era: '{0}'.
ru: Значение MaxIssuedTokenCachingTime должно быть больше TimeSpan.Zero. Было: "{0}".
tr: MaxIssuedTokenCachingTime değeri TimeSpan.Zero değerinden büyük olmalıdır. Değer şuydu: '{0}'.
zh_hans: MaxIssuedTokenCachingTime 必须大于 TimeSpan.Zero。之前的值为:“{0}”。
zh_hant: MaxIssuedTokenCachingTime 必須大於 TimeSpan.Zero，但卻是 '{0}'。

source: No key size provided.
cs: Nezadala se žádná velikost klíče.
de: Es wurde keine Schlüsselgröße angegeben.
es: No se proporcionó ningún tamaño de clave.
fr: Aucune taille de clé n’est fournie.
it: Nessuna dimensione della chiave specificata.
ja: キー サイズが指定されていません。
ko: 키 크기가 제공되지 않았습니다.
pl: Nie podano rozmiaru klucza.
pt_br: Nenhum tamanho de chave fornecido.
ru: Размер ключа не указан.
tr: Anahtar boyutu belirtilmedi.
zh_hans: 未提供密钥大小。
zh_hant: 未提供金鑰大小。

source: Only PSHA1 computed keys are supported.
cs: Podporují se jen počítané klíče PSHA1.
de: Es werden nur berechnete PSHA1-Schlüssel unterstützt.
es: Solo se admiten claves calculadas PSHA1.
fr: Seules les clés calculées PSHA1 sont prises en charge.
it: Sono supportate solo le chiavi calcolate PSHA1.
ja: PSHA1 計算キーのみがサポートされています。
ko: PSHA1 계산 키만 지원됩니다.
pl: Obsługiwane są tylko klucze obliczane przez PSHA1.
pt_br: Somente chaves computadas PSHA1 têm suporte.
ru: Поддерживаются только вычисляемые ключи PSHA1.
tr: Yalnızca PSHA1 hesaplanan anahtarları destekleniyor.
zh_hans: 仅支持 PSHA1 计算的密钥。
zh_hant: 只支援 PSHA1 計算金鑰。

source: Protected key entropy is not supported.
cs: Entropie chráněného klíče se nepodporuje.
de: Die Entropie geschützter Schlüssel wird nicht unterstützt.
es: No se admite la entropía de clave protegida.
fr: L’entropie de clé protégée n’est pas prise en charge.
it: L'entropia della chiave protetta non è supportata.
ja: 保護されたキー エントロピはサポートされていません。
ko: 보호된 키 엔트로피는 지원되지 않습니다.
pl: Entropia klucza chronionego nie jest obsługiwana.
pt_br: Não há suporte para entropia de chave protegida.
ru: Энтропия защищенного ключа не поддерживается.
tr: Korumalı anahtar entropisi desteklenmiyor.
zh_hans: 不支持受保护的密钥熵。
zh_hant: 不支援受保護的金鑰 Entropy。

# RSTRProofTokenShouldNotHaveAComputedKeyAlgorithmOrIssuerEntropy
source: An RSTR containing a proof token should not also have a computed key algorithm or issuer entropy.
cs: RSTR obsahující ověřovací token by také neměl mít vypočítaný algoritmus klíče nebo entropii vystavitele.
de: Ein RSTR, der ein Nachweistoken enthält, sollte nicht auch über einen berechneten Schlüsselalgorithmus oder eine Ausstellerentropie verfügen.
es: Un RSTR que contenga un token de prueba no debe tener también un algoritmo de clave calculado o una entropía de emisor.
fr: Un RSTR contenant un jeton de preuve ne doit pas non plus avoir d’algorithme de clé calculée ou d’entropie d’émetteur.
it: Un RSTR contenente un token di prova non deve avere anche un algoritmo di chiave calcolato o un'entropia dell'autorità emittente.
ja: 証明トークンを含む RSTR には、計算されたキー アルゴリズムまたは発行者エントロピを含めない必要があります。
ko: 증명 토큰을 포함하는 RSTR에는 계산 키 알고리즘이나 발급자 엔트로피도 없어야 합니다.
pl: Element RSTR zawierający token potwierdzający nie powinien również mieć obliczonego algorytmu klucza ani entropii wystawcy.
pt_br: Um RSTR que contém um token de prova também não deve ter um algoritmo de chave computado ou entropia de emissor.
ru: RSTR, содержащий маркер проверки, также не должен иметь вычисляемый алгоритм ключа или энтропию издателя.
tr: Kanıt belirteci içeren bir RSTR aynı zamanda bir hesaplanan anahtar algoritması veya veren entropi içermemelidir.
zh_hans: 包含证明令牌的 RSTR 不应同时具有计算的密钥算法或证书颁发者熵。
zh_hant: 包含證明權杖的 RSTR 不應該同時有計算金鑰演算法或簽發者 Entropy。
