Repository: dotnet/wcf
Catalog: src/System.ServiceModel.Federation/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# RequestTypeNotSupported
source: The RequestType '{0}', is not supported.
cs: Typ požadavku (RequestType) '{0}' není podporován.
de: Der RequestType "{0}" wird nicht unterstützt.
es: RequestType "{0}" no se admite.
fr: RequestType '{0}' n’est pas pris en charge.
it: Il RequestType '{0}' non è supportato.
ja: RequestType '{0}' はサポートされていません。
ko: RequestType '{0}'은(는) 지원되지 않습니다.
pl: Element RequestType „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o RequestType '{0}'.
ru: Тип RequestType "{0}" не поддерживается.
tr: RequestType '{0}' desteklenmiyor.
zh_hans: 不支持 RequestType“{0}”。
zh_hant: 不支援 RequestType '{0}'。

# SFxTimeoutOutOfRange0
source: Timeout must be greater than or equal to TimeSpan.Zero. To disable timeout, specify TimeSpan.MaxValue.
cs: Časový limit musí být větší než nula nebo se rovnat hodnotě TimeSpan.Zero. Pokud chcete časový limit zakázat, zadejte hodnotu TimeSpan.MaxValue.
de: Das Zeitlimit muss größer oder gleich TimeSpan.Zero sein. Geben Sie den TimeSpan.MaxValue an, um das Zeitlimit zu deaktivieren.
es: El tiempo de espera debe ser mayor o igual que TimeSpan.Zero. Para deshabilitar el tiempo de espera, especifique TimeSpan.MaxValue.
fr: Le délai d'expiration doit être supérieur ou égal à TimeSpan.Zero. Pour désactiver le délai d'expiration, spécifiez TimeSpan.MaxValue.
it: Il valore del timeout deve essere maggiore o uguale a TimeSpan.Zero. Per disabilitare il timeout, specificare TimeSpan.MaxValue.
ja: タイムアウトは TimeSpan.Zero 以上の値にする必要があります。タイムアウトを無効にするには、TimeSpan.MaxValue を指定してください。
pl: Limit czasu musi być większy lub równy wartości TimeSpan.Zero. Aby wyłączyć limit czasu, określ wartość TimeSpan.MaxValue.
pt_br: O tempo limite deve ser maior ou igual a TimeSpan.Zero. Para desabilitar o tempo limite, especifique TimeSpan.MaxValue.
ru: Время ожидания должно быть не менее TimeSpan.Zero. Чтобы отключить время ожидания, укажите TimeSpan.MaxValue.
tr: Zaman aşımı değeri, TimeSpan.Zero değerinden büyük ya da ona eşit olmalıdır. Zaman aşımını devre dışı bırakmak için TimeSpan.MaxValue değeri belirtin.
zh_hans: 超时必须大于或等于 TimeSpan.Zero。要禁用超时，请指定 TimeSpan.MaxValue。
zh_hant: Timeout 必須大於或等於 TimeSpan.Zero。若要停用逾時，請指定 TimeSpan.MaxValue。

# SecurityEndpointNotFound
source: Server '{0}' sent back a fault indicating it is in the process of shutting down. Please see the inner exception for fault details.
cs: Server {0} odeslal zpět chybu, která udává, že probíhá jeho vypínání. Podrobné informace o chybě naleznete v popisu vnitřní výjimky.
de: Der Server "{0}" hat einen Fehler zurückgesendet, der darauf hinweist, dass der Server gerade heruntergefahren wird. Detaillierte Fehlerinformationen finden Sie in der inneren Ausnahme.
es: El servidor '{0}' devolvió un error que indica que está en proceso de cerrarse. Consulte la excepción interna para obtener más información del error.
fr: Le serveur '{0}' a renvoyé une erreur indiquant qu'il est en cours d'arrêt. Consultez l'exception interne pour obtenir des détails sur l'erreur.
it: Il server '{0}' ha restituito un errore che indica che è in fase di arresto. Per ulteriori informazioni sull'errore, vedere l'eccezione interna.
ja: サーバー '{0}' は、シャットダウンの処理中であることを示すフォールトを返信しました。詳細については、内部例外を参照してください。
ko: 종료하는 중이라는 것을 나타내는 오류를 '{0}' 서버가 다시 보냈습니다. 자세한 오류 내용은 내부 예외를 참조하십시오.
pl: Serwer „{0}” zwrócił błąd wskazujący, że właśnie trwa jego zamykanie. Szczegółowe informacje o błędzie można znaleźć w wewnętrznym wyjątku.
pt_br: O servidor '{0}' retornou uma falha indicando que ele está desligando. Consulte a exceção interna para obter os detalhes da falha.
ru: Сервер "{0}" отправил обратно сообщение об ошибке, указывающее, что он находится в процессе отключения. Дополнительные сведения об ошибке см. внутреннее исключение.
tr: '{0}' sunucusu, kapanmakta olduğunu belirten bir hata gönderdi. Hata ayrıntıları için iç özel duruma bakın.
zh_hans: 服务器“{0}”发回错误，指示其正在关机。有关错误的详细信息，请参见内部异常。
zh_hant: 伺服器 '{0}' 傳回錯誤，指出正在進行關機。如需錯誤詳細資訊，請參閱內部例外狀況。

# SecurityServerTooBusy
source: Server '{0}' sent back a fault indicating it is too busy to process the request. Please retry later. Please see the inner exception for fault details.
cs: Server {0} odeslal zpět chybu, která udává, že je příliš zaneprázdněn a nemůže zpracovat požadavek. Podrobné informace o chybě naleznete v popisu vnitřní výjimky.
de: Der Server "{0}" hat einen Fehler zurückgesendet, der darauf hinweist, dass er zu ausgelastet ist, um die Anforderung zu verarbeiten. Versuchen Sie es später noch mal. Detaillierte Fehlerinformationen finden Sie in der inneren Ausnahme.
es: El servidor "{0}" devolvió un error que indica que está demasiado ocupado para procesar la solicitud. Inténtelo de nuevo más adelante. Consulte la excepción interna para obtener más información del error.
fr: Le serveur '{0}' a envoyé une erreur indiquant qu'il est trop occupé pour traiter la requête. Réessayez plus tard. Consultez l'exception interne pour obtenir des détails sur l'erreur.
it: Il server '{0}' ha restituito un errore che indica che è troppo occupato per elaborare la richiesta. Riprovare più tardi. Per dettagli sull'errore, vedere l'eccezione interna.
ja: サーバー '{0}' は、ビジー状態のため要求を処理できないことを示すフォールトを送り返しました。後で再試行してください。フォールトの詳細については、内部例外を参照してください。
ko: 사용 중이어서 요청을 처리할 수 없다는 것을 나타내는 오류를 '{0}' 서버가 다시 보냈습니다. 나중에 다시 시도하세요. 자세한 오류 내용은 내부 예외를 참조하세요.
pl: Serwer „{0}” zwrócił błąd wskazujący, że jest zbyt obciążony, aby obsłużyć żądanie. Spróbuj ponownie później. Szczegółowe informacje o błędzie można znaleźć w wewnętrznym wyjątku.
pt_br: O servidor '{0}' retornou uma falha indicando que ele está muito ocupado para processar a solicitação. Tente novamente mais tarde. Consulte a exceção interna para obter os detalhes da falha.
ru: Сервер "{0}" отправил обратно сообщение об ошибке, указывающее, что он перегружен и не может обработать запрос. Повторите попытку позже. Дополнительные сведения об ошибке см. в описании внутреннего исключения.
tr: '{0}' sunucusu bir hata geri göndererek, isteği işleyemeyecek kadar meşgul olduğunu belirtti. Lütfen daha sonra yeniden deneyin. Hata ayrıntıları için iç özel duruma bakın.
zh_hans: 服务器“{0}”发回错误，指示其太忙，无法处理请求。请稍后重试。有关错误的详细信息，请参见内部异常。
zh_hant: 伺服器 '{0}' 傳回錯誤，指出因過於忙碌，無法處理要求。請稍後重試。請參考內部例外狀況，以取得錯誤詳細資料。

# TokenProviderUnableToGetToken
source: The token provider '{0}' was unable to provide a security token.
cs: Poskytovatel tokenu {0} nemohl poskytnout token zabezpečení.
de: Der Tokenanbieter "{0}" konnte kein Sicherheitstoken bereitstellen.
es: El proveedor de token "{0}" no pudo proporcionar un token de seguridad.
fr: Le fournisseur de jetons '{0}' n'a pas pu fournir de jeton de sécurité.
it: Il provider di token '{0}' non è riuscito a fornire un token di sicurezza.
ja: トークン プロバイダー '{0}' はセキュリティ トークンを提供できませんでした。
ko: 토큰 공급자 '{0}'에서 보안 토큰을 제공하지 못했습니다.
pl: Dostawca tokenu „{0}” nie mógł zapewnić tokenu zabezpieczającego.
pt_br: O provedor de token '{0}' não pôde fornecer um token de segurança.
ru: Поставщику маркеров "{0}" не удалось предоставить маркер безопасности.
tr: '{0}' belirteç sağlayıcısı bir güvenlik belirteci sağlayamadı.
zh_hans: 令牌提供程序“{0}”无法提供安全令牌。
zh_hant: 權杖提供者 '{0}' 無法提供安全性權杖。

source: UseKeys are not supported
cs: UseKeys se nepodporují.
de: UseKeys werden nicht unterstützt.
es: No se admiten UseKeys
fr: Les Userkeys ne sont pas pris en charge.
it: Le chiavi di utilizzo non sono supportate
ja: UseKeys はサポートされていません
ko: UseKeys는 지원되지 않습니다
pl: Klucze UseKey nie są obsługiwane
pt_br: Não há suporte para UseKeys
ru: UseKeys не поддерживаются
tr: UseKeys desteklenmiyor.
zh_hans: 不支持 UseKey
zh_hant: 不支援 UseKeys。

# ValueMustBePositive
source: The value of this argument must be positive.
cs: Hodnota tohoto argumentu musí být kladná.
de: Der Wert dieses Arguments muss positiv sein.
es: El valor de este argumento debe ser positivo.
fr: La valeur de cet argument doit être positive.
it: Il valore di questo argomento deve essere positivo.
ja: この引数の値は、正の値である必要があります。
pl: Wartość tego argumentu musi być dodatnia.
pt_br: O valor deste argumento deve ser positivo.
ru: Значение этого аргумента должно быть положительным.
tr: Bu bağımsız değişkenin değeri pozitif olmalıdır.
zh_hans: 此参数的值必须为正。
zh_hant: 此引數值必須是正數。

# WsTrustVersionNotSupported
source: The WsTrust wersion '{0}' is not supported.
cs: '{0}' WsTrust verze není podporována.
de: Die WsTrust-Wersion "{0}" wird nicht unterstützt.
es: No se admite la versión WsTrust "{0}".
fr: Le '{0}' WsTrust Wersion n’est pas pris en charge.
it: La versione di WsTrust '{0}' non è supportata.
ja: WsTrust wersion '{0}' はサポートされていません。
ko: WsTrust 버전 '{0}'은(는) 지원되지 않습니다.
pl: Wersja The WsTrust version „{0}” nie jest obsługiwana.
pt_br: Não há suporte para a versão '{0}' WsTrust.
ru: Версия WsTrust "{0}" не поддерживается.
tr: WsTrust sürümü '{0}' desteklenmiyor.
zh_hans: 不支持 WsTrust wersion“{0}”。
zh_hant: 不支援 WsTrust wersion '{0}'。
