Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/Shared/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ErrorDepenencySpecFormat
source: Project dependency specification not formatted correctly: '{0}'.
cs: Specifikace závislostí projektu není správně naformátovaná: {0}
de: Projektabhängigkeitsspezifikation nicht ordnungsgemäß formatiert: "{0}".
es: La especificación de dependencia del proyecto no tiene el formato correcto: "{0}".
fr: Format incorrect de la spécification de dépendance de projet : '{0}'.
it: La specifica delle dipendenze del progetto non è formattata correttamente: '{0}'.
ja: プロジェクトの依存関係の仕様の形式が正しくありません: '{0}'。
ko: 프로젝트 종속성 사양의 형식이 올바르지 않습니다. '{0}'.
pl: Specyfikacja zależności projektu nie jest poprawnie sformatowana: „{0}”.
pt_br: A especificação de dependência do projeto não está formatada corretamente: '{0}'.
ru: Неправильный формат спецификации зависимостей проекта: "{0}".
tr: Proje bağımlılığı belirtimi düzgün biçimlendirilmemiş: '{0}'.
zh_hans: 项目依赖项规范的格式不正确: {0}。
zh_hant: 專案相依性規格的格式不正確: '{0}'。

# ErrorDeserializingOptionsFromJsonFormat
source: One or more errors where found while deserializing options:{0}
cs: Při deserializaci možností se našla nejméně jedna chyba: {0}
de: Mindestens ein Fehler beim Deserialisieren von Optionen: {0}
es: Se encontraron uno o varios errores al deserializar las opciones: {0}
fr: Une ou plusieurs erreurs ont été trouvées durant la désérialisation des options : {0}
it: Sono stati trovati uno o più errori durante la deserializzazione delle opzioni: {0}
ja: オプションの逆シリアル化中に 1 つ以上のエラーが見つかりました: {0}
ko: 옵션을 역직렬화하는 동안 하나 이상의 오류 발생: {0}
pl: Znaleziono co najmniej jeden błąd podczas deserializacji opcji: {0}
pt_br: Um ou mais erros encontrados ao desserializar opções:{0}
ru: При десериализации параметров обнаружены одна или несколько ошибок: {0}
tr: Seçenekler seri durumdan çıkarılırken en az bir hata bulundu:{0}
zh_hans: 反序列化选项时发现一个或多个错误: {0}
zh_hant: 將選項還原序列化時發現一或多個錯誤: {0}

# ErrorFullPathNotAProjectFilePathFormat
source: The specified path does not refer to a project file: '{0}.
cs: Zadaná cesta neodkazuje na soubor projektu: {0}.
de: Der angegebene Pfad verweist nicht auf eine Projektdatei: "{0}".
es: La ruta de acceso especificada no hace referencia a un archivo de proyecto: "{0}".
fr: Le chemin spécifié ne fait pas référence à un fichier projet : '{0}'.
it: Il percorso specificato non fa riferimento a un file di progetto: '{0}'.
ja: 指定されたパスはプロジェクト ファイルを参照していません: '{0}'。
ko: 지정된 경로가 프로젝트 파일 '{0}'을(를) 참조하지 않습니다.
pl: Określona ścieżka nie odwołuje się do pliku projektu: „{0}”.
pt_br: O caminho especificado não se refere a um arquivo de projeto: '{0}.
ru: Указанный путь не содержит ссылку на файл проекта: "{0}.
tr: Belirtilen yol bir proje dosyasına başvurmuyor: '{0}.
zh_hans: 指定路径不引用项目文件:“{0}”。
zh_hant: 指定的路徑未參考專案檔: '{0}'。

# ErrorInvalidDependencyValue
source: The specified parameter value '{0}' is not valid. Parameter name: '{1}'.
cs: Zadaná hodnota parametru {0} není platná. Název parametru: {1}
de: Der angegebene Parameterwert "{0}" ist ungültig. Parametername: "{1}".
es: El valor del parámetro "{0}" especificado no es válido. Nombre del parámetro: "{1}".
fr: La valeur de paramètre spécifiée '{0}' est non valide. Nom de paramètre : '{1}'.
it: Il valore di parametro specificato '{0}' non è valido. Nome del parametro: '{1}'.
ja: 指定されたパラメーター値 '{0}' は無効です。パラメーター名: '{1}'。
ko: 지정된 매개 변수 값 '{0}'이(가) 잘못되었습니다. 매개 변수 이름은 '{1}'입니다.
pl: Wybrana wartość parametru „{0}” jest nieprawidłowa. Nazwa parametru: „{1}”.
pt_br: O valor do parâmetro '{0}' especificado não é válido. Nome do parâmetro: '{1}'.
ru: Указанное значение параметра "{0}" является недопустимым. Имя параметра: "{1}".
tr: Belirtilen parametre değeri '{0}' geçerli değil. Parametre adı: '{1}'.
zh_hans: 指定的参数值“{0}”无效。参数名称:“{1}”。
zh_hant: 指定的參數值 '{0}' 無效。參數名稱: '{1}'。

# ErrorInvalidKeyOrValueNotFoundFormat
source: The specifed key '{0}' is not valid for the option '{1}'.
cs: Zadaný klíč {0} není pro možnost {1} platný.
de: Der angegebene Schlüssel "{0}" ist für die Option "{1}" ungültig.
es: La clave "{0}" especificada no es válida para la opción "{1}".
fr: La clé spécifiée '{0}' est non valide pour l'option '{1}'.
it: La chiave specificata '{0}' non è valida per l'opzione '{1}'.
ja: 指定されたキー '{0}' はオプション '{1}' に対して無効です。
ko: 지정된 키 '{0}'이(가) '{1}' 옵션에 대해 유효하지 않습니다.
pl: Wybrany klucz „{0}” jest nieprawidłowy w przypadku opcji „{1}”.
pt_br: A chave especificada '{0}' não é válida para a opção '{1}'.
ru: Указанный ключ "{0}" является недопустимым для параметра "{1}".
tr: Belirtilen '{0}' anahtarı, '{1}' seçeneği için geçerli değil.
zh_hans: 指定的密钥“{0}”对于选项“{1}”无效。
zh_hant: 指定的索引鍵 '{0}' 對選項 '{1}' 無效。

# ErrorInvalidOptionValueFormat
source: The value '{0}' specified for the option '{1}' is not valid.
cs: Hodnota {0} zadaná pro možnost {1} není platná.
de: Der für die Option "{0}" angegebene Wert "{1}" ist ungültig.
es: El valor "{0}" especificado para la opción "{1}" no es válido.
fr: La valeur '{0}' spécifiée pour l'option '{1}' est non valide.
it: Il valore '{0}' specificato per l'opzione '{1}' non è valido.
ja: オプション '{1}' に指定された値 '{0}' は無効です。
ko: '{1}' 옵션에 대해 지정된 값 '{0}'이(가) 잘못되었습니다.
pl: Wartość „{0}” określona dla opcji „{1}” jest nieprawidłowa.
pt_br: O valor '{0}' especificado para a opção '{1}' não é válido.
ru: Значение "{0}" параметра "{1}" является недопустимым.
tr: '{1}' seçeneği için belirtilen '{0}' değeri geçerli değil.
zh_hans: 为选项“{1}”指定的值“{0}”无效。
zh_hant: 為選項 '{1}' 指定的值 '{0}' 無效。

# ErrorInvalidProjectFormat
source: The project format is incorrect.
cs: Formát projektu není správný.
de: Das Projektformat ist falsch.
es: El formato del proyecto no es correcto.
fr: Le format du projet est incorrect.
it: Il formato del progetto non è corretto.
ja: プロジェクトの形式が正しくありません。
ko: 프로젝트 형식이 잘못되었습니다.
pl: Format projektu jest niepoprawny.
pt_br: O formato do projeto está incorreto.
ru: Формат проекта неверен.
tr: Proje biçimi yanlış.
zh_hans: 项目格式不正确。
zh_hant: 專案格式不正確。

# ErrorItemNotFoundInCollectionFormat
source: The option '{0}' doesn't have an item with the key '{1}'.
cs: Možnost {0} nemá položku s klíčem {1}.
de: Die Option "{0}" verfügt nicht über ein Element mit dem Schlüssel "{1}".
es: La opción "{0}" no tiene ningún elemento con la clave "{1}".
fr: L'option '{0}' n'a aucun élément ayant la clé '{1}'.
it: L'opzione '{0}' non contiene alcun elemento la cui chiave è '{1}'.
ja: オプション '{0}' にはキー '{1}' の項目はありません。
ko: '{0}' 옵션에 '{1}' 키가 포함된 항목이 없습니다.
pl: Opcja „{0}” nie ma elementu z kluczem „{1}”.
pt_br: A opção '{0}' não tem um item com a chave '{1}'.
ru: Параметр "{0}" не содержит элемента с ключом "{1}".
tr: '{0}' seçeneğinin '{1}' anahtarına sahip bir öğesi yok.
zh_hans: 选项“{0}”不具有含密钥“{1}”的项。
zh_hant: 選項 '{0}' 沒有索引鍵為 '{1}' 的項目。

# ErrorNotSupportedTargetFrameworkFormat
source: The target framework '{0}' is not a supported .NET Core, .NET Standard, or a .NET Framework version. The minimum supported framework versions are as follows: netcoreapp{1}, netstandard{2} and net{3}.
cs: Cílová architektura {0} není podporovanou verzí rozhraní .NET Core, .NET Standard nebo .NET Framework. Minimální podporované verze architektury jsou tyto: netcoreapp{1}, netstandard{2} a net{3}.
de: Das Zielframework "{0}" ist keine unterstützte .NET Core-, .NET Standard- oder .NET Framework-Version. Folgende Mindestversionen für das Framework werden unterstützt: netcoreapp{1}, netstandard{2} und net{3}.
es: La plataforma de destino "{0}" no tiene una versión admitida de .NET Core, .NET Standard o .NET Framework. Las versiones mínimas admitidas de estas plataformas son: netcoreapp{1}, netstandard{2} y net{3}.
fr: Le framework cible '{0}' n'est pas une version prise en charge du .NET Core, du .NET Standard ou du .NET Framework. Les versions de framework minimales prises en charge sont les suivantes : netcoreapp{1}, netstandard{2} et net{3}.
it: Il framework di destinazione '{0}' non è una versione supportata di .NET Core, .NET Standard o .NET Framework. Le versioni minime supportate del framework sono: netcoreapp{1}, netstandard{2} e net{3}.
ja: ターゲット フレームワーク '{0}' はサポートされているバージョンの .NET Core、.NET Standard、.NET Framework ではありません。サポートされている最小のフレームワーク バージョンは、netcoreapp{1}、netstandard{2}、net{3} です。
ko: 대상 프레임워크 '{0}'이(가) 지원되는 .NET Core, .NET Standard 또는 .NET Framework 버전이 아닙니다. 지원되는 최소 프레임워크 버전은 netcoreapp{1}, netstandard{2} 및 net{3}입니다.
pl: Platforma docelowa „{0}” nie jest obsługiwaną wersją programu .NET Core ani platformy .NET Standard bądź .NET Framework. Obsługiwane są następujące minimalne wersje platformy: netcoreapp{1}, netstandard{2} i net{3}.
pt_br: A estrutura de destino '{0}' não é uma versão compatível do .NET Core, do .NET Standard ou do .NET Framework. As versões de estrutura mínimas compatíveis são as seguintes: netcoreapp{1}, netstandard{2} e net{3}.
ru: Целевая платформа "{0}" не является поддерживаемой версией .NET Core, .NET Standard или .NET Framework. Поддерживаются следующие минимальные версии платформ: netcoreapp{1}, netstandard{2} и net{3}.
tr: '{0}' hedef çerçevesi, desteklenen bir .NET Core, .NET Standard veya .NET Framework sürümü değil. Desteklenen en düşük çerçeve sürümleri şunlardır: netcoreapp{1}, netstandard{2} ve net{3}.
zh_hans: 目标框架“{0}”不是受支持的 .Net Core、.NET Standard 或 .Net Framework 版本。受支持的最低框架版本如下: netcoreapp{1}、netstandard{2} 和 net{3}。
zh_hant: 目標 Framework '{0}' 不是支援的 .NET Core、.NET Standard 或 .NET Framework 版本。支援的最低 Framework 版本如下: netcoreapp{1}、netstandard{2} 和 net{3}。

# ErrorOnInvalidEnumSupportedValuesFormat
source: The valid values are: {0}.
cs: Platné hodnoty jsou tyto: {0}
de: Gültige Werte sind: {0}.
es: Los valores válidos son: {0}.
fr: Les valeurs valides sont : {0}.
it: I valori validi sono: {0}.
ja: 有効な値は {0} です。
ko: 유효한 값은 {0}입니다.
pl: Prawidłowe wartości to: {0}.
pt_br: Os valores válidos são: {0}.
ru: Допустимые значения: {0}.
tr: Geçerli değerler şunlardır: {0}.
zh_hans: 有效值为: {0}。
zh_hant: 有效值為: {0}。

# ErrorOptionAlreadyDeserializedFormat
source: The option '{0}' has already been deserialized.
cs: Možnost {0} se už deserializovala.
de: Die Option "{0}" wurde bereits deserialisiert.
es: La opción "{0}" ya se ha deserializado.
fr: L'option '{0}' a déjà été désérialisée.
it: L'opzione '{0}' è già stata deserializzata.
ja: オプション '{0}' は既に逆シリアル化されています。
ko: '{0}' 옵션이 이미 역직렬화되었습니다.
pl: Opcja „{0}” została już zdeserializowana.
pt_br: A opção '{0}' já foi desserializada.
ru: Параметр "{0}" уже десериализован.
tr: '{0}' seçeneği zaten seri durumdan çıkarıldı.
zh_hans: 选项“{0}”已被反序列化。
zh_hant: 選項 '{0}' 已還原序列化。

# ErrorOptionAlreadyRegisteredFormat
source: The specified option '{0}' was already registered.
cs: Zadaná možnost {0} je už zaregistrovaná.
de: Die angegebene Option "{0}" wurde bereits registriert.
es: La opción "{0}" especificada ya estaba registrada.
fr: L'option spécifiée '{0}' a déjà été inscrite.
it: L'opzione specificata '{0}' è già stata registrata.
ja: 指定されたオプション '{0}' は既に登録されています。
ko: 지정된 옵션 '{0}'이(가) 이미 등록되었습니다.
pl: Wybrana opcja „{0}” została już zarejestrowana.
pt_br: A opção especificada '{0}' já foi registrada.
ru: Указанный параметр "{0}" уже зарегистрирован.
tr: Belirtilen '{0}' seçeneği zaten kayıtlı.
zh_hans: 已注册指定的选项“{0}”。
zh_hant: 指定的選項 '{0}' 已經註冊。

# ErrorOptionDuplicateValueFormat
source: The option '{0}' already contains the value '{1}'.
cs: Možnost {0} už obsahuje hodnotu {1}.
de: Die Option "{0}" enthält bereits den Wert "{1}".
es: La opción "{0}" ya contiene el valor "{1}".
fr: L'option '{0}' contient déjà la valeur '{1}'.
it: L'opzione '{0}' contiene già il valore '{1}'.
ja: オプション '{0}' には値 '{1}' が既に含まれています。
ko: '{0}' 옵션에 '{1}' 값이 이미 포함되어 있습니다.
pl: Opcja „{0}” już zawiera wartość „{1}”.
pt_br: A opção '{0}' já contém o valor '{1}'.
ru: Параметр "{0}" уже содержит значение "{1}".
tr: '{0}' seçeneği zaten '{1}' değerini içeriyor.
zh_hans: 选项“{0}”已包含值“{1}”。
zh_hant: 選項 '{0}' 已經包含值 '{1}'。

# ErrorProjectFileAlreadyExistsFormat
source: The specified project file '{0}' already exists.
cs: Zadaný soubor projektu {0} už existuje.
de: Die angegebene Projektdatei "{0}" ist bereits vorhanden.
es: El archivo del proyecto "{0}" especificado ya existe.
fr: Le fichier projet spécifié '{0}' existe déjà.
it: Il file di progetto specificato '{0}' esiste già.
ja: 指定されたプロジェクト ファイル '{0}' は既に存在します。
ko: 지정한 프로젝트 파일 '{0}'이(가) 이미 있습니다.
pl: Określony plik projektu „{0}” już istnieje.
pt_br: O arquivo de projeto especificado '{0}' já existe.
ru: Указанный файл проекта "{0}" уже существует.
tr: Belirtilen '{0}' proje dosyası zaten var.
zh_hans: 指定的项目文件“{0}”已存在。
zh_hant: 指定的專案檔 '{0}' 已存在。

# ErrorProjectReferenceMissingFilePathFormat
source: The project reference specification '{0}' does not have a file path.
cs: Specifikace odkazu na projekt {0} neobsahuje cestu k souboru.
de: Die Projektverweisspezifikation "{0}" enthält keinen Dateipfad.
es: La especificación de referencia de proyecto "{0}" no tiene una ruta de acceso de archivo.
fr: La spécification de référence de projet '{0}' n'a aucun chemin de fichier.
it: Nella specifica '{0}' del riferimento al progetto non è presente alcun percorso file.
ja: プロジェクト参照の指定 '{0}' にファイル パスがありません。
ko: 프로젝트 참조 사양 '{0}'에 파일 경로가 없습니다.
pl: Specyfikacja odwołania do projektu „{0}” nie zawiera ścieżki do pliku.
pt_br: A especificação de referência do projeto '{0}' não tem nenhum caminho de arquivo.
ru: Спецификация ссылки на проект "{0}" не содержит путь к файлу.
tr: '{0}' proje başvurusu belirtiminin bir dosya yolu yok.
zh_hans: 项目引用规范“{0}”没有文件路径。
zh_hant: 專案參考規格 '{0}' 沒有檔案路徑。

# ErrorTypeNotSupportedbyOptionFormat
source: The type '{0}' is not supported by the '{1}' option.
cs: Možnost {1} nepodporuje typ {0}.
de: Der Typ "{0}" wird durch die Option "{1}" nicht unterstützt.
es: La opción "{1}" no admite el tipo "{0}".
fr: Le type '{0}' n'est pas pris en charge par l'option '{1}'.
it: L'opzione '{1}' non supporta il tipo '{0}'.
ja: オプション '{1}' で型 '{0}' はサポートされていません。
ko: 형식 '{0}'은(는) '{1}' 옵션에서 지원하지 않습니다.
pl: Typ „{0}” nie jest obsługiwany przez opcję „{1}”.
pt_br: O tipo '{0}' não é compatível com a opção '{1}'.
ru: Тип "{0}" не поддерживается параметром "{1}".
tr: '{0}' türü '{1}' seçeneği tarafından desteklenmiyor.
zh_hans: “{1}”选项不支持类型“{0}”。
zh_hant: '{1}' 選項不支援類型 '{0}'。

source: Resolving project references ...
cs: Překládají se odkazy projektu...
de: Projektverweise werden aufgelöst...
es: Resolviendo las referencias del proyecto...
fr: Résolution des références de projet...
it: Risoluzione dei riferimenti al progetto...
ja: プロジェクト参照を解決しています...
ko: 프로젝트 참조를 확인하는 중...
pl: Rozpoznawanie odwołań projektu...
pt_br: Resolvendo as referências do projeto...
ru: Разрешение ссылок проекта…
tr: Proje başvuruları çözümleniyor...
zh_hans: 正在解析项目引用...
zh_hant: 正在解析專案參考...

# WarningCannotResolveProjectReferences
source: The project configuration doesn't seem to be in a valid state. Please ensure the project can be built so project references can be resolved.
cs: Vypadá to, že konfigurace projektu není v platném stavu. Aby se odkazy projektu daly přeložit, ujistěte se prosím, že se projekt dá sestavit.
de: Die Projektkonfiguration befindet sich offenbar in einem ungültigen Zustand. Stellen Sie sicher, dass das Projekt erstellt werden kann, sodass Projektverweise aufgelöst werden können.
es: La configuración del proyecto no parece tener un estado válido. Asegúrese de que el proyecto puede compilarse para poder resolver las referencias del proyecto.
fr: La configuration du projet ne semble pas être dans un état valide. Vérifiez que vous pouvez générer le projet pour permettre la résolution des références de projet.
it: La configurazione del progetto non sembra essere in uno stato valido. Assicurarsi che sia possibile compilare il progetto in modo da risolvere i riferimenti al progetto.
ja: プロジェクト構成が有効な状態ではない可能性があります。プロジェクトをビルドでき、プロジェクト参照を解決できることをご確認ください。
ko: 프로젝트 구성이 유효한 상태가 아닌 것 같습니다. 프로젝트 참조를 확인할 수 있도록 프로젝트를 빌드할 수 있는지 확인하세요.
pl: Konfiguracja projektu prawdopodobnie nie jest w prawidłowym stanie. Upewnij się, że projekt można skompilować, aby można było rozpoznać odwołania do projektu.
pt_br: A configuração do projeto não parece estar em um estado válido. Verifique se o projeto pode ser compilado para que as referências de projeto possam ser resolvidas.
ru: Конфигурация проекта находится в недопустимом состоянии. Убедитесь, что вы можете выполнить сборку проекта, чтобы разрешить ссылки проекта.
tr: Proje yapılandırması geçerli bir durumda değil gibi görünüyor. Proje başvurularının çözümlenebilmesi için projenin derlenebilir olduğundan emin olun.
zh_hans: 项目配置似乎不处于有效状态。请确保可以生成项目，以便可以解析项目引用。
zh_hant: 專案組態似乎不在有效狀態。請確認專案可建置以解析專案參考。

# WarningMultiFxOrNoSupportedDnxVersion
source: The project specifies multiple target frameworks or does not target a supported .NET Core or .NET Standard version.
cs: Projekt určuje více cílových architektur nebo nemá za cíl podporovanou verzi rozhraní .NET Core nebo .NET Standard.
de: Im Projekt wird mehr als ein Zielframework oder eine nicht unterstützte .NET Core- oder .NET Standard-Zielversion angegeben.
es: El proyecto indica varias plataformas de destino o no tiene especificada una versión admitida de .NET Core o .NET Standard como destino.
fr: Le projet spécifie plusieurs frameworks cibles ou ne cible pas une version prise en charge du .NET Core ou du .NET Standard.
it: Il progetto specifica più framework di destinazione oppure non è destinato a una versione supportata di .NET Core o .NET Standard.
ja: 複数のターゲット フレームワークがプロジェクトに指定されているか、サポートされているバージョンの .NET Core や .NET Standard がターゲットとして指定されていません。
ko: 프로젝트가 여러 대상 프레임워크를 지정하거나, 지원되는 .NET Core 또는 .NET Standard 버전을 대상으로 하지 않습니다.
pl: Projekt określa wiele platform docelowych lub nie jest skierowany do obsługiwanej wersji platformy .NET Core lub .NET Standard.
pt_br: O projeto especifica várias estruturas de destino ou não é direcionado a uma versão compatível do .NET Core ou do .NET Standard.
ru: В проекте указано несколько целевых платформ либо не указана поддерживаемая целевая платформа .NET Core или .NET Standard.
tr: Proje birden çok hedef çerçeve belirtiyor veya desteklenen bir .NET Core ya da .NET Standard sürümünü hedeflemiyor.
zh_hans: 项目指定多个目标框架，或不以支持的 .NET Core 或 .NET Standard 版本为目标。
zh_hant: 專案指定多個目標 Framework，或沒有將支援的 .NET Core 或 .NET Standard 版本作為目標。

# WarningUnrecognizedOptionFormat
source: The specified option '{0}' is not recognized.
cs: Zadaná možnost {0} se nerozpoznala.
de: Die angegebene Option "{0}" wird nicht erkannt.
es: La opción "{0}" especificada no se reconoce.
fr: L'option spécifiée '{0}' n'est pas reconnue.
it: L'opzione specificata '{0}' non è riconosciuta.
ja: 指定されたオプション '{0}' は認識されていません。
ko: 지정된 옵션 '{0}'을(를) 인식할 수 없습니다.
pl: Wybrana opcja „{0}” nie została rozpoznana.
pt_br: A opção especificada '{0}' não é reconhecida.
ru: Указанный параметр "{0}" не распознан.
tr: Belirtilen '{0}' seçeneği tanınmıyor.
zh_hans: 无法识别指定的选项“{0}”。
zh_hant: 無法辨識指定的選項 '{0}'。
