Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/xlf/*.*.xlf
Languages: sr

# HelpNamespaceFormat
source: A mapping from a WSDL or XML Schema targetNamespace to a CLR namespace. Using the '*' for the targetNamespace maps all targetNamespaces without an explicit mapping to that CLR namespace. Default: derived from the target namespace of the schema document for Data Contracts. The default namespace is used for all other generated types. (Short Form: -{0})
sr: Сопоставление пространств имен targetNamespace из схем WSDL или XML и пространств имен CLR. С помощью параметра "*" с целевым пространством имен targetNamespace сопоставляются все целевые пространства имен targetNamespace без явного сопоставления с пространством имен CLR. По умолчанию: получается из пространства имен документа схемы для контрактов данных. Для всех остальных созданных типов используется пространство имен по умолчанию. (Краткая форма: /{0})

# HelpNoTypeReuseFormat
source: Disable reusing types from project refereces. References provided with the --{1} option will only be considered for resolving collection types specified with the --{2} option. (Short Form: -{0})
sr: Отключите повторное использование типов в ссылках проекта. Ссылки, указанные в параметре --{1}, могут использоваться только для разрешения типов коллекций, указанных в параметре --{2}. (Краткая форма: -{0})

# HelpNologoFormat
source: Suppress the copyright and banner message. (Short Form: -{0})
sr: Не выводить сообщение-баннер и авторские права. (Краткая форма: -{0})

# HelpNostdlibFormat
source: Do not reference standard libraries. By default System.Runtime (mscorlib) and System.ServiceModel (WCF) libraries are referenced. (Short Form: -{0})
sr: Не ссылаться на стандартные библиотеки. По умолчанию используются ссылки на библиотеки System.Runtime (mscorlib) и System.ServiceModel (WCF). (Краткая форма: -{0})

# HelpOptions
source: Options:
sr: Параметры:

# HelpOutFormat
source: The filename for the generated code. Default: derived from the WSDL definition name, WSDL service name or targetNamespace of one of the schemas. (Short Form: -{0})
sr: Имя файла для сформированного кода. По умолчанию: получается из имени определения WSDL, имени службы WSDL или пространства имен targetNamespace одной из схем. (Краткая форма: /{0})

# HelpProjectFileFormat
source: The project file to add the client to (if any). (Short Form: -{0}).
sr: Файл проекта, в который добавляется клиент (при наличии). (Краткая форма: -{0}.)

# HelpReferenceCodeGenerationFormat
source: Package or project references to reuse types from. When generating clients, use this option to specify references in the user's project that might contain types representing the metadata being imported. The reference can be specified as a nuget package name and version or the path to a .Net Core project. (Short Form: -{0})
sr: Ссылки на пакет или проект, типы из которых используются повторно. При создании клиентов используйте этот параметр, чтобы указать в проекте пользователя ссылки, которые могут содержать типы, представляющие импортируемые метаданные. Ссылка может быть указана в виде имени и версии пакета NuGet или пути к проекту .Net Core. (Краткая форма: -{0})

# HelpRuntimeIdentifierFormat
source: The runtime identifier used for building reference projects (if any). (Short Form: -{0})
sr: Идентификатор среды выполнения, используемый для сборки ссылочных проектов (при наличии). (Краткая форма: -{0}.)

# HelpServiceContractFormat
source: Generate code for Service Contracts. Client class will not be generated. (Short Form: -{0})
sr: Создание кода для контрактов на предоставление услуг. Класс клиента не будет создан. (Короткая форма: -{0})

# HelpSyncFormat
source: Generate synchronous methods for operations in addition to async. (Short Form: -{0})
sr: Создавать синхронные методы для операций в дополнение к асинхронным. (Краткая форма: -{0})

# HelpTargetFrameworkFormat
source: The target framework used for building reference projects. (Short Form: -{0}).
sr: Целевая платформа, используемая для сборки ссылочных проектов. (Краткая форма: /{0})

# HelpUpdateWebServiceReferenceFormat
source: Updates an existing web service reference. If the project contains more than one web service reference, the name of the web service reference to be updated is required. (Short Form: -{0})
sr: Обновляет существующую ссылку на веб-службу. Если проект содержит несколько ссылок на веб-службы, необходимо указать имя обновляемой ссылки на веб-службу. (Краткая форма: -{0})

# HelpUsage1
source: USE:
sr: Использовать:

# HelpUsage2
source: - Generate web service proxy code from running services or static metadata documents.
sr: — формирование кода веб-службы на основе выполняемых служб или статических документов метаданных.

# HelpUsageCategory
source: -= USAGE =-
sr: -= Использование =-

# HelpVerbosityFormat
source: Determines the amount of information displayed by the tool. Valid values are '{0}'. (Short Form: -{1})
sr: Определяет объем сведений, отображаемых средством. Допустимые значения: "{0}". (Краткая форма: -{1})

# HelpWrappedFormat
source: Generated code will not unwrap "parameters" member of document-wrapped-literal messages. (Short Form: -{0})
sr: Созданный код не будет переносить элемент "parameters" в сообщениях формата document-wrapped-literal. (Краткая форма: -{0})

# HelpXmlSerializer
source: Generate data types that use the XmlSerializer for serialization and deserialization
sr: Формирование типов данных, использующих сериализатор XmlSerializer для сериализации и десериализации

# LogoFormat
source: Microsoft (R) WCF Service Model Proxy Generation Tool for .Net Core platform [{0}, Version {1}] {2}
sr: Средство формирования прокси модели службы Microsoft® WCF для платформы .Net Core [{0}, версия {1}] {2}

# Microsoft_Copyright_CommandLine_Logo
source: Copyright (c) Microsoft Corporation. All rights reserved.
sr: (с) Корпорация Майкрософт. Все права защищены.

# MoreHelpFormat
source: If you would like more help, type "dotnet-svcutil -{0}"
sr: Для получения дополнительных сведений введите "dotnet-svcutil -{0}".

# NoCodeWasGenerated
source: No code was generated. If you were trying to generate a client, this could be because the metadata documents did not contain any valid contracts or services, or because all contracts/services were discovered to exist in --reference assemblies. Verify that you passed all the metadata documents to the tool.
sr: Код не создан. Если вы пытались создать код клиента, это может быть вызвано тем, что документы метаданных не содержат допустимых контрактов или служб или все контракты и службы были обнаружены в сборках, указанных параметром --reference. Убедитесь, что все документы метаданных были переданы в инструмент.

# NotClientBaseType
source: Type does not inherit from ClientBase<T>
sr: Тип не наследует от ClientBase<T>

# ParametersCollectionType
source: <type>
sr: <тип>

# ParametersExcludeType
source: <type>
sr: <тип>

# ParametersProjectFile
source: <project file>
sr: <файл проекта>

# ParametersReference
source: <package>
sr: <пакет>

# ParametersRuntimeIdentifier
source: <runtime identifier>
sr: <идентификатор среды выполнения>

# ParametersTargetFramework
source: <framework>
sr: <платформа>

# ParametersVerbosity
source: <verbosity level>
sr: <уровень детализации>

# ParametersWebServiceReferenceName
source: <web service reference>
sr: <ссылка на веб-службу>

# PasswordPrompt
source: Enter password (ESC to cancel):
sr: Введите пароль (нажмите клавишу ESC для отмены):

# ReadingMetadataMessageFormat
source: Attempting to load metadata from '{0}'.
sr: Выполняется попытка загрузить метаданные из "{0}".

# RequestReplyCallbackContractNotSupported
source: Request/Reply callback contracts are not supported for .Net Core apps.
sr: Контракты обратного вызова запроса/ответа не поддерживаются для приложений .Net Core.

# RetreivingMetadataMsgFormat
source: Attempting to download metadata from '{0}' using WS-Metadata Exchange and HttpGet.
sr: Попытка скачать метаданные из "{0}" с помощью службы обмена метаданными WS-Metadata Exchange и HttpGet.

# ServiceEndpointComment
source: The endpoint to configure
sr: Настраиваемая конечная точка

# TelemetryEnabled
source: This tool collects information about how it is used in order to improve the tool. This functionality can be disabled by setting the environment variable "DOTNET_SVCUTIL_TELEMETRY_OPTOUT" to 1.
sr: В целях улучшения работы это средство собирает сведения о способах его использования. Чтобы отключить эту функцию, задайте для переменной среды "DOTNET_SVCUTIL_TELEMETRY_OPTOUT" значение 1.

# UseProjectFileOptionOnMultipleFilesMsgFormat
source: Please use the --{0} option to specify the project to use, possible values: {1}.
sr: Укажите используемый проект в параметре --{0}. Допустимые значения: {1}.

# UsernamePrompt
source: Enter username (ESC to cancel):
sr: Введите имя пользователя (нажмите клавишу ESC для отмены):

# WarningPrefix
source: Warning:
sr: Предупреждение.

# WrnCouldNotGenerateContractOperationsFormat
source: Could not generate contract operations using the '{0}' type, attempting with the '{1}' type.
sr: Не удалось создать операции контракта с помощью типа "{0}", выполняется попытка с типом "{1}".

# WrnCouldNotLoadTypesFromReferenceAssemblyAtFormat
source: Cannot load some types in assembly '{0}', types will not be available to the tool.
sr: Невозможно загрузить некоторые типы в сборке "{0}". Типы не будут доступны для инструмента.

# WrnExtraParamsOnInputFileParamIgnoredFormat
source: An input parameters file was specified in the command line, the following parameter(s) will be ignored: {0}.
sr: Файл с входными параметрами указан в командной строке; следующие параметры будут проигнорированы: {0}.

# WrnIncompatibleEndpointFormat
source: Endpoint '{0}' at address '{1}' contains one or more bindings not compatible with .Net Core apps, skipping...
sr: Конечная точка "{0}" по адресу "{1}" содержит одну или несколько привязок, несовместимых с приложениями .Net Core. Пропуск...

# WrnSpecifiedFilePathNotUndeProjectDirFormat
source: The value specified with the --{0} option resolves to the file path '{1}' which is not under the directory of the project '{2}'. The file may not get compiled!
sr: Значение, указанное для параметра --{0}, определяет путь к файлу "{1}", который не находится в каталоге проекта "{2}". Это может привести к тому, что файл не будет скомпилирован.

# WrnTargetFrameworkNotSupported_NetNamedPipe
source: NetNamedPipe is not supported on current .net target framework.
sr: NetNamedPipe не поддерживается в текущей требуемой версии .NET Framework

# WrnUnexpectedArgumentFormat
source: The specified --{0} option is not expected in the current operational context of the tool!
sr: Указанный аргумент --{0} не ожидается в текущем операционном контексте средства.

# WrnUnexpectedInputsFormat
source: The specified input(s) {0} are not expected in the current operational context of the tool!
sr: Указанные аргументы {0} не ожидаются в текущем операционном контексте средства!

# WrnUserBasicCredentialsInClearText
source: The server needs to authenticate your request. Your credentials will be sent to the server in clear text.
sr: Серверу требуется выполнить проверку подлинности вашего запроса. Ваши учетные данные будут отправлены на сервер в виде обычного текста.

# WrnWSMExFailedFormat
source: WS-Metadata Exchange Error URI: {0}
sr: Ошибка службы обмена метаданными WS-Metadata Exchange Идентификатор URI: {0}

# WsdlOrSchemaFilesMsg
source: WSDL files
sr: WSDL-файлы
