Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/xlf/*.*.xlf
Languages: sr

# BindingBinaryMessageEncodingVersionNotSupportedFormat
source: Unsupported binary message encoding version: '{0}'. It must be '{1}'.
sr: Неподдерживаемая версия кодирования двоичного сообщения: "{0}". Должна быть "{1}".

# BindingClientCertRequirementNotSupported
source: Client certificate security requirement is not supported.
sr: Требование безопасности сертификата клиента не поддерживается.

# BindingElementTypeNotSupportedFormat
source: Unsupported binding element type: '{0}'.
sr: Неподдерживаемый тип элемента привязки: "{0}".

# BindingMessageEncodingElementNotSupportedFormat
source: Unsupported message encoding element type: '{0}'. It must be one of the following types: '{1}', '{2}.'
sr: Неподдерживаемый тип элемента кодирования сообщения: "{0}". Должен быть одним из следующих типов: "{1}", "{2}".

# BindingMessageEncodingNotSupportedFormat
source: Unsupported message encoding value: '{0}'. It must be '{1}'.
sr: Неподдерживаемое значение кодирования сообщения: "{0}". Должно быть "{1}".

# BindingMtomMessageEncodingVersionNotSupportedFormat
source: Unsupported MTOM message encoding version: '{0}'. It must be '{1}' or '{2}' or '{3}' or '{4}'.
sr: Неподдерживаемая версия кодирования текстовых сообщений MTOM: "{0}". Должна быть "{1}", "{2}", "{3}" или "{4}".

# BindingReliableSessionNotSupported
source: Reliable session is not supported.
sr: Надежный сеанс не поддерживается.

# BindingTextMessageEncodingVersionNotSupportedFormat
source: Unsupported text message encoding version: '{0}'. It must be '{1}' or '{2}' or '{3}' or '{4}' or '{5}'.
sr: Неподдерживаемая версия кодирования текстового сообщения: "{0}". Должна быть "{1}", "{2}", "{3}", "{4}" или "{5}".

# BindingTransactionFlowNotSupported
source: Transaction flow is not supported.
sr: Поток транзакций не поддерживается.

# BindingTransportDetectReplaysNotSupported
source: Transport Security with DetectReplays enabled is not supported.
sr: Защита транспорта с включенным DetectReplays не поддерживается.

# BindingTransportMessageSecurityVersionNotSupportedFormat
source: Transport message security version value is not supported: '{0}'. It must be one of the following values: {1}.
sr: Значение версии безопасности сообщения транспорта не поддерживается: "{0}". Должно быть одним из следующих значений: {1}.

# BindingTransportSecurityDefaultAlgorithmSuiteNotSupportedFormat
source: Transport default security algorithm suite is not supported: '{0}'. It must be '{1}'.
sr: Набор алгоритмов безопасности по умолчанию транспорта не поддерживается: "{0}". Должен быть "{1}".

# BindingTransportSecurityElementTypeNotSupportedFormat
source: Transport security element type not supported: '{0}'. It must be '{1}'.
sr: Тип элемента защиты транспорта не поддерживается: "{0}". Должен быть "{1}".

# BindingTransportSecurityHeaderLayoutValueNotSupportedFormat
source: Transport security header layout value is not supported: '{0}'. It must be '{1}'.
sr: Значение формата заголовка безопасности транспорта не поддерживается: "{0}". Должно быть "{1}".

# BindingTransportSecurityMustIncludeTimestamp
source: Transport security must include timestamp.
sr: Защита транспорта должна включать метку времени.

# BindingTransportSecurityTokenEndorsingParamsTypeFormat
source: Unsupported transport security token endorsing parameters type: '{0}'. It must be '{1}'.
sr: Неподдерживаемый тип параметров маркера безопасности транспорта: "{0}". Должен быть "{1}".

# BindingTransportSecurityTokenMustBeOneOfEitherEndorsingOrSignedEncrypted
source: Transport security token must have one and only one type of parameters and it must be either 'Endorsing' or 'SignedEncrypted'.
sr: Маркер безопасности транспорта должен иметь строго один из поддерживаемых типов параметров: Endorsing или SignedEncrypted.

# BindingTransportSecurityTokenParamsInclusionModeValueNotSupportedFormat
source: Transport security token parameters inclusion mode value is not supported: '{0}'. It must be '{1}'.
sr: Значение режима включения параметров маркера безопасности транспорта не поддерживается: "{0}". Должно быть "{1}".

# BindingTransportSecurityTokenParamsReferenceStyleNotSupportedFormat
source: Transport security token parameters reference style is not supported: '{0}'. It must be '{1}'.
sr: Стиль ссылок на параметры маркера безопасности транспорта не поддерживается: "{0}". Должен быть "{1}".

# BindingTransportSecurityTokenParamsRequiringDerivedKeysNotSupported
source: Security token parameters requiring derived keys is not supported.
sr: Параметры маркера безопасности, требующие производных ключей, не поддерживаются.

# BindingTransportSecurityTokenParamsTypeNotSupportedFormat
source: Security token parameters type is not supported: '{0}'. It must be '{1}'.
sr: Тип параметров маркера безопасности не поддерживается: "{0}". Должен быть "{1}".

# BindingTransportSecurityTokenSignedOrSignedEndorsingNotSupported
source: Transport security token with signed or signed and endorsing paramaters is not supported.
sr: Маркер безопасности транспорта с подписанными или подписанными и подтверждающими параметрами не поддерживается.

# BindingTransportTypeNotSupportedFormat
source: Unsupported transport type: '{0}'. It must be one of the following types: '{1}', '{2}', '{3}'.
sr: Неподдерживаемый тип транспорта: "{0}". Должен быть одним из следующих типов: "{1}", "{2}", "{3}".

# BindingTypeNotSupportedFormat
source: Unsupported binding type: '{0}'. It must be one of the following types: '{1}', '{2}', '{3}', '{4}' or '{5}'.
sr: Неподдерживаемый тип привязки: "{0}". Должен быть одним из следующих типов: "{1}", "{2}", "{3}", "{4}" или "{5}".

# CertificateIndexPrompt
source: Please enter the index of the certificate to use or ESC to cancel:
sr: Введите индекс сертификата, чтобы использовать его, или нажмите клавишу ESC для отмены:

# CertificateSelectionMessageFormat
source: The site {0} is asking for a client certificate, a list of possible valid certificates will be presented.
sr: Сайт {0} запрашивает сертификат клиента. Будет представлен список допустимых сертификатов.

# ClientCredentialsComment
source: The client credentials
sr: Учетные данные клиента.

# CodeExpressionCouldNotFindEndpoint
source: Could not find endpoint with name '{0}'.
sr: Не удалось найти конечную точку с именем "{0}".

# ConfigureEndpointCommentSummary
source: Implement this partial method to configure the service endpoint.
sr: Реализуйте этот разделяемый метод для настройки конечной точки службы.

# EnableMetadataHelpMessage
source: If this is a Windows (R) Communication Foundation service to which you have access, please check that you have enabled metadata publishing at the specified address. For help enabling metadata publishing, please refer to the MSDN documentation at http://go.microsoft.com/fwlink/?LinkId=65455.
sr: Если у вас есть доступ к службе Windows (R) Communication Foundation, убедитесь, что включена публикация метаданных по указанному адресу. Справочные сведения по включению публикации метаданных см. в документации MSDN по адресу http://go.microsoft.com/fwlink/?LinkId=65455.

# EnterOrEscapeMessage
source: Press the ENTER to accept or ESC to cancel:
sr: Нажмите клавишу ВВОД, чтобы принять, или ESC для отмены:

# EnterYesOrNoMessage
source: Invalid answer. Please enter 'yes' or 'no':
sr: Недопустимый ответ. Введите "yes" или "no":

# ErrArgumentWithoutValue
source: The --{0} option requires a value to be passed, but none was found.
sr: Для параметра --{0} необходимо указать значение, но оно не найдено.

# ErrBindingElementNotSupportedFormat
source: Binding element of type '{0}' is not supported.
sr: Элемент привязки типа "{0}" не поддерживается.

# ErrBindingTypeNotSupportedFormat
source: Binding type '{0}' is not supported.
sr: Тип привязки "{0}" не поддерживается.

# ErrCannotCreateDirectoryFormat
source: Cannot create directory: '{0}'.
sr: Не удается создать каталог: "{0}".

# ErrCannotCreateFileFormat
source: Cannot create output file: '{0}'.
sr: Не удается создать выходной файл: "{0}".

# ErrCannotDisambiguateSpecifiedTypesFormat
source: More than one type with the same name exists in the set of referenced assemblies. Use assembly-qualified names to disambiguate between the --{0} types '{1}' and '{2}'
sr: В наборе сборок, на которые заданы ссылки, существует несколько типов с таким именем. Используйте имена, определенные с указанием сборок, чтобы устранить неоднозначность между типами --{0} "{1}" и "{2}"

# ErrCannotLoadSpecifiedTypeFormat
source: No type could be loaded for the value '{1}' passed to the --{0} option. Ensure that the assembly this type belongs to is specified via the --{2} option.
sr: Не удалось загрузить типы для значения "{1}" параметра --{0}. Убедитесь, что сборка, к которой принадлежит этот тип, указана в качестве значения параметра --{2}.

# ErrCannotWriteFile
source: Cannot write to output file.
sr: Не удается записать данные в выходной файл.

# ErrCodegenError
source: There was an error trying to generate code in the specified language. This could be because the language does not support all the code elements being generated. Consider using another language.
sr: Произошла ошибка при попытке сформировать код на указанном языке. Возможная причина: язык не поддерживает все элементы создаваемого кода. Попробуйте применить другой язык.

# ErrCouldNotCreateCodeProviderFormat
source: A code provider could not be created for the value: '{0}' passed to the --{1} option. Verify that the code provider is properly installed and configured.
sr: Не удалось создать поставщик кода для значения "{0}", переданного для параметра --{1}. Убедитесь, что поставщик кода установлен и настроен правильно.

# ErrCouldNotCreateInstanceFormat
source: Cannot create instance of the type '{0}' passed to the --{1} option.
sr: Не удается создать экземпляр типа "{0}", указанного в параметре --{1}.

# ErrCouldNotLoadTypesFromAssemblyAtFormat
source: Cannot load any types in assembly '{0}'.
sr: Не удается загрузить типы в сборке "{0}".

# ErrDuplicateReferenceValuesFormat
source: The assembly '{1}' was loaded twice through the --{0} option. You may reference each assembly only once.
sr: Сборка "{1}" загружена дважды с помощью параметра "--{0}". Вы можете указать только одну ссылку на каждую сборку.

# ErrDuplicateValuePassedToTypeArgFormat
source: The value '{1}' was passed to the --{0} option multiple times. Each type may be specified only once.
sr: Значение "{1}" передано для параметра --{0} несколько раз. Каждый тип можно указать только один раз.

# ErrEncodingNotSupportedFormat
source: Encoding '{0}' is not supported.
sr: Кодирование "{0}" не поддерживается.

# ErrIncompatibleContractSoapEncodingFormat
source: The contract '{0}' contains one or more operations with SOAP Encoding (use='encoded'). This is not supported by the current target framework. Only the non-encoded operations will be generated, if any.
sr: Контракт "{0}" содержит одну или несколько операций с кодированием SOAP (use='encoded'). Это не поддерживается текущей целевой платформой. Будут созданы только некодированные операции (при наличии).

# ErrInputEPRFileParseErrorFormat
source: Cannot read Endpoint Reference from: '{0}'. Verify that the XML is both well-formed and valid.
sr: Не удается прочитать ссылку конечной точки из "{0}". Проверьте допустимость и правильность формата XML-элемента.

# ErrInputPolicyParseErrorFormat
source: WS-Policy Parsing Error while reading: '{0}'. Verify that the XML is both well-formed and valid.
sr: Ошибка анализа WS-Policy во время чтения: "{0}". Проверьте допустимость и правильность формата XML-элемента.

# ErrInputSchemaParseErrorFormat
source: XML Schema Parsing Error while reading: '{0}'. Verify that the XML is both well-formed and valid.
sr: Ошибка разбора схемы XML во время чтения: "{0}". Проверьте допустимость и правильность формата XML-элемента.

# ErrInputWsdlParseErrorFormat
source: WSDL Parsing Error while reading: '{0}'. Verify that the XML is both well-formed and valid.
sr: Ошибка разбора WSDL во время чтения: "{0}". Проверьте допустимость и правильность формата XML-элемента.

# ErrInvalidNamespaceFormat
source: The specified namespace mappings {0} contain invalid identifiers.
sr: Сопоставления указанного пространства имен {0} содержат недопустимые идентификаторы.

# ErrInvalidOperationNoProjectFileFoundUnderFolderFormat
source: The current operation is invalid outside the context of a project and no project file was found under the '{0}' directory.
sr: Текущая операция является недопустимой вне контекста проекта, и файл проекта не найден в каталоге "{0}".

# ErrInvalidPathFormat
source: Invalid path '{0}'. Check the --{1} option value.
sr: Недопустимый путь "{0}". Проверьте значение параметра --{1}.

# ErrMessageVersionNotSupportedFormat
source: MessageVersion '{0}' is not supported.
sr: MessageVersion "{0}" не поддерживается.

# ErrMoreThanOneProjectFoundFormat
source: The directory '{0}' contains more than one project file.
sr: Каталог "{0}" содержит несколько файлов проектов.

# ErrMoreThanOneUpdateParamsFilesFoundFormat
source: More than one web service reference was found under the project '{0}'. Please use the --{1} option to specify the service reference to update. The possible values are: {2}.
sr: В проекте "{0}" обнаружено несколько ссылок на веб-службы. Используйте параметр --{1}, чтобы указать ссылку на службу, которую необходимо обновить. Возможные значения: {2}.

# ErrNoCompatibleEndpoints
source: No endpoints compatible with .Net Core apps were found.
sr: Не найдены конечные точки, совместимые с приложениями .Net Core.

# ErrNoUpdateParamsFileFoundFormat
source: The project '{0}' does not have a web service reference that can be updated.
sr: Проект "{0}" не содержит обновляемых ссылок на веб-службы.

# ErrNoValidInputSpecified
source: No valid input specified. Specify either a service url or a wsdl file.
sr: Нет допустимых входных данных. Укажите URL-адрес службы или WSDL-файл.

# ErrNotCodeDomTypeFormat
source: The type '{0}' passed to the --{1} option is not a subclass of '{2}'.
sr: Тип "{0}", переданный в качестве значения аргумента --{1}, не является подклассом "{2}".

# ErrNotLanguageOrCodeDomTypeFormat
source: The value '{0}' passed to the --{1} option does not represent a defined language and it could not be loaded as a fully qualified CLR type.
sr: Значение "{0}", переданное для аргумента --{1}, не представляет собой определенный язык, и его не удалось загрузить как полный тип CLR.

# ErrOutputFileAlreadyExistsFormat
source: The source file '{0}' resolved from the value specified with the option --{1} already exists!
sr: Исходный файл "{0}", полученный в результате разрешения значения параметра --{1}, уже существует!

# ErrOutputFileNotUnderOutputDirFormat
source: The value of the --{0} option resolves to the path '{1}' which is not under the directory '{2}' resolved from the value specified with the --{3} option. The file must be a relative file name or a full path under this directory.
sr: Значение параметра --{0} определяет путь "{1}", который не находится в каталоге "{2}", который был определен параметром --{3}. Необходимо указать относительное имя файла или полный путь к файлу в этом каталоге.

# ErrPathTooLongDirOnlyFormat
source: The resultant path '{0}' is too long. Review the --{1} option value.
sr: Результирующий путь "{0}" слишком длинный. Проверьте значение параметра --{1}.

# ErrPathTooLongFormat
source: The resultant path '{0}' is too long. Review the --{1} and --{2} option values.
sr: Результирующий путь "{0}" слишком длинный. Проверьте параметры --{1} и --{2}.

# ErrProjectToUpdateNotFoundFormat
source: The --{0} option requires a project to be specified, please use the --{1} option to specify the project to use.
sr: При использовании параметра --{0} необходимо указать проект. Чтобы указать используемый проект, воспользуйтесь параметром --{1}.

# ErrServerCertFailedValidationFormat
source: There were errors when validating the server certificate: {0} {1}
sr: Произошли ошибки при проверке сертификата сервера: {0} {1}

# ErrServiceReferenceNotFoundUnderProjectFormat
source: The specified web service reference '{0}' was not found under the project '{1}'.
sr: Указанная ссылка на веб-службу "{0}" не найдена в проекте "{1}".

# ErrSingleUseSwitchFormat
source: The --{0} option cannot be specified multiple times.
sr: Параметр --{0} не может быть указан несколько раз.

# ErrUnableToImportMetadata
source: A critical error occurred while attempting to import metadata.
sr: Во время попытки импорта метаданных произошла критическая ошибка.

# ErrUnableToLoadExtensionsFormat
source: There was an error loading import extensions. Make sure to provide the assemblies containing these extensions as reference assemblies using the --{0} option.
sr: Произошла ошибка при загрузке расширений импорта. Обязательно укажите сборки с этими расширениями как базовые сборки с помощью параметра --{0}.

# ErrUnableToLoadInputs
source: There was an error reading the loaded metadata.
sr: Ошибка чтения загруженных метаданных.

# ErrUnableToLoadMetadataDocumentFormat
source: There was an error reading the metadata from one of the loaded documents. Document Identifier: '{0}'.
sr: Ошибка чтения метаданных из одного из загруженных документов. Идентификатор документа: "{0}".

# ErrUnableToLoadReferenceFormat
source: Reference cannot be loaded: '{0}', {1}
sr: Невозможно загрузить ссылку: "{0}", {1}

# ErrUnableToRetrieveMetadataFromUriFormat
source: Cannot obtain Metadata from {0} {1}
sr: Не удается получить метаданные из {0} {1}

# ErrUnableToUniquifyFilenameFormat
source: Cannot create output filename. Too many files are being created with the prefix '{0}'.
sr: Не удается создать выходное имя файла. Слишком много файлов создается с префиксом "{0}".

# ErrUnexpectedError
source: An error occurred in the tool.
sr: Ошибка в инструменте.

# ErrUnknownSwitchFormat
source: Unrecognized option '{0}' specified.
sr: Указан нераспознанный параметр "{0}".

# ErrorPrefix
source: Error:
sr: Ошибка:

source: Generating files...
sr: Создание файлов...

# HelpAcceptCertificateFormat
source: Accept remote certificate as trusted when downloading service metadata. (Short Form: -{0})
sr: Принимать удаленный сертификат как доверенный при загрузке метаданных службы. (Краткая форма: -{0})

# HelpAutoSerializerFormat
source: Automatically select the serializer. This tries to use the Data Contract serializer and uses the XmlSerializer if that fails. (Short Form: -{0})
sr: Автоматический выбор сериализатора. Будет предпринята попытка использовать сериализатор контрактов данных, а в случае его отказа — сериализатор XmlSerializer. (Краткая форма: /{0})

# HelpCodeGenerationSyntaxInput1
source: The path to a metadata document (wsdl or xsd). Standard command-line wildcards can be used in the file path.
sr: Путь к документу метаданных (wsdl или xsd). В пути файла можно использовать стандартные подстановочные знаки командной строки.

# HelpCodeGenerationSyntaxInput2
source: The URL to a service endpoint that provides metadata or to a metadata document hosted online.
sr: URL-адрес конечной точки службы, предоставляющей метаданные, или документа метаданных, размещенного в сети.

# HelpCodeGenerationSyntaxInput3
source: The path to an XML file that contains a WS-Addressing EndpointReference for a service endpoint that supports WS-Metadata Exchange.
sr: Путь к XML-файлу, который содержит элемент WS-Addressing EndpointReference для конечной точки службы, поддерживающей обмен метаданными через WS-Metadata Exchange.

# HelpCollectionTypeFormat
source: A fully-qualified or assembly-qualified name of the type to use as a collection data type when code is generated from schemas. (Short Form: -{0})
sr: Полное имя типа или имя типа, определенное через сборку, которое используется как тип данных коллекции, когда код формируется из схем. (Краткая форма: /{0})

# HelpCommonOptionsCategory
source: -= COMMON OPTIONS =-
sr: -= ОБЩИЕ ПАРАМЕТРЫ =-

# HelpDataContractSerializer
source: Generate data types that use the Data Contract Serializer for serialization and deserialization
sr: Формировать типы данных, которые используют сериализаторы контрактов данных для сериализации и десериализации

# HelpDirectoryFormat
source: Directory to create files in. Default: A directory called ServiceReference inside the current directory. (Short Form: -{0})
sr: Каталог, в котором создаются файлы. По умолчанию используется подкаталог ServiceReference в текущем каталоге. (Краткая форма: -{0})

# HelpEnableDataBindingFormat
source: Implement the System.ComponentModel.INotifyPropertyChanged interface on all Data Contract types to enable data binding. (Short Form: -{0})
sr: Реализация интерфейса System.ComponentModel.INotifyPropertyChanged для всех типов контрактов данных для привязки данных. (Краткая форма: /{0})

# HelpExamples
source: -= EXAMPLES =-
sr: -= ПРИМЕРЫ =-

# HelpExamples11
source: - Update existing web service reference named ServiceReference. The command need to be executed under directory which contains the project file.
sr: -Обновление существующей ссылки на веб-службу с именем ServiceReference. Команду следует выполнять в каталоге, содержащем файл проекта.

# HelpExamples3
source: - Generate client code from a running service or online metadata documents.
sr: — формирование кода клиента из выполняемой службы или документов метаданных в сети.

# HelpExamples7
source: - Generate client code in Visual Basic from local metadata documents.
sr: — формирование клиентского кода в Visual Basic из локальных документов метаданных.

# HelpExamples9
source: - Generate client code from a running service using settings that emulate the default "WCF Connected Service" behavior in Visual Studio
sr: — формирование клиентского кода на основе выполняемой службы с использованием параметров, которые имитируют стандартный режим "Служба подключения к WCF" в Visual Studio.

# HelpExcludeTypeCodeGenerationFormat
source: A fully-qualified or assembly-qualified type name to exclude from referenced contract types. (Short Form: -{0})
sr: Полное имя типа или имя типа, определенное через сборку, для исключения из типов контрактов, на которые заданы ссылки. (Краткая форма: /{0})

# HelpHelpFormat
source: Display command syntax and options for the tool. (Short Form: -{0})
sr: Отображение синтаксиса команд и параметров для инструмента. (Краткая форма: /{0})

# HelpInputMetadataDocumentPath
source: <metadata document path>
sr: <путь к документу метаданных>

# HelpInputUrl
source: <url>
sr: <URL-адрес>

# HelpInternalFormat
source: Generate classes that are marked as internal. Default: generate public classes. (Short Form: -{0})
sr: Формирование классов, отмеченных как внутренние. По умолчанию: формирование открытых классов. (Краткая форма: /{0})

# HelpLanguageFormat
source: The programming language to use for generating code. Provide either a language name registered in the machine.config file or provide the fully-qualified name of a class that inherits from System.CodeDom.Compiler.CodeDomProvider. Examples of language names to use are CS and VB. Default: C#. (Short Form: -{0})
sr: Язык программирования для формирования кода. Предоставьте имя языка, зарегистрированного в файле machine.config, или полное имя класса, который наследует у System.CodeDom.Compiler.CodeDomProvider. Примеры имен языков, которые следует использовать: CS и VB. По умолчанию: C#. (Краткая форма: /{0})

# HelpMessageContractFormat
source: Generate Message Contract types. (Short Form: -{0})
sr: Формирование типов контрактов сообщений. (Краткая форма: /{0})
