Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpDirectory
source: Directory to create files in (default: current directory) (Short Form: -{0})
cs: Adresář, ve kterém mají být vytvořeny soubory (výchozí: aktuální adresář) (Krátký tvar: /{0})
de: Das Verzeichnis, in dem Dateien erstellt werden (Standard: aktuelles Verzeichnis). (Kurzform: /{0})
es: El directorio en que se crean archivos (valor predeterminado: directorio actual) (Forma corta: /{0})
fr: Répertoire dans lequel les fichiers sont créés (valeur par défaut : répertoire actif) (Forme abrégée : /{0})
it: Directory per la creazione dei file (impostazione predefinita: directory corrente). Forma breve: -{0}
ja: ファイルを作成するディレクトリ (既定: 現在のディレクトリ) (短い形式: -{0})
ko: 파일을 만들 디렉터리(기본값: 현재 디렉터리)(약식: -{0})
pl: Katalog, w którym będą tworzone pliki (domyślnie: bieżący katalog) (Krótka wersja: -{0})
pt_br: Diretório no qual os arquivos são criados (padrão: diretório atual) (Forma Abreviada: /{0})
ru: Каталог, в котором следует создавать файлы (по умолчанию: текущий каталог) (Краткая форма: /{0})
tr: Dosyaların oluşturulacağı dizin (varsayılan: geçerli dizin) (Kısa Biçim: -{0})
zh_hans: 创建文件所在的目录(默认目录: 当前目录) (缩写: -{0})
zh_hant: 要在其中建立檔案的目錄 (預設: 目前目錄) (簡短形式: /{0})

# HelpExamples
source: -= EXAMPLES =-
cs: -= PŘÍKLADY =-
de: -= BEISPIELE =-
es: -= EJEMPLOS=-
fr: -= EXEMPLES =-
it: -= ESEMPI =-
ja: -= 例 =-
ko: -= 예 =-
pl: -= PRZYKŁADY =-
pt_br: -= EXEMPLOS =-
ru: -= ПРИМЕРЫ =-
tr: -= ÖRNEKLER =-
zh_hans: -= 示例 =-
zh_hant: -= 範例 =-

# HelpExamples2
source: - Generate serialization types for XmlSerializer types used by any Service Contracts in the assembly
cs: - Generovat typy serializace pro typy XmlSerializer používané libovolnými kontrakty služby v sestavení
de: – Generieren von Serialisierungstypen for XmlSerializer-Typen, die von Dienstverträgen in der Assembly verwendet werden
es: - Generar tipos de serialización para los tipos XmlSerializer usados por cualquier contrato de servicio en el ensamblado
fr: - Générer des types de sérialisation pour les types XmlSerializer utilisés par les contrats de service dans l’assembly
it: - Genera i tipi di serializzazione per i tipi XmlSerializer usati da qualsiasi contratto di servizio nell'assembly
ja: - アセンブリ内のサービス コントラクトで使用される XmlSerializer 型のシリアル化の種類を生成します
ko: - 어셈블리의 모든 서비스 계약에 사용되는 XmlSerializer 형식의 serialization 형식을 생성합니다.
pl: — Generowanie typów serializacji dla typów XmlSerializer używanych przez dowolne kontrakty usług w zestawie
pt_br: - Gerar tipos de serialização para os tipos XmlSerializer usados por quaisquer Contratos de Serviço no assembly
ru: — генерация типов сериализации для типов XmlSerializer, используемых любыми контрактами служб в сборке
tr: - Bütünleştirilmiş koddaki herhangi bir Hizmet Anlaşması tarafından kullanılan XmlSerializer türleri için serileştirme türleri oluşturun
zh_hans: - 为程序集中任何服务合约所使用的 XmlSerializer 类型生成序列化类型
zh_hant: - 針對組件中任何服務合約使用的 XmlSerializer 類型產生序列化類型

# HelpExcludeTypeCodeGeneration
source: A fully-qualified or assembly-qualified type name to exclude from referenced contract types. (Short Form: -{0})
cs: Plně kvalifikovaný název nebo kvalifikovaný název sestavení, který bude vyloučen z odkazovaných typů kontraktu. (Krátký tvar: /{0})
de: Ein vollqualifizierter Name oder ein Typname mit Assemblyqualifikation, der aus referenzierten Vertragstypen ausgeschlossen werden soll. (Kurzform: /{0})
es: Un nombre de tipo completo o calificado con el ensamblado que se va a excluir de los tipos de contrato a los que se va a hacer referencia. (Forma corta: /{0})
fr: Nom complet ou nom de type qualifié d'assembly à exclure des types de contrat référencés. (Forme abrégée : /{0})
it: Nome di tipo completo o qualificato dall'assembly da escludere dai tipi di contratto di riferimento. Forma breve: -{0}
ja: 参照されるコントラクト型から除外する完全修飾またはアセンブリ修飾型名です。(短い形式: -{0})
ko: 참조된 계약 형식에서 제외할 정규화된 형식 이름 또는 정규화된 어셈블리 형식 이름입니다(약식: -{0}).
pl: W pełni kwalifikowana lub kwalifikowana dla zestawu nazwa typu do wykluczenia z przywoływanych typów kontraktu. (Krótka wersja: -{0})
pt_br: Um nome de tipo qualificado pelo assembly ou totalmente qualificado a ser excluído dos tipos de contratos referenciados. (Forma Abreviada: /{0})
ru: Полное имя типа или имя типа, определенное через сборку, для исключения из типов контрактов, на которые заданы ссылки. (Краткая форма: /{0})
tr: Başvurulan anlaşma türlerinin dışında tutulacak bir tam veya bütünleştirilmiş kodla nitelenen tür adı. (Kısa Biçim: -{0})
zh_hans: 要从引用的协定类型中排除的完全限定的类型名称或程序集限定类型名称。(缩写: -{0})
zh_hant: 要從參考的合約類型排除之完整類型名稱或符合組件規格的類型名稱。 (簡短形式: /{0})

# HelpExcludeTypeExport
source: The fully-qualified or assembly-qualified name of a type to exclude from export. This option can be used when exporting metadata for a service or a set of service contracts to exclude types from being exported. This option cannot be used with the --{1} option. (Short Form: -{0})
cs: Plně kvalifikovaný název nebo název kvalifikovaný pro sestavení typu, který se má vyloučit z exportu. Tento parametr lze použít při exportu metadat pro kontrakty služby nebo sadu kontraktů služeb k vyloučení typů z exportu. Tento parametr nelze použít s parametrem --{1}. (Krátký tvar: -{0})
de: Der vollqualifizierte Name oder der qualifizierte Assemblyname eines Typs, der vom Export ausgeschlossen werden soll. Diese Option kann verwendet werden, wenn Metadaten für einen Dienst oder eine Reihe von Dienstverträgen exportiert werden, um Typen vom Export auszuschließen. Diese Option kann nicht zusammen mit der Option --{1} verwendet werden. (Kurzform: -{0})
es: Nombre completo o nombre calificado con el ensamblado de un tipo que se va a excluir de la exportación. Esta opción se puede usar al exportar metadatos para un servicio o un conjunto de contratos de servicio para excluir tipos de la exportación. Esta opción no se puede usar con la opción --{1}. (Forma corta: -{0})
fr: Le nom complet ou le nom qualifié d’assembly d’un type à exclure de l’exportation. Cette option peut être utilisée lors de l’exportation des métadonnées d’un service ou d’un ensemble de contrats de service pour exclure l’exportation des types. Cette option ne peut pas être utilisée avec l’option --{1}. (Forme abrégée : -{0})
it: Nome completo o qualificato dall'assembly di un tipo da escludere dall'esportazione. Questa opzione può essere usata quando si esportano i metadati di un servizio o di un set di contratti di servizio per escludere i tipi dall'esportazione. Non è possibile usare questa opzione con l'opzione --{1}. (Forma breve: -{0})
ja: エクスポートから除外する型の完全修飾名またはアセンブリ修飾名です。このオプションは、エクスポートから型を除外するサービスまたはサービス コントラクトのセットのメタデータをエクスポートする場合に使用できます。このオプションは --{1} オプションと一緒に使用できません。(短い形式: -{0})
ko: 내보내기에서 제외할 형식의 정규화된 이름 또는 정규화된 어셈블리 이름입니다. 이 옵션은 서비스 또는 서비스 계약 집합에 대한 메타데이터를 내보낼 때 형식을 내보낼 수 없도록 제외하는 데 사용할 수 있습니다. 이 옵션은 --{1} 옵션과 함께 사용할 수 없습니다. (약식: -{0})
pl: W pełni kwalifikowana lub kwalifikowana nazwa typu do wykluczenia z eksportu. Opcja ta może być używana podczas eksportowania metadanych dla usługi lub zestawu kontraktów usług, aby wykluczyć typy z eksportu. Tej opcji nie można użyć z opcją --{1}. (Krótka wersja: —{0})
pt_br: O nome totalmente qualificado ou qualificado pelo assembly de um tipo de serviço a ser excluído da validação. Esta opção pode ser usada ao exportar metadados para um serviço ou um conjunto de contratos de serviço para excluir tipos de serem exportados. Essa opção não pode ser usada com a opção --{1}. (Forma Resumida: -{0})
ru: Полное имя или имя с указанием сборки типа, который необходимо исключить из экспорта. Этот параметр можно использовать при экспорте метаданных для службы или набора контрактов службы, чтобы исключить типы из экспорта. Этот параметр нельзя использовать с параметром --{1}. (Краткая форма: -{0})
tr: Dışarı aktarmadan dışlanacak bir türün tam veya bütünleştirilmiş kodla nitelenmiş adı. Bu seçenek, bir hizmete veya bir dizi hizmet sözleşmesine ilişkin meta verileri dışa aktarırken türlerin dışa aktarılmasını dışlamak için kullanılabilir. Bu seçenek, --{1} seçeneğiyle kullanılamaz. (Kısa Biçim: -{0})
zh_hans: 要从导出中排除的类型的完全限定的名称或程序集限定的名称。导出服务的元数据或一组服务合约时，可以使用此选项来排除要导出的类型。此选项不能与 --{1} 选项一起使用。(缩写: -{0})
zh_hant: 要從匯出中排除的類型的完整名稱或組件限定名稱。匯出服務的中繼資料或一組服務合約以排除匯出的類型時可使用此選項。此選項無法搭配 --{1} 選項使用。(簡短形式: -{0})

# HelpHelp
source: Display command syntax and options for the tool. (Short Form: -{0})
cs: Zobrazení syntaxe příkazu a možností pro nástroj (Krátký tvar: /{0})
de: Befehlssyntax und Optionen für das Tool anzeigen. (Kurzform: /{0})
es: Mostrar la sintaxis de los comandos y las opciones de la herramienta. (Forma corta: /{0})
fr: Afficher la syntaxe de commande et les options de l'outil. (Forme abrégée : /{0})
it: Visualizza la sintassi e le opzioni del comando per lo strumento. Forma breve: -{0}
ja: ツールのコマンド構文とオプションを表示します。(短い形式: -{0})
ko: 명령 구문 및 도구의 옵션을 표시합니다(약식: -{0}).
pl: Wyświetl składnię polecenia i opcje dla narzędzia. (Krótka wersja: -{0})
pt_br: Exibe a sintaxe de comando e as opções da ferramenta. (Forma Abreviada: /{0})
ru: Отображение синтаксиса команд и параметров для инструмента. (Краткая форма: /{0})
tr: Araç için komut söz dizimini ve seçenekleri görüntüleme. (Kısa Biçim: -{0})
zh_hans: 显示工具的命令语法和选项。(缩写: -{0})
zh_hant: 顯示工具的命令語法與選項。(簡短形式: /{0})

# HelpMetadataDownloadCategory
source: -= METADATA DOWNLOAD =-
cs: -= STAŽENÍ METADAT =-
de: -= METADATENDOWNLOAD =-
es: -= DESCARGA DE METADATOS =-
fr: -= TÉLÉCHARGEMENT DE MÉTADONNÉES =-
it: -= DOWNLOAD METADATI =-
ja: -= メタデータのダウンロード =-
ko: -= 메타데이터 다운로드 =-
pl: -= POBIERANIE METADANYCH =-
pt_br: -= DOWNLOAD DE METADADOS =-
ru: -= СКАЧИВАНИЕ МЕТАДАННЫХ =-
tr: -= META VERİLERİ İNDİRME =-
zh_hans: -= 元数据下载 =-
zh_hant: -= 中繼資料下載 =-

# HelpMetadataDownloadDescription
source: Description: {0} can be used to download metadata from running services and save the metadata to local files. To download metadata, you must explicitly specify the --{1}:{2} option. Otherwise, client code will be generated. For http and https URL schemes svcutil.exe will try to retrieve metadata using WS-Metadata Exchange and DISCO. For all other URL schemes {0} will only try WS-Metadata Exchange. By default, {0} uses the bindings defined in the System.ServiceModel.Description.MetadataExchangeBindings class. To configure the binding used for WS-Metadata Exchange you must define a client endpoint in config that uses the IMetadataExchange contract. This can be defined either in {0}'s config file or in another config file specified using the --{3} option.
cs: Popis: {0} lze použít ke stažení metadat ze spuštěných služeb a uložení metadat do místních souborů. Pokud chcete stáhnout metadata, musíte explicitně zadat parametr --{1}:{2}. Jinak se vygeneruje kód klienta. V případě schémat adres URL http a https se svcutil.exe pokusí načíst metadata pomocí protokolu WS-Metadata Exchange a DISCO. U všech ostatních schémat adres URL provede {0} pokus pouze pomocí protokolu WS-Metadata Exchange. Ve výchozím nastavení používá {0} vazby definované ve třídě System.ServiceModel.Description.MetadataExchangeBindings. Pokud chcete nakonfigurovat vazbu používanou pro WS-Metadata Exchange, musíte v konfiguraci definovat koncový bod klienta, který používá kontrakt IMetadataExchange. Dá se definovat buď v konfiguračním souboru {0}, nebo v jiném konfiguračním souboru zadaném pomocí parametru --{3}.
de: Beschreibung: {0} können zum Herunterladen von Metadaten aus ausgeführten Diensten und zum Speichern der Metadaten in lokalen Dateien verwendet werden. Um Metadaten herunterzuladen, müssen Sie explizit die Option --{1}:{2} angeben. Andernfalls wird Clientcode generiert. Bei HTTP- und HTTPS-URL-Schemas versucht "svcutil.exe", Metadaten mithilfe von WS-Metadata Exchange und DISCO abzurufen. Bei allen anderen URL-Schemas versuchen {0} nur WS-Metadata Exchange. Standardmäßig verwendet {0} die in der System.ServiceModel.Description.MetadataExchangeBindings-Klasse definierten Bindungen. Um die für WS-Metadata Exchange verwendete Bindung zu konfigurieren, müssen Sie einen Clientendpunkt in der Konfiguration definieren, der den IMetadataExchange-Vertrag verwendet. Dies kann entweder in der Konfigurationsdatei von {0} oder in einer anderen Konfigurationsdatei definiert werden, die mit der Option --{3} angegeben wird.
es: Descripción: {0} se puede usar para descargar metadatos de servicios en ejecución y guardar los metadatos en archivos locales. Para descargar metadatos, debe especificar explícitamente la opción --{1}:{2}. De lo contrario, se generará código de cliente. En el caso de los esquemas de dirección URL http y https, svcutil.exe intentará recuperar metadatos mediante WS-Metadata Exchange y DISCO. Para todos los demás esquemas de dirección URL, {0} solo intentará WS-Metadata Exchange. De manera predeterminada, {0} usa los enlaces definidos en la clase System.ServiceModel.Description.MetadataExchangeBindings. Para configurar el enlace usado para WS-Metadata Exchange, debe definir un punto de conexión de cliente en la configuración que use el contrato de IMetadataExchange. Esto se puede definir en el archivo de configuración {0} o en otro archivo de configuración especificado mediante la opción --{3}.
fr: Description : {0} permet de télécharger des métadonnées à partir des services en cours d’exécution et d’enregistrer les métadonnées dans des fichiers locaux. Pour télécharger des métadonnées, vous devez spécifier explicitement l’option --{1} : {2}. Sinon, le code client sera généré. Pour les schémas d’URL http et https, svcutil.exe essaie de récupérer les métadonnées à l’aide de WS-Metadata Exchange et DISCO. Pour tous les autres schémas d’URL {0}, essayer uniquement WS-Metadata Exchange. Par défaut,{0} utilise les liaisons définies dans la classe System.ServiceModel.Description.MetadataExchangeBindings. Pour configurer la liaison utilisée pour WS-Metadata Exchange, vous devez définir un point de terminaison client dans la configuration qui utilise le contrat IMetadataExchange. Cela peut être défini dans le fichier config de{0} ou dans un autre fichier config spécifié à l’aide de l’option --{3}.
it: Descrizione: {0} può essere usato per scaricare i metadati dai servizi in esecuzione e salvare i metadati nei file locali. Per scaricare i metadati, è necessario specificare in modo esplicito l'opzione --{1}:{2}. In caso contrario, verrà generato il codice client. Per gli schemi URL HTTP e HTTPS svcutil.exe proverà a recuperare i metadati tramite WS-Metadata Exchange e DISCO. Per tutti gli altri schemi URL {0} proverà solo WS-Metadata Exchange. Per impostazione predefinita, {0} usa le associazioni definite nella classe System.ServiceModel.Description.MetadataExchangeBindings. Per configurare l'associazione usata per WS-Metadata Exchange, è necessario definire un endpoint client nella configurazione che usa il contratto IMetadataExchange. Può essere definito nel file di configurazione di {0} o in un altro file di configurazione specificato tramite l'opzione --{3}.
ja: 説明: {0} を使用して、実行中のサービスからメタデータをダウンロードし、メタデータをローカル ファイルに保存できます。メタデータをダウンロードするには、--{1}:{2} オプションを明示的に指定する必要があります。それ以外の場合は、クライアント コードが生成されます。http と https の URL スキームでは、svcutil.exe で WS-Metadata Exchange と DISCO を使用してメタデータの取得が試行されます。その他の URL スキームについては、{0} で WS-Metadata Exchange のみ試行されます。既定では、{0} は System.ServiceModel.Description.MetadataExchangeBindings クラスで定義されたバインドを使用します。WS-Metadata Exchange に使用するバインドを構成するには、IMetadataExchange コントラクトを使用する構成でクライアント エンドポイントを定義する必要があります。これは、{0} の構成ファイル、または --{3} オプションを使用して指定された別の構成ファイルで定義できます。
ko: 설명: {0}은(는) 실행 중인 서비스에서 메타데이터를 다운로드하고 메타데이터를 로컬 파일에 저장하는 데 사용할 수 있습니다. 메타데이터를 다운로드하려면 --{1}:{2} 옵션을 명시적으로 지정해야 합니다. 그렇지 않으면 클라이언트 코드가 생성됩니다. http 및 https URL 체계의 경우 svcutil.exe는 WS-Metadata Exchange 및 DISCO를 사용하여 메타데이터를 검색하려고 합니다. 다른 모든 URL 체계의 경우 {0}은(는) WS-Metadata Exchange만 시도합니다. 기본적으로 {0}은(는) System.ServiceModel.Description.MetadataExchangeBindings 클래스에 정의된 바인딩을 사용합니다. WS-Metadata Exchange에 사용되는 바인딩을 구성하려면 구성에서 IMetadataExchange 계약을 사용하는 클라이언트 엔드포인트를 정의해야 합니다. {0}의 구성 파일 또는 -- {3} 옵션을 사용하여 지정된 다른 구성 파일에서 정의할 수 있습니다.
pl: Opis: {0} może służyć do pobierania metadanych z uruchomionych usług i zapisywania metadanych w plikach lokalnych. Aby pobrać metadane, należy jawnie określić opcję --{1}:{2}. W przeciwnym razie zostanie wygenerowany kod klienta. W przypadku schematów URL protokołu http i https svcutil.exe spróbuje pobrać metadane przy użyciu funkcji WS-Metadata Exchange i DISCO. W przypadku wszystkich innych schematów adresów URL będzie można wypróbować {0} tylko protokół WS-Metadata Exchange. {0} domyślnie używa powiązań zdefiniowanych w klasie System.ServiceModel.Description.MetadataExchangeBindings. Aby skonfigurować powiązanie używane dla funkcji WS-Metadata Exchange, należy zdefiniować punkt końcowy klienta w konfiguracji, który korzysta z kontraktu protokołu IMetadataExchange. Można to zdefiniować w pliku konfiguracyjnym {0} lub w innym pliku konfiguracyjnym określonym za pomocą opcji --{3}.
pt_br: Descrição: {0} pode ser usado para baixar metadados de serviços em execução e salvar os metadados nos arquivos locais. Para baixar metadados, você deve especificar explicitamente a opção --{1}:{2}. Caso contrário, o código do cliente será gerado. Para esquemas de URL http e https, o svcutil.exe tentará recuperar os metadados usando o WS-Metadata Exchange e DISCO. Para todos os outros esquemas de URL {0} só tentará o WS-Metadata Exchange. Por padrão, {0} usa as associações definidas na classe System.ServiceModel.Description.MetadataExchangeBindings. Para configurar a associação usada no WS-Metadata Exchange, você deve definir um ponto de extremidade do cliente na configuração que usa o contrato IMetadataExchange. Isso pode ser definido no arquivo {0} de configuração ou em outro arquivo de configuração especificado usando a opção --{3}.
ru: Описание: {0} может использоваться для скачивания метаданных из запущенных служб и сохранения метаданных в локальные файлы. Чтобы скачать метаданные, необходимо явно указать параметр --{1}:{2} В противном случае будет создан код клиента. Для схем URL-адресов HTTP и HTTPS svcutil.exe попытается получить метаданные с помощью WS-Metadata Exchange и DISCO. Для всех остальных схем URL-адресов {0} будет использоваться только WS-Metadata Exchange. По умолчанию {0} использует привязки, определенные в классе System.ServiceModel.Description.MetadataExchangeBindings. Чтобы настроить привязку, используемую для обмена WS-Metadata Exchange, необходимо определить конечную точку клиента в конфигурации, использующей контракт IMetadataExchange. Это можно определить либо в файле конфигурации {0}, либо в другом файле конфигурации, указанном с помощью параметра --{3}.
tr: Açıklama: {0}, çalışan hizmetlerden meta verileri indirmek ve meta verileri yerel dosyalara kaydetmek için kullanılabilir. Meta verileri indirmek için --{1}:{2} seçeneğini belirtmelisiniz. Aksi takdirde, istemci kodu oluşturulur. http ve https URL şemaları için svcutil.exe, WS-Metadata Exchange ve DISCO'yu kullanarak meta verileri almaya çalışır. Diğer tüm URL şemaları için {0} yalnızca WS-Metadata Exchange'i dener. Varsayılan olarak {0}, System.ServiceModel.Description.MetadataExchangeBindings sınıfında tanımlanan bağlamaları kullanır. WS-Metadata Exchange için kullanılan bağlamayı yapılandırmak için, IMetadataExchange anlaşmasını kullanan yapılandırmada bir istemci uç noktası tanımlamanız gerekir. Bu, {0} yapılandırma dosyasında veya --{3} seçeneği kullanılarak belirtilen başka bir yapılandırma dosyasında tanımlanabilir.
zh_hans: 说明: {0} 可用于从正在运行的服务下载元数据并将元数据保存到本地文件。若要下载元数据，必须显式指定 --{1}:{2} 选项。否则，将生成客户端代码。对于 http 和 https URL 方案，svcutil.exe 将尝试使用 WS-Metadata Exchange 和 DISCO 检索元数据。对于所有其他 URL 方案 {0} ，将仅尝试 WS-Metadata Exchange。默认情况下，{0} 使用 System.ServiceModel.Description.MetadataExchangeBindings 类中定义的绑定。若要配置用于 WS-Metadata Exchange 的绑定，则必须在配置中定义使用 IMetadataExchange 协定的客户端终结点。这可以在 {0} 的配置文件中定义，也可以在使用 --{3} 选项指定的另一个配置文件中定义。
zh_hant: 描述: {0} 可用來從執行中服務下載中繼資料，以及將中繼資料儲存到本機檔案。若要下載中繼資料，您必須明確指定 --{1}:{2} 選項。否則，將產生用戶端程式碼。對於 http 和 https URL 配置，svcutil.exe 會嘗試使用 WS-Metadata Exchange 和 DISCO 來擷取中繼資料。針對所有其他 URL 配置，{0} 將只會嘗試 WS-Metadata Exchange。依預設，{0} 會使用 System.ServiceModel.Description.MetadataExchangeBindings 類別中定義的繫結。若要設定用於 WS-Metadata Exchange 的繫結，您必須在使用 IMetadataExchange 合約的設定中定義用戶端端點。這可以在 {0} 的設定檔中或在指定的另一個設定檔中使用 --{3} 選項定義。

# HelpMetadataDownloadSyntax
source: Syntax: {0} --{1}:{2} {3}* | {4}
cs: Syntaxe: {0} --{1}:{2} {3}* | {4}
es: Sintaxis: {0} --{1}:{2} {3}* | {4}
fr: Syntaxe : {0} --{1}:{2} {3}* | {4}
it: Sintassi: {0} --{1}:{2} {3}* | {4}
ja: 構文: {0} --{1}:{2} {3}* | {4}
ko: 구문: {0} --{1}:{2} {3}* | {4}
pl: Składnia: {0} --{1}:{2} {3}* | {4}
pt_br: Sintaxe: {0} --{1}:{2} {3}* | {4}
tr: Söz dizimi: {0} --{1}:{2} {3}* | {4}
zh_hans: 语法: {0} --{1}:{2} {3}* | {4}
zh_hant: 語法: {0} --{1}:{2} {3}* | {4}

# HelpMetadataDownloadSyntaxInput1
source: The URL to a service endpoint that provides metadata or an URL that points to a metadata document hosted online.
cs: Adresa URL ke koncovému bodu služby, který poskytuje metadata, nebo adresa URL odkazující na dokument metadat hostovaný online.
de: Die URL zu einem Dienstendpunkt, der Metadaten bereitstellt, oder eine URL, die auf ein online gehostetes Metadatendokument zeigt.
es: La dirección URL a un punto de conexión de servicio que proporciona metadatos o una dirección URL que apunta a un documento de metadatos hospedado en línea.
fr: URL d’un point de terminaison de service qui fournit des métadonnées ou URL qui pointe vers un document de métadonnées hébergé en ligne.
it: URL di un endpoint servizio che fornisce metadati o URL che punta a un documento di metadati ospitato online.
ja: メタデータを提供するサービス エンドポイントの URL、またはオンラインでホストされているメタデータ ドキュメントを指す URL です。
ko: 메타데이터를 제공하는 서비스 끝점의 URL 또는 온라인으로 호스팅되는 메타데이터 문서를 가리키는 URL입니다.
pl: Adres URL do punktu końcowego usługi, który dostarcza metadane lub adres URL, który wskazuje na dokument metadanych hostowany online.
pt_br: A URL de um ponto de extremidade de serviço que fornece metadados ou uma URL que aponta para um documento de metadados hospedado online.
ru: URL-адрес конечной точки службы, предоставляющей метаданные, или URL-адрес, указывающий на документ метаданных, размещенный в сети.
tr: Meta verileri sağlayan bir servis uç noktasının URL'si veya çevrimiçi olarak barındırılan bir meta veri belgesini gösteren bir URL.
zh_hans: 提供元数据的服务终结点的 URL，或指向联机寄宿的元数据文档的 URL。
zh_hant: 提供中繼資料服務端點的 URL，或指向線上裝載的中繼資料文件的 URL。
