Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AmbiguousToolUseage
source: The intended output for the tool could not be inferred from the inputs and the options.
cs: Ze vstupů a možností nebylo možné vyvodit zamýšlený výstup nástroje.
de: Die beabsichtigte Ausgabe für das Tool konnte nicht aus den Eingaben und Optionen abgeleitet werden.
es: La salida prevista de la herramienta no se pudo inferir de las entradas y las opciones.
fr: Impossible de déduire la sortie prévue pour l'outil à partir des entrées et des options.
it: Non è stato possibile derivare l'output designato dagli input e dalle opzioni.
ja: ツールの意図した出力を、入力およびオプションから推論できませんでした。
ko: 입력 및 옵션에서 도구에 대해 원하는 출력을 유추할 수 없습니다.
pl: Nie można wywnioskować zamierzonych danych wyjściowych dla narzędzia na podstawie danych wejściowych i opcji.
pt_br: Não foi possível inferir a saída pretendida da ferramenta com base nas entradas e nas opções.
ru: Не удалось вывести требуемые выходные данные для средства из входных данных и параметров.
tr: Giriş ve seçeneklerden araç için hedeflenen çıkış çıkarsanamadı.
zh_hans: 无法通过输入和选项推断出工具的预期输出。
zh_hant: 無法從輸入與選項推斷工具應會有的輸出。

# CopyrightForCmdLine
source: Copyright (c) Microsoft Corporation. All rights reserved.
cs: Copyright (c) Microsoft Corporation. Všechna práva vyhrazena.
de: Copyright (c) Microsoft Corporation. Alle Rechte vorbehalten.
es: Copyright (c) Microsoft Corporation. Todos los derechos reservados.
fr: Copyright (c) Microsoft Corporation. Tous droits réservés.
it: Copyright (c) Microsoft Corporation. Tutti i diritti sono riservati.
pl: Copyright (c) Microsoft Corporation. Wszelkie prawa zastrzeżone.
pt_br: Copyright (c) Microsoft Corporation. Todos os direitos reservados.
ru: (с) Корпорация Майкрософт. Все права защищены.
tr: Teklif Hakkı (c) Microsoft Corporation. Tüm hakları saklıdır.
zh_hans: 版权所有(C) Microsoft Corporation。保留所有权利。
zh_hant: Copyright (c) Microsoft Corporation. 著作權所有，並保留一切權利。

# ErrAmbiguityInAssemblyNames
source: Could not load assembly '{0}'. 2 reference assemblies ('{1}' and '{2}') were found that match the string '{0}'. This is usually caused by an insufficient type reference in a config file. Resolve this issue by passing only the reference assembly needed or by adding more information like a version number or a public key to the reference.
cs: Nepodařilo se načíst sestavení {0}. Našly se 2 referenční sestavení ({1} a {2}), která odpovídají řetězci {0}. To je obvykle způsobeno nedostatečným odkazem na typ v konfiguračním souboru. Tento problém vyřešte předáním pouze potřebného referenčního sestavení nebo přidáním dalších informací, jako je číslo verze nebo veřejný klíč, do odkazu.
de: Die Assembly "{0}" konnte nicht geladen werden. Es wurden 2 Verweisassemblys ("{1}" und "{2}" gefunden, die mit der Zeichenfolge "{0}" übereinstimmen. Dies wird in der Regel durch einen unzureichenden Typverweis in einer Konfigurationsdatei verursacht. Beheben Sie dieses Problem, indem Sie nur die erforderliche Verweisassembly übergeben oder dem Verweis weitere Informationen wie eine Versionsnummer oder einen öffentlichen Schlüssel hinzufügen.
es: No se pudo cargar el ensamblado “{0}”. Se encontraron 2 ensamblados de referencia (“{1}” y “{2}”) que coinciden con la cadena “{0}”. Esto suele deberse a una referencia de tipo insuficiente en un archivo de configuración. Resuelva este problema pasando solo el ensamblado de referencia necesario o agregando más información, como un número de versión o una clave pública a la referencia.
fr: Nous n’avons pas pu charger l’assembly « {0} ». 2 assemblys de référence (« {1} » et « {2} ») correspondant à la chaîne « {0} » ont été trouvés. Cela est généralement dû à une référence de type insuffisante dans un fichier config. Corrigez ce problème en passant uniquement l’assembly de référence nécessaire ou en ajoutant des informations supplémentaires telles qu’un numéro de version ou une clé publique à la référence.
it: Non è stato possibile caricare l'assembly '{0}'. Sono stati trovati 2 assembly di riferimento ('{1}' e '{2}') corrispondenti alla stringa '{0}'. Questo problema è in genere causato da un riferimento al tipo insufficiente in un file di configurazione. Risolvere il problema passando solo l'assembly di riferimento necessario o aggiungendo ulteriori informazioni come un numero di versione o una chiave pubblica al riferimento.
ja: アセンブリ '{0}' を読み込めませんでした。文字列 '{0}' に一致する 2 つの参照アセンブリ ('{1}' および '{2}') が見つかりました。これは通常、構成ファイルの型参照が十分でないために発生します。必要な参照アセンブリのみを渡すか、バージョン番号や公開キーなどの情報を参照に追加することで、この問題を解決します。
ko: 어셈블리 '{0}'을(를) 로드할 수 없습니다. 문자열 '{0}'과(와) 일치하는 참조 어셈블리 2개('{1}' 및 '{2}')를 찾았습니다. 이는 일반적으로 구성 파일의 형식 참조가 부족하기 때문에 발생합니다. 필요한 참조 어셈블리만 전달하거나 버전 번호 또는 공개 키와 같은 추가 정보를 참조에 추가하여 이 문제를 해결합니다.
pl: Nie można załadować zestawu „{0}”. Znaleziono 2 zestawy odwołań („{1}” i „{2}”), które pasują do ciągu „{0}”. Zwykle jest to spowodowane niewystarczającym odwołaniem do typu w pliku konfiguracyjnym. Rozwiązać ten problem można przekazując tylko wymagany zestaw odwołania lub dodając do odwołania więcej informacji, takich jak numer wersji lub klucz publiczny.
pt_br: Não foi possível carregar o assembly '{0}'. Foram encontrados dois assemblies de referência ('{1}' e '{2}') que correspondem à cadeia de caracteres '{0}'. Isso geralmente é causado por uma referência de tipo insuficiente em um arquivo de configuração. Resolva esse problema passando apenas o assembly de referência necessário ou adicionando mais informações, como um número de versão ou uma chave pública à referência.
ru: Не удалось загрузить сборку "{0}" Обнаружено 2 базовых сборки ("{1}" и "{2}"), соответствующие строке "{0}". Обычно это вызвано недостаточной ссылкой на тип в файле конфигурации. Устраните эту проблему, передав только необходимую базовую сборку или добавив в ссылку дополнительные сведения, например номер версии или открытый ключ.
tr: '{0}' bütünleştirilmiş kodu yüklenemedi. '{0}' dizesiyle eşleşen 2 başvuru bütünleştirilmiş kodu ('{1}' ve '{2}') bulundu. Bu, genellikle bir yapılandırma dosyasındaki yetersiz tür başvurusundan kaynaklanır. Yalnızca gereken başvuru bütünleştirilmiş kodunu geçirerek veya başvuruya sürüm numarası veya ortak anahtar gibi daha fazla bilgi ekleyerek bu sorunu çözün.
zh_hans: 无法加载程序集“{0}”。找到 2 个与字符串“{0}”匹配的引用程序集(“{1}”和“{2}”)。这通常是由于配置文件中的类型引用不足导致的。通过仅传递所需的引用程序集或向引用添加版本号或公钥等详细信息来解决此问题。
zh_hant: 無法載入組件 '{0}'。找到符合字串 '{0}' 的 2 個參考組件 ('{1}' 和 '{2}')。這通常是因為設定檔中的類型參考不足導致。只傳遞所需的參考組件，或新增版本號碼或公開金鑰等更多資訊至參考，以解決此問題。

# ErrAmbiguousOptionModeConflict
source: The --{0} option conflicts with other options. Review your use of the tool.
cs: Parametr --{0} je v konfliktu s jinými parametry. Zkontrolujte způsob použití nástroje.
de: Die Option --{0} steht im Konflikt mit anderen Optionen. Prüfen Sie die Verwendung des Tools.
es: La opción --{0} entra en conflicto con otras opciones. Revise el uso de la herramienta.
fr: L’option –{0}est en conflit avec d’autres options. Vérifiez votre utilisation de l’outil.
it: L'opzione --{0} è in conflitto con altre opzioni. Rivedere l'utilizzo dello strumento.
ja: --{0} オプションが他のオプションと競合しています。ツールの使用方法を確認してください。
ko: --{0} 옵션이 다른 옵션과 충돌합니다. 도구 사용을 검토하십시오.
pl: Opcja —{0}wchodzi w konflikt z innymi opcjami. Sprawdź sposób korzystania z narzędzia.
pt_br: A opção --{0} entra em conflito com outras opções. Examine seu uso da ferramenta.
ru: Параметр --{0}конфликтует с другими параметрами. Проверьте использование программного средства.
tr: --{0} seçeneği diğer seçeneklerle çakışıyor. Araç kullanımınızı gözden geçirin.
zh_hans: --{0} 选项与其他选项冲突。请检查对工具的使用。
zh_hant: --{0} 選項與其他選項衝突。檢閱工具使用方式。

# ErrAssemblyLoadFailed
source: Cannot load file {0} as an Assembly. Check the FusionLogs for more Information.
cs: Nelze načíst soubor {0} jako sestavení. Další informace viz FusionLogs.
de: Die Datei "{0}" kann nicht als Assembly geladen werden. Weitere Informationen finden Sie in den FusionLogs.
es: No se puede cargar el archivo {0} como un ensamblado. Consulte FusionLogs para obtener más información.
fr: Nous n’avons pas pu charger le fichier {0}en tant qu’assembly. Pour plus d’informations, consultez FusionLogs.
it: Non è possibile caricare il file {0} come assembly. Per altre informazioni, vedere FusionLogs.
ja: ファイル {0} をアセンブリとして読み込めません。詳細については、FusionLogs を確認してください。
ko: 파일 {0}을(를) 어셈블리로 로드할 수 없습니다. 자세한 내용은 FusionLogs를 확인하세요.
pl: Nie można załadować pliku {0} jako Zestawu. Sprawdź dzienniki FusionLogs, aby uzyskać więcej informacji.
pt_br: Não é possível carregar o arquivo {0} como um Assembly. Verifique os FusionLogs para obter mais Informações.
ru: Не удается загрузить файл {0} в качестве сборки. Дополнительные сведения можно получить в FusionLogs.
tr: {0} dosyası Bütünleştirilmiş Kod olarak yüklenemiyor. Daha fazla Bilgi için FusionLogs'a bakın.
zh_hans: 无法将文件 {0} 作为程序集加载。有关详细信息，请查看 FusionLogs。
zh_hant: 無法將檔案 {0} 載入為組件。如需詳細資訊，請查看 FusionLogs。

# ErrCannotCreateDirectory
source: Cannot create directory: {0}
cs: Nelze vytvořit adresář: {0}
de: Das Verzeichnis kann nicht erstellt werden: {0}.
es: No se puede crear el directorio: {0}
fr: Impossible de créer le répertoire : {0}
it: Non è possibile creare la directory: {0}
ja: ディレクトリを作成できません: {0}
ko: 디렉터리를 만들 수 없습니다. {0}
pl: Nie można utworzyć katalogu: {0}
pt_br: Não é possível criar o diretório: {0}
ru: Не удается создать каталог: {0}
tr: Dizin oluşturulamıyor: {0}
zh_hans: 无法创建目录: {0}
zh_hant: 無法建立目錄: {0}

# ErrCannotCreateFile
source: Cannot create output file: {0}
cs: Nejde vytvořit výstupní soubor: {0}
de: Die Ausgabedatei kann nicht erstellt werden: {0}.
es: No se puede crear el archivo de salida: {0}
fr: Impossible de créer le fichier de sortie : {0}
it: Non è possibile creare il file di output: {0}
ja: 出力ファイルを作成できません: {0}
ko: 출력 파일을 만들 수 없습니다. {0}
pl: Nie można utworzyć pliku wyjściowego: {0}
pt_br: Não é possível criar o arquivo de saída: {0}
ru: Не удается создать выходной файл: {0}
tr: Çıkış dosyası oluşturulamıyor: {0}
zh_hans: 无法创建输出文件: {0}
zh_hant: 無法建立輸出檔: {0}

# ErrCannotDeleteExistingConfig
source: There is an existing config file that cannot be overwritten. Either fix the problem or provide a different config file name using the --{0} option.
cs: Existuje konfigurační soubor, který nelze přepsat. Buď problém opravte, nebo zadejte jiný název konfiguračního souboru pomocí parametru --{0}.
de: Es gibt eine vorhandene Konfigurationsdatei, die nicht überschrieben werden kann. Beheben Sie das Problem, oder geben Sie mithilfe der Option --{0} einen anderen Konfigurationsdateinamen an.
es: Hay un archivo de configuración existente que no se puede sobrescribir. Corrija el problema o proporcione un nombre de archivo de configuración diferente mediante la opción --{0}.
fr: Il existe un fichier config qui ne peut pas être remplacé. Corrigez le problème ou fournissez un autre nom de fichier config à l’aide de l’option --{0}.
it: È presente un file di configurazione esistente che non può essere sovrascritto. Risolvere il problema o specificare un nome di file di configurazione diverso utilizzando l'opzione --{0}.
ja: 上書きできない既存の構成ファイルがあります。問題を修正するか、--{0} オプションを使用して別の構成ファイル名を指定してください。
ko: 덮어쓸 수 없는 기존 구성 파일이 있습니다. --{0} 옵션을 사용하여 문제를 해결하거나 다른 구성 파일 이름을 제공합니다.
pl: Istnieje plik konfiguracji, który nie może zostać zastąpiony. Rozwiąż problem lub podaj inną nazwę pliku konfiguracji przy użyciu opcji --{0}.
pt_br: Há um arquivo de configuração existente que não pode ser substituído. Corrija o problema ou forneça um nome de arquivo de configuração diferente usando a opção --{0}.
ru: Есть существующий файл config, который невозможно перезаписать. Устраните проблему или укажите другое имя файла конфигурации, используя параметр --{0}.
tr: Üzerine yazılamaz bir yapılandırma dosyası var. Ya sorunu düzeltin ya da --{0} seçeneğini kullanarak farklı bir yapılandırma dosyası adı sağlayın.
zh_hans: 存在无法覆盖的现有配置文件。请修复问题或使用 --{0} 选项提供其他配置文件名。
zh_hant: 有一個無法被覆寫的現有設定檔。請修正問題，或使用 --{0} 選項提供不同的設定檔名稱。

# ErrCannotDisambiguateSpecifiedTypes
source: More than one type with the same name exists in the set of referenced assemblies. Use assembly-qualified names to disambiguate between the --{0} types '{1}' and '{2}'
cs: V sadě odkazovaných sestavení existuje více než jeden typ stejného názvu. K rozlišení mezi typy --{0} {1} a {2} použijte názvy kvalifikované pro sestavení.
de: Im Satz referenzierter Assemblys sind mehrere Typen mit demselben Namen vorhanden. Verwenden Sie qualifizierte Assemblynamen, um die --{0}-Typen "{1}" und "{2}" eindeutig zu unterscheiden.
es: Existe más de un tipo con el mismo nombre en el conjunto de ensamblados al que se hace referencia. Utilice nombres calificados con el ensamblado para eliminar la ambigüedad entre los dos tipos de --{0}: "{1}" y "{2}"
fr: L'ensemble d'assemblys référencés comporte plusieurs types portant le même nom. Utilisez des noms qualifiés d'assemblys pour supprimer l'ambiguïté entre les types de --{0}, '{1}' et '{2}'
it: Nel set di assembly di riferimento esistono più tipi con lo stesso nome. Usare nomi completi di assembly per evitare ambiguità tra i tipi '{1}' e '{2}' di --{0}
ja: 参照されたアセンブリのセット内に、同じ名前を持つ複数の型が存在します。アセンブリ修飾名を使用して、--{0} 型の '{1}' と '{2}' の間を明確にしてください
ko: 참조된 어셈블리 집합에 동일한 이름을 가진 둘 이상의 형식이 있습니다. 정규화된 어셈블리 이름을 사용하여 --{0} 형식 '{1}'과(와) '{2}'을(를) 구분하세요.
pl: Istnieje więcej niż jeden typ o tej samej nazwie w zbiorze przywoływanych zestawów. Użyj nazw kwalifikowanych dla zestawu, aby usunąć niejednoznaczność między typami --{0} „{1}” i „{2}”
pt_br: Existe mais de um tipo com o mesmo nome no conjunto de assemblies referenciados. Use nomes qualificados de assembly para remover a ambiguidade entre os tipos --{0} '{1}' e '{2}'
ru: В наборе сборок, на которые заданы ссылки, существует несколько типов с таким именем. Используйте имена, определенные с указанием сборок, чтобы устранить неоднозначность между типами --{0} "{1}" и "{2}"
tr: Başvurulan bütünleştirilmiş kod kümesinde aynı ada sahip birden çok tür var. '{1}' ve '{2}' şeklindeki --{0} türlerini birbirinden ayırmak için bütünleştirilmiş kodla nitelenen adlar kullanın
zh_hans: 所引用的程序集组中存在多个同名类型。请使用程序集限定的名称来区分类型“{1}”和“{2}”的 --{0}。
zh_hant: 在參考的組件集合中，存在多種類型具有相同的名稱。請使用組件限定名稱來區分 --{0} 類型 '{1}' 與 '{2}'

# ErrCannotLoadSpecifiedType
source: No type could be loaded for the value {1} passed to the --{0} option. Ensure that the assembly this type belongs to is specified via the --{2} option.
cs: Pro hodnotu {1} předanou možnosti --{0} nebylo možné načíst žádný typ. Ujistěte se, že sestavení, k němuž tento typ patří, je zadáno pomocí možnosti --{2}.
de: Für den an die Option --{0} übergebenen Wert "{1}" konnte kein Typ geladen werden. Stellen Sie sicher, dass die Assembly, zu der dieser Typ gehört, mithilfe der Option --{2} angegeben wurde.
es: No se pudo cargar ningún tipo para el valor {1} pasado a la opción --{0}. Asegúrese de que el ensamblado al que pertenece este tipo se especifica a través de la opción --{2}.
fr: Impossible de charger un type pour la valeur {1} passée à l'option --{0}. Vérifiez que l'assembly auquel ce type appartient est spécifié via l'option --{2}.
it: Non è stato possibile caricare alcun tipo per il valore {1} passato all'opzione --{0}. Assicurarsi che l'assembly a cui appartiene questo tipo sia specificato tramite l'opzione --{2}.
ja: --{0} オプションに渡された値 {1} に対して型を読み込めませんでした。この型が属するアセンブリが、-{2} オプションを介して指定されていることをご確認ください。
ko: --{0} 옵션에 전달된 {1} 값에 대한 형식을 로드할 수 없습니다. 이 형식이 속해 있는 어셈블리가 --{2} 옵션을 통해 지정되었는지 확인하세요.
pl: Nie można załadować żadnego typu dla wartości {1} przekazanej do opcji --{0}. Upewnij się, że zestaw, do którego należy ten typ, jest określony za pośrednictwem opcji --{2}.
pt_br: Não foi possível carregar nenhum tipo para o valor {1} enviado à opção --{0}. Verifique se o assembly ao qual esse tipo pertence está especificado por meio da opção --{2}.
ru: Не удалось загрузить типы для значения {1}, переданного параметру --{0}. Убедитесь, что сборка, к которой принадлежит этот тип, указана параметром --{2}.
tr: --{0} seçeneğine geçirilen {1} değeri için tür yüklenemedi. Bu türün ait olduğu bütünleştirilmiş kodun --{2} seçeneği aracılığıyla belirtildiğinden emin olun.
zh_hans: 无法为传递给 --{0} 选项的值 {1} 加载任何类型。请确保此类型所属的程序集已通过 --{2} 选项指定。
zh_hant: 無法為傳遞到 --{0} 選項的值 {1}，載入任何類型。請確定已透過 --{2} 選項，指定此類型所屬的組件。

# ErrCannotSpecifyMultipleMappingsForNamespace
source: Invalid value passed to the --{0} option. Target namespace '{1}' cannot be mapped to multiple CLR namespaces '{2}' and '{3}'
cs: Do možnosti --{0} byla předána neplatná hodnota. Cílový obor názvů {1} nejde namapovat na několik oborů názvů CLR {2} a {3}.
de: An die --{0}-Option wurde ein ungültiger Wert übergeben. Der Zielnamespace "{1}" kann nicht mehreren CLR-Namespaces "{2}" und "{3}" zugeordnet werden.
es: Se ha pasado un valor no válido a la opción --{0}. El espacio de nombres de destino, "{1}", no se puede asignar a varios espacios de nombres "{2}" y "{3}"
fr: Valeur non valide passée à l'option --{0}. Impossible de mapper l'espace de noms cible '{1}' à plusieurs espaces de noms CLR '{2}' et '{3}'
it: Il valore passato all'opzione --{0} non è valido. Non è possibile eseguire il mapping dello spazio dei nomi di destinazione '{1}' a più spazi dei nomi CLR '{2}' e '{3}'
ja: --{0} オプションに無効な値が渡されました。ターゲット名前空間 '{1}' を複数の CLR 名前空間 '{2}' および '{3}' にマップできません
ko: 잘못된 값이 --{0} 옵션에 전달되었습니다. 대상 네임스페이스 '{1}'을(를) 여러 CLR 네임스페이스 '{2}' 및 '{3}'에 매핑할 수 없습니다.
pl: Nieprawidłowa wartość przekazana do opcji --{0}. Nie można mapować docelowej przestrzeni nazw „{1}” na wiele przestrzeni nazw CLR „{2}” i „{3}”
pt_br: Valor inválido passado à opção --{0}. O namespace de destino '{1}' não pode ser mapeado para vários namespaces CLR '{2}' e '{3}'
ru: Через параметр --{0} передано недопустимое значение. Целевое пространство имен "{1}" невозможно сопоставить с несколькими пространствами имен CLR "{2}" и "{3}"
tr: --{0} seçeneğine geçersiz değer geçirildi. '{1}' hedef ad alanı birden çok CLR ad alanıyla ('{2}' ve '{3}') eşlenemiyor
zh_hans: 传递给 --{0} 选项的值无效。无法将目标命名空间“{1}”映射到多个 CLR 命名空间“{2}”和“{3}”
zh_hant: 傳遞到 --{0} 選項的值無效。目標命名空間 '{1}' 無法對應到多個 CLR 命名空間 '{2}' 與 '{3}'

# ErrCannotWriteFile
source: Cannot write to output file
cs: Nelze zapisovat do výstupního souboru.
de: In die Ausgabedatei kann nicht geschrieben werden.
es: No es posible escribir en el archivo de salida
fr: Impossible d'écrire dans le fichier de sortie
it: Non è possibile scrivere nel file di output
ja: 出力ファイルに書き込めません
ko: 출력 파일에 쓸 수 없습니다.
pl: Nie można zapisać w pliku wyjściowym
pt_br: Não é possível gravar no arquivo de saída
ru: Не удается записать в выходной файл.
tr: Çıkış dosyasına yazılamıyor
zh_hans: 无法写入输出文件
zh_hant: 無法寫入輸出檔

# ErrConflictingInputs
source: The '{0}' input argument conflicts with '{1}' because they imply different modes of tool operation
cs: Vstupní argument {0} je v konfliktu s {1}, protože implikují různé režimy funkce nástroje.
de: Das Eingabeargument "{0}" steht im Konflikt mit "{1}", weil beide unterschiedliche Betriebsmodi des Tools implizieren.
es: El argumento de entrada "{0}" entra en conflicto con "{1}" porque implican modos diferentes de funcionamiento de la herramienta
fr: L’argument d’entrée « {0} » est en conflit avec « {1} », car ils impliquent différents modes d’utilisation de l’outil.
it: L'argomento di input '{0}' è in conflitto con '{1}' perché implicano modalità diverse di funzionamento dello strumento
ja: '{0}' 入力引数と '{1}' は、ツール操作の異なるモードを示すため、競合します
ko: '{0}' 입력 인수와 '{1}'은(는) 서로 다른 도구 작업 모드를 나타내므로 충돌합니다.
pl: Argument wejściowy „{0}” wchodzi w konflikt z elementem „{1}”, ponieważ oznaczają inne tryby działania narzędzia
pt_br: O argumento de entrada '{0}' entra em conflito com '{1}' porque eles implicam diferentes modos de operação de ferramenta.
ru: Входной аргумент "{0}" конфликтует с "{1}", так как они предполагают разные режимы работы средства
tr: '{0}' giriş bağımsız değişkeni, '{1}' ile farklı araç çalıştırma modlarını gerektirdiğinden çakışıyor
zh_hans: “{0}”输入参数与“{1}”冲突，因为这两者采用的工具操作模式不同
zh_hant: '{0}' 輸入引數與 '{1}' 相衝突，因為它們表示不同的工具作業模式

# ErrCouldNotCreateCodeProvider
source: A code provider could not be created for the value: '{0}' passed to the --{1} argument. Verify that the code provider is properly installed and configured.
cs: Pro hodnotu {0} předanou argumentu --{1} nebylo možné vytvořit poskytovatele kódu. Ověřte, že je poskytovatel kódu správně nainstalován a nakonfigurován.
de: Für den an das --{1}-Argument übergebenen Wert "{0}" konnte kein Codeanbieter erstellt werden. Überprüfen Sie, ob der Codeanbieter korrekt installiert und konfiguriert ist.
es: No se pudo crear ningún proveedor de código para el valor: "{0}" se ha pasado al argumento --{1}. Compruebe que el proveedor de código está instalado y configurado correctamente.
fr: Impossible de créer un fournisseur de code pour la valeur '{0}' passée à l'argument --{1}. Vérifiez que le fournisseur de code est installé et configuré correctement.
it: Non è stato possibile creare un provider di codice per il valore '{0}' passato all'argomento --{1}. Verificare che il provider di codice sia installato e configurato correttamente.
ja: --{1} 引数に渡された値 '{0}' に対して、コード プロバイダーを作成できませんでした。コード プロバイダーが正しくインストールおよび構成されていることをご確認ください。
ko: --{1} 인수에 전달된 '{0}' 값에 대해 코드 공급자를 만들 수 없습니다. 코드 공급자가 제대로 설치되고 구성되었는지 확인하세요.
pl: Nie można utworzyć dostawcy kodu dla wartości „{0}” przekazanej do argumentu --{1}. Upewnij się, że dostawca kodu został prawidłowo zainstalowany i skonfigurowany.
pt_br: Não foi possível criar um provedor de código para o valor: '{0}' passado ao argumento --{1}. Verifique se o provedor de código está instalado e configurado corretamente.
ru: Не удалось создать поставщик кода для значения "{0}", переданного через аргумент --{1}. Проверьте, правильно ли установлен и настроен поставщик кода.
tr: --{1} bağımsız değişkenine geçirilen '{0}' değeri için bir kod sağlayıcısı oluşturulamadı. Kod sağlayıcısının düzgün bir biçimde yüklenip yapılandırıldığından emin olun.
zh_hans: 无法为传递给 --{1} 参数的值“{0}”创建代码提供程序。请验证是否正确安装并配置了代码提供程序。
zh_hant: 無法為傳遞到 --{1} 引數的值 '{0}'，建立程式碼提供者。請確認已正確安裝程式碼提供者，並加以設定。

# ErrCouldNotCreateInstance
source: Could not create instance of the type '{0}' passed to the --{1} argument.
cs: Nepovedlo se vytvořit instanci typu {0} předanou argumentu --{1}.
de: Die an das Argument --{1} übergebene Instanz vom Typ "{0}" konnte nicht erstellt werden.
es: No se pudo crear ninguna instancia del tipo “{0}” pasada al argumento --{1}.
fr: Impossible de créer l’instance du type « {0} » passé à l’argument –{1}.
it: Non è stato possibile creare un'istanza del tipo '{0}' passato all'argomento --{1}.
ja: --{1} 引数に渡された型 '{0}' のインスタンスを作成できませんでした。
ko: --{1} 인수에 전달된 '{0}' 형식의 인스턴스를 만들 수 없습니다.
pl: Nie można utworzyć wystąpienia typu „{0}” przekazanego do argumentu --{1}.
pt_br: Não é possível criar uma instância do tipo '{0}' passada para o argumento --{1}.
ru: Не удалось создать экземпляр типа "{0}", переданного аргументу --{1}.
tr: --{0} bağımsız değişkenine geçirilen '{1}' türündeki örnek oluşturulamadı.
zh_hans: 无法创建传递给 --{1} 参数的类型“{0}”的实例。
zh_hant: 無法建立傳遞至 --{1} 引數的類型 '{0}' 的執行個體。

# ErrCouldNotLoadReferenceAssemblyAt
source: Cannot load reference assembly '{0}'
cs: Nelze načíst referenční sestavení {0}.
de: Die Verweisassembly "{0}" kann nicht geladen werden.
es: No se puede cargar el ensamblado de referencia “{0}”
fr: Nous n’avons pas pu charger l’assembly de référence « {0} »
it: Non è possibile caricare l'assembly di riferimento '{0}'
ja: 参照アセンブリ '{0}' を読み込めません
ko: 참조 어셈블리 '{0}'을(를) 로드할 수 없습니다.
pl: Nie można załadować zestawu odwołania „{0}”
pt_br: Não é possível carregar o assembly de referência '{0}'
ru: Невозможно загрузить базовую сборку "{0}"
tr: '{0}' başvuru bütünleştirilmiş kodu yüklenemiyor
zh_hans: 无法加载引用程序集“{0}”
zh_hant: 無法載入參考組件 '{0}'
