Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpMetadataDownloadSyntaxInput2
source: The path to an XML file that contains a WS-Addressing EndpointReference for a service endpoint that supports WS-Metadata Exchange.
cs: Cesta k souboru XML, který obsahuje WS-Addressing EndpointReference pro koncový bod služby podporující WS-Metadata Exchange.
de: Der Pfad zu einer XML-Datei, die einen WS-Addressing-EndpointReference für einen Dienstendpunkt enthält, der WS-Metadata Exchange unterstützt.
es: La ruta de acceso a un archivo XML que contiene WS-Addressing EndpointReference para un punto de conexión de servicio que admite WS-Metadata Exchange.
fr: Chemin d'un fichier XML qui contient un EndpointReference WS-Addressing pour un point de terminaison de service qui prend en charge WS-Metadata Exchange.
it: Percorso di un file XML contenente un elemento WS-Addressing EndpointReference per un endpoint servizio che supporta WS-Metadata Exchange.
ja: WS-Metadata Exchange をサポートするサービス エンドポイントの WS-Addressing EndpointReference を含む XML ファイルへのパスです。
ko: WS-Metadata Exchange를 지원하는 서비스 엔드포인트에 대한 WS-Addressing EndpointReference가 포함된 XML 파일의 경로입니다.
pl: Ścieżka do pliku XML zawierającego odwołanie WS-Addressing EndpointReference dla punktu końcowego usługi, który obsługuje protokół WS-Metadata Exchange.
pt_br: O caminho para um arquivo XML que contém uma EndpointReference de WS-Addressing para o ponto de extremidade de serviço que dá suporte ao WS-Metadata Exchange.
ru: Путь к XML-файлу, который содержит элемент WS-Addressing EndpointReference для конечной точки службы, поддерживающей обмен метаданными через WS-Metadata Exchange.
tr: WS-Metadata Exchange'i destekleyen bir hizmet uç noktası için WS-Addressing EndpointReference içeren bir XML dosyasının yolu.
zh_hans: 包含服务终结点的 WS-Addressing EndpointReference (它支持 WS-Metadata Exchange)的 XML 文件路径。
zh_hant: XML 檔案的路徑包含支援 WS-Metadata Exchange 之服務端點的 WS-Addressing EndpointReference。

# HelpMetadataExportCategory
source: -= METADATA EXPORT =-
cs: -= EXPORT METADAT =-
de: -= METADATENEXPORT =-
es: -= EXPORTACIÓN DE METADATOS =-
fr: -= EXPORT DE MÉTADONNÉES =-
it: -= ESPORTAZIONE METADATI =-
ja: -= メタデータのエクスポート =-
ko: -= 메타데이터 내보내기 =-
pl: -= EKSPORT METADANYCH =-
pt_br: -= EXPORTAÇÃO DE METADADOS =-
ru: -= ЭКСПОРТ МЕТАДАННЫХ =-
tr: -= META VERİLERİ DIŞARI AKTARMA =-
zh_hans: -= 元数据导出 =-
zh_hant: -= 中繼資料匯出 =-

# HelpMetadataExportDescription
source: Description: {0} can export metadata for services, contracts and data types in compiled assemblies. To export metadata for a service, you must use the --{1} option to indicate the service you would like to export. To export all Data Contract types within an assembly use the --{2} option. By default metadata is exported for all Service Contracts in the input assemblies.
cs: Popis: {0} může exportovat metadata pro služby, kontrakty a datové typy ve zkompilovaných sestaveních. Pokud chcete exportovat metadata pro službu, musíte k označení služby, kterou chcete exportovat, použít parametr --{1}. Pokud chcete exportovat všechny typy kontraktů dat v rámci sestavení, použijte parametr --{2}. Ve výchozím nastavení se metadata exportují pro všechny kontrakty služeb ve vstupních sestaveních.
de: Beschreibung: {0} können Metadaten für Dienste, Verträge und Datentypen in kompilierten Assemblys exportieren. Um Metadaten für einen Dienst zu exportieren, müssen Sie die Option --{1} verwenden, um den Dienst anzugeben, den Sie exportieren möchten. Verwenden Sie die Option --{2}, um alle Datenvertragstypen innerhalb einer Assembly zu exportieren. Standardmäßig werden Metadaten für alle Dienstverträge in den Eingabeassemblys exportiert.
es: Descripción: {0} puede exportar metadatos para servicios, contratos y tipos de datos en ensamblados compilados. Para exportar los metadatos de un servicio, debe usar la opción --{1} para indicar el servicio que desea exportar. Para exportar todos los tipos de contrato de datos dentro de un ensamblado, use la opción --{2}. De manera predeterminada, los metadatos se exportan para todos los contratos de servicio de los ensamblados de entrada.
fr: Description : {0}peut exporter des métadonnées pour les services, les contrats et les types de données dans les assemblys compilés. Pour exporter des métadonnées pour un service, vous devez utiliser l’option –{1} pour indiquer le service à exporter. Pour exporter tous les types contrat de données au sein d’un assembly, utilisez l’option --{2}. Par défaut, les métadonnées sont exportées pour tous les contrats de service dans les assemblys d’entrée.
it: Descrizione: {0} può esportare metadati per servizi, contratti e tipi di dati negli assembly compilati. Per esportare i metadati per un servizio, è necessario usare l'opzione --{1} per indicare il servizio da esportare. Per esportare tutti i tipi di contratti di dati all'interno di un assembly, usare l'opzione --{2}. Per impostazione predefinita, i metadati vengono esportati per tutti i contratti di servizio negli assembly di input.
ja: 説明: {0} は、コンパイル済みアセンブリ内のサービス、コントラクト、およびデータ型のメタデータをエクスポートできます。サービスのメタデータをエクスポートするには、--{1} オプションを使用してエクスポートするサービスを指定する必要があります。アセンブリ内のすべてのデータ コントラクト型をエクスポートするには、--{2} オプションを使用します。既定では、入力アセンブリ内のすべてのサービス コントラクトのメタデータがエクスポートされます。
ko: 설명: {0}은(는) 컴파일된 어셈블리에서 서비스, 계약 및 데이터 형식에 대한 메타데이터를 내보낼 수 있습니다. 서비스에 대한 메타데이터를 내보내려면 --{1} 옵션을 사용하여 내보낼 서비스를 나타내야 합니다. 어셈블리 내의 모든 데이터 계약 형식을 내보내려면 --{2} 옵션을 사용합니다. 기본적으로 메타데이터는 입력 어셈블리의 모든 서비스 계약에 대해 내보내집니다.
pl: Opis: {0} może eksportować metadane usług, kontraktów i typów danych w skompilowanych zestawach. Aby wyeksportować metadane dla usługi, należy użyć opcji --{1} wskazującej usługę, którą chcesz wyeksportować. Aby wyeksportować wszystkie typy kontraktu danych w zestawie, użyj opcji --{2}. Domyślnie metadane są eksportowane dla wszystkich kontraktów usług w zestawach wejściowych.
pt_br: Descrição: {0}pode exportar metadados para serviços, contratos e tipos de dados nos assemblies compilados. Para exportar os metadados para um serviço, você deve usar a opção --{1} para indicar o serviço que você quer exportar. Para exportar todos os tipos de Contrato de Dados em um assembly, use a opção --{2}. Por padrão, os metadados são exportados para todos os Contratos de Serviço nos assemblies de entrada.
ru: Описание: {0} может экспортировать метаданные для служб, контрактов и типов данных в скомпилированные сборки. Чтобы экспортировать метаданные службы, вы должны использовать параметр --{1}, чтобы указать службу, которую вы хотите экспортировать. Чтобы экспортировать все типы контрактов данных в сборке, используйте параметр --{2}. По умолчанию метаданные экспортируются для всех контрактов служб во входных сборках.
tr: Açıklama: {0}, derlenmiş bütünleşik kodlarda hizmetler, anlaşmalar ve veri türleri için meta verileri dışarı aktarabilir. Bir hizmete ilişkin meta verileri dışa aktarmak için dışarı aktarmak istediğiniz hizmeti belirtmek üzere --{1} seçeneğini kullanmanız gerekir. Bütünleştirilmiş koddaki tüm Veri Anlaşması türlerini dışarı aktarmak için --{2} seçeneğini kullanın. Varsayılan olarak meta veriler, giriş bütünleştirilmiş kodlarındaki tüm Hizmet Anlaşmaları için dışarı aktarılır.
zh_hans: 说明: {0} 可以导出已编译程序集中的服务、合约和数据类型的元数据。若要导出服务的元数据，必须使用 --{1} 选项来指示要导出的服务。若要导出程序集中的所有数据协定类型，请使用 --{2} 选项。默认情况下，将为输入程序集中的所有服务合约导出元数据。
zh_hant: 描述: {0} 可以匯出編譯的組件中的服務、合約和資料類型的中繼資料。若要匯出服務的中繼資料，您必須使用 --{1} 選項來指出要匯出的服務。若要匯出組件內的所有資料合約類型，請使用 --{2} 選項。依預設，會匯出輸入組件中所有服務合約的中繼資料。

# HelpMetadataExportSyntax
source: Syntax: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
cs: Syntaxe: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
es: Sintaxis: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
fr: Syntaxe : {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
it: Sintassi: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
ja: 構文: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
ko: 구문: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
pl: Składnia: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
pt_br: Sintaxe: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
tr: Sözdizimi: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
zh_hans: 语法: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*
zh_hant: 語法: {0} [--{1}:{2}] [--{3}:{4}] [--{5}] {6}*

# HelpMetadataExportSyntaxInput1
source: The path to an assembly that contains services, contracts or Data Contract types to be exported. Standard command-line wildcards can be used to provide multiple files as input.
cs: Cesta k sestavení, které obsahuje služby, kontrakty nebo typy kontraktů dat, které se mají exportovat. K zadání více souborů na vstupu lze použít standardní zástupné znaky příkazového řádku.
de: Der Pfad zu einer Assembly, die zu exportierende Dienste, Verträge oder Datenvertragstypen enthält. Standard-Befehlszeilenplatzhalter können verwendet werden, um mehrere Dateien als Eingabe bereitzustellen.
es: Ruta de acceso a un ensamblado que contiene servicios, contratos o tipos de contrato de datos que se van a exportar. Los caracteres comodín de línea de comandos estándar se pueden usar para proporcionar varios archivos como entrada.
fr: Le chemin d’accès à un assembly qui contient des services, des contrats ou des types contrat de données à exporter. Les caractères génériques standard de ligne de commande standard peuvent être utilisés pour fournir plusieurs fichiers en entrée.
it: Percorso di un assembly che contiene servizi, contratti o tipi di contratti di dati da esportare. I caratteri jolly standard della riga di comando possono essere usati per fornire più file come input.
ja: エクスポートするサービス、コントラクト、またはデータ コントラクト型を含むアセンブリへのパス。標準コマンドライン ワイルドカードを使用して、複数のファイルを入力として指定できます。
ko: 내보낼 서비스, 계약 또는 데이터 계약 형식이 포함된 어셈블리의 경로입니다. 표준 명령줄 와일드카드를 사용하여 여러 파일을 입력으로 제공할 수 있습니다.
pl: Ścieżka do zestawu zawierającego usługi, kontrakty lub typy kontraktu danych do wyeksportowania. Standardowe symbole wieloznaczne wiersza poleceń mogą być używane do dostarczania wielu plików jako danych wejściowych.
pt_br: O caminho para um assembly que contém serviços, contratos ou tipos de Contrato de Dados a serem exportados. Os coringas de linha de comando padrão podem ser usados para fornecer vários arquivos como entrada.
ru: Путь к сборке, содержащей службы, контракты или типы контрактов данных, подлежащие экспорту. Стандартные подстановочные знаки командной строки можно использовать для предоставления нескольких файлов в качестве входных данных.
tr: Dışarı aktarılacak hizmetleri, anlaşmaları veya Veri Anlaşması türlerini içeren bir bütünleştirilmiş kod yolu. Standart komut satırı joker karakterleri giriş olarak birden çok dosya sağlamak için kullanılabilir.
zh_hans: 包含要导出的服务、合约或数据协定类型的程序集的路径。标准命令行通配符可用于提供多个文件作为输入。
zh_hant: 包含要匯出的服務、合約或資料合約類型的組件路徑。標準命令列萬用字元可用來提供多個檔案做為輸入。

# HelpNamespace
source: A mapping from a WSDL or XML Schema targetNamespace to a CLR namespace. Using the '*' for the targetNamespace maps all targetNamespaces without an explicit mapping to that CLR namespace. Default: derived from the target namespace of the schema document for Data Contracts. The default namespace is used for all other generated types. (Short Form: -{0})
cs: Mapování z oboru názvů targetNamespace schématu WSDL nebo XML na obor názvů CLR. Pomocí znaku * pro targetNamespace lze mapovat všechny obory názvů targetNamespace bez explicitního mapování na daný obor názvů CLR. Výchozí: odvozeno z cílového oboru názvů dokumentu schématu pro kontrakty dat. Výchozí obor názvů je používán pro všechny ostatní generované typy. (Krátký tvar: /{0})
de: Eine Zuordnung von einem WSDL- oder XML-Schema-targetNamespace zu einem CLR-Namespace. Bei Verwendung von "*" als targetNamespace werden alle targetNamespaces ohne explizite Zuordnung diesem CLR-Namespace zugeordnet. Standard: Wird vom Zielnamespace des Schemadokuments für Datenverträge abgeleitet. Für alle anderen generierten Typen wird der Standardnamespace verwendet. (Kurzform: /{0})
es: Una asignación de un WSDL o XML Schema targetNamespace a un espacio de nombres CLR. El uso de "*" para targetNamespace asigna todos los objetos targetNamespaces sin una asignación explícita a dicho espacio de nombres CLR. Valor predeterminado: derivado del espacio de nombres de destino del documento de esquema para los contratos de datos. El espacio de nombres predeterminado se utiliza para los restantes tipos generados. (Forma corta: /{0})
fr: Mappage du targetNamespace d'un schéma WSDL ou XML à un espace de noms CLR. L'utilisation de '*' pour targetNamespace mappe tous les targetNamespaces sans mappage explicite à l'espace de noms CLR. Valeur par défaut : valeur dérivée de l'espace de noms cible du document de schéma pour les contrats de données. L'espace de noms par défaut est utilisé pour tous les autres types générés. (Forme abrégée : /{0})
it: Mapping da un elemento targetNamespace di WSDL o XML Schema a uno spazio dei nomi CLR. Se si usa l'asterisco '*' per targetNamespace, verrà eseguito il mapping di tutti gli elementi targetNamespace senza mapping esplicito allo spazio dei nomi CLR. Impostazione predefinita: derivato dallo spazio dei nomi del documento di schema per i contratti di dati. Per tutti gli altri tipi generati viene usato lo spazio dei nomi predefinito. Forma breve: -{0}
ja: WSDL または XML スキーマの targetNamespace から CLR 名前空間へのマッピングです。targetNamespace に '*' を使用すると、その CLR 名前空間への明示的なマッピングなしに、すべての targetNamespaces がマップされます。既定: データ コントラクトのスキーマ ドキュメントのターゲット名前空間から派生します。その他すべての生成された型には、既定の名前空間が使用されます。(短い形式: -{0})
ko: WSDL 또는 XML 스키마 targetNamespace에서 CLR 네임스페이스로의 매핑입니다. targetNamespace에 '*'를 사용하여 해당 CLR 네임스페이스에 명시적으로 매핑하지 않고 모든 targetNamespaces를 매핑합니다. 기본값: 데이터 계약에 대한 스키마 문서의 대상 네임스페이스에서 파생됩니다. 생성된 다른 모든 형식에는 기본 네임스페이스가 사용됩니다(약식: -{0}).
pl: Mapowanie z elementu targetNamespace schematu WSDL lub XML na przestrzeń nazw CLR. Użycie symbolu „*” dla elementu targetNamespace spowoduje mapowanie wszystkich elementów targetNamespace bez jawnego mapowania na przestrzeń nazw CLR. Domyślnie: pochodna z docelowej przestrzeni nazw dokumentu schematu dla kontraktów danych. Domyślna przestrzeń nazw jest używana w przypadku wszystkich innych wygenerowanych typów. (Krótka wersja: -{0})
pt_br: Um mapeamento de um targetNamespace de Esquema WSDL ou XML para um namespace CLR. Usar '*' para o targetNamespace mapeará todos os targetNamespaces sem um mapeamento explícito para o namespace CLR em questão. Padrão: derivado do namespace de destino do documento do esquema de Contratos de Dados. O namespace padrão é usado para todos os outros tipos gerados. (Forma Abreviada: /{0})
ru: Сопоставление пространств имен targetNamespace из схем WSDL или XML и пространств имен CLR. С помощью параметра "*" с целевым пространством имен targetNamespace сопоставляются все целевые пространства имен targetNamespace без явного сопоставления с пространством имен CLR. По умолчанию: получается из пространства имен документа схемы для контрактов данных. Для всех остальных созданных типов используется пространство имен по умолчанию. (Краткая форма: /{0})
tr: Bir WSDL veya XML Schema targetNamespace'ten CLR ad alanına eşleme. targetNamespace için '*' kullanılırsa, ilgili CLR ad alanına açık bir eşleme olmaksızın tüm targetNamespace'ler eşlenir. Varsayılan: Veri Anlaşmaları için şema belgesinin hedef ad alanından türetilir. Diğer tüm oluşturulan türler için varsayılan ad alanı kullanılır. (Kısa Biçim: -{0})
zh_hans: 从 WSDL 或 XML targetNamespace 到 CLR 命名空间的映射。如果将 "*" 用于 targetNamespace，会将没有显式映射的所有 targetNamespace 映射到该 CLR 命名空间。默认设置: 从数据协定架构文档的目标命名空间派生。默认命名空间用于所有其他生成的类型。(缩写: -{0})
zh_hant: 從 WSDL 或 XML 結構描述 targetNamespace 到 CLR 命名空間的對應。請將對應所有未明確對應到該 CLR 命名空間的 targetNamespaces 之 targetNamespace，使用 '*'。預設: 從資料合約之結構描述文件的目標命名空間衍生。會為所有其他產生的類型使用預設命名空間。(簡短形式: /{0})

# HelpNologo
source: Suppress the copyright and banner message.
cs: Potlačí zprávu o autorských právech a úvodní nápis.
de: Copyright- und Bannermeldung unterdrücken.
es: Suprimir el mensaje del copyright y del banner.
fr: Supprimer le message de copyright et de bannière.
it: Non visualizza le informazioni di copyright e il banner.
ja: 著作権とバナー メッセージを非表示にします。
ko: 저작권 및 배너 메시지를 표시하지 않습니다.
pl: Pomiń komunikat o prawach autorskich i baneru.
pt_br: Suprima a mensagem de direitos autorais e de identificação.
ru: Подавить вывод сообщения баннера и сообщения об авторском праве.
tr: Telif hakkı ve başlık iletisini gösterme.
zh_hans: 取消版权和标题消息。
zh_hant: 不顯示版權與橫幅訊息。

# HelpNostdlib
source: Do not reference standard libraries. By default mscorlib.dll and system.servicemodel.dll are referenced.
cs: Neodkazovat na standardní knihovny. Ve výchozím nastavení se odkazuje na knihovny mscorlib.dll a system.servicemodel.dll.
de: Referenziert keine Standardbibliotheken. Standardmäßig werden "mscorlib.dll" und "system.servicemodel.dll" referenziert.
es: No haga referencia a bibliotecas estándar. De manera predeterminada, se hace referencia a mscorlib.dll y system.servicemodel.dll.
fr: Permet de ne pas référencer les bibliothèques standard. Par défaut, mscorlib.dll et system.servicemodel.dll sont référencés.
it: Non fa riferimento alle librerie standard. Per impostazione predefinita, viene fatto riferimento a mscorlib.dll e system.servicemodel.dll.
ja: 標準ライブラリを参照しません。既定では、mscorlib.dll および system.servicemodel.dll が参照されます。
ko: 표준 라이브러리를 참조하지 마세요. 기본적으로 mscorlib.dll 및 system.servicemodel.dll이 참조됩니다.
pl: Nie odwołuj się do bibliotek standardowych. Domyślnie odwołania do bibliotek mscorlib.dll i system.servicemodel.dll są przywoływane.
pt_br: Não referenciar bibliotecas padrão. Por padrão, mscorlib.dll e system.servicemodel.dll são referenciados.
ru: Не ссылаться на стандартные библиотеки. По умолчанию используются ссылки на mscorlib.dll и system.servicemodel.dll.
tr: Standart kitaplıklara başvurmayın. Varsayılan olarak mscorlib.dll ve system.servicemodel.dll'ye başvurulur.
zh_hans: 请勿引用标准库。默认情况下，会引用 mscorlib.dll 和 system.servicemodel.dll。
zh_hant: 不參考標準程式庫。預設會參考 mscorlib.dll 和 system.servicemodel.dll。

# HelpOptions
source: Options:
cs: Parametry:
de: Optionen:
es: Opciones:
it: Opzioni:
ja: オプション:
ko: 옵션:
pl: Opcje:
pt_br: Opções:
ru: Параметры:
tr: Seçenekler:
zh_hans: 选项:
zh_hant: 選項:

# HelpOut
source: The filename for the generated code. Default: derived from the WSDL definition name, WSDL service name or targetNamespace of one of the schemas. (Short Form: -{0})
cs: Název souboru pro vygenerovaný kód. Výchozí: odvozeno z názvu definice WSDL, názvu služby WSDL nebo targetNamespace jednoho ze schémat. (Krátký tvar: -{0})
de: Der Dateiname für den generierten Code. Standard: abgeleitet vom WSDL-Definitionsnamen, WSDL-Dienstnamen oder targetNamespace eines der Schemas. (Kurzform: -{0})
es: El nombre de archivo del código generado. Valor predeterminado: derivado del nombre de definición de WSDL, el nombre de servicio WSDL o el targetNamespace de uno de los esquemas. (Forma corta: /{0})
fr: Nom de fichier du code généré. Valeur par défaut : valeur dérivée du nom de définition WSDL, du nom de service WSDL ou du targetNamespace d'un des schémas. (Forme abrégée : /{0})
it: Il nome del file per il codice generato. Impostazione predefinita: derivata dal nome della definizione WSDL, dal nome del servizio WSDL o dall'elemento targetNamespace di uno degli schemi. (Forma breve: -{0})
ja: 生成されたコードのファイル名です。既定: いずれかのスキーマの WSDL 定義名、WSDL サービス名、targetNamespace から派生します。(短い形式: -{0})
ko: 생성된 코드의 파일 이름입니다. 기본값: WSDL 정의 이름, WSDL 서비스 이름 또는 스키마 중 하나의 targetNamespace에서 파생됩니다. (약식: -{0})
pl: Nazwa pliku wygenerowanego kodu. Domyślnie: na podstawie nazwy definicji pliku WSDL, nazwy usługi WSDL lub przestrzeni nazw targetNamespace jednego ze schematów. (Krótka wersja: —{0})
pt_br: O nome do arquivo do código gerado. Padrão: derivado do nome da definição WSDL, do nome do serviço WSDL ou do targetNamespace de um dos esquemas. (Forma Abreviada: -{0})
ru: Имя файла для сформированного кода. По умолчанию: получается из имени определения WSDL, имени службы WSDL или пространства имен targetNamespace одной из схем. (Краткая форма: -{0})
tr: Oluşturulan kodun dosya adı. Varsayılan: WSDL tanım adı, WSDL hizmet adı veya şemalardan birinin targetNamespace değerinden türetilir. (Kısa Biçim: -{0})
zh_hans: 所生成代码的文件名。默认设置: 从某种架构的 WSDL 定义名称、WSDL 服务名称或 targetNamespace 派生。(缩写: -{0})
zh_hant: 產生的程式碼的檔案名稱。預設: 從其中一個結構描述的 WSDL 定義名稱、WSDL 服務名稱或 targetNamespace 衍生。(簡短形式: -{0})

# HelpReferenceCodeGeneration
source: Reference types in the specified assembly. When generating clients, use this option to specify assemblies that might contain types representing the metadata being imported. (Short Form: -{0})
cs: Odkazové typy v zadaném sestavení. Při generování klientů pomocí tohoto parametru zadejte sestavení, která mohou obsahovat typy představující importovaná metadata. (Krátký tvar: -{0})
de: Verweistypen in der angegebenen Assembly. Verwenden Sie diese Option beim Generieren von Clients, um Assemblys anzugeben, die möglicherweise Typen enthalten, die die importierten Metadaten darstellen. (Kurzform: -{0})
es: Tipos de referencia en el ensamblado especificado. Al generar clientes, use esta opción para especificar ensamblados que pueden contener tipos que representan los metadatos que se están importando. (Forma corta: /{0})
fr: Permet de référencer les types dans l'assembly spécifié. Au moment de générer les clients, utilisez cette option pour spécifier les assemblys qui peuvent contenir des types représentant les métadonnées importées. (Forme abrégée : /{0})
it: Tipi di riferimento nell'assembly specificato. Quando si generano i client, usare questa opzione per specificare gli assembly che potrebbero contenere tipi che rappresentano i metadati da importare. (Forma breve: -{0})
ja: 指定したアセンブリ内の型を参照します。クライアントを生成する際、インポート中のメタデータを表す型が含まれる可能性のあるアセンブリを指定する場合に、このオプションを使用します。(短い形式: -{0})
ko: 지정된 어셈블리의 참조 형식입니다. 클라이언트를 생성할 때 이 옵션을 사용하여 가져오는 메타데이터를 나타내는 형식이 포함되었을 수 있는 어셈블리를 지정하세요. (약식: -{0})
pl: Typy referencyjne w określonym zestawie. Podczas generowania klientów użyj tej opcji, aby określić zestawy, które mogą zawierać typy reprezentujące importowane metadane. (Krótka wersja: —{0})
pt_br: Tipo de referência no assembly especificado. Ao gerar clientes, use essa opção para especificar assemblies que possam conter tipos que representam os metadados sendo importados. (Forma Abreviada: -{0})
ru: Ссылочные типы в указанной сборке. При формировании клиентов используйте этот параметр для указания сборок, которые могут содержать типы, представляющие импортируемые метаданные. (Краткая форма: -{0})
tr: Belirtilen bütünleştirilmiş koddaki başvuru türleri. İstemci oluştururken, içeri aktarılmakta olan meta verileri temsil eden türleri içerebilecek bütünleştirilmiş kodlar belirtmek için bu seçeneği kullanın. (Kısa Biçim: -{0})
zh_hans: 指定程序集中的引用类型。生成客户端时，使用此选项指定可能包含代表正在导入的元数据的类型的程序集。(缩写: -{0})
zh_hant: 指定組件中的參考類型。產生用戶端時，請使用此選項來指定可能包含代表要匯入的中繼資料的類型的組件。(簡短形式: -{0})
