Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# NoCodeWasGenerated
source: No code was generated. If you were trying to generate a client, this could be because the metadata documents did not contain any valid contracts or services or because all contracts/services were discovered to exist in /reference assemblies. Verify that you passed all the metadata documents to the tool.
cs: Nebyl vygenerován žádný kód. Pokud jste se pokoušeli vygenerovat klienta, může k tomuto dojít v případě, že dokumenty metadat neobsahovaly žádné platné kontrakty ani služby, nebo bylo zjištěno, že všechny kontrakty nebo služby existují v sestaveních /reference. Ověřte, že jste nástroji předali všechny dokumenty metadat.
de: Es wurde kein Code generiert. Wenn Sie versucht haben, einen Client zu generieren, könnte die Ursache hierfür sein, dass die Metadatendokumente keine gültigen Verträge oder Dienste enthielten oder dass erkannt wurde, dass sich alle Verträge/Dienste in /reference-Assemblys befinden. Stellen Sie sicher, dass alle Metadatendokumente an das Tool übergeben wurden.
es: No se generó código. Si intentaba generar un cliente, es posible que se deba a que los documentos de metadatos no contenían contratos o servicios válidos, o bien porque se detectó que todos los contratos y servicios existen en los /ensamblados de referencia. Compruebe que pasó todos los documentos de metadatos a la herramienta.
fr: Aucun code n'a été généré. Si vous essayiez de générer un client, cela peut être dû au fait que les documents de métadonnées ne contenaient aucun service ou contrat valide ou que les contrats/services existaient déjà dans des assemblys de référence. Vérifiez que vous avez indiqué tous les documents de métadonnées à l'outil.
it: Nessun codice generato. Se si sta tentando di creare un client, ciò può essere dovuto al fatto che i documenti dei metadati non contengono contratti o servizi validi oppure tutti i contratti/servizi sono presenti negli assembly /reference. Verificare di aver passato tutti i documenti dei metadati allo strumento.
ja: コードは生成されませんでした。 クライアントを生成しようとしていた場合は、メタデータ ドキュメントに有効なコントラクトまたはサービスが含まれていなかったか、 すべてのコントラクト/サービスが /reference アセンブリ内に存在することが検出された可能性があります。すべてのメタデータ ドキュメントをツールに渡したことを確認してください。
ko: 코드가 생성되지 않았습니다. 클라이언트를 생성하려고 하는 경우 메타데이터 문서에 올바른 계약 또는 서비스가 포함되지 않았거나 모든 계약/서비스가 /reference assemblies에 있기 때문일 수 있습니다. 모든 메타데이터 문서를 도구에 전달했는지 확인하십시오.
pl: Nie wygenerowano żadnego kodu. Jeśli próbowano wygenerować klienta, może być to spowodowane przez dokumenty metadanych, które nie zawierały żadnych prawidłowych kontraktów lub usług, albo przez to, że wszystkie kontrakty/usługi zostały odnalezione jako istniejące w zestawach /reference. Upewnij się, że do narzędzia przekazano wszystkie dokumenty metadanych.
pt_br: Nenhum código foi gerado. Se você estivesse tentando gerar um cliente, isso poderia ocorrer porque os documentos de metadados não continham nenhum contrato nem serviço válido ou porque descobriu-se que todos os contratos/serviços existiam em assemblies /reference. Verifique se você passou todos os documentos de metadados à ferramenta.
ru: Код не сгенерирован. Если вы пытались сгенерировать клиент, причиной этого может быть то, что документы метаданных не содержат допустимых контрактов или служб, или все контракты и службы были обнаружены в сборках, указанных в параметре /reference. Убедитесь, что в программное средство переданы все документы метаданных.
tr: Kod oluşturulmadı. İstemci oluşturmaya çalışıyorsanız bunun nedeni meta veri belgelerinin geçerli anlaşma veya hizmetler içermemesi ya da bulunan tüm anlaşma ve hizmetlerin /reference bütünleştirilmiş kodlarında yer alması olabilir. Araca tüm meta veri belgelerini geçirdiğinizi doğrulayın.
zh_hans: 未生成任何代码。 如果尝试生成客户端，此问题可能是由于元数据文档中未包含任何有效的约定或服务所致， 或者由于发现所有约定/服务均存在于 /reference 程序集中所致。请验证是否已将所有元数据文档传递给工具。
zh_hant: 未產生任何程式碼。 若嘗試產生用戶端，這可能是因為中繼資料文件未包含任何有效的合約或服務，或因為所有 合約/服務被發現存在於 /reference 組件中。請確認您已將所有中繼資料文件傳遞給工具。

# ParametersCollectionType
source: <type>
cs: <typ>
ko: <형식>
ru: <тип>
tr: <tür>

# ParametersExcludeType
source: <type>
cs: <typ>
ko: <형식>
ru: <тип>
tr: <tür>

# ParametersOutputType
source: <output type>
cs: <typ výstupu>
fr: <type de sortie>
ko: <출력 형식>
ru: <тип выходных данных>
tr: <çıkış türü>

# ParametersTarget
source: <enum>
cs: <výčet>
ko: <열거>
ru: <перечисление>
tr: <sabit listesi>

source: Validation Error:
cs: Chyba ověření:
de: Validierungsfehler:
es: Error de validación:
fr: Erreur de validation :
it: Errore di convalida:
ja: 検証エラー:
ko: 유효성 검사 오류:
pl: Błąd weryfikacji:
pt_br: Erro de validação:
ru: Ошибка проверки:
tr: Doğrulama Hatası:
zh_hans: 验证错误:
zh_hant: 驗證錯誤:

# ValidationWasSuccessful
source: The Service '{0}' was validated with no errors
cs: Služba {0} byla ověřena bez chyb.
de: Der Dienst "{0}" wurde ohne Fehler validiert.
es: El servicio ''{0}'' se ha validado sin errores
fr: Le service «{0}» a été validé sans erreur
it: Il servizio '{0}' è stato convalidato senza errori
ja: サービス '{0}' の検証でエラーは見つかりませんでした
ko: 오류 없이 '{0}' 서비스의 유효성이 검사되었습니다.
pl: Usługa „{0}” została zweryfikowana bez błędów
pt_br: O Serviço '{0}' foi validado sem erros
ru: При проверке службы "{0}" не выявлено ошибок
tr: '{0}' Hizmeti hatasız doğrulandı
zh_hans: 服务“{0}”已经过验证，并且未出现任何错误
zh_hant: 已驗證服務 '{0}'，未發生任何錯誤

source: Warning:
cs: Upozornění:
de: Warnung:
es: Advertencia:
fr: Avertissement :
it: Avviso:
ja: 警告:
ko: 경고:
pl: Ostrzeżenie:
pt_br: Aviso:
ru: Предупреждение!
tr: Uyarı:
zh_hans: 警告:
zh_hant: 警告

# WrnCouldNotLoadTypesFromReferenceAssemblyAt
source: There were errors loading types in an assembly loaded from '{0}' some types in the assembly could not be loaded and will not be available to the tool.
cs: V sestavení načteném z {0} došlo k chybám při načítání typů. Některé typy v sestavení nebylo možné načíst a nástroj je nebude mít k dispozici.
de: Fehler beim Laden von Typen in einer von "{0}" geladenen Assembly. Einige Typen in der Assembly konnten nicht geladen werden und stehen dem Tool nicht zur Verfügung.
es: Se produjeron varios errores al cargar tipos en un ensamblado cargado desde ''{0}'', algunos tipos del ensamblado no se pudieron cargar y no estarán disponibles para la herramienta.
fr: Des erreurs se sont produites lors du chargement des types dans un assembly chargé à partir de «{0}», certains types de l’assembly n’ont pas pu être chargés et ne seront pas disponibles pour l’outil.
it: Si sono verificati errori durante il caricamento dei tipi in un assembly caricato da '{0}'. Non è stato possibile caricare nell'assembly alcuni tipi che non saranno disponibili per lo strumento.
ja: '{0}' から読み込まれたアセンブリ内の型を読み込み中にエラーが発生しました。アセンブリ内の一部の型を読み込めませんでした。これらの型はツールで使用できません。
ko: '{0}'에서 로드된 어셈블리에 있는 형식을 로드하는 동안 오류가 발생했습니다. 어셈블리에 있는 일부 형식을 로드할 수 없으므로 도구에서 해당 형식을 사용할 수 없습니다.
pl: Wystąpiły błędy podczas ładowania typów w zestawie załadowanym z elementu „{0}” nie można załadować niektórych typów w zestawie i nie będą one dostępne dla narzędzia.
pt_br: Erros ao carregar tipos em um assembly carregado de '{0}' alguns tipos no assembly não puderam ser carregados e não estarão disponíveis para a ferramenta.
ru: Произошли ошибки во время загрузки типов в сборки, загруженные из "{0}". Некоторые типы в сборке загрузить не удалось, и они будут недоступны для программного средства.
tr: '{0}' öğesinden yüklenen bir bütünleştirilmiş koddaki türler yüklenirken hatalar oluştu. Bütünleştirilmiş koddaki bazı türler yüklenemedi ve araç tarafından kullanılamayacak.
zh_hans: 加载从“{0}”加载的程序集中的类型时出错，此程序集中的某些类型可能无法加载，将无法供工具使用。
zh_hant: 載入從 '{0}' 載入的組件中的類型時發生錯誤，組件中的某些類型無法載入，因此無法供工具使用。

# WrnNoServiceContractTypes
source: Cannot generate XmlSerializer types for assembly: {0}. No service contract types were found.
cs: Nelze generovat typy XmlSerializer pro sestavení: {0}{ 0}. Nenašly se žádné typy kontraktů služeb.
de: XmlSerializer-Typen für Assembly {0} können nicht generiert werden. Es wurden keine Dienstvertragstypen gefunden.
es: No se pueden generar tipos XmlSerializer para el ensamblado: {0}. No se encontraron tipos de contrato de servicio.
fr: Impossible de générer des types XmlSerializer pour l’assembly : {0}. Aucun type de contrat de service n’a été trouvé.
it: Non è possibile generare tipi XmlSerializer per l'assembly: {0}. Non sono stati trovati tipi di contratto di servizio.
ja: アセンブリに対して XmlSerializer 型を生成できません: {0}。サービス コントラクト型が見つかりませんでした。
ko: 어셈블리 {0}에 대한 XmlSerializer 형식을 생성할 수 없습니다. 서비스 계약 유형을 찾을 수 없습니다.
pl: Nie można wygenerować typów XmlSerializer dla zestawu: {0}. Nie znaleziono typów kontraktów usług.
pt_br: Não é possível gerar tipos de XmlSerializer para assembly: {0}. Nenhum tipo de contrato de serviço foi encontrado.
ru: Не удается сформировать типы XmlSerializer для сборки: {0}. Типы контрактов служб не найдены.
tr: Bütünleştirilmiş kod için XmlSerializer türleri oluşturulamıyor: {0}. Hizmet anlaşması türü bulunamadı.
zh_hans: 无法为程序集生成 XmlSerializer 类型: {0}。未找到任何服务合约类型。
zh_hant: 無法產生組件的 XmlSerializer 類型: {0}。找不到服務合約類型。

# WrnNoXmlSerializerOperationBehavior
source: Cannot generate XmlSerializer for assembly: {0}. No service contract in the assembly has an operation with XmlSerializerOperationBehavior.
cs: Nelze generovat XmlSerializer pro sestavení: {0}. Žádný kontrakt služby v sestavení nemá operaci s XmlSerializerOperationBehavior.
de: Der XmlSerializer für die Assembly {0} kann nicht generiert werden Kein Dienstvertrag in der Assembly verfügt über einen Vorgang mit dem XmlSerializerOperationBehavior.
es: No se puede generar XmlSerializer para el ensamblado: {0}. Ningún contrato de servicio del ensamblado tiene una operación con XmlSerializerOperationBehavior.
fr: Impossible de générer XmlSerializer pour l’assembly : {0}. Aucun contrat de service dans l’assembly n’a une opération avec XmlSerializerOperationBehavior.
it: Non è possibile generare XmlSerializer per l'assembly {0}. Nessun contratto di servizio nell'assembly ha un'operazione con XmlSerializerOperationBehavior.
ja: アセンブリに対して XmlSerializer を生成できません: {0}。アセンブリ内のサービス コントラクトに XmlSerializerOperationBehavior を持つ操作がありません。
ko: 어셈블리 {0}에 대한 XmlSerializer를 생성할 수 없습니다. 어셈블리에 XmlSerializerOperationBehavior를 사용하는 작업이 있는 서비스 계약이 없습니다.
pl: Nie można wygenerować elementu XmlSerializer dla zestawu: {0}. Żaden kontrakt usługi w zestawie nie ma operacji z elementem XmlSerializerOperationBehavior.
pt_br: Não é possível gerar XmlSerializer para assembly: {0}. Nenhum contrato de serviço no assembly tem uma operação com XmlSerializerOperationBehavior.
ru: Не удается сформировать XmlSerializer для сборки: {0}. Ни один контракт служб в сборке не работает с XmlSerializerOperationBehavior.
tr: Bütünleştirilmiş kod için XmlSerializer oluşturulamıyor: {0}. Bütünleştirilmiş koddaki hiçbir hizmet anlaşmasının XmlSerializerOperationBehavior ile bir işlemi yok.
zh_hans: 无法为程序集生成 XmlSerializer: {0}。程序集中没有具有 XmlSerializerOperationBehavior 的操作的服务合约。
zh_hant: 無法產生組件的 XmlSerializer: {0}。組件中沒有任何服務合約具有 XmlSerializerOperationBehavior 的作業。

# WrnOptionConflictsWithInput
source: Option --{0} cannot be used with multiple input assemblies. Ignoring {0} option.
cs: Parametr --{0} nelze použít s více vstupními sestaveními. Ignoruje se parametr {0}.
de: Die Option --{0} kann nicht mit mehreren Eingabeassemblys verwendet werden. Die {0}-Option wird ignoriert.
es: Opción:{0} no se puede usar con varios ensamblados de entrada. Omitiendo la opción {0}.
fr: Option --{0} ne peut pas être utilisé avec plusieurs assemblys d’entrée. Option {0} ignorée.
it: Opzione --{0} non può essere usato con più assembly di input. L'opzione{0} verrà ignorata.
ja: オプション --{0} は、複数の入力アセンブリで使用できません。{0} オプションを無視します。
ko: 옵션 --{0}은(는) 여러 입력 어셈블리와 함께 사용할 수 없습니다. {0} 옵션을 무시합니다.
pl: Opcja --{0} nie może być używana z wieloma zestawami danych wejściowych. Opcja ignorowana {0}.
pt_br: A opção --{0}não pode ser usada com vários assemblies de entrada. Ignorando opção {0}.
ru: Параметр --{0} нельзя использовать с несколькими входными сборками. Параметр {0} игнорируется.
tr: --{0} seçeneği birden çok giriş bütünleştirilmiş koduyla kullanılamaz. {0} seçeneği yoksayılıyor.
zh_hans: 选项 --{0} 不能与多个输入程序集一起使用。忽略 {0} 选项。
zh_hant: 選項 --{0} 無法與多個輸入組件一起使用。正在忽略 {0} 選項。

# WrnToolIsUsedDirectly
source: This tool is not intended to be used directly.
cs: Tento nástroj není určen k přímému použití.
de: Dieses Tool ist nicht für die direkte Verwendung vorgesehen.
es: Esta herramienta no está pensada para usarse directamente.
fr: Cet outil n’est pas destiné à être utilisé directement.
it: Questo strumento non è destinato a essere usato direttamente.
ja: このツールは、直接使用することを意図したものではありません。
ko: 이 도구는 직접 사용할 수 없습니다.
pl: To narzędzie nie jest przeznaczone do bezpośredniego użycia.
pt_br: Esta ferramenta não deve ser usada diretamente.
ru: Это программное средство не предназначено для непосредственного использования.
tr: Bu aracın doğrudan kullanılması amaçlanmamıştır.
zh_hans: 不应直接使用此工具。
zh_hant: 此工具並非意欲直接使用。

# WrnUnableToLoadContractForSGen
source: There was an error loading a contract type. Cannot generate XmlSerializer types for this contract. Type: {0} Details:{1}
cs: Při načítání typu kontraktu došlo k chybě. Nelze generovat typy XmlSerializer pro tento kontrakt. Typ: {0} Podrobnosti: {1}
de: Fehler beim Laden eines Vertragstyps. XmlSerializer-Typen für diesen Vertrag können nicht generiert werden. Typ: {0} Details: {1}
es: Error al cargar un tipo de contrato. No se pueden generar tipos XmlSerializer para este contrato. Tipo: {0} Detalles:{1}
fr: Une erreur s’est produite lors du chargement d’un type de contrat. Impossible de générer des types XmlSerializer pour ce contrat. Type : {0} Détails : {1}
it: Si è verificato un errore durante il caricamento di un tipo di contratto. Non è possibile generare tipi XmlSerializer per questo contratto. Tipo: {0} Dettagli:{1}
ja: コントラクト型の読み込み中にエラーが発生しました。このコントラクトの XmlSerializer 型を生成できません。 型: {0} 詳細: {1}
ko: 계약 형식을 로드하는 동안 오류가 발생했습니다. 이 계약에 대한 XmlSerializer 형식을 생성할 수 없습니다. 형식: {0} 세부 정보:{1}
pl: Wystąpił błąd podczas ładowania typu kontraktu. Nie można wygenerować typów XmlSerializer dla tego kontraktu. Typ: {0} Szczegóły: {1}
pt_br: Erro ao carregar um tipo de contrato. Não é possível gerar tipos XmlSerializer para este contrato. Tipo: {0} Detalhes:{1}
ru: Произошла ошибка при загрузке типа контракта. Не удается сформировать типы XmlSerializer для этого контракта. Тип: {0} Сведения:{1}
tr: Anlaşma türü yüklenirken bir hata oluştu. Bu anlaşma için XmlSerializer türleri oluşturulamıyor. Tür: {0} Ayrıntılar:{1}
zh_hans: 加载合约类型时出错。无法为此合约生成 XmlSerializer 类型。 类型: {0} 详细信息:{1}
zh_hant: 載入合約類型時發生錯誤。無法產生此合約的 XmlSerializer 類型。 類型: {0} 詳細資料: {1}

# WrnVJSharpNamespace
source: When using the '--{0}:{1}' argument, only one namespace mapping is supported. Use '--{2}:*,<string>' to set the namespace.
cs: Při použití argumentu --{0}:{1} se podporuje jenom jedno mapování oboru názvů. K nastavení oboru názvů použijte --{2}:*,<string>.
de: Bei Verwendung des Arguments "--{0}:{1}" wird nur eine Namespacezuordnung unterstützt. Legen Sie mithilfe von "--{2}:*,<string>" den Namespace fest.
es: Cuando se usa el argumento ''--{0}:{1}'', solo se admite una asignación de espacio de nombres. Use "--{2}:*,<string>" para establecer el espacio de nombres.
fr: Lors de l’utilisation de l’argument « --{0}:{1}», un seul mappage d’espace de noms est pris en charge. Utilisez '--{2} :*,<string>' pour définir l’espace de noms.
it: Quando si usa l'argomento '--{0}:{1}', è supportato un solo mapping dello spazio dei nomi. Usare '--{2}:*,<string>' per impostare lo spazio dei nomi.
ja: '--{0}:{1}' 引数を使用する場合、1 つの名前空間マッピングのみがサポートされます。'--{2}:*,<string>' を使用して、名前空間を設定します。
ko: '--{0}:{1}' 인수를 사용하는 경우 하나의 네임스페이스 매핑만 지원됩니다. '--{2}:*,<string>'을 사용하여 네임스페이스를 설정합니다.
pl: W przypadku używania argumentu „--{0}:{1}” obsługiwane jest tylko jedno mapowanie przestrzeni nazw. Użyj polecenia „--{2}:*,<string>”, aby ustawić przestrzeń nazw.
pt_br: Ao usar o argumento '--{0}:{1}', há suporte para apenas um mapeamento de namespace. Use '--{2}:*,<string>' para definir o namespace.
ru: При использовании аргумента "--{0}:{1}" поддерживается только одно сопоставление пространства имен. Используйте "--{2}:*,<string>", чтобы задать пространство имен.
tr: '--{0}:{1}' bağımsız değişkeni kullanılırken yalnızca bir ad alanı eşlemesi desteklenir. Ad alanını ayarlamak için '--{2}:*,<string>' kullanın.
zh_hans: 使用“--{0}:{1}”参数时，仅支持一个命名空间映射。使用“--{2}:*,<string>”设置命名空间。
zh_hant: 使用 '--{0}:{1}' 引數時，只支援一個命名空間對應。使用 '--{2}:*,<string>' 來設定命名空間。
