Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpReferenceOther
source: Add the specified assembly to the set of assemblies used for resolving type references. If you are exporting or validating a service that uses 3rd-party extensions (Behaviors, Bindings and BindingElements) registered in config use this option to locate extension assemblies that are not in the GAC. (Short Form: -{0})
cs: Přidejte zadané sestavení do sady sestavení, která se používají k překladu odkazů na typy. Pokud exportujete nebo ověřujete službu, která používá rozšíření třetích stran (Behaviors, Bindings a BindingElements) zaregistrovaná v konfiguraci, použijte tento parametr k vyhledání sestavení rozšíření, která nejsou v globální mezipaměti sestavení (GAC). (Krátký tvar: -{0})
de: Fügt die angegebene Assembly dem Satz von Assemblys hinzu, die zum Auflösen von Typverweisen verwendet werden. Beim Exportieren oder Validieren eines Diensts, der Erweiterungen von Drittanbietern verwendet, (Verhalten, Bindungen und BindingElements), die in der Konfigurationsdatei registriert sind, geben Sie mithilfe dieser Option den Ort von Erweiterungsassemblys an, die sich nicht im GAC befinden. (Kurzform: -{0})
es: Agregue el ensamblado especificado al conjunto de ensamblados usados para resolver referencias de tipo. Si va a exportar o validar un servicio que usa extensiones de terceros (comportamientos, enlaces y BindingElements) registrados en la configuración, use esta opción para buscar ensamblados de extensión que no están en la GAC. (Forma corta: /{0})
fr: Ajoutez l’assembly spécifié à l’ensemble d’assemblys utilisé pour résoudre les références de type. Si vous exportez ou validez un service qui utilise des extensions tierces (Behaviors, Bindings et BindingElements) inscrites dans la configuration, utilisez cette option pour localiser les assemblys d’extension qui ne se trouvent pas dans le GAC. (Forme abrégée : /{0})
it: Aggiunge l'assembly specificato al set di assembly usato per risolvere i riferimenti di tipo. Se si esporta o si convalida un servizio che usa estensioni di terze parti (Behaviors, Bindings e BindingElements) registrate nella configurazione, usare questa opzione per individuare gli assembly delle estensioni che non sono incluse nel GAC. (Forma breve: -{0})
ja: 指定されたアセンブリを、型の参照の解決に使用されるアセンブリのセットに追加します。構成に登録されているサード パーティ製の拡張機能 (Behaviors、Bindings、BindingElements) を使用するサービスをエクスポートまたは検証する場合は、このオプションを使用して GAC にない拡張アセンブリを検索します。(短い形式: -{0})
ko: 형식 참조를 확인하는 데 사용되는 어셈블리 집합에 지정된 어셈블리를 추가합니다. 구성에 등록된 제3자 확장(Behaviors, Bindings 및 BindingElements)을 사용하는 서비스를 내보내거나 유효성을 검사하는 경우 이 옵션을 사용하여 GAC에 없는 확장 어셈블리를 찾습니다. (약식: -{0})
pl: Dodaj określony zestaw do zestawu zestawów używanych do rozpoznawania odwołań do typów. Jeśli eksportujesz lub walidujesz usługę, która korzysta z rozszerzeń innych firm (Behaviors, Bindings i BindingElements) zarejestrowanych w konfiguracji, użyj tej opcji, aby zlokalizować zespoły rozszerzeń, które nie znajdują się w pliku GAC. (Krótka wersja: —{0})
pt_br: Adicione o assembly especificado ao conjunto de assemblies usados para resolver referências de tipo. Se você estiver exportando ou validando um serviço que usa extensões de terceiros (Comportamentos, Associações e BindingElements) registrados na configuração, use essa opção para localizar assemblies de extensão que não estão no GAC. (Forma Abreviada: -{0})
ru: Добавление указанных сборок в набор сборок, используемых для разрешения ссылок типов. В случае экспорта или проверки службы, использующей расширения сторонних поставщиков (поведение, привязки и элементы BindingElement), зарегистрированные в конфигурации, используйте этот параметр для определения расположения сборок расширений, которые не входят в глобальный кэш сборок. (Краткая форма: -{0})
tr: Belirtilen bütünleştirilmiş kodu tür başvurularını çözümlemek için kullanılan bütünleştirilmiş kodlar kümesine ekleyin. Yapılandırmada kayıtlı 3. taraf uzantıları (Behaviors, Bindings ve BindingElements) kullanan bir hizmeti dışarı aktarıyor veya doğruluyorsanız GAC'de olmayan uzantı bütünleştirilmiş kodlarını bulmak için bu seçeneği kullanın. (Kısa Biçim: -{0})
zh_hans: 将指定的程序集添加到用于解析类型引用的程序集的集合。若要导出或验证使用在配置中注册的三方扩展(Behaviors、Bindings 和 BindingElements)的服务，请使用此选项定位不在 GAC 中的扩展程序集。(缩写: -{0})
zh_hant: 將指定的組件新增到用來解析類型參考的一組組件。如果您要匯出或驗證使用在設定中登錄的第三方延伸模組 (Behaviors、Bindings 和 BindingElements) 的服務，請使用此選項來尋找不在 GAC 中的延伸模組組件。(簡短形式: -{0})

# HelpTargetOutputType
source: The target output for the tool: {0}, {1} or {2}.
cs: Cílový výstup nástroje: {0}, {1} nebo {2}.
de: Die Zielausgabe für das Tool: {0}, {1} oder {2}.
es: Salida de destino de la herramienta: {0}, {1} o {2}.
fr: Sortie cible de l’outil : {0}, {1} ou {2}.
it: Output di destinazione per lo strumento: {0}, {1} o {2}.
ja: ツールのターゲット出力: {0}、{1}、または {2}。
ko: 도구에 대한 대상 출력: {0}, {1} 또는 {2}.
pl: Docelowe dane wyjściowe narzędzia: {0}, {1} lub {2}.
pt_br: A saída de destino da ferramenta: {0}, {1} ou {2}.
ru: Целевые выходные данные для программного средства: {0}, {1} или {2}.
tr: Aracın hedef çıkışı: {0}, {1} veya {2}.
zh_hans: 工具的目标输出: {0}、{1} 或 {2}。
zh_hant: 工具的目標輸出: {0}、{1} 或 {2}。

# HelpUsage1
source: USES:
cs: POUŽITÍ:
de: VERWENDUNGEN:
es: USOS:
fr: UTILISATIONS :
it: UTILIZZI:
ja: 使用目的:
ko: 용도:
pl: ZASTOSOWANIA:
pt_br: USOS:
ru: ИСПОЛЬЗОВАНИЕ:
tr: ŞUNU KULLANIR:
zh_hans: 用法:
zh_hant: 使用:

# HelpUsage2
source: - Generate code from running services or static metadata documents.
cs: - Vygeneruje kód ze spuštěných služeb nebo dokumentů statických metadat.
de: – Generiert Code aus Diensten, die ausgeführt werden, oder aus statischen Metadatendokumenten.
es: - Generar código a partir de servicios en ejecución o documentos de metadatos estáticos.
fr: - Générer du code à partir des services en cours d'exécution ou des documents de métadonnées statiques.
it: - Genera il codice da servizi in esecuzione o documenti dei metadati statici.
ja: - 実行中のサービスまたは静的なメタデータ ドキュメントからコードを生成します。
ko: - 실행 중인 서비스 또는 정적 메타데이터 문서에서 코드를 생성합니다.
pl: — Generowanie kodu z uruchomionych usług lub statycznych dokumentów metadanych.
pt_br: - Gere código de serviços em execução ou documentos de metadados estáticos.
ru: — генерация кода из выполняемых служб или статических документов метаданных.
tr: - Çalışmakta olan hizmetlerden veya statik meta veri belgelerinden kod oluşturun.
zh_hans: - 通过正在运行的服务或静态元数据文档生成代码。
zh_hant: - 從執行中服務或靜態中繼資料文件產生程式碼。

# HelpUsage3
source: - Export metadata documents from compiled code.
cs: - Exportuje dokumenty metadat z kompilovaného kódu.
de: – Exportiert Metadatendokumente aus kompiliertem Code.
es: - Exportar documentos de metadatos a partir de código compilado.
fr: - Exporter des documents de métadonnées à partir de code compilé.
it: - Esporta documenti dei metadati da codice compilato.
ja: - コンパイルされたコードからメタデータ ドキュメントをエクスポートします。
ko: - 컴파일된 코드에서 메타데이터 문서를 내보냅니다.
pl: — Eksportuj dokumenty metadanych ze skompilowanego kodu.
pt_br: - Exportar documentos de metadados do código compilado.
ru: — экспорт документов метаданных из компилированного кода.
tr: - Derlenmiş koddaki meta veri belgelerini dışarı aktarın.
zh_hans: - 通过已编译的代码导出元数据文档。
zh_hant: - 從已編譯的程式碼匯出中繼資料文件。

# HelpUsage4
source: - Validate compiled service code.
cs: - Ověřte zkompilovaný kód služby.
de: – Validiert kompilierten Dienstcode.
es: - Validar código de servicio compilado.
fr: - Valider le code de service compilé.
it: - Convalida il codice del servizio compilato.
ja: - コンパイルされたサービス コードを検証します。
ko: - 컴파일된 서비스 코드의 유효성을 검사합니다.
pl: — Zweryfikuj skompilowany kod usługi.
pt_br: - Validar código de serviço compilado.
ru: — проверка компилированного кода службы.
tr: - Derlenmiş hizmet kodunu doğrulayın.
zh_hans: - 验证已编译的服务代码。
zh_hant: - 驗證已編譯的服務程式碼。

# HelpUsage5
source: - Download metadata documents from running services.
cs: - Umožňuje stáhnout dokumenty metadat ze spuštěných služeb.
de: – Lädt Metadatendokumente von Diensten, die ausgeführt werden, herunter.
es: - Descargar documentos de metadatos de los servicios en ejecución.
fr: - Télécharger les documents de métadonnées à partir de services en cours d'exécution.
it: - Scarica i documenti dei metadati dai servizi in esecuzione.
ja: - 実行中のサービスからメタデータ ドキュメントをダウンロードします。
ko: - 실행 중인 서비스에서 메타데이터 문서를 다운로드합니다.
pl: — Pobieranie dokumentów metadanych z uruchomionych usług.
pt_br: - Baixar documentos de metadados de serviços em execução.
ru: — скачивание документов метаданных из выполняемых служб.
tr: - Çalışan hizmetlerden meta veri belgelerini indirin.
zh_hans: - 通过正在运行的服务下载元数据文档。
zh_hant: - 從執行中服務下載中繼資料文件。

# HelpUsage6
source: - Pre-generate serialization code.
cs: - Předběžně vygenerujte serializační kód.
de: – Generiert Serialisierungscode vor.
es: - Generar previamente código de serialización.
fr: - Pré-générer le code de sérialisation.
it: - Pregenera il codice di serializzazione.
ja: - シリアル化コードを事前に生成します。
ko: - serialization 코드를 미리 생성합니다.
pl: — Wstępnie wygeneruj kod serializacji.
pt_br: – Pré-gerar código de serialização.
ru: — генерация предварительного кода сериализации.
tr: - Serileştirme kodunu önceden oluşturun.
zh_hans: - 预生成序列化代码。
zh_hant: - 預先產生序列化程式碼。

# HelpValidationCategory
source: -= SERVICE VALIDATION =-
cs: -= OVĚŘENÍ SLUŽBY =-
de: -= DIENSTVALIDIERUNG =-
es: -= VALIDACIÓN DE SERVICIOS =-
fr: -= VALIDATION DU SERVICE =-
it: -= CONVALIDA DEL SERVIZIO =-
ja: -= サービスの検証 =-
ko: -= 서비스 유효성 검사 =-
pl: -= WALIDACJA USŁUGI =-
pt_br: -= VALIDAÇÃO DE SERVIÇO =-
ru: -= ПРОВЕРКА СЛУЖБЫ =-
tr: -= HIZMET DOĞRULAMA =-
zh_hans: -= 服务验证 =-
zh_hant: -= 服務驗證 =-

# HelpValidationDescription
source: Description: Validation is useful to detect errors in service implementations without hosting the service. You must use the --{0} option to indicate the service you would like to validate.
cs: Popis: Ověření je užitečné k detekci chyb v implementacích služby bez hostování služby. Pokud chcete označit službu, kterou chcete ověřit, musíte použít parametr --{0}.
de: Beschreibung: Die Überprüfung ist nützlich, um Fehler in Dienstimplementierungen zu erkennen, ohne den Dienst zu hosten. Sie müssen die Option --{0} verwenden, um den Dienst anzugeben, den Sie überprüfen möchten.
es: Descripción: La validación es útil para detectar errores en implementaciones de servicio sin hospedar el servicio. Debe usar la opción --{0} para indicar el servicio que desea validar.
fr: Description : La validation est utile pour détecter les erreurs dans les implémentations de service sans héberger le service. Vous devez utiliser l’option --{0} pour indiquer le service que vous souhaitez valider.
it: Descrizione: la convalida è utile per rilevare gli errori nelle implementazioni dei servizi senza ospitare il servizio. È necessario usare l'opzione --{0} per indicare il servizio da convalidare.
ja: 説明: 検証は、サービスをホストすることなくサービス実装のエラーを検出するのに役立ちます。検証するサービスを指定するには、--{0} オプションを使用する必要があります。
ko: 설명: 유효성 검사는 서비스를 호스트하지 않고 서비스 구현에서 오류를 검색하는 데 유용합니다. --{0} 옵션을 사용하여 유효성을 검사할 서비스를 나타내야 합니다.
pl: Opis: walidacja jest przydatna do wykrywania błędów w implementacjach usług bez hostowania usługi. Musisz użyć opcji --{0} w celu wskazania usługi, którą chcesz zweryfikować.
pt_br: Descrição: a validação é útil para detectar erros em implementações de serviço sem hospedar o serviço. Você deve usar a opção{0} para indicar o serviço que deseja validar.
ru: Описание: Проверка полезна для обнаружения ошибок в реализации служб без предоставления службе удаленного доступа. Необходимо использовать параметр --{0}, чтобы указать службу, которую вы хотите проверить.
tr: Açıklama: Doğrulama, hizmeti barındırmadan hizmet uygulamalarındaki hataları algılamak için faydalıdır. Doğrulamak istediğiniz hizmeti belirtmek için --{0} seçeneğini kullanabilirsiniz.
zh_hans: 描述: 在不托管服务的情况下，验证检测服务实现中的错误很有用。必须使用 --{0} 选项来指示要验证的服务。
zh_hant: 描述: 驗證很實用，可以偵測服務實作中的錯誤，而不需要裝載服務。您必須使用 --{0} 選項來指出要驗證的服務。

# HelpValidationExcludeTypeExport
source: The fully-qualified or assembly-qualified name of a service type to exclude from validation. (Short Form: -{0})
cs: Plně kvalifikovaný název nebo název kvalifikovaný pro sestavení typu služby, který se má vyloučit z ověřování. (Krátký tvar: -{0})
de: Der vollqualifizierte Name oder der qualifizierte Assemblyname eines Diensttyps, der von der Validierung ausgeschlossen werden soll. (Kurzform: -{0})
es: Nombre completo o calificado por el ensamblado de un tipo de servicio que se va a excluir de la validación. (Forma corta: /{0})
fr: Nom qualifié complet ou qualifié d’assembly d’un type de service à exclure de la validation. (Forme abrégée : /{0})
it: Nome di tipo completamente qualificato o qualificato dall'assembly di un tipo di servizio da escludere dalla convalida. (Forma breve: -{0})
ja: 検証から除外するサービス型の完全修飾またはアセンブリ修飾名です。(短い形式: -{0})
ko: 유효성 검사에서 제외할 서비스 유형의 정규화된 이름 또는 정규화된 어셈블리 이름입니다. (약식: -{0})
pl: W pełni kwalifikowana lub kwalifikowana nazwa typu usługi do wykluczenia z walidacji. (Krótka wersja: —{0})
pt_br: O nome totalmente qualificado ou qualificado por assembly de um tipo de serviço a ser excluído da validação. (Forma Abreviada: -{0})
ru: Полное имя или имя типа службы, определенное с помощью сборки, которое следует исключить из списка проверки. (Краткая форма: -{0})
tr: Doğrulamadan dışlanacak bir hizmet türünün tam veya bütünleştirilmiş kodla nitelenmiş adı. (Kısa Biçim: -{0})
zh_hans: 要从验证中排除的服务类型的完全限定的名称或程序集限定的名称。(缩写: -{0})
zh_hant: 要從驗證排除的完整服務型別名稱或符合組件規格的服務型別名稱。(簡短形式: -{0})

# HelpValidationSyntax
source: Syntax: {0} --{1} --{2}:{3} {4}*
cs: Syntaxe: {0} --{1} --{2}:{3} {4}*
es: Sintaxis: {0} --{1} --{2}:{3} {4}*
fr: Syntaxe : {0} --{1} --{2}:{3} {4}*
it: Sintassi: {0} --{1} --{2}:{3} {4}*
ja: 構文: {0} --{1} --{2}:{3} {4}*
ko: 구문: {0} --{1} --{2}:{3} {4}*
pl: Składnia: {0} --{1} --{2}:{3} {4}*
ru: Синтаксис: {0} --{1} --{2}:{3} {4}*
tr: Söz Dizimi: {0} --{1} --{2}:{3} {4}*
zh_hans: 语法: {0} --{1} --{2}:{3} {4}*
zh_hant: 語法: {0} --{1} --{2}:{3} {4}*

# HelpValidationSyntaxInput1
source: The path to an assembly containing service types to be validated. The assembly must have an associated config file to provide service configuration. Standard command-line wildcards can be used to provide multiple assemblies.
cs: Cesta k sestavení obsahujícímu typy služeb, které se mají ověřit. Sestavení musí mít přidružený konfigurační soubor pro zajištění konfigurace služby. K zadání více sestavení lze použít standardní zástupné znaky příkazového řádku.
de: Der Pfad zu einer Assembly, die zu überprüfende Diensttypen enthält. Der Assembly muss eine Konfigurationsdatei zugeordnet sein, um die Dienstkonfiguration bereitzustellen. Standard-Befehlszeilenplatzhalter können verwendet werden, um mehrere Assemblys bereitzustellen.
es: Ruta de acceso a un ensamblado que contiene los tipos de servicio que se van a validar. El ensamblado debe tener un archivo de configuración asociado para proporcionar la configuración del servicio. Los caracteres comodín estándar de la línea de comandos se pueden usar para proporcionar varios ensamblados.
fr: Chemin d’accès à un assembly contenant les types de service à valider. L’assembly doit avoir un fichier de configuration associé pour fournir la configuration du service. Les caractères génériques de ligne de commande standard peuvent être utilisés pour fournir plusieurs assemblys.
it: Il percorso di un assembly contenente i tipi di servizio da convalidare. L'assembly deve avere un file di configurazione associato per fornire la configurazione del servizio. I caratteri jolly standard della riga di comando possono essere usati per fornire più assembly.
ja: 検証するサービス型を含むアセンブリへのパス。サービス構成を指定するには、アセンブリに構成ファイルが関連付けられている必要があります。標準コマンドライン ワイルドカードを使用して、複数のアセンブリを指定できます。
ko: 유효성을 검사할 서비스 유형을 포함하는 어셈블리의 경로입니다. 서비스 구성을 제공하려면 어셈블리에 연결된 구성 파일이 있어야 합니다. 표준 명령줄 와일드카드를 사용하여 여러 어셈블리를 제공할 수 있습니다.
pl: Ścieżka do zestawu zawierającego typy usług, które mają zostać zwalidowane. Zestaw musi mieć skojarzony plik konfiguracji, aby zapewnić konfigurację usługi. Standardowe symbole wieloznaczne wiersza polecenia mogą być używane do dostarczania wielu zestawów.
pt_br: O caminho para um assembly que contém tipos de serviço a serem validados. O assembly deve ter um arquivo de configuração associado para fornecer a configuração do serviço. Curingas de linha de comando padrão podem ser usados para fornecer vários assemblies.
ru: Путь к сборке, содержащей типы служб, подлежащие проверке. Для конфигурации службы сборка должна иметь связанный файл конфигурации. Стандартные подстановочные знаки командной строки можно использовать для предоставления нескольких сборок.
tr: Doğrulanacak hizmet türlerini içeren bir bütünleştirilmiş kodun yolu. Hizmet yapılandırması sağlamak için bütünleştirilmiş kodun ilişkili bir yapılandırma dosyası olması gerekir. Standart komut satırı joker karakterleri birden çok bütünleştirilmiş kod sağlamak için kullanılabilir.
zh_hans: 包含要验证的服务类型的程序集的路径。程序集必须具有关联的配置文件才能提供服务配置。标准命令行通配符可用于提供多个程序集。
zh_hant: 包含要驗證的服務類型的組件路徑。組件必須有相關聯的設定檔，才能提供服務設定。標準命令列萬用字元可用來提供多個組件。

# HelpVersion30TargetClientVersion
source: Generate code that references functionality in .NET Framework assemblies 3.0 and before. Use this switch if you are generating code for clients that use .NET Framework version 3.0.(Short Form: -{0})
cs: Vygenerování kódu, který odkazuje na funkce v sestaveních využívajících .NET Framework 3.0 a dřívější verze. Tento přepínač použijte, pokud generujete kód pro klienty, kteří používají .NET Framework verze 3.0. (Krátký tvar: -{0})
de: Generieren Sie Code, der auf Funktionen in .NET Framework-Assemblys 3.0 und früher verweist. Verwenden Sie diese Option, wenn Sie Code für Clients generieren, die .NET Framework-Version 3.0 verwenden. (Kurzform: -{0})
es: Generar código que haga referencia a la funcionalidad en .NET Framework ensamblados 3.0 y versiones anteriores. Use este modificador si va a generar código para los clientes que usan .NET Framework versión 3.0. (Forma corta: -{0})
fr: Générez du code qui référence des fonctionnalités dans .NET Framework assemblys 3.0 et antérieurs. Utilisez ce commutateur si vous générez du code pour les clients qui utilisent .NET Framework version 3.0. (Forme abrégée : -{0})
it: Genera codice che fa riferimento a funzionalità presenti negli assembly di .NET Framework 3.0 e precedenti. Usare questa opzione se si genera codice per i client che usano .NET Framework versione 3.0. (Forma breve: -{0})
ja: .NET Framework アセンブリ 3.0 以前の機能を参照するコードを生成します。このスイッチは、.NET Framework バージョン 3.0 を使用するクライアント用のコードを生成する場合に使用します (短い形式: -{0})。
ko: .NET Framework 어셈블리 3.0 이전의 기능을 참조하는 코드를 생성합니다. .NET Framework 버전 3.0을 사용하는 클라이언트에 대한 코드를 생성하는 경우 이 스위치를 사용합니다(약식: -{0}).
pl: Generuj kod odwołujący się do funkcji w zestawach programu .NET Framework w wersji 3.0 lub nowszej. Użyj tego przełącznika, jeśli generujesz kod dla klientów korzystających z programu .NET Framework w wersji 3.0. (Krótka forma: -{0})
pt_br: Gerar código que faz referência à funcionalidade .NET Framework assemblies 3.0 e anteriores. Use essa opção se você estiver gerando código para clientes que usam .NET Framework versão 3.0. (Forma Abreviada: -{0})
ru: Создать код, который ссылается на функциональные возможности сборок .NET Framework 3.0 и более ранних версий. Используйте этот переключатель, если вы генерируете код для клиентов, которые используют платформу .NET Framework версии 3.0.( Краткая форма: -{0})
tr: .NET Framework bütünleştirilmiş kodları 3.0 ve öncesindeki işlevselliğe başvuran kod oluşturun. .NET Framework sürüm 3.0'ı kullanan istemciler için kod oluşturuyorsanız bu geçişi kullanın.(Kısa Form: -{0} )
zh_hans: 生成在 .NET Framework 程序集 3.0 及之前版本中引用功能的代码。如果要为使用 .NET Framework 版本 3.0 的客户端生成代码，请使用此开关。(短格式: -{0})
zh_hant: 產生參考 .NET Framework 組件 3.0 及更早版本中功能的程式碼。如果您要為使用 .NET Framework 3.0 版本的用戶端產生程式碼，請使用此參數。(簡短形式: -{0})

# HelpVersion35TargetClientVersion
source: Generate code that references functionality in .NET Framework assemblies 3.5 and before. Use this switch if you are generating code for clients that use .NET Framework version 3.5.(Short Form: -{0})
cs: Vygenerování kódu, který odkazuje na funkce v sestaveních využívajících .NET Framework 3.5 a dřívější verze. Tento přepínač použijte, pokud generujete kód pro klienty, kteří používají .NET Framework verze 3.5. (Krátký tvar: -{0})
de: Generieren Sie Code, der auf Funktionen in .NET Framework-Assemblys 3.5 und früher verweist. Verwenden Sie diese Option, wenn Sie Code für Clients generieren, die .NET Framework-Version 3.5 verwenden. (Kurzform: -{0})
es: Genere código que haga referencia a la funcionalidad en .NET Framework ensamblados 3.5 y versiones anteriores. Use este modificador si va a generar código para los clientes que usan .NET Framework versión 3.5. (Forma corta: -{0})
fr: Générez du code qui référence des fonctionnalités dans .NET Framework assemblys 3.5 et antérieurs. Utilisez ce commutateur si vous générez du code pour les clients qui utilisent .NET Framework version 3.5. (Forme abrégée : -{0})
it: Genera codice che fa riferimento a funzionalità presenti negli assembly di .NET Framework 3.5 e precedenti. Usare questa opzione se si genera codice per i client che usano .NET Framework versione 3.5. (Forma breve: -{0})
ja: .NET Framework アセンブリ 3.5 以前の機能を参照するコードを生成します。このスイッチは、.NET Framework バージョン 3. 5を使用するクライアント用のコードを生成する場合に使用します (短い形式: -{0})。
ko: .NET Framework 어셈블리 3.5 이전의 기능을 참조하는 코드를 생성합니다. .NET Framework 버전 3.5를 사용하는 클라이언트에 대한 코드를 생성하는 경우 이 스위치를 사용합니다(약식: -{0}).
pl: Wygeneruj kod odwołujący się do funkcji w zestawach platformy .NET Framework w wersji 3.5 lub nowszej. Użyj tego przełącznika, jeśli generujesz kod dla klientów korzystających z programu .NET Framework w wersji 3.5. (Krótka forma: -{0})
pt_br: Gerar código que faz referência à funcionalidade .NET Framework assemblies 3.5 e anteriores. Use essa opção se você estiver gerando código para clientes que usam .NET Framework versão 3.5. (Forma Abreviada: -{0})
ru: Создать код, который ссылается на функциональные возможности сборок .NET Framework 3.5 и более ранних версий. Используйте этот переключатель, если вы генерируете код для клиентов, которые используют платформу .NET Framework версии 3.5.( Краткая форма: -{0})
tr: .NET Framework bütünleştirilmiş kodları 3.5 ve öncesindeki işlevselliğe başvuran kod oluşturun. .NET Framework sürüm 3.5'i kullanan istemciler için kod oluşturuyorsanız bu anahtarı kullanın.(Kısa Form: -{0} )
zh_hans: 生成在 .NET Framework 程序集 3.5 及之前版本中引用功能的代码。如果要为使用 .NET Framework 版本 3.5 的客户端生成代码，请使用此开关。(短格式: -{0})
zh_hant: 產生參考 .NET Framework 組件 3.5 及更早版本中功能的程式碼。如果您要為使用 .NET Framework 3.5 版本的用戶端產生程式碼，請使用此參數。(簡短形式: -{0})

# HelpWrapped
source: Generated code will not unwrap "parameters" member of document-wrapped-literal messages.
cs: Vygenerovaný kód nebude rozbalovat člen parameters zpráv literálů zabalených do dokumentů.
de: Generierter Code entpackt nicht den parameters-Member von Literalnachrichten, die von einem Dokument umschlossen sind.
es: El código generado no desencapsulará el miembro "parameters" de los mensajes de literal encapsulados en un documento.
fr: Le code généré ne va pas annuler l'inclusion dans un wrapper des membres "parameters" des messages document-wrapped-literal.
it: Il codice generato non annullerà il wrapping del membro "parameters" dei messaggi document-wrapped-literal.
ja: 生成されたコードは、ドキュメント ラップ リテラル メッセージの "parameters" メンバーをラップ解除しません。
ko: 생성된 코드는 문서 래핑 리터럴 메시지의 "매개 변수" 멤버 래핑을 해제하지 않습니다.
pl: Wygenerowany kod nie będzie rozpakowywać składowej „parameters” z komunikatów w postaci literałów zapakowanych w dokumenty.
pt_br: O código gerado não desencapsulará o membro "parameters" das mensagens document-wrapped-literal.
ru: Созданный код не будет распаковывать член parameters сообщений с параметром "литерал на основе упакованного документа".
tr: Oluşturulan kod, belgede sarmalanmış sabit değer iletilerinin "parameters" üyesini sarmalamadan çıkarmaz.
zh_hans: 生成的代码将不会取消 document-wrapped-literal 消息的“参数”成员的封装。
zh_hant: 產生的程式碼不會解除包裝 document-wrapped-literal 訊息的 "parameters" 成員。
