Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ErrCouldNotLoadTypesFromAssemblyAt
source: Cannot load any types in assembly '{0}'.
cs: Nelze načíst žádné typy v sestavení {0}.
de: In der Assembly "{0}" können keine Typen geladen werden.
es: No se puede cargar ningún tipo en el ensamblado "{0}".
fr: Impossible de charger des types dans l'assembly '{0}'.
it: Non è possibile caricare tipi nell'assembly '{0}'.
ja: アセンブリ '{0}' 内の型を読み込めません。
ko: '{0}' 어셈블리에 있는 형식을 로드할 수 없습니다.
pl: Nie można załadować żadnych typów w zestawie „{0}”.
pt_br: Não é possível carregar nenhum tipo no assembly '{0}'.
ru: Не удается загрузить типы в сборке "{0}".
tr: '{0}' bütünleştirilmiş kodundaki türler yüklenemiyor.
zh_hans: 无法加载程序集“{0}”中的任何类型。
zh_hant: 無法載入組件 '{0}' 中的任何類型。

# ErrDirectoryContainsInvalidCharacters
source: Invalid value '{1}' passed to the --{0} option. The {2} character is not permitted in a path
cs: Parametru --{0} byla předána neplatná hodnota {1}. Znak {2} není v cestě povolen.
de: An die Option --{0} wurde ein ungültiger Wert "{1}" übergeben. Das Zeichen "{2}" ist in einem Pfad nicht zulässig.
es: Se ha pasado un valor no válido “{1}” a la opción --{0}. El carácter {2} no se permite en ninguna ruta de acceso
fr: Valeur {1} non valide passée à l’option --{0}. Le caractère{2} n’est pas autorisé dans un chemin d’accès
it: Il valore '{1}' passato all'opzione --{0} non è valido. Il carattere {2} non è consentito in un percorso
ja: --{0} オプションに無効な値 '{1}' が渡されました。パスに {2} 文字は使用できません。
ko: 잘못된 값 '{1}'이(가) --{0}옵션에 전달되었습니다. 경로에 {2} 문자를 사용할 수 없습니다.
pl: Nieprawidłowa wartość „{1}” przekazana do opcji --{0}. Znak {2} nie jest dozwolony w ścieżce
pt_br: Valor inválido '{1}' passado para a opção --{0}. O caractere {2} não é permitido em um caminho.
ru: Через параметр --"{1}" передано недопустимое значение {0}. Символ {2} не разрешено использовать в пути
tr: '{1}' seçeneğine geçersiz --{0}değeri geçirildi. Bir yolda {2} karakterinin kullanılmasına izin verilmez.
zh_hans: 传递给 --{0} 选项的值“{1}”无效。路径中不允许包含 {2} 字符
zh_hant: 傳遞到 --{0} 選項的值 '{1}' 無效。路徑中不允許 {2} 字元

# ErrDirectoryInsteadOfFile
source: The input path '{0}' appears to be a directory. Inputs must be either URLs or file paths
cs: Zdá se, že vstupní cesta {0} představuje adresář. Vstupy musí být buď adresy URL, nebo cesty k souborům.
de: Der Eingabepfad "{0}" ist offenbar ein Verzeichnis. Als Eingabe können nur URLs oder Dateipfade verwendet werden.
es: La ruta de acceso de entrada "{0}" parece ser un directorio. Las entradas deben ser direcciones URL o rutas de acceso a archivos
fr: Le chemin d’entrée « {0} » est un répertoire. Les entrées doivent être des URL ou des chemins d’accès de fichiers
it: Il percorso di input '{0}' sembra essere una directory. Gli input devono essere URL o percorsi di file
ja: 入力パス '{0}' はディレクトリである可能性があります。入力は URL またはファイル パスのいずれかである必要があります
ko: 입력 경로 '{0}'이(가) 디렉터리입니다. 입력은 URL 또는 파일 경로여야 합니다.
pl: Ścieżka danych wejściowych „{0}” wygląda na katalog. Dane wejściowe muszą być adresami URL albo ścieżkami plików.
pt_br: O caminho de entrada '{0}' parece ser um diretório. As entradas devem ser URLs ou caminhos de arquivo
ru: Вероятно, входной путь "{0}" является каталогом. Входные данные должны быть URL-адресами или путями к файлам
tr: '{0}' giriş yolu bir dizin gibi görünüyor. Girişlerin URL veya dosya yolu olması gerekir.
zh_hans: 输入路径“{0}”似乎是一个目录。输入必须是 URL 或文件路径
zh_hant: 輸入路徑 '{0}' 似乎是目錄。輸入必須是 URL 或檔案路徑

# ErrDirectoryNotFound
source: The directory '{0}' could not be found. Verify that the directory exists and that you have the appropriate permissions to read it.
cs: Adresář {0} se nepodařilo najít. Ověřte, že existuje a že máte příslušná oprávnění jej číst.
de: Das Verzeichnis "{0}" wurde nicht gefunden. Stellen Sie sicher, dass das Verzeichnis vorhanden ist, und dass Sie über Leseberechtigungen für das Verzeichnis verfügen.
es: No se encuentra el directorio "{0}". Compruebe que el directorio existe y que tiene los permisos apropiados para leerlo.
fr: Le répertoire '{0}' est introuvable. Vérifiez que le répertoire existe et que vous avez les autorisations appropriées pour le lire.
it: Non è stato possibile trovare la directory '{0}'. Verificare che la directory esista e che siano disponibili le autorizzazioni necessarie per leggerla.
ja: ディレクトリ '{0}' が見つかりませんでした。ディレクトリが存在し、ディレクトリを読み取るための適切なアクセス許可があることを確認してください。
ko: '{0}' 디렉터리를 찾을 수 없습니다. 디렉터리가 있는지 확인하고 해당 디렉터리를 읽을 수 있는 권한이 있는지 확인하세요.
pl: Nie można znaleźć katalogu „{0}”. Sprawdź, czy katalog istnieje i czy masz odpowiednie uprawnienia umożliwiające jego odczyt.
pt_br: Não foi possível encontrar o diretório '{0}'. Verifique se o diretório existe e se você tem as permissões apropriadas para lê-lo.
ru: Не удалось найти каталог "{0}". Убедитесь, что он существует и у вас есть соответствующие разрешения на его чтение.
tr: '{0}' dizini bulunamadı. Dizinin mevcut olduğunu ve dizini okumak için uygun izinlere sahip olduğunuzu doğrulayın.
zh_hans: 找不到目录“{0}”。请验证该目录是否存在并且你是否具有相应的读取权限。
zh_hant: 找不到目錄 '{0}'。請確認該目錄存在，且您有適當的權限可讀取該目錄。

# ErrDirectoryPointsToAFile
source: Invalid value '{1}' passed to the --{0} option. '{1}' is a path to a file.
cs: Do možnosti --{0} byla předána neplatná hodnota {1}. {1} je cesta k souboru.
de: An die --{0}-Option wurde ein ungültiger Wert "{1}" übergeben. "{1}" ist ein Pfad zu einer Datei.
es: Se ha pasado un valor no válido "{1}" a la opción --{0}. "{1}" es una ruta de acceso a un archivo.
fr: Valeur '{1}' non valide passée à l'option --{0}. '{1}' est le chemin d'un fichier.
it: Il valore '{1}' passato all'opzione --{0} non è valido. '{1}' è il percorso di un file.
ja: --{0} オプションに無効な値 '{1}' が渡されました。'{1}' はファイルへのパスです。
ko: 잘못된 값 '{1}'이(가) --{0} 옵션에 전달되었습니다. '{1}'은(는) 파일 경로입니다.
pl: Nieprawidłowa wartość „{1}” przekazana do opcji --{0}. „{1}” jest ścieżką do pliku.
pt_br: Valor inválido '{1}' passado à opção --{0}. '{1}' é um caminho para um arquivo.
ru: Через параметр --{0} передано недопустимое значение "{1}". Значение "{1}" является путем к файлу.
tr: --{0} seçeneğine '{1}' geçersiz değeri geçirildi. '{1}' bir dosyanın yoludur.
zh_hans: 传递给 --{0} 选项的值“{1}”无效。“{1}”是一个文件路径。
zh_hant: 傳遞到 --{0} 選項的值 '{1}' 無效。'{1}' 是到達檔案的路徑。

# ErrDuplicateReferenceValues
source: The assembly {1} was loaded twice through the --{0} option. You may reference each assembly only once.
cs: Sestavení {1} bylo pomocí možnosti --{0} načteno dvakrát. Na každé sestavení je možné odkazovat jen jednou.
de: Die Assembly "{1}" wurde über die Option --{0} zweimal geladen. Auf jede Assembly darf nur einmal verwiesen werden.
es: El ensamblado {1} se cargó dos veces a través de la opción --{0}. Solo puede hacer referencia a cada ensamblado una vez.
fr: L'assembly {1} a été chargé à deux reprises via l'option --{0}. Vous devez référencer chaque assembly une seule fois.
it: L'assembly {1} è stato caricato due volte tramite l'opzione --{0}. È possibile fare riferimento a ciascun assembly solo una volta.
ja: アセンブリ {1} が --{0} オプションを通じて 2 回読み込まれました。各アセンブリを参照できるのは一度だけです。
ko: {1} 어셈블리가 --{0} 옵션을 통해 두 번 로드되었습니다. 각 어셈블리는 한 번만 참조할 수 있습니다.
pl: Zestaw {1} został załadowany dwukrotnie za pośrednictwem opcji --{0}. Możesz odwoływać się do każdego zestawu tylko raz.
pt_br: O assembly {1} foi carregado duas vezes por meio da opção --{0}. Você pode referenciar cada assembly apenas uma vez.
ru: Сборка {1} загружена дважды с помощью параметра --{0}. Задавать ссылку на каждую сборку можно только один раз.
tr: {1} bütünleştirilmiş kodu --{0} seçeneği aracılığıyla iki kere yüklendi. Her bütünleştirilmiş koda yalnızca bir kere başvurabilirsiniz.
zh_hans: 通过 --{0} 选项加载了两次程序集 {1}。每个程序集只能引用一次。
zh_hant: 組件 {1} 透過 --{0} 選項載入了兩次。每個組件只可參考一次。

# ErrDuplicateValuePassedToTypeArg
source: The value {1} was passed to the --{0} option multiple times. Each type may be specified only once.
cs: Hodnota {1} byla do možnosti --{0} předána vícekrát. Každý typ je možné zadat jen jednou.
de: Der Wert "{1}" wurde mehrfach an die Option --{0} übergeben. Jeder Typ darf nur einmal angegeben werden.
es: El valor {1} se pasó a la opción --{0} varias veces. Cada tipo se puede especificar una sola vez.
fr: La valeur {1} a été passée à l'option --{0} plusieurs fois. Chaque type doit être spécifié une seule fois.
it: Il valore {1} è stato passato più volte all'opzione --{0}. È possibile specificare ogni tipo solo una volta.
ja: 値 {1} が --{0} オプションに複数回渡されました。各型を指定できるのは一度だけです。
ko: {1} 값이 --{0} 옵션에 여러 번 전달되었습니다. 각 형식은 한 번만 지정할 수 있습니다.
pl: Wartość {1} została przekazana do opcji --{0} wiele razy. Każdy typ można określić tylko raz.
pt_br: O valor {1} foi passado à opção --{0} várias vezes. Cada tipo pode ser especificado apenas uma vez.
ru: Значение {1} передано через параметр --{0} несколько раз. Каждый тип можно указывать только один раз.
tr: {1} değeri --{0} seçeneğine birden çok kez geçirildi. Her tür yalnızca bir kere belirtilebilir.
zh_hans: 多次将值 {1} 传递给了 --{0} 选项。每个类型只能指定一次。
zh_hant: 多次傳遞值 {1} 到 --{0} 選項。每個類型只能指定一次。

# ErrExclusiveOptionsSpecified
source: The --{0} option cannot be used when the --{1} option has been specified.
cs: Parametr --{0} nelze použít, pokud byl zadán parametr --{1}.
de: Die Option --{0} kann nicht verwendet werden, wenn die Option --{1} angegeben wurde.
es: La opción --{0} no se puede utilizar si se ha especificado la opción --{1}.
fr: Nous n’avons pas pu utiliser l’option –{0} lorsque l’option –{1} a été spécifiée.
it: Non è possibile usare l'opzione --{0} quando è stata specificata l'opzione --{1}.
ja: --{0} オプションは、--{1} オプションが指定されている場合には使用できません。
ko: --{1} 옵션을 지정한 경우 --{0} 옵션을 사용할 수 없습니다.
pl: Nie można użyć opcji --{0} po określeniu opcji --{1}.
pt_br: A opção --{0} não pode ser usada quando a opção --{1} tiver sido especificada.
ru: Параметр --{0} нельзя использовать, если указан параметр --{1}.
tr: --{0} seçeneği belirtildiğinde --{1} seçeneği kullanılamaz.
zh_hans: 已指定 --{1} 选项时，无法使用 --{0} 选项。
zh_hant: 指定 --{1} 選項時，無法使用 --{0} 選項。

# ErrExpectedValue
source: The {0} option requires that a value be specified.
cs: Možnost {0} vyžaduje, aby byla hodnota specifikována.
de: Die {0}-Option erfordert die Angabe eines Werts.
es: La opción {0} requiere que se especifique un valor.
fr: Une valeur doit être spécifiée pour l'option {0}.
it: Con l'opzione {0} è necessario specificare un valore.
ja: {0} オプションでは、値を指定する必要があります。
ko: {0} 옵션에서는 값을 지정해야 합니다.
pl: Opcja {0} wymaga określenia wartości.
pt_br: A opção {0} requer que um valor seja especificado.
ru: Для использования параметра {0} требуется указать значение.
tr: {0} seçeneği değer belirtilmesini gerektirir.
zh_hans: {0} 选项要求指定值。
zh_hant: {0} 選項需要指定一個值。

# ErrInputConflictsWithMode
source: The input read from '{0}' is inconsistent with other options.
cs: Vstup přečtený z {0} je nekonzistentní s jinými možnostmi.
de: Die von "{0}" gelesene Eingabe ist mit anderen Optionen nicht konsistent.
es: La lectura de entrada de "{0}" no es coherente con las restantes opciones.
fr: L'entrée lue à partir de '{0}' n'est pas cohérente avec les autres options.
it: L'input letto da '{0}' non è coerente con altre opzioni.
ja: '{0}' から読み取られた入力が、他のオプションと矛盾しています。
ko: '{0}'에서 읽은 입력이 다른 옵션과 일관되지 않습니다.
pl: Dane wejściowe odczytane z elementu „{0}” są niespójne z innymi opcjami.
pt_br: A entrada lida de '{0}' é inconsistente com as outras opções.
ru: Входные данные, считываемые из параметра "{0}", не согласованы с другими параметрами.
tr: '{0}' öğesinden okunan giriş diğer seçeneklerle tutarsız.
zh_hans: 从“{0}”读取的输入与其他选项不一致。
zh_hant: 從 '{0}' 讀取的輸入與其他選項不一致。

# ErrInputConflictsWithOption
source: The input read from '{1}' cannot be used with the --{0} option because they imply different modes of tool operation.
cs: Vstup přečtený z {1} nelze použít s parametrem --{0}, protože vstup a parametr implikují různé režimy fungování nástroje.
de: Die von "{1}" gelesene Eingabe kann nicht mit der Option --{0} verwendet werden, weil sie unterschiedliche Betriebsmodi des Tools implizieren.
es: La lectura de entrada de "{1}" no se puede utilizar con la opción --{0} porque implican modos diferentes de funcionamiento de la herramienta.
fr: Nous n’avons pas pu utiliser l’entrée lue à partir de « {1} » avec l’option –{0}, car elles impliquent différents modes d’utilisation de l’outil.
it: Non è possibile usare l'input letto da '{1}' con l'opzione --{0}, perché implicano modalità diverse di funzionamento dello strumento.
ja: '{1}' から読み取られた入力と--{0} オプションは、ツール操作の異なるモードを示すため、一緒に使用できません。
ko: '{1}'에서 읽은 입력과 --{0} 옵션은 서로 다른 도구 작업 모드를 나타내므로 함께 사용할 수 없습니다.
pl: Dane wejściowe odczytane z elementu „{1}” nie mogą być użyte z opcją --{0}, ponieważ zakładają inne tryby działania narzędzia.
pt_br: A entrada lida de '{1}' não pode ser usada com a opção --{0}, porque elas implicam diferentes modos de operação de ferramenta.
ru: Входные данные, считываемые из параметра "{1}", нельзя использовать с параметром --{0}, так как они предполагают разные режимы работы средства.
tr: '{1}' öğesinden okunan giriş ile --{0} seçeneği farklı araç çalıştırma modları gerektirdiğinden birlikte kullanılamaz.
zh_hans: 从“{1}”读取的输入无法与 --{0} 选项一起使用，因为这两者采用的工具操作模式不同。
zh_hant: 無法使用從 '{1}' 讀取的輸入搭配 --{0} 選項使用，因為它們表示不同的工具作業模式。

# ErrInputConflictsWithTarget
source: The type of input read from '{2}' is not supported with the --{0} option set to '{1}'.
cs: Typ vstupu přečtený z {2} není podporovaný s parametrem --{0} nastaveným na hodnotu {1}.
de: Der von "{2}" gelesene Typ der Eingabe wird nicht unterstützt, wenn die Option --{0} auf "{1}" festgelegt ist.
es: El tipo de lectura de entrada de “{2}” no es compatible con la opción --{0} establecida en “{1}”.
fr: Le type d’entrée lu à partir de « {2} » n’est pas pris en charge avec l’option –{0} définie sur « {1} ».
it: Il tipo di input letto da '{2}' non è supportato con l'opzione --{0} impostata su '{1}'.
ja: '{2}' から読み取られた入力の種類は、--{0} オプションが '{1}' に設定されている場合はサポートされません。
ko: --{0} 옵션을 '{1}'(으)로 설정하면 '{2}'에서 읽은 입력 형식을 사용할 수 없습니다.
pl: Typ danych wejściowych odczytanych z elementu „{2}” nie jest obsługiwany w przypadku opcji --{0} ustawionej na „{1}”.
pt_br: O tipo de entrada lido de '{2}' não tem suporte com a opção --{0} definida como '{1}'.
ru: Тип входных данных, считываемых из "{2}", не поддерживается параметром --{0}, для которого установлено значение "{1}".
tr: '{2}' öğesinden okunan giriş türü {0}-- seçeneği '{1}' olarak ayarlandığında desteklenmiyor.
zh_hans: 将 --{0} 选项设置为“{1}”时，不支持从“{2}”读取的输入类型。
zh_hant: 當 --{0} 選項設定為 '{1}' 時，不支援從 '{2}' 讀取的輸入類型。

# ErrInputFileNotAssemblyOrMetadata
source: The file at: '{0}' read via input argument'{1}' does not appear to be an XML metadata file or a valid assembly.
cs: Soubor v {0} přečtený pomocí argumentu vstupu {1} pravděpodobně není soubor metadat XML nebo platné sestavení.
de: Die Datei unter "{0}", die über das Eingabeargument "{1}" gelesen wurde, scheint keine XML-Metadatendatei oder gültige Assembly zu sein.
es: El archivo en: “{0}” leer a través del argumento de entrada “{1}” no parece ser un archivo de metadatos XML o un ensamblado válido.
fr: Le fichier situé à l’emplacement « {0} » lu via l’argument d’entrée « {1} » n’est pas un fichier de métadonnées XML ou un assembly valide.
it: Il file in: '{0}' letto tramite l'argomento di input '{1}' non sembra essere un file di metadati XML o un assembly valido.
ja: '{0}' にある、入力引数'{1}' 経由で読み取られたファイルが、XML メタデータ ファイルまたは有効なアセンブリでない可能性があります。
ko: 입력 인수 '{1}'을(를) 통해 읽은 '{0}'의 파일이 XML 메타데이터 파일 또는 올바른 어셈블리가 아닙니다.
pl: Plik w lokalizacji „{0}” odczytany za pośrednictwem argumentu wejściowego „{1}” nie wydaje się być plikiem metadanych XML ani prawidłowym zestawem.
pt_br: O arquivo em: '{0}' lido pelo argumento de entrada'{1}' não parece ser um arquivo de metadados XML ou um assembly válido.
ru: Файл по адресу: "{0}", считываемый через входной аргумент "{1}", не является файлом метаданных XML или допустимой сборкой.
tr: '{1}' giriş bağımsız değişkeni aracılığıyla okunan '{0}' konumundaki dosya bir XML meta veri dosyası geçerli bir bütünleştirilmiş kod gibi görünmüyor.
zh_hans: 通过输入参数“{1}”读取的“{0}”处的文件似乎不是 XML 元数据文件或有效的程序集。
zh_hant: 透過輸入引數 '{1}' 讀取的檔案 (位於 '{0}') 似乎不是 XML 中繼資料檔案或有效的組件。

# ErrInvalidInputPath
source: The input path '{0}' doesn't appear to refer to any existing files and does not appear to be a valid URI.
cs: Vstupní cesta {0} pravděpodobně neodkazuje na žádný existující soubor a nejedná se o platný identifikátor URI.
de: Der Eingabepfad '{0}' scheint auf keine vorhandenen Dateien zu verweisen und ist anscheinend auch kein gültiger URI.
es: La ruta de acceso de entrada '{0}' no parece hacer referencia a ningún archivo existente ni ser un URI válido.
fr: Le chemin d'entrée '{0}' ne semble pas faire référence à aucun fichier existant et être un URI valide.
it: Il percorso di input '{0}' non sembra fare riferimento ad alcun file esistente e non sembra essere un URI valido.
ja: 入力パス '{0}' は既存のファイルを参照しておらず、有効な URI でない可能性があります。
ko: 입력 경로 '{0}'이(가) 기존 파일을 참조하지 않으며 유효한 URI가 아닙니다.
pl: Ścieżka wejściowa „{0}” nie wydaje się odwoływać do żadnych istniejących plików i nie wygląda na prawidłowy identyfikator URI.
pt_br: O caminho de entrada '{0}' não parece fazer referência a nenhum arquivo existente e não parece ser um URI válido.
ru: Входной путь "{0}" не ссылается ни на один существующий файл и не является допустимым идентификатором URI.
tr: '{0}' giriş yolu herhangi bir mevcut dosyaya başvurmuyor ve geçerli bir URI değil.
zh_hans: 输入路径“{0}”似乎未引用任何现有文件，并且似乎不是有效的 URI。
zh_hant: 輸入路徑 '{0}' 似乎未參考任何現有的檔案，而且似乎不是有效的 URI。

# ErrInvalidNamespaceArgument
source: Invalid value {1} passed to the --{0} option. Specify a comma-separated target namespace and CLR namespace pair.
cs: Parametru --{0} byla předána neplatná hodnota {1}. Zadejte čárkou oddělený pár oboru názvů cíle a CLR.
de: An die Option --{0} wurde ein ungültiger Wert "{1}" übergeben. Geben Sie ein durch Trennzeichen getrenntes Paar aus Zielnamespace und CLR-Namespace an.
es: Se ha pasado un valor no válido {1} a la opción --{0}. Especifique un par de espacios de nombres CLR y un espacio de nombres de destino separado por comas.
fr: Valeur {1} non valide passée à l’option --{0}. Spécifiez une paire espace de noms cible/espace de noms CLR en séparant les valeurs par une virgule.
it: Il valore {1} passato all'opzione --{0}non è valido. Specificare una coppia di spazio dei nomi di destinazione e spazio dei nomi CLR delimitata da virgole.
ja: --{0} オプションに無効な値 {1}が渡されました。コンマで区切られたターゲット名前空間と CLR 名前空間の組み合わせを指定してください。
ko: 잘못된 값 {1}이(가) --{0} 옵션에 전달되었습니다. 쉼표로 구분된 대상 네임스페이스 및 CLR 네임스페이스 쌍을 지정하세요.
pl: Nieprawidłowa wartość {1} przekazana do opcji --{0}. Określ rozdzieloną przecinkiem parę docelowej przestrzeni nazw i przestrzeni nazw CLR.
pt_br: Valor inválido {1} passado para a opção --{0}. Especifique um par de namespace de destino e namespace CLR separados por vírgula.
ru: Через параметр --{1} передано недопустимое значение {0}. Укажите пару из целевого пространства имен и пространства имен CLR, разделенных запятой.
tr: --{0} seçeneğine geçersiz {1} değeri geçirildi. Virgülle ayrılmış hedef ad alanı ve CLR ad alanı çifti belirtin.
zh_hans: 传递给 --{0} 选项的值 {1} 无效。请指定逗号分隔的目标命名空间和 CLR 命名空间对。
zh_hant: 傳遞到 --{0} 選項的值 {1} 無效。指定以逗點分隔的成對目標命名空間與 CLR 命名空間。

# ErrInvalidPath
source: Invalid path {0}. Check the --{1} argument
cs: Neplatná cesta {0}. Zkontrolujte argument --{1}.
de: Ungültiger Pfad "{0}". Überprüfen Sie das Argument --{1}.
es: La ruta de acceso {0} no es válida. Comprobar el argumento --{1}
fr: Chemin d’accès non valide {0}. Vérifiez l’argument --{1}
it: Il percorso {0} non è valido. Controllare l'argomento --{1}
ja: パス {0} は無効です。--{1} 引数を確認してください
ko: 잘못된 경로 {0}. --{1} 인수 확인
pl: Nieprawidłowa ścieżka {0}. Sprawdź argument --{1}.
pt_br: Caminho inválido {0}. Verifique o argumento --{1}
ru: Недопустимый путь: {0}. Проверьте аргумент --{1}
tr: Geçersiz yol {0}. --{1} bağımsız değişkenini denetleyin
zh_hans: 路径 {0} 无效。请检查 --{1} 参数
zh_hant: 路徑 {0} 無效。檢查 --{1} 引數

# ErrInvalidSerializer
source: Invalid serializer value passed to the --{0} option. The supported serializers are: {2}
cs: Parametru --{0} byla předána neplatná hodnota serializátoru. Podporované jsou tyto serializátory: {2}
de: An die Option --{0} wurde ein ungültiger Serialisierungsmodulwert übergeben. Folgende Serialisierungsmodule werden unterstützt: {2}
es: Se ha pasado un valor de serializador no válido a la opción --{0}. Los serializadores compatibles son: {2}
fr: Valeur de sérialiseur non valide passée à l’option --{0}. Les sérialiseurs pris en charge sont :{2}
it: Il valore del serializzatore passato all'opzione --{0} non è valido. I serializzatori supportati sono: {2}
ja: --{0} オプションに無効なシリアライザー値が渡されました。サポートされているシリアライザー: {2}
ko: 잘못된 직렬 변환기 값이 --{0} 옵션에 전달되었습니다. 지원되는 직렬 변환기는 {2}입니다.
pl: Nieprawidłowa wartość serializatora przekazana do opcji --{0}. Obsługiwane serializatory to: {2}
pt_br: Valor de serializador inválido passado para a opção --{0}. Os serializadores com suporte são: {2}
ru: В параметр --{0} передано недопустимое значение сериализатора. Поддерживаемые сериализаторы: {2}
tr: --{0} seçeneğine geçersiz serileştirici değeri geçirildi. Desteklenen serileştiriciler: {2}
zh_hans: 传递给 --{0} 选项的序列化程序值无效。支持的序列化程序为: {2}
zh_hant: 傳遞到 --{0} 選項的序列化程式值無效。支援的序列化程式為: {2}

# ErrInvalidTarget
source: Invalid target '{1}' specified via the --{0} option. The supported Targets are: {2}
cs: Prostřednictvím parametru --{0} byl zadán neplatný cíl {1}. Podporované jsou tyto cíle: {2}
de: Über die Option --{0} wurde ein ungültiges Ziel "{1}" angegeben. Folgende Ziele werden unterstützt: {2}
es: El destino “{1}” especificado mediante la opción --{0} no es válido. Los destinos admitidos son: {2}
fr: Cible non valide « {1} » spécifiée par le biais de l’option --{0}. Les cibles prises en charge sont : {2}
it: La destinazione '{1}' specificata tramite l'opzione --{0} non è valida. Le destinazioni supportate sono: {2}
ja: --{0} オプションで指定されたターゲット '{1}' が無効です。サポートされているターゲット: {2}
ko: --{0} 옵션을 통해 잘못된 대상 '{1}'이(가) 지정되었습니다. 지원되는 대상은 {2}입니다.
pl: Za pomocą opcji --{1} określono nieprawidłowy element docelowy --{0}. Obsługiwane obiekty docelowe to: {2}
pt_br: Destino inválido '{1}' especificado pela opção --{0}. Os Destinos com suporte são: {2}
ru: Неверный целевой объект "{1}", указанная с помощью опции --{0}. Поддерживаемые целевые объекты: {2}
tr: --{0} seçeneği aracılığıyla geçersiz hedef ('{1}') belirtildi. Desteklenen Hedefler: {2}
zh_hans: 通过 --{0} 选项指定的目标“{1}”无效。支持的目标包括: {2}
zh_hant: 透過 --{0} 選項指定的目標 '{1}' 無效。支援的目標為: {2}
