Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ErrInvalidTargetClientVersion
source: Invalid targetClientVersion value passed to the --{0} option. The supported targetClientVersions are: {2}
cs: Parametru --{0} byla předána neplatná hodnota targetClientVersion. Podporované hodnoty targetClientVersion jsou: {2}
de: An die Option --{0} wurde ein ungültiger targetClientVersion-Wert übergeben. Die unterstützten targetClientVersions sind: {2}
es: Se pasó un valor targetClientVersion no válido a la opción --{0}. Los valores targetClientVersions admitidos son: {2}
fr: Valeur targetClientVersion non valide passée à l’option --{0}. TargetClientVersions pris en charge :{2}
it: Il valore targetClientVersion passato all'opzione --{0} non è valido. I valori targetClientVersions supportati sono: {2}
ja: --{0} オプションに無効な targetClientVersion 値が渡されました。サポートされている targetClientVersion: {2}
ko: --{0} 옵션에 전달된 targetClientVersion 값이 잘못되었습니다. 지원되는 targetClientVersions는 {2}입니다.
pl: Do opcji --{0} przekazano nieprawidłową wartość targetClientVersion. Obsługiwane wartości targetClientVersions to: {2}
pt_br: Valor de targetClientVersion inválido passado para a opção --{0}. Os targetClientVersions com suporte são: {2}
ru: В параметр --{0} передано недопустимое значение targetClientVersion. Поддерживаемые targetClientVersions: {2}
tr: --{0} seçeneğine geçersiz targetClientVersion değeri geçirildi. Desteklenen targetClientVersions: {2}
zh_hans: 传递给 --{0} 选项的 targetClientVersion 值无效。支持的 targetClientVersions 为: {2}
zh_hant: 傳遞給 --{0} 選項的 targetClientVersion 值無效。支援的 targetClientVersions 為: {2}

# ErrIsNotAnAssembly
source: Could not load '{0}' as an assembly verify that this file is a .NET Assembly.
cs: Nelze načíst {0} jako sestavení. Ověřte, že je tento soubor sestavením .NET.
de: "{0}" konnte nicht als Assembly geladen werden. Stellen Sie sicher, dass diese Datei eine .NET-Assembly ist.
es: “{0}” no se pudo cargar como un ensamblado; compruebe que este archivo sea un ensamblado .NET.
fr: Nous n’avons pas pu charger {0} comme assembly. Vérifiez que ce fichier est un assembly .NET.
it: Non è stato possibile caricare '{0}' come assembly. Verificare che il file sia un assembly .NET.
ja: '{0}' をアセンブリとして読み込めませんでした。このファイルが .NET アセンブリであることを確認してください。
ko: '{0}'을(를) 어셈블리로 로드할 수 없습니다. 이 파일이 .NET 어셈블리인지 확인하십시오.
pl: Nie można załadować elementu „{0}” jako zestawu, aby sprawdzić, czy ten plik jest zestawem platformy .NET.
pt_br: Não foi possível carregar '{0}', pois um assembly verifica se este arquivo é um Assembly do .NET.
ru: Не удалось загрузить "{0}" в качестве сборки. Проверьте, является ли этот файл сборкой .NET.
tr: '{0}' bütünleştirilmiş kod olarak yüklenemedi, bu dosyanın bir .NET Bütünleştirilmiş Kodu olduğunu doğrulayın.
zh_hans: 无法将“{0}”作为程序集加载，请验证此文件是否是 .NET 程序集。
zh_hant: 無法將 '{0}' 載入為組件，請驗證此檔案是 .NET 組件。

# ErrMergeConfigUsedWhenConfigDoesNotExist
source: Cannot merge config file. The file '{1}' does not exist.
cs: Nelze sloučit konfigurační soubor. Soubor {1} neexistuje.
de: Die Konfigurationsdatei kann nicht zusammengeführt werden. Die Datei "{1}" ist nicht vorhanden.
es: No se puede combinar el archivo de configuración. El archivo “{1}” no existe.
fr: Nous n’avons pas pu fusionner le fichier config. Le fichier « {1} » n’existe pas.
it: Non è possibile unire il file di configurazione. Il file '{1}' non esiste.
ja: 構成ファイルをマージできません。ファイル '{1}' が存在しません。
ko: 구성 파일을 병합할 수 없습니다. '{1}' 파일이 없습니다.
pl: Nie można scalić pliku konfiguracji. Plik „{1}” nie istnieje.
pt_br: Não é possível mesclar o arquivo de configuração. O arquivo '{1}' não existe.
ru: Не удается объединить файл конфигурации. Файл "{1}" не существует.
tr: Yapılandırma dosyası birleştirilemedi. '{1}' dosyası yok.
zh_hans: 无法合并配置文件。文件“{1}”不存在。
zh_hant: 無法合併設定檔。檔案 '{1}' 不存在。

# ErrMergeConfigUsedWithoutConfig
source: Cannot use the --{0} option without specifying the --{1} option.
cs: Parametr --{0} nelze použít bez zadání parametru --{1}.
de: Die Option --{0} kann nicht ohne Angabe der Option --{1} verwendet werden.
es: No se puede utilizar la opción --{0} sin especificar la opción --{1}.
fr: Nous n’avons pas pu utiliser l’option –{0} sans spécifier l’option –{1}.
it: Non è possibile usare l'opzione --{0} senza specificare l'opzione --{1}.
ja: --{1} オプションを指定せずに --{0} オプションを使用することはできません。
ko: --{1} 옵션을 지정하지 않으면 --{0} 옵션을 사용할 수 없습니다.
pl: Nie można użyć opcji --{0} bez określenia opcji --{1}.
pt_br: Não é possível usar a opção --{0} sem especificar a opção --{1}.
ru: Не удается использовать параметр --{0} без указания параметра --{1}.
tr: --{1} seçeneği belirtilmeden --{0} seçeneği kullanılamaz.
zh_hans: 如果未指定 --{1} 选项，则无法使用 --{0} 选项。
zh_hant: 未指定 --{1} 選項時，無法使用 --{0} 選項。

# ErrNoFilesFound
source: The input path '{0}' doesn't appear to refer to any existing files
cs: Vstupní cesta {0} pravděpodobně neodkazuje na žádný existující soubor.
de: Der Eingabepfad "{0}" scheint auf keine vorhandenen Dateien zu verweisen.
es: La ruta de acceso de entrada "{0}" no parece hacer referencia a ningún archivo existente
fr: Le chemin d'entrée '{0}' ne semble pas faire référence à un fichier existant
it: Il percorso di input '{0}' non sembra fare riferimento ad alcun file esistente
ja: 入力パス '{0}' は既存のファイルを参照していない可能性があります
ko: 입력 경로 '{0}'이(가) 기존 파일을 참조하지 않습니다.
pl: Ścieżka wejściowa „{0}” nie wydaje się odwoływać do żadnego istniejącego pliku
pt_br: O caminho de entrada '{0}' não parece fazer referência a nenhum arquivo existente
ru: Входной путь "{0}" не ссылается ни на один существующий файл.
tr: '{0}' giriş yolu mevcut bir dosyaya başvurmuyor
zh_hans: 输入路径“{0}”似乎未引用任何现有文件
zh_hant: 輸入路徑 '{0}' 似乎未參考任何現有的檔案

# ErrNoValidInputFilesSpecified
source: No valid input files specified. Specify either metadata documents or assembly files
cs: Nebyly zadány žádné platné vstupní soubory. Zadejte dokumenty metadat nebo soubory sestavení.
de: Es wurden keine gültigen Eingabedateien angegeben. Geben Sie Metadatendokumente oder Assemblydateien an.
es: No se especificó ningún archivo de entrada válido. Especificar documentos de metadatos o archivos de ensamblado
fr: Aucun fichier d’entrée valide spécifié. Spécifiez des documents de métadonnées ou des fichiers d’assembly
it: Nessun file di input valido specificato. Specificare i documenti di metadati o i file di assembly
ja: 有効な入力ファイルが指定されていません。メタデータ ドキュメントまたはアセンブリ ファイルのいずれかを指定する
ko: 올바른 입력 파일이 지정되지 않았습니다. 메타데이터 문서 또는 어셈블리 파일 지정
pl: Nie określono prawidłowych plików wejściowych. Określ dokumenty metadanych lub pliki zestawów
pt_br: Sem arquivos de entrada válidos especificados. Especificar documentos de metadados ou arquivos do assembly
ru: Не указаны допустимые входные файлы. Укажите документы метаданных или файлы сборки
tr: Geçerli giriş dosyası belirtilmedi. Meta veri belgelerini veya derleme dosyalarını belirtin
zh_hans: 未指定有效的输入文件。指定元数据文档或程序集文件二者之一
zh_hant: 未指定有效的輸入檔案。指定中繼資料文件或組件檔案

# ErrNotCodeDomType
source: The type '{0}' passed to the --{1} argument is not a subclass of {2}.
cs: Typ {0} předaný argumentu --{1} není podtřídou třídy {2}.
de: Der an das --{1}-Argument übergebene Typ "{0}" ist keine Unterklasse von "{2}".
es: El tipo "{0}" pasado al argumento --{1} no es una subclase de {2}.
fr: Le type '{0}' passé à l'argument --{1} n'est pas une sous-classe de {2}.
it: Il tipo '{0}' passato all'argomento --{1} non è una sottoclasse di {2}.
ja: --{1} 引数に渡された型 '{0}' は {2} のサブクラスではありません。
ko: --{1} 인수에 전달된 '{0}' 형식이 {2}의 서브클래스가 아닙니다.
pl: Typ „{0}” przekazany do argumentu --{1} nie jest podklasą klasy {2}.
pt_br: O tipo '{0}' passado ao argumento --{1} não é uma subclasse de {2}.
ru: Тип "{0}", переданный через аргумент --{1}, не является подклассом {2}.
tr: --{1} bağımsız değişkenine geçirilen '{0}' türü, {2} sınıfının bir alt sınıfı değil.
zh_hans: 传递给 --{1} 参数的类型“{0}”不是 {2} 的子类。
zh_hant: 傳遞到 --{1} 引數的類型 '{0}'，並非 {2} 的子類別。

# ErrNotLanguageOrCodeDomType
source: The value '{0}' passed to the --{1} argument does not represent a defined language and it could not be loaded as a fully qualified CLR type.
cs: Hodnota {0} předaná argumentu --{1} nepředstavuje definovaný jazyk a nebylo možné ji načíst jako plně kvalifikovaný typ CLR.
de: Der an das --{1}-Argument übergebene Wert "{0}" stellt keine definierte Sprache dar und konnte nicht als vollqualifizierter CLR-Typ geladen werden.
es: El valor "{0}" pasado al argumento --{1} no representa un lenguaje definido y no se pudo cargar como un tipo CLR completo.
fr: La valeur '{0}' passée à l'argument --{1} ne représente pas un langage défini. Impossible de la télécharger en tant que type CLR complet.
it: Il valore '{0}' passato all'argomento --{1} non rappresenta un linguaggio definito e non può essere caricato come tipo CLR completo.
ja: --{1} 引数に渡された値 '{0}' は定義された言語を表しておらず、完全修飾 CLR 型として読み込めませんでした。
ko: --{1} 인수에 전달된 '{0}' 값이 정의된 언어를 나타내지 않으므로 정규화된 CLR 형식으로 로드할 수 없습니다.
pl: Wartość „{0}” przekazana do argumentu --{1} nie reprezentuje zdefiniowanego języka i nie może być załadowana jako w pełni kwalifikowany typ CLR.
pt_br: O valor '{0}' passado ao argumento --{1} não representa uma linguagem definida e não pôde ser carregado como um tipo CLR totalmente qualificado.
ru: Значение "{0}", переданное через аргумент --{1}, не представляет собой определенный язык, и его не удалось загрузить как полный тип CLR.
tr: --{1} bağımsız değişkenine geçirilen '{0}' değeri tanımlı bir dili temsil etmiyor ve tam bir CLR türü olarak yüklenemedi.
zh_hans: 传递给 --{1} 参数的值“{0}”不代表已定义的语言，无法作为完全限定的 CLR 类型加载。
zh_hant: 傳遞到 --{1} 引數的值 '{0}'，並不代表定義的語言，因此無法將其載入為完整的 CLR 類型。

# ErrOptionConflictsWithTarget
source: The use of the --{2} option is not supported with the --{0} option set to '{1}'.
cs: Použití parametru --{2} není podporováno, pokud je parametr --{0} nastavený na hodnotu {1}.
de: Die Verwendung der Option --{2} wird nicht unterstützt, wenn die Option --{0} auf "{1}" festgelegt ist.
es: El uso de la opción --{2} no es compatible con la opción --{0} establecida en “{1}”.
fr: L’utilisation de l’option –{2} n’est pas prise en charge avec l’option –{0} définie comme « {1} ».
it: L'utilizzo dell'opzione --{2} non è supportato con l'opzione --{0} impostata su '{1}'.
ja: --{2} オプションの使用は、--{0} オプションが '{1}' に設定されている場合はサポートされません。
ko: --{0} 옵션을 '{1}'(으)로 설정하면 --{2} 옵션을 사용할 수 없습니다.
pl: Użycie opcji --{2} nie jest obsługiwane w przypadku opcji --{0} ustawionej na „{1}”.
pt_br: O uso da opção --{2} não tem suporte com a opção --{0} definida como '{1}'.
ru: Использование параметра --{2} не поддерживается, если для параметра --{0} установлено значение "{1}".
tr: --{2} seçeneğinin kullanımı, --{0} seçeneği '{1}' olarak ayarlandığında desteklenmez.
zh_hans: 将 --{0} 选项设置为“{1}”时，不支持使用 --{2} 选项。
zh_hant: 當 --{0} 選項設定為 '{1}' 時，不支援使用 --{2} 選項。

# ErrOptionModeConflict
source: The --{1} option cannot be used with the --{0} option because they imply different output types.
cs: Parametr --{1} nelze použít spolu s parametrem --{0}, protože implikují různé typy výstupu.
de: Die Option --{1} kann nicht zusammen mit der Option --{0} verwendet werden, weil beide unterschiedliche Ausgabetypen implizieren.
es: La opción --{1} no se puede utilizar con la opción --{0} porque implican tipos de salida diferentes.
fr: Nous n’avons pas pu utiliser l’option –{1} avec l’option –{0}, car elles impliquent des types de sortie différents.
it: Non è possibile usare l'opzione --{1} con l'opzione --{0}, perché implicano tipi di output diversi.
ja: --{1} オプションと --{0} オプションは異なる出力の種類を示すため、一緒に使用できません。
ko: --{1} 옵션과 --{0} 옵션은 서로 다른 출력 형식을 나타내므로 함께 사용할 수 없습니다.
pl: Opcja --{1} nie może być użyta wraz z opcją --{0}, ponieważ zakładają one inne typy wyjściowe.
pt_br: A opção --{1} não pode ser usada com a opção --{0} porque implicam tipos de saída diferentes.
ru: Параметр --{1} нельзя использовать с параметром --{0}, так как они предполагают разные типы выходных данных.
tr: --{1} seçeneği ile --{0} seçeneği farklı çıkış türleri gerektirdiğinden birlikte kullanılamaz.
zh_hans: --{1} 选项无法与 --{0} 选项一起使用，因为这两者采用的输出类型不同。
zh_hant: --{1} 選項無法搭配 --{0} 選項使用，因為它們表示不同的輸出類型。

# ErrPathTooLong
source: The resultant path '{0}' is too long. Review the --{1} and --{2} arguments
cs: Výsledná cesta {0} je moc dlouhá. Zkontrolujte argumenty --{1} a --{2}.
de: Der resultierende Pfad "{0}" ist zu lang. Überprüfen Sie die Argumente --{1} und --{2}.
es: La ruta de acceso resultante "{0}" es demasiado larga. Revise los argumentos --{1} y --{2}.
fr: Le chemin d’accès résultant « {0} » est trop long. Vérifiez les arguments –{1} et –{2}
it: Il percorso risultante '{0}' è troppo lungo. Controllare gli argomenti --{1} e --{2}
ja: 結果のパス '{0}' が長すぎます。--{1} 引数および --{2} 引数をご確認ください。
ko: 결과 경로 '{0}'이(가) 너무 깁니다. --{1} 및 --{2} 인수 검토
pl: Ścieżka wynikowa „{0}” jest zbyt długa. Sprawdź argumenty --{1} i --{2}.
pt_br: O caminho resultante '{0}' é muito longo. Examine os argumentos --{1} e --{2}
ru: Результирующий путь "{0}" слишком длинный. Проверьте аргументы --{1} и --{2}.
tr: Sonuçta elde edilen '{0}' yolu çok uzun. --{1} ve --{2} bağımsız değişkenlerini gözden geçirin
zh_hans: 生成的路径“{0}”过长。请检查 --{1} 和 --{2} 参数
zh_hant: 結果路徑 '{0}' 太長。檢閱 --{1} 與 --{2} 引數

# ErrPathTooLongDirOnly
source: The resultant path '{0}' is too long. Review the --{1} argument
cs: Výsledná cesta {0} je moc dlouhá. Zkontrolujte argument --{1}.
de: Der resultierende Pfad "{0}" ist zu lang. Überprüfen Sie das Argument --{1}.
es: La ruta de acceso resultante "{0}" es demasiado larga. Revisar el argumento --{1}
fr: Le chemin d’accès résultant « {0} » est trop long. Vérifiez l’argument --{1}
it: Il percorso risultante '{0}' è troppo lungo. Controllare l'argomento --{1}
ja: 結果のパス '{0}' が長すぎます。--{1} 引数を確認してください
ko: 결과 경로 '{0}'이(가) 너무 깁니다. --{1} 인수 검토
pl: Ścieżka wynikowa „{0}” jest zbyt długa. Przejrzyj argument --{1}.
pt_br: O caminho resultante '{0}' é muito longo. Examine o argumento --{1}
ru: Результирующий путь "{0}" слишком длинный. Проверьте аргумент --{1}
tr: Sonuçta elde edilen '{0}' yolu çok uzun. --{1} bağımsız değişkenini gözden geçirin
zh_hans: 生成的路径“{0}”过长。请检查 --{1} 参数。
zh_hant: 結果路徑 '{0}' 太長。檢閱 --{1} 引數

# ErrSchemaValidationForExport
source: There was a validation error on a schema generated during export: Source: {0} Line: {1} Column: {2} Validation Error: {3}
cs: Došlo k chybě ověření schématu vygenerovaného během exportu: Zdroj: {0} Řádek: {1}, sloupec: {2} Chyba ověření: {3}
de: Validierungsfehler bei einem Schema, das während des Exports generiert wurde: Quelle: {0} Zeile: {1} Spalte: {2} Validierungsfehler: {3}
es: Error de validación en un esquema generado durante la exportación: Origen: {0} Línea: {1} Columna: {2} Error de validación: {3}
fr: Une erreur de validation s’est produite sur un schéma généré lors de l’exportation : Source : {0} Ligne {1} Colonne : {2} Erreur de validation : {3}
it: Errore di convalida in uno schema generato durante l'esportazione: Origine: {0} Riga: {1} Colonna: {2} Errore di convalida: {3}
ja: のエクスポート中に生成されたスキーマで検証エラーが発生しました。 ソース: {0} 行: {1} 列: {2} 検証エラー: {3}
ko: 내보내는 동안 생성된 스키마에 유효성 검사 오류가 발생: 원본: {0} 줄: {1} 열: {2} 유효성 검사 오류: {3}
pl: Wystąpił błąd weryfikacji schematu wygenerowanego podczas eksportowania: Źródło: {0} Wiersz: {1}, kolumna: {2} Błąd walidacji: {3}
pt_br: Ocorreu um erro de validação em um esquema gerado durante a exportação: Origem: {0} Linha: {1} Coluna: {2} Erro de Validação: {3}
ru: Произошла ошибка проверки схемы, созданной во время экспорта: Источник: {0} Строка: {1} столбец: {2} Ошибка проверки: {3}
tr: Dışarı aktarma sırasında oluşturulan şemada doğrulama hatası oluştu: Kaynak: {0} Satır: {1} Sütun: {2} Doğrulama Hatası: {3}
zh_hans: 导出期间生成的架构出现验证错误: 源:{0} 行: {1} 列: {2} 验证错误: {3}
zh_hant: 匯出期間產生的結構描述上發生驗證錯誤: 來源: {0} 行: {1} 資料行: {2} 驗證錯誤: {3}

# ErrSingleUseSwitch
source: The {0} option cannot be specified multiple times.
cs: Možnost {0} nemůže být několikanásobně specifikována.
de: Die {0}-Option kann nicht mehrmals angegeben werden.
es: La opción {0} no se puede especificar varias veces.
fr: Impossible de spécifier l'option {0} plusieurs fois.
it: Non è possibile specificare più volte l'opzione {0}.
ja: {0} オプションを複数回指定することはできません。
ko: {0} 옵션은 여러 번 지정할 수 없습니다.
pl: Opcji {0} nie można określać wielokrotnie.
pt_br: A opção {0} não pode ser especificada várias vezes.
ru: Параметр {0} нельзя указывать несколько раз.
tr: {0} seçeneği birkaç kez belirtilemez.
zh_hans: 不能多次指定 {0} 选项。
zh_hant: 不可指定多次 {0} 選項。

# ErrSwitchMissing
source: Invalid argument: '{0}'.
cs: Neplatný argument: {0}.
de: Ungültiges Argument: "{0}".
es: Argumento no válido: "{0}".
fr: Argument non valide : « {0} ».
it: Argomento non valido: '{0}'.
ja: 無効な引数 '{0}' です。
ko: 잘못된 인수: '{0}'.
pl: Nieprawidłowy argument: „{0}”.
pt_br: Argumento inválido: '{0}'.
ru: Недопустимый аргумент: "{0}".
tr: Geçersiz bağımsız değişken: '{0}'.
zh_hans: 参数无效:“{0}”。
zh_hant: 引數無效: '{0}'。

# ErrToolConfigDoesNotExist
source: The config File {0} specified for the --{1} option does not exist.
cs: Konfigurační soubor {0} zadaný pro parametr --{1} neexistuje.
de: Die für die Option --{1} angegebene Konfigurationsdatei "{0}" ist nicht vorhanden.
es: El archivo de configuración {0} especificado para la opción --{1} no existe.
fr: Le fichier config {0} spécifié pour l’option –{1} n’existe pas.
it: Il file di configurazione {0} specificato per l'opzione --{1} non esiste.
ja: --{1} オプションに指定された構成ファイル {0} は存在しません。
ko: --{1} 옵션에 대해 지정한 구성 파일 {0}이(가) 없습니다.
pl: Plik konfiguracji {0} określony dla opcji --{1} nie istnieje.
pt_br: O arquivo de configuração {0} especificado na opção --{1} não existe.
ru: Файл конфигурации {0}, указанный для параметра --{1}, не существует.
tr: --{1} seçeneği için belirtilen {0} yapılandırma dosyası yok.
zh_hans: 为 --{1} 选项指定的配置文件 {0} 不存在。
zh_hant: 為 --{1} 選項指定的設定檔 {0} 不存在。

# ErrUnableToLoadExtensions
source: There was an error loading import extensions. Make sure to provide the assemblies containing these extensions as reference assemblies using the --{0} option.
cs: Při načítání rozšíření importu došlo k chybě. Ujistěte se, že jste jako referenční sestavení pomocí možnosti --{0} poskytli sestavení, která obsahují tato rozšíření.
de: Fehler beim Laden von Importerweiterungen. Stellen Sie sicher, dass die Assemblys, in denen diese Erweiterungen enthalten sind, mithilfe der Option --{0} als Referenzassemblys bereitgestellt werden.
es: Error al cargar extensiones de importación. Asegúrese de proporcionar los ensamblados que contienen estas extensiones como ensamblados de referencia con la opción --{0}.
fr: Une erreur s'est produite durant le chargement des extensions d'importation. Veillez à fournir les assemblys contenant ces extensions en tant qu'assemblys de référence à l'aide de l'option --{0}.
it: Si è verificato un errore durante il caricamento delle estensioni di importazione. Assicurarsi di specificare gli assembly contenenti queste estensioni come assembly di riferimento usando l'opzione --{0}.
ja: インポート拡張の読み込みでエラーが発生しました。--{0} オプションを使用して、これらの拡張を含むアセンブリを参照アセンブリとして指定してください。
ko: 가져오기 확장을 로드하는 동안 오류가 발생했습니다. --{0} 옵션을 사용하여 이 확장이 포함된 어셈블리를 참조 어셈블리로 제공하세요.
pl: Wystąpił błąd podczas ładowania rozszerzeń importowania. Pamiętaj, aby udostępnić zestawy zawierające te rozszerzenia jako zestawy odwołań przy użyciu opcji --{0}.
pt_br: Houve um erro ao carregar extensões de importação. Lembre-se de fornecer os assemblies contendo essas extensões como assemblies de referência usando a opção --{0}.
ru: Произошла ошибка при загрузке расширений импорта. Обязательно укажите сборки с этими расширениями как базовые сборки с помощью параметра --{0}.
tr: İçeri aktarma uzantıları yüklenirken bir hata oluştu. --{0} seçeneğini kullanarak bu uzantıları içeren bütünleştirilmiş kodları başvuru bütünleştirilmiş kodları olarak sağladığınızdan emin olun.
zh_hans: 加载导入扩展时出错。请确保使用 --{0} 选项将包含这些扩展的程序集作为引用程序集提供。
zh_hant: 載入匯入延伸模組時發生錯誤。請確定您已使用 --{0} 選項，提供包含這些延伸模組作為參考組件的組件。

# ErrUnableToLoadFile
source: Cannot read {0}.
cs: Nelze přečíst {0}.
de: {0} kann nicht gelesen werden.
es: No se puede leer {0}.
fr: Nous n’avons pas pu lire {0}.
it: Non è possibile leggere {0}.
ja: {0} を読み取れません。
ko: {0}을(를) 읽을 수 없습니다.
pl: Nie można odczytać elementu {0}.
pt_br: Não é possível ler {0}.
ru: Не удается прочитать {0}.
tr: {0} okunamıyor.
zh_hans: 无法读取 {0}。
zh_hant: 無法讀取 {0}。

# ErrUnableToLoadInputConfig
source: Cannot load the config file {0}
cs: Nelze načíst konfigurační soubor {0}.
de: Die Konfigurationsdatei "{0}" kann nicht geladen werden.
es: No se puede cargar el archivo de configuración {0}
fr: Nous n’avons pas pu télécharger le fichier config {0}
it: Non è possibile caricare il file di configurazione {0}
ja: 構成ファイル {0} を読み込めません
ko: 구성 파일 {0}을(를) 로드할 수 없습니다.
pl: Nie można załadować pliku konfiguracji {0}
pt_br: Não é possível carregar o arquivo de configuração {0}
ru: Не удается загрузить файл конфигурации {0}
tr: {0} yapılandırma dosyası yüklenemiyor
zh_hans: 无法加载配置文件 {0}
zh_hant: 無法載入設定檔 {0}

# ErrUnableToLoadReferenceType
source: There was an error loading a referenced contract type. This type will be ignored. Type: {0}
cs: Při načítání odkazovaného typu kontraktu došlo k chybě. Tento typ bude ignorován. Typ: {0}
de: Fehler beim Laden eines referenzierten Vertragstyps. Dieser Typ wird ignoriert. Typ: {0}
es: Error al cargar un tipo de contrato al que se hace referencia. Este tipo se omitirá. Tipo: {0}
fr: Une erreur s’est produite lors du chargement d’un type de contrat référencé. Ce type sera ignoré. Type : {0}
it: Si è verificato un errore durante il caricamento di un tipo di contratto di riferimento. Questo tipo verrà ignorato. Tipo: {0}
ja: 参照されたコントラクト型の読み込み中にエラーが発生しました。この種類は無視されます。 種類: {0}
ko: 참조된 계약 형식을 로드하는 동안 오류가 발생했습니다. 이 형식은 무시됩니다. 형식: {0}
pl: Wystąpił błąd podczas ładowania przywoływanego typu kontraktu. Ten typ zostanie zignorowany. Typ: {0}
pt_br: Ocorreu um erro ao carregar um tipo de contrato referenciado. Esse tipo será ignorado. Tipo: {0}
ru: Произошла ошибка при загрузке указанного типа контракта. Этот тип будет пропущен. Тип: {0}
tr: Başvurulan anlaşma türü yüklenirken bir hata oluştu. Bu tür yoksayılır. Tür: {0}
zh_hans: 加载引用的协定类型时出错。将忽略此类型。 类型: {0}
zh_hant: 載入參考的合約類型時發生錯誤。將忽略此類型。 類型: {0}

# ErrUnableToUniquifyFilename
source: Cannot create output filename. Too many files are being created with the prefix '{0}'.
cs: Nelze vytvořit název výstupního souboru. Je vytvářeno příliš mnoho souborů s předponou {0}.
de: Der Ausgabedateiname kann nicht erstellt werden. Es werden zu viele Dateien mit dem Präfix "{0}" erstellt.
es: No se puede crear un nombre de archivo de salida. Se han creado demasiados archivos con el prefijo "{0}".
fr: Impossible de créer le nom de fichier de sortie. Les fichiers créés avec le préfixe '{0}' sont trop nombreux.
it: Non è possibile creare il nome file di output. Ci sono troppi file creati con il prefisso '{0}'.
ja: 出力ファイル名を作成できません。プレフィックス '{0}' を使用して作成されているファイルの数が多すぎます。
ko: 출력 파일 이름을 만들 수 없습니다. '{0}' 접두사를 사용하여 너무 많은 파일을 만들고 있습니다.
pl: Nie można utworzyć nazwy pliku wyjściowego. Jest tworzonych zbyt wiele plików z prefiksem „{0}”.
pt_br: Não é possível criar o nome do arquivo de saída. Muitos arquivos estão sendo criados com o prefixo '{0}'.
ru: Не удается создать выходное имя файла. Слишком много файлов создается с префиксом "{0}".
tr: Çıkış dosyası adı oluşturulamıyor. '{0}' ön ekine sahip çok fazla dosya oluşturuluyor.
zh_hans: 无法创建输出文件名。使用前缀“{0}”创建的文件过多。
zh_hant: 無法建立輸出檔名。已使用前置詞 '{0}' 建立太多檔案。
