Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ErrUnexpectedDelimiter
source: Invalid argument: delimiter (':' or '=') cannot start option.
cs: Neplatný argument: oddělovačem (: nebo =) nemůže začínat možnost.
de: Ungültiges Argument: Eine Option darf nicht mit einem Trennzeichen (":" oder "=") beginnen.
es: Argumento no válido: el delimitador (":" o "=") no puede iniciar la opción.
fr: Argument non valide : un délimiteur (':' ou '=') ne peut pas démarrer l'option.
it: Argomento non valido: il delimitatore (':' o '=') non può avviare l'opzione.
ja: 無効な引数: オプションの先頭に区切り文字 (':' または '=') は使用できません。
ko: 잘못된 인수: 구분 기호(':' 또는 '=')로 옵션을 시작할 수 없습니다.
pl: Nieprawidłowy argument: opcja nie może rozpoczynać się ogranicznikiem („:” lub „=”).
pt_br: Argumento inválido: o delimitador (':' ou '=') não pode iniciar a opção.
ru: Недопустимый аргумент: параметр не может начинаться с разделителя (":" или "=").
tr: Geçersiz bağımsız değişken: ayırıcı (':' veya '=') seçenek başlangıcı olamaz.
zh_hans: 参数无效: 分隔符(":" 或 "=")不能作为起始选项。
zh_hant: 引數無效: 選項開頭不可為分隔符號 (':' 或 '=')。

# ErrUnexpectedError
source: An error occurred in the tool.
cs: V nástroji došlo k chybě.
de: Im Tool ist ein Fehler aufgetreten.
es: Error en la herramienta.
fr: Une erreur s'est produite dans l'outil.
it: Si è verificato un errore nello strumento.
ja: ツールでエラーが発生しました。
ko: 도구에서 오류가 발생했습니다.
pl: Wystąpił błąd w narzędziu.
pt_br: Erro na ferramenta.
ru: Ошибка в инструменте.
tr: Araçta bir hata oluştu.
zh_hans: 工具中出错。
zh_hant: 工具中發生錯誤。

# ErrUnexpectedValue
source: The {0} option does not support any values
cs: Parametr {0} nepodporuje žádné hodnoty.
de: Die {0}-Option unterstützt keine Werte.
es: La opción {0} no admite ningún valor
fr: L’option {0} ne prend en charge aucune valeur
it: L'opzione {0} non supporta alcun valore
ja: {0} オプションはどの値もサポートしていません
ko: {0} 옵션은 값을 지원하지 않습니다.
pl: Opcja {0} nie obsługuje żadnych wartości
pt_br: A opção {0} não dá suporte a nenhum valor.
ru: Параметр {0} не поддерживает никаких значений.
tr: {0} seçeneği hiçbir değeri desteklemiyor
zh_hans: {0} 选项不支持任何值
zh_hant: {0} 選項不支援任何值

# ErrUnknownSwitch
source: Unrecognized option '{0}' specified.
cs: Byla zadána nerozpoznaná možnost {0}.
de: Es wurde eine nicht erkannte Option "{0}" angegeben.
es: Se ha especificado una opción que no se reconoce "{0}".
fr: Option '{0}' spécifiée non reconnue.
it: L'opzione specificata '{0}' non è riconosciuta.
ja: 認識できないオプション '{0}' が指定されました。
ko: 인식할 수 없는 옵션 '{0}'이(가) 지정되었습니다.
pl: Określono nierozpoznaną opcję „{0}”.
pt_br: Opção não reconhecida '{0}' especificada.
ru: Указан нераспознанный параметр "{0}".
tr: Tanınmayan seçenek '{0}' belirtildi.
zh_hans: 无法识别指定的选项“{0}”。
zh_hant: 無法辨識指定的選項 '{0}'。

# ErrValidateInvalidUse
source: The {0} option cannot be used with the {1} option.
cs: Parametr {0} nelze použít s parametrem {1}.
de: Die {0}-Option kann nicht zusammen mit der {1}-Option verwendet werden.
es: La opción {0} no se puede utilizar con la opción {1}.
fr: Nous n’avons pas pu utiliser l’option {0} avec l’option {1}.
it: Non è possibile usare l'opzione {0} con l'opzione {1}.
ja: {0} オプションは {1} オプションと一緒に使用できません。
ko: {1} 옵션과 함께 {0} 옵션을 사용할 수 없습니다.
pl: Tej {0} opcji nie można użyć z tą {1} opcją.
pt_br: A opção {0} não pode ser usada com a {1} opção.
ru: Параметр {0} нельзя использовать с параметром {1}.
tr: {0} seçeneği, {1} seçeneğiyle kullanılamaz.
zh_hans: {0} 选项无法与 {1} 选项一起使用。
zh_hant: {0} 選項無法搭配 {1} 選項使用。

# ErrValidateRequiresServiceName
source: To validate a service, the --{0} option must be used to specify the service to validate.
cs: Pokud chcete ověřit službu, musí se k určení služby, která se má ověřit, použít parametr --{0}.
de: Zum Validieren eines Diensts muss mithilfe der Option --{0} der zu validierende Dienst angegeben werden.
es: Para validar un servicio, se debe utilizar la opción --{0} para especificar el servicio que se va a validar.
fr: Pour valider un service, l’option –{0} doit être utilisée pour spécifier le service à valider.
it: Per convalidare un servizio, è necessario usare l'opzione --{0} per specificare il servizio da convalidare.
ja: サービスを検証するには、--{0} オプションを使用して、検証するサービスを指定する必要があります。
ko: 서비스의 유효성을 검사하려면 --{0} 옵션을 사용하여 유효성을 검사할 서비스를 지정해야 합니다.
pl: Aby zweryfikować usługę, należy użyć opcji --{0}, aby określić usługę do zweryfikowania.
pt_br: Para validar um serviço, a opção --{0} deve ser usada para especificar o serviço a ser validado.
ru: Чтобы проверить службу, необходимо использовать параметр --{0} для указания службы для проверки.
tr: Bir hizmeti doğrulamak için, doğrulanacak hizmeti belirtmek üzere --{0} seçeneği kullanılmalıdır.
zh_hans: 要验证服务，必须使用 --{0} 选项指定要验证的服务。
zh_hant: 若要驗證服務，必須使用 --{0} 選項指定要驗證的服務。

source: Error:
cs: Chyba:
de: Fehler:
fr: Erreur :
it: Errore:
ja: エラー:
ko: 오류:
pl: Błąd:
pt_br: Erro:
ru: Ошибка:
tr: Hata
zh_hans: 错误:
zh_hant: 錯誤:

# GenerateSerializerNotFound
source: Svcutil does not work with the framework of the version being used. 'System.Xml.Serialization.XmlSerializer' does not have a method named 'GenerateSerializer'.
cs: Svcutil nefunguje s architekturou používané verze. System.Xml.Serialization.XmlSerializer nemá metodu s názvem GenerateSerializer.
de: Svcutil funktioniert nicht mit dem Framework der verwendeten Version. "System.Xml.Serialization.XmlSerializer" weist keine Methode mit dem Namen "GenerateSerializer" auf.
es: Svcutil no funciona con el marco de la versión que se usa. “System.Xml.Serialization.XmlSerializer” no tiene un método denominado “GenerateSerializer”.
fr: Svcutil ne fonctionne pas avec l’infrastructure de la version utilisée. « System.Xml.Serialization.XmlSerializer » n’a pas de méthode nommée « GenerateSerializer ».
it: Svcutil non funziona con il framework della versione in uso. 'System.Xml.Serialization.XmlSerializer' non dispone di un metodo denominato 'GenerateSerializer'.
ja: Svcutil は、使用されているバージョンのフレームワークでは機能しません。'System.Xml.Serialization.XmlSerializer' には 'GenerateSerializer' という名前のメソッドがありません。
ko: Svcutil은 사용 중인 버전의 프레임워크에서 작동하지 않습니다. 'System.Xml.Serialization.XmlSerializer'에는 'GenerateSerializer'라는 메서드가 없습니다.
pl: Program Svcutil nie działa ze strukturą używanej wersji. Element „System.Xml.Serialization.XmlSerializer” nie ma metody o nazwie „GenerateSerializer”.
pt_br: O Svcutil não funciona com a estrutura da versão que está sendo usada. 'System.Xml.Serialization.XmlSerializer' não tem um método chamado 'GenerateSerializer'.
ru: Svcutil не работает с инфраструктурой используемой версии. "System.Xml.Serialization.XmlSerializer" не содержит метода "GenerateSerializer".
tr: Svcutil, kullanılan sürümün çerçevesiyle çalışmaz. 'System.Xml.Serialization.XmlSerializer', 'GenerateSerializer' adlı bir yönteme sahip değil.
zh_hans: Svcutil 不适用于所使用的版本的框架。“System.Xml.Serialization.XmlSerializer”没有名为“GenerateSerializer”的方法。
zh_hant: Svcutil 無法搭配要使用的版本架構使用。'System.Xml.Serialization.XmlSerializer' 沒有名為 'GenerateSerializer' 的方法。

source: Generating files...
cs: Generují se soubory...
de: Dateien werden generiert...
es: Generando archivos...
fr: Génération de fichiers...
it: Generazione dei file...
ja: ファイルを生成しています...
ko: 파일 생성 중...
pl: Trwa generowanie plików...
pt_br: Gerando arquivos...
ru: Создание файлов...
tr: Dosyalar oluşturuluyor...
zh_hans: 正在生成文件...
zh_hant: 正在產生檔案...

# GeneratingSerializer
source: Generating XML serializers...
cs: Generování serializátorů XML...
de: XML-Serialisierer werden generiert...
es: Generando serializadores XML...
fr: Génération de sérialiseurs XML...
it: Generazione serializzatori XML...
ja: XML シリアライザーを生成しています...
ko: XML 직렬화기 생성 중...
pl: Trwa generowanie serializatorów XML...
pt_br: Gerando serializadores XML...
ru: Идет генерирование сериализаторов XML...
tr: XML serileştiricileri oluşturuluyor...
zh_hans: 正在生成 XML 序列化程序...
zh_hant: 正在產生 XML 序列化程式...

# HelpCodeGenerationAbbreviationSyntax
source: Syntax: {0} [-{1}:{2}] {3}* | {4}* | {5}
cs: Syntaxe: {0} [-{1}:{2}] {3}* | {4}* | {5}
es: Sintaxis: {0} [-{1}:{2}] {3}* | {4}* | {5}
fr: Syntaxe : {0} [-{1}:{2}] {3}* | {4}* | {5}
it: Sintassi: {0} [-{1}:{2}] {3}* | {4}* | {5}
ja: 構文: {0} [-{1}:{2}] {3}* | {4}* | {5}
ko: 구문: {0} [-{1}:{2}] {3}* | {4}* | {5}
pl: Składnia: {0} [-{1}:{2}] {3}* | {4}* | {5}
pt_br: Sintaxe: {0} [-{1}:{2}] {3}* | {4}* | {5}
tr: Söz dizimi: {0} [-{1}:{2}] {3}* | {4}* | {5}
zh_hans: 语法: {0} [-{1}:{2}] {3}* | {4}* | {5}
zh_hant: 語法: {0} [-{1}:{2}] {3}* | {4}* | {5}

# HelpCodeGenerationCategory
source: -= CODE GENERATION =-
cs: -= GENEROVÁNÍ KÓDU =-
de: -= CODEGENERIERUNG =-
es: -= GENERACIÓN DE CÓDIGO =-
fr: -= GÉNÉRATION DE CODE =-
it: -= GENERAZIONE DEL CODICE =-
ja: -= コード生成 =-
ko: -= 코드 생성 =-
pl: -= GENEROWANIE KODU =-
pt_br: -= GERAÇÃO DE CÓDIGO =-
ru: -= ФОРМИРОВАНИЕ КОДА =-
tr: - KOD OLUŞTURMA -
zh_hans: -= 代码生成 =-
zh_hant: -= 程式碼產生 =-

# HelpCodeGenerationDescription
source: Description: {0} can generate code for service contracts, clients and data types from metadata documents. These metadata documents can be on disk or retrieved online. Online retrieval follows either the WS-Metadata Exchange protocol or the DISCO protocol.
cs: Popis: {0} může generovat kód pro kontrakty služeb, klienty a datové typy z dokumentů metadat. Tyto dokumenty metadat mohou být na disku nebo načteny online. Online načtení se řídí buď protokolem WS-Metadata Exchange, nebo protokolem DISCO.
de: Beschreibung: {0} können Code für Dienstverträge, Clients und Datentypen aus Metadatendokumenten generieren. Diese Metadatendokumente können sich auf dem Datenträger befinden oder online abgerufen werden. Der Onlineabruf folgt entweder dem WS-Metadata Exchange-Protokoll oder dem DISCO-Protokoll.
es: Descripción: {0} puede generar código para contratos de servicio, clientes y tipos de datos a partir de documentos de metadatos. Estos documentos de metadatos pueden estar en disco o recuperarse en línea. La recuperación en línea sigue el protocolo WS-Metadata Exchange o el protocolo DISCO.
fr: Description : {0}peut générer du code pour les contrats de service, les clients et les types de données à partir de documents de métadonnées. Ces documents de métadonnées peuvent se trouver sur le disque ou être récupérés en ligne. La récupération en ligne suit les protocoles WS-Metadata Exchange ou DISCA.
it: Descrizione: {0} può generare codice per contratti di servizio, client e tipi di dati da documenti di metadati. Questi documenti di metadati possono risiedere su disco o essere recuperati online. Il recupero online segue il protocollo WS-Metadata Exchange o il protocollo DISCO.
ja: 説明: {0} は、メタデータ ドキュメントからサービス コントラクト、クライアント、データ型のコードを生成できます。これらのメタデータ ドキュメントは、ディスク上にあるか、オンラインで取得できます。オンライン取得は、WS-Metadata Exchange プロトコルまたは DISCO プロトコルのいずれかに従います。
ko: 설명: {0}은(는) 메타데이터 문서에서 서비스 계약, 클라이언트 및 데이터 형식에 대한 코드를 생성할 수 있습니다. 이러한 메타데이터 문서는 디스크에 있거나 온라인으로 검색할 수 있습니다. 온라인 검색은 WS-Metadata Exchange 프로토콜 또는 DISCO 프로토콜을 따릅니다.
pl: Opis: {0} na podstawie dokumentów metadanych można wygenerować kod dla kontraktów usług, klientów i typów danych. Te dokumenty metadanych mogą znajdować się na dysku lub być pobierane w trybie online. Pobieranie w trybie online odbywa się zgodnie z protokołem WS-Metadata Exchange lub protokołem DISCO.
pt_br: Descrição: {0} pode gerar código para contratos de serviço, clientes e tipos de dados de documentos de metadados. Esses documentos de metadados podem estar em disco ou recuperados online. A recuperação online segue o protocolo WS-Metadata Exchange ou o protocolo DISCO.
ru: Описание: {0} может создавать код для контрактов на обслуживание, клиентов и типов данных из документов метаданных. Эти документы метаданных могут храниться на диске или быть доступны в Интернете. Веб-поиск осуществляется по протоколу WS-Metadata Exchange или по протоколу DISCO.
tr: Açıklama: {0}, meta veri belgelerinden hizmet anlaşmaları, müşteriler ve veri türleri için kod oluşturabilir. Bu meta veri belgeleri diskte olabilir veya çevrimiçi olarak alınabilir. Çevrimiçi alma, WS-Metadata Exchange protokolünü veya DISCO protokolünü izler.
zh_hans: 说明: {0} 可以从元数据文档为服务合约、客户端和数据类型生成代码。这些元数据文档可以位于磁盘或联机检索上。联机检索遵循 WS-Metadata Exchange 协议 或 DISCO 协议。
zh_hant: 描述: {0} 可以從中繼資料文件產生服務合約、用戶端和資料類型的程式碼。這些中繼資料文件可以在磁碟上或在線上擷取。線上擷取會遵循 WS-Metadata Exchange 通訊協定或 DISCO 通訊協定。

# HelpCodeGenerationServiceContract
source: Generate code for Service Contracts. Client class and configuration will not be generated. (Short Form: -{0})
cs: Vygenerovat kód pro kontrakty služeb Třída a konfigurace klienta se nevygenerují. (Krátký tvar: -{0})
de: Generieren Sie Code für Dienstleistungsverträge. Clientklasse und -konfiguration werden nicht generiert. (Kurzform: -{0})
es: Generar código para contratos de servicio. No se generará la clase de cliente ni la configuración. (Forma corta: -{0})
fr: Générez du code pour les contrats de service. La classe et la configuration du client ne seront pas générées. (Forme abrégée : -{0})
it: Generare il codice per i contratti di servizio. La classe e la configurazione del client non verranno generate. (Forma breve: -{0})
ja: サービス コントラクトのコードを生成します。クライアント クラスと構成は生成されません。(短い形式: -{0})
ko: 서비스 계약에 대한 코드를 생성합니다. 클라이언트 클래스 및 구성이 생성되지 않습니다. (약식: -{0})
pl: Generuj kod dla kontraktów usług. Klasa i konfiguracja klienta nie zostaną wygenerowane. (Krótka wersja: —{0})
pt_br: Gerar código para Contratos de Serviço. A classe e a configuração do cliente não serão geradas. (Forma Resumida: -{0})
ru: Создать код для контрактов службы. Класс и конфигурация клиента не будут созданы. (Краткая форма: -{0})
tr: Hizmet Anlaşmaları için kod oluşturun. İstemci sınıfı ve yapılandırması oluşturulmayacak. (Kısa Biçim: -{0})
zh_hans: 为服务合约生成代码。不会生成客户端类和配置。(缩写: -{0})
zh_hant: 產生服務合約的程式碼。將不會產生用戶端類別和設定。(簡短形式: -{0})

# HelpCodeGenerationSyntaxInput1
source: The path to a metadata document (wsdl or xsd). Standard command-line wildcards can be used in the file path.
cs: Cesta k dokumentu metadat (wsdl nebo xsd). V cestě k souboru lze použít standardní zástupné znaky příkazového řádku.
de: Der Pfad zu einem Metadatendokument (WSDL oder XSD). Im Dateipfad können standardmäßige Befehlszeilen-Platzhalterzeichen verwendet werden.
es: La ruta de acceso a un documento de metadatos (wsdl o xsd). En la ruta de acceso al archivo se pueden utilizar comodines estándar de la línea de comandos.
fr: Chemin d'un document de métadonnées (wsdl ou xsd). Des caractères génériques de ligne de commande standard peuvent être utilisés dans le chemin du fichier.
it: Percorso di un documento dei metadati (wsdl o xsd). Nel percorso del file è possibile usare caratteri jolly della riga di comando standard.
ja: メタデータ ドキュメント (wsdl または xsd) へのパスです。ファイル パスでは、標準のコマンドライン ワイルドカードを使用できます。
ko: 메타데이터 문서(wsdl 또는 xsd)의 경로입니다. 파일 경로에 표준 명령줄 와일드카드를 사용할 수 있습니다.
pl: Ścieżka do dokumentu metadanych (wsdl lub xsd). W ścieżce do pliku można użyć standardowych symboli wieloznacznych wiersza polecenia.
pt_br: O caminho para um documento de metadados (wsdl ou xsd). Curingas padrão de linha de comando podem ser usados no caminho do arquivo.
ru: Путь к документу метаданных (wsdl или xsd). В пути файла можно использовать стандартные подстановочные знаки командной строки.
tr: Bir meta veri belgesinin (wsdl veya xsd) yolu. Dosya yolunda standart komut satırı joker parçacıkları kullanılabilir.
zh_hans: 元数据文档(wsdl 或 xsd)的路径。可以在文件路径中使用标准的命令行通配符。
zh_hant: 中繼資料文件 (wsdl 或 xsd) 的路徑。您可以在檔案路徑中使用標準命令列萬用字元。

# HelpCodeGenerationSyntaxInput2
source: The URL to a service endpoint that provides metadata or to a metadata document hosted online. For more information on how these documents are retrieved see the Metadata Download section.
cs: Adresa URL ke koncovému bodu služby, který poskytuje metadata, nebo k dokumentu metadat hostovanému online. Další informace o tom, jak se tyto dokumenty načítají, najdete v části Stažení metadat.
de: Die URL zu einem Dienstendpunkt, der Metadaten bereitstellt, oder zu einem online gehosteten Metadatendokument. Weitere Informationen zum Abrufen dieser Dokumente finden Sie im Abschnitt "Metadatendownload".
es: La dirección URL que señala a un punto de conexión de servicio que proporciona metadatos o a un documento de metadatos hospedado en línea. Para obtener más información sobre cómo se recuperan estos documentos, consulte la sección Descarga de metadatos.
fr: URL d’un point de terminaison de service qui fournit des métadonnées ou qui pointe vers un document de métadonnées hébergé en ligne. Pour plus d’informations sur la façon dont ces documents sont récupérés, consultez la section Téléchargement des métadonnées.
it: URL di un endpoint servizio che fornisce metadati o di un documento di metadati ospitato online. Per altre informazioni su come recuperare questi documenti, vedere la sezione Download metadati.
ja: メタデータを提供するサービス エンドポイント、またはオンラインでホストされているメタデータ ドキュメントを指す URL です。これらのドキュメントの取得方法の詳細については、「メタデータのダウンロード」セクションを参照してください。
ko: 메타데이터를 제공하는 서비스 엔드포인트의 URL 또는 온라인에 호스트된 메타데이터 문서의 URL입니다. 이러한 문서를 검색하는 방법에 대한 자세한 내용은 메타데이터 다운로드 섹션을 참조하세요.
pl: Adres URL punktu końcowego usługi, który udostępnia metadane, lub dokumentu z metadanymi hostowanego w trybie online. Aby uzyskać więcej informacji na temat pobierania tych dokumentów, zobacz sekcję Pobieranie metadanych.
pt_br: A URL para um ponto de extremidade de serviço que fornece metadados ou para um documento de metadados hospedado online. Para obter mais informações sobre como esses documentos são recuperados, consulte a seção Download de Metadados.
ru: URL-адрес конечной точки службы, предоставляющей метаданные, или документа метаданных, размещенного в сети. Дополнительные сведения о том, как эти документы извлекаются, см. в разделе "Загрузка метаданных".
tr: Meta verileri ya da çevrimiçi barındırılan bir meta veri belgesini sağlayan bir servis uç noktasının URL'si. Bu belgelerin alınma durumu hakkında daha fazla bilgi için Meta Veri İndirme bölümüne bakın.
zh_hans: 提供元数据的服务终结点的 URL，或指向联机托管元数据文档的 URL。有关如何检索这些文档的详细信息，请参阅“元数据下载”部分。
zh_hant: 提供中繼資料服務端點的 URL，或指向線上裝載的中繼資料文件的 URL。如需如何擷取這些文件的詳細資訊，請參閱中繼資料下載一節。

# HelpCodeGenerationSyntaxInput3
source: The path to an XML file that contains a WS-Addressing EndpointReference for a service endpoint that supports WS-Metadata Exchange. For more information see the Metadata Download section.
cs: Cesta k souboru XML, který obsahuje WS-Addressing EndpointReference pro koncový bod služby podporující WS-Metadata Exchange. Další informace najdete v části Stažení metadat.
de: Der Pfad zu einer XML-Datei, die einen WS-Addressing-EndpointReference für einen Dienstendpunkt enthält, der WS-Metadata Exchange unterstützt. Weitere Informationen finden Sie im Abschnitt "Metadatendownload".
es: La ruta de acceso a un archivo XML que contiene WS-Addressing EndpointReference para un punto de conexión de servicio que admite WS-Metadata Exchange. Para obtener más información, consulte la sección Descarga de metadatos.
fr: Chemin d’un fichier XML qui contient un EndpointReference WS-Addressing pour un point de terminaison de service qui prend en charge WS-Metadata Exchange. Pour plus d’informations, consultez la section Téléchargement des métadonnées.
it: Percorso di un file XML contenente un elemento WS-Addressing EndpointReference per un endpoint servizio che supporta WS-Metadata Exchange. Per altre informazioni, vedere la sezione Download metadati.
ja: WS-Metadata Exchange をサポートするサービス エンドポイントの WS-Addressing EndpointReference を含む XML ファイルへのパスです。詳細については、「メタデータ ダウンロード」セクションを参照してください。
ko: WS-Metadata Exchange를 지원하는 서비스 엔드포인트에 대한 WS-Addressing EndpointReference가 포함된 XML 파일의 경로입니다. 자세한 내용은 메타데이터 다운로드 섹션을 참조하세요.
pl: Ścieżka do pliku XML zawierającego odwołanie WS-Addressing EndpointReference dla punktu końcowego usługi, który obsługuje protokół WS-Metadata Exchange. Aby uzyskać więcej informacji, zobacz sekcję Pobieranie metadanych.
pt_br: O caminho para um arquivo XML que contém uma EndpointReference de WS-Addressing para o ponto de extremidade de serviço que dá suporte ao WS-Metadata Exchange. Para obter mais informações, consulte a seção Download de metadados.
ru: Путь к XML-файлу, который содержит элемент WS-Addressing EndpointReference для конечной точки службы, поддерживающей обмен метаданными через WS-Metadata Exchange. Дополнительные сведения см. в разделе "Загрузка метаданных".
tr: WS-Metadata Exchange'i destekleyen bir servis uç noktası için WS-Addressing EndpointReference içeren bir XML dosyasının yolu. Daha fazla bilgi için Meta Veri İndirme bölümüne bakın.
zh_hans: 包含服务终结点的 WS-Addressing EndpointReference (它支持 WS-Metadata Exchange)的 XML 文件路径。有关详细信息，请参阅“元数据下载”部分。
zh_hant: XML 檔案的路徑包含支援 WS-Metadata Exchange 之服務端點的 WS-Addressing EndpointReference。如需詳細資訊，請參閱中繼資料下載一節。

# HelpCollectionType
source: A fully-qualified or assembly-qualified name of the type to use as a collection data type when code is generated from schemas. (Short Form: -{0})
cs: Plně kvalifikovaný název nebo kvalifikovaný název sestavení daného typu, který bude použit jako datový typ kolekce ve chvíli, kdy bude ze schémat vygenerován kód. (Krátký tvar: /{0})
de: Ein vollqualifizierter Name oder ein qualifizierter Assemblyname des Typs, der bei der Generierung von Code aus Schemas als Sammlungsdatentyp zu verwenden ist. (Kurzform: /{0})
es: Un nombre completo o calificado con el ensamblado del tipo que se va a utilizar como tipo de datos de colección cuando se genera código de los esquemas. (Forma corta: /{0})
fr: Nom complet ou nom qualifié d'assembly du type à utiliser comme type de données de collection quand le code est généré à partir de schémas. (Forme abrégée : /{0})
it: Nome completo o nome qualificato dall'assembly del tipo da usare come tipo di dati delle raccolte quando il codice viene generato da schemi. Forma breve: -{0}
ja: コードがスキーマから生成される場合に、コレクション データ型として使用する型の完全修飾またはアセンブリ修飾名です。(短い形式: -{0})
ko: 스키마에서 코드를 생성할 때 컬렉션 데이터 형식으로 사용할 형식의 정규화된 이름 또는 정규화된 어셈블리 이름입니다(약식: -{0}).
pl: W pełni kwalifikowana lub kwalifikowana dla zestawu nazwa typu do użycia w formie typu danych kolekcji podczas generowania kodu ze schematów. (Krótka wersja: -{0})
pt_br: Um nome qualificado pelo assembly ou totalmente qualificado do tipo a ser usado como um tipo de dados de coleção quando o código é gerado com base nos esquemas. (Forma Abreviada: /{0})
ru: Полное имя типа или имя типа, определенное через сборку, которое используется как тип данных коллекции, когда код формируется из схем. (Краткая форма: /{0})
tr: Şemalardan kod üretilirken bir koleksiyon veri türü olarak kullanılacak türün tam veya bütünleştirilmiş kodla nitelenen adı. (Kısa Biçim: -{0})
zh_hans: 基于架构生成代码时，作为集合数据类型使用的类型的完全限定的名称或程序集限定名称。(缩写: -{0})
zh_hant: 從結構描述產生程式碼時，要用作為集合資料類型之類型的完整名稱或符合組件要求的名稱。(簡短形式: /{0})

# HelpCommonOptionsCategory
source: -= COMMON OPTIONS =-
cs: -= SPOLEČNÉ MOŽNOSTI =-
de: -= ALLGEMEINE OPTIONEN =-
es: -= OPCIONES COMUNES =-
fr: -= OPTIONS COURANTES =-
it: -= OPZIONI COMUNI =-
ja: -= 共通のオプション =-
ko: -= 일반 옵션 =-
pl: -= TYPOWE OPCJE =-
pt_br: -= OPÇÕES COMUNS =-
ru: -= ОБЩИЕ ПАРАМЕТРЫ =-
tr: -= ORTAK SEÇENEKLER =-
zh_hans: -= 常用选项 =-
zh_hant: -= 常用選項 =-
