Repository: dotnet/wcf
Catalog: src/svcutilcore/src/Resources/xlf/Strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# HelpXmlSerializerTypeGenerationCategory
source: -= XMLSERIALIZER TYPE GENERATION =-
cs: -= GENEROVÁNÍ TYPU XMLSERIALIZER =-
de: -= XMLSERIALIZER-TYPGENERIERUNG =-
es: -= GENERADOR DE TIPOS XMLSERIALIZER =-
fr: -= GÉNÉRATION DE TYPES XMLSERIALIZER =-
it: -= GENERAZIONE TIPO XMLSERIALIZER =-
ja: -= XMLSERIALIZER 型の生成 =-
ko: -= XmlSerializer 형식 생성 =-
pl: -= GENEROWANIE TYPU XMLSERIALIZER =-
pt_br: -= GERAÇÃO DE TIPO XMLSERIALIZER =-
ru: -= ГЕНЕРИРОВАНИЕ ТИПОВ С ПОМОЩЬЮ СЕРИАЛИЗАТОРА XMLSERIALIZER =-
tr: -= XMLSERIALIZER TÜRÜ OLUŞTURMA =-
zh_hans: -= XMLSERIALIZER 类型生成 =-
zh_hant: -= XMLSERIALIZER 類型產生 =-

# HelpXmlSerializerTypeGenerationDescription
source: Description: {0} can pre-generate C# serialization code that is required for types that can be serialized using the XmlSerializer. {0} will only generate code for types used by Service Contracts found in the input assemblies.
cs: Popis: {0} může předem vygenerovat serializační kód jazyka C#, který je vyžadován pro typy, které lze serializovat pomocí typu XmlSerializer. {0} vygeneruje kód pouze pro typy používané kontrakty služeb nalezené ve vstupních sestaveních.
de: Beschreibung: {0} kann C#-Serialisierungscode vorgenerieren, der für Typen erforderlich ist, die mithilfe des XmlSerializer serialisiert werden können. {0} generiert Code nur für Typen, die von Dienstverträgen verwendet werden, die sich in den Eingabeassemblys befinden.
es: Descripción: {0} puede generar previamente código de serialización de C# necesario para los tipos que se pueden serializar mediante XmlSerializer. {0} solo generará código para los tipos usados por los contratos de servicio que se encuentran en los ensamblados de entrada.
fr: Description : {0} pouvez pré-générer du code de sérialisation C# requis pour les types qui peuvent être sérialisés à l’aide du XmlSerializer. {0} génère uniquement du code pour les types utilisés par les contrats de service trouvés dans les assemblys d’entrée.
it: Descrizione: {0} può pregenerare il codice di serializzazione C# necessario per i tipi che possono essere serializzati tramite XmlSerializer. {0} genera solo il codice per i tipi usati dai contratti di servizio trovati negli assembly di input.
ja: 説明: {0} は、XmlSerializer を使用してシリアル化できる型に必要な C# シリアル化コードを事前に生成できます。{0} は、入力アセンブリ内にあるサービス コントラクトで使用される型のコードのみを生成します。
ko: 설명: {0}은(는) XmlSerializer를 사용하여 serialization할 수 있는 형식에 필요한 C# serialization 코드를 미리 생성할 수 있습니다. {0}은(는) 입력 어셈블리에서 찾은 서비스 계약에 사용되는 형식에 대한 코드만 생성합니다.
pl: Opis: {0} może wstępnie wygenerować kod serializacji C#, który jest wymagany dla typów, które mogą być serializowane za pomocą funkcji XmlSerializer. {0} wygeneruje kod tylko dla typów używanych przez kontrakty usług znalezione w zestawach danych wejściowych.
pt_br: Description: {0} pode gerar previamente o código de serialização C# necessário para tipos que podem ser serializados usando o XmlSerializer. {0} gerará código apenas para tipos usados pelos Contratos de Serviço encontrados nos assemblies de entrada.
ru: Описание: {0} может генерировать предварительный код сериализации C#, необходимый для типов, которые можно сериализовать посредством сериализатора XmlSerializer. {0} генерирует только код для типов, которые используются контрактами служб, содержащимися во входных сборках.
tr: Açıklama: {0}, XmlSerializer kullanılarak seri hale getirilebilir türler için gereken C# serileştirme kodunu önceden üretebilir. {0}, yalnızca giriş bütünleştirilmiş kodlarında bulunan Hizmet Anlaşmaları tarafından kullanılan türler için kod üretir.
zh_hans: 说明: {0} 可以预生成 C# 序列化代码，该代码是在可以使用 XmlSerializer 进行序列化的类型所必需的。{0} 将只为在输入程序集中找到的服务约定所使用的类型生成代码。
zh_hant: 描述: {0} 可以預先產生可使用 XmlSerializer 序列化的類型所需的 C# 序列化程式碼。{0} 將只會為服務合約所使用、在輸入組件中找到的類型產生程式碼。

# HelpXmlSerializerTypeGenerationSyntax
source: Syntax: {0} {1}*
cs: Syntaxe: {0} {1}*
es: Sintaxis: {0} {1}*
fr: Syntaxe : {0} {1}*
it: Sintassi: {0} {1}*
ja: 構文: {0} {1}*
ko: 구문: {0} {1}*
pl: Składnia: {0} {1}*
pt_br: Sintaxe: {0} {1}*
ru: Синтаксис: {0} {1}*
tr: Söz dizimi: {0} {1}*
zh_hans: 语法: {0} {1}*
zh_hant: 語法: {0} {1}*

# HelpXmlSerializerTypeGenerationSyntaxInput1
source: The path to an assembly containing Service Contract types. Serialization types will be generated for all Xml Serializable types in each contract
cs: Cesta k sestavení s typy kontraktů služby. Typy serializace se vygenerují pro všechny serializovatelné typy XML v každém kontraktu.
de: Der Pfad zu einer Assembly, die Dienstvertragstypen enthält. Serialisierungstypen werden für alle serialisierbaren XML-Typen in jedem Vertrag generiert.
es: Ruta de acceso a un ensamblado que contiene tipos de contrato de servicio. Se generarán tipos de serialización para todos los tipos Serializables XML de cada contrato.
fr: Chemin d’accès à un assembly contenant les types contrat de service. Les types de sérialisation seront générés pour tous les types Sérialisables XML dans chaque contrat
it: Percorso di un assembly contenente i tipi di contratto di servizio. I tipi di serializzazione verranno generati per tutti i tipi xml serializzabili in ogni contratto
ja: サービス コントラクト型を含むアセンブリへのパス。シリアル化の種類は、各コントラクトのすべての XML シリアル化可能な型に対して生成されます
ko: 서비스 계약 형식을 포함하는 어셈블리의 경로입니다. serialization 형식은 각 계약의 모든 Xml 직렬화 가능 형식에 대해 생성됩니다.
pl: Ścieżka do zestawu zawierającego typy kontraktów usługi. Typy serializacji zostaną wygenerowane dla wszystkich serializowalnych typów Xml w każdym kontrakcie
pt_br: O caminho para um assembly que contém tipos de Contrato de Serviço. Os tipos de serialização serão gerados para todos os tipos Serializáveis Xml em cada contrato
ru: Путь к сборке, содержащей типы контрактов служб. Типы сериализации будут сформированы для всех сериализуемых типов XML в каждом контракте
tr: Hizmet Anlaşması türlerini içeren bir bütünleştirilmiş kodun yolu. Serileştirme türleri, her anlaşmadaki tüm Xml Serileştirilebilir türleri için oluşturulur
zh_hans: 包含服务合约类型的程序集的路径。将为每个合约中的所有 Xml 可序列化类型生成序列化类型
zh_hant: 包含服務合約類型的組件路徑。將針對每個合約中的所有 XML 可序列化類型產生序列化類型

# HelpXmlSerializerTypeGenerationSyntaxInput2
source: Add the specified assembly to the set of assemblies used for resolving type references. (Short Form: -{0})
cs: Přidejte zadané sestavení do sady sestavení, která se používají k překladu odkazů na typy. (Krátký tvar: -{0})
de: Fügt die angegebene Assembly dem Satz von Assemblys hinzu, die zum Auflösen von Typverweisen verwendet werden. (Kurzform: -{0})
es: Agregue el ensamblado especificado al conjunto de ensamblados usados para resolver referencias de tipo. (Forma corta: /{0})
fr: Ajoutez l’assembly spécifié à l’ensemble d’assemblys utilisé pour résoudre les références de type. (Forme abrégée : /{0})
it: Aggiunge l'assembly specificato al set di assembly usato per risolvere i riferimenti di tipo. (Forma breve: -{0})
ja: 指定されたアセンブリを、型の参照の解決に使用されるアセンブリのセットに追加します。(短い形式: -{0})
ko: 형식 참조를 확인하는 데 사용되는 어셈블리 집합에 지정된 어셈블리를 추가합니다. (약식: -{0})
pl: Dodaj określony zestaw do zestawu zestawów używanych do rozpoznawania odwołań do typów. (Krótka wersja: —{0})
pt_br: Adicione o assembly especificado ao conjunto de assemblies usados para resolver referências de tipo. (Forma Abreviada: -{0})
ru: Добавление указанных сборок в набор сборок, используемых для разрешения ссылок типов. (Краткая форма: -{0})
tr: Belirtilen bütünleştirilmiş kodu tür başvurularını çözümlemek için kullanılan bütünleştirilmiş kodlar kümesine ekleyin. (Kısa Biçim: -{0})
zh_hans: 将指定的程序集添加到用于解析类型引用的程序集的集合。(缩写: -{0})
zh_hant: 將指定的組件新增到用來解析類型參考的一組組件。(簡短形式: -{0})

# HelpXmlSerializerTypeGenerationSyntaxInput3
source: Fully-qualified or assembly-qualified type name to exclude from export or validation. This option can be used when exporting metadata for a service or a set of service contracts to exclude types from being exported. (Short Form: -{0})
cs: Plně kvalifikovaný název typu nebo název typu kvalifikovaný pro sestavení, který bude vyloučen z exportu nebo ověřování. Tento parametr lze použít při exportu metadat pro kontrakty služby nebo sadu kontraktů služeb k vyloučení typů z exportu. (Krátký tvar: -{0})
de: Vollqualifizierter Typname oder Typname mit Assemblyqualifikation, der vom Export oder der Validierung ausgeschlossen werden soll. Diese Option kann verwendet werden, wenn Metadaten für einen Dienst oder eine Reihe von Dienstverträgen exportiert werden, um Typen vom Export auszuschließen. (Kurzform: -{0})
es: Nombre de tipo calificado con el ensamblado o completo que se va a excluir de la exportación o validación. Esta opción se puede usar al exportar metadatos para un servicio o un conjunto de contratos de servicio para excluir tipos de la exportación. (Forma corta: /{0})
fr: Nom de type complet ou qualifié d’assembly à exclure de l’exportation ou de la validation. Cette option peut être utilisée lors de l’exportation des métadonnées d’un service ou d’un ensemble de contrats de service pour exclure l’exportation des types. (Forme abrégée : /{0})
it: Nome di tipo completamente qualificato o qualificato dall'assembly da escludere dall'esportazione o dalla convalida. Questa opzione può essere usata quando si esportano i metadati di un servizio o di un set di contratti di servizio per escludere i tipi dall'esportazione. (Forma breve: -{0})
ja: エクスポートまたは検証から除外する型の完全修飾名またはアセンブリ修飾型名です。このオプションは、エクスポートから型を除外するサービスまたはサービス コントラクトのセットのメタデータをエクスポートする場合に使用できます。(短い形式: -{0})
ko: 내보내기 또는 유효성 검사에서 제외할 정규화된 형식 또는 어셈블리 정규화된 형식 이름입니다. 이 옵션은 서비스 또는 서비스 계약 집합에 대한 메타데이터를 내보낼 때 형식을 내보낼 수 없도록 제외하는 데 사용할 수 있습니다. (약식: -{0})
pl: W pełni kwalifikowana lub kwalifikowana nazwa typu zespołu do wykluczenia z eksportu lub walidacji. Opcja ta może być używana podczas eksportowania metadanych dla usługi lub zestawu kontraktów usług, aby wykluczyć typy z eksportu. (Krótka wersja: —{0})
pt_br: Nome de tipo totalmente qualificado ou qualificado por assembly a ser excluído da exportação ou validação. Esta opção pode ser usada ao exportar metadados para um serviço ou um conjunto de contratos de serviço para excluir tipos de serem exportados. (Forma Abreviada: -{0})
ru: Полное имя типа или имя типа, определенное через сборку, для исключения из списка экспорта или проверки. Этот параметр можно использовать при экспорте метаданных для службы или набора контрактов службы, чтобы исключить типы из экспорта. (Краткая форма: -{0})
tr: Dışarı aktarma veya doğrulamadan dışlanacak tam veya bütünleştirilmiş kodla nitelenen tür adı. Bu seçenek, bir hizmete veya bir dizi hizmet sözleşmesine ilişkin meta verileri dışa aktarırken türlerin dışa aktarılmasını dışlamak için kullanılabilir. (Kısa Biçim: -{0})
zh_hans: 要从导出或验证中排除的完全限定或程序集限定类型名称。导出服务的元数据或一组服务合约时，可以使用此选项来排除要导出的类型。(缩写: -{0})
zh_hant: 要從匯出或驗證排除的完整或組件合格的類型名稱。匯出服務的中繼資料或一組服務合約以排除匯出的類型時可使用此選項。(簡短形式: -{0})

# HelpXmlSerializerTypeGenerationSyntaxInput4
source: Filename for the generated code. This option will be ignored when multiple assemblies are passed as input to the tool. Default: derived from the assembly name. (Short Form: -{0})
cs: Název souboru pro vygenerovaný kód. Tento parametr bude ignorován, pokud je nástroji ve vstupu předáno více sestavení. Výchozí: odvozeno z názvu sestavení. (Krátký tvar: -{0})
de: Der Dateiname für den generierten Code. Diese Option wird ignoriert, wenn mehrere Assemblys als Eingabe an das Tool übergeben werden. Standard: abgeleitet vom Assemblynamen. (Kurzform: -{0})
es: Nombre de archivo del código generado. Esta opción se omitirá cuando se pasen varios ensamblados como entrada a la herramienta. Valor predeterminado: derivado del nombre del ensamblado. (Forma corta: /{0})
fr: Nom de fichier du code généré. Cette option est ignorée quand plusieurs assemblys sont passés en entrée à l’outil. Valeur par défaut : dérivé du nom de l’assembly. (Forme abrégée : /{0})
it: Nome del file per il codice generato. Questa opzione viene ignorata quando più assembly vengono passati come input allo strumento. Impostazione predefinita: derivata dal nome dell'assembly. (Forma breve: -{0})
ja: 生成されたコードのファイル名です。複数のアセンブリが入力としてツールに渡された場合、このオプションは無視されます。既定値: アセンブリ名から派生します。(短い形式: -{0})
ko: 생성된 코드의 파일 이름입니다. 이 옵션은 여러 어셈블리가 도구에 입력으로 전달될 때 무시됩니다. 기본값: 어셈블리 이름에서 파생됩니다. (약식: -{0})
pl: Nazwa pliku dla wygenerowanego kodu. Opcja ta zostanie zignorowana w przypadku przekazania wielu złożeń jako danych wejściowych do narzędzia. Domyślnie: pochodzi od nazwy zestawu. (Krótka wersja: —{0})
pt_br: Nome do arquivo para o código gerado. Esta opção será ignorada quando vários assemblies forem passados como entrada para a ferramenta. Padrão: derivado do nome do assembly. (Forma Abreviada: -{0})
ru: Имя файла для сформированного кода. Этот параметр будет пропущен, если в программное средство в качестве входных данных передано несколько сборок. Значение по умолчанию: производное от имени сборки. (Краткая форма: -{0})
tr: Oluşturulan kodun dosya adı. Araca giriş olarak birden çok bütünleştirilmiş kod geçirildiğinde bu seçenek yoksayılır. Varsayılan: bütünleştirilmiş kod adından türetildi. (Kısa Biçim: -{0})
zh_hans: 所生成代码的文件名。将多个程序集作为输入传递到工具时，将忽略此选项。默认值: 派生自程序集名称。(缩写: -{0})
zh_hant: 產生的程式碼的檔案名稱。當將多個組件傳遞為工具的輸入時，將會忽略此選項。預設值: 衍生自組件名稱。(簡短形式: -{0})

# HintConsiderUseXmlSerializer
source: If you are using the --{0} option to import data contract types and are getting this error message, consider using xsd.exe instead. Types generated by xsd.exe may be used in the Windows Communication Foundation after applying the XmlSerializerFormatAttribute attribute on your service contract. Alternatively, consider using the --{1} option to import these types as XML types to use with DataContractFormatAttribute attribute on your service contract.
cs: Pokud k importu typů kontraktů dat používáte parametr --{0} a zobrazuje se tato chybová zpráva, zvažte možnost použít místo toho soubor xsd.exe. Typy generované souborem xsd.exe mohou být použity v rámci Windows Communication Foundation po použití atributu XmlSerializerFormatAttribute u kontraktu služby. Případně zvažte možnost importovat tyto typy jako typy XML pomocí parametru --{1} a použít je s atributem DataContractFormatAttribute v kontraktu služby.
de: Wenn Sie die Option --{0} zum Importieren von Datenvertragstypen verwenden und diese Fehlermeldung erhalten, sollten Sie stattdessen "xsd.exe" verwenden. Von xsd.exe generierte Typen können im Windows Communication Foundation verwendet werden, nachdem das XmlSerializerFormatAttribute-Attribut auf Ihren Dienstvertrag angewendet wurde. Alternativ können Sie die Option --{1} verwenden, um diese Typen als XML-Typen zu importieren, die mit dem DataContractFormatAttribute-Attribut in Ihrem Dienstvertrag verwendet werden sollen.
es: Si usa la opción --{0} para importar tipos de contrato de datos y recibe este mensaje de error, considere la posibilidad de usar xsd.exe en su lugar. Los tipos generados por xsd.exe se pueden usar en el Windows Communication Foundation después de aplicar el atributo XmlSerializerFormatAttribute en el contrato de servicio. Como alternativa, considere la posibilidad de usar la opción --{1} para importar estos tipos como tipos XML para usarlos con el atributo DataContractFormatAttribute en el contrato de servicio.
fr: Si vous utilisez l’option --{0} pour importer des types de contrat de données et recevez ce message d’erreur, envisagez d’utiliser xsd.exe à la place. Les types générés par xsd.exe peuvent être utilisés dans le Windows Communication Foundation après l’application de l’attribut XmlSerializerFormatAttribute sur votre contrat de service. Vous pouvez également utiliser l’option --{1} pour importer ces types en tant que types XML à utiliser avec l’attribut DataContractFormatAttribute sur votre contrat de service.
it: Se si usa l'opzione --{0} per importare i tipi di contratto di dati e si riceve questo messaggio di errore, provare a usare xsd.exe. I tipi generati da xsd.exe possono essere usati in Windows Communication Foundation dopo l’applicazione dell'attributo XmlSerializerFormatAttribute nel contratto di servizio. In alternativa, provare a usare l'opzione --{1} per importare questi tipi come tipi XML da usare con l'attributo DataContractFormatAttribute nel contratto di servizio.
ja: --{0} オプションを使用してデータ コントラクト型をインポートしていて、このエラー メッセージが表示される場合は、代わりに xsd.exe を使用することを検討してください。xsd.exe で生成された型は、サービス コントラクトに XmlSerializerFormatAttribute 属性を適用した後に Windows Communication Foundation で使用できます。または、--{1} オプションを使用してこれらの型を XML 型としてインポートし、サービス コントラクトの DataContractFormatAttribute 属性で使用することを検討してください。
ko: --{0} 옵션을 사용하여 데이터 계약 형식을 가져오고 이 오류 메시지가 표시되는 경우 대신 xsd.exe를 사용하는 것이 좋습니다. xsd.exe에서 생성된 형식은 서비스 계약에 XmlSerializerFormatAttribute 특성을 적용한 후 Windows Communication Foundation에서 사용할 수 있습니다. 또는 --{1} 옵션을 사용하여 이러한 형식을 XML 형식으로 가져와서 서비스 계약에서 DataContractFormatAttribute 특성과 함께 사용하는 것이 좋습니다.
pl: Jeśli używasz opcji --{0} do importowania typów kontraktów danych i otrzymujesz ten komunikat o błędzie, rozważ użycie programu xsd.exe. Typy wygenerowane przez plik xsd.exe mogą być używane w programie Windows Communication Foundation po zastosowaniu atrybutu XmlSerializerFormatAttribute do Twojego kontraktu usługi. Alternatywnie rozważ użycie opcji --{1} w celu zaimportowania tych typów jako typów XML do użycia z atrybutem DataContractFormatAttribute w swoim kontrakcie usługi.
pt_br: Se você estiver usando a opção --{0} importar tipos de contrato de dados e estiver recebendo essa mensagem de erro, considere usar xsd.exe em vez disso. Os tipos gerados pelo xsd.exe podem ser usados no Windows Communication Foundation após a aplicação do atributo XmlSerializerFormatAttribute no contrato de serviço. Como alternativa, considere usar a opção {1} para importar esses tipos como tipos XML a serem usadas com o atributo DataContractFormatAttribute em seu contrato de serviço.
ru: Если вы используете параметр --{0} для импорта типов контрактов данных и получаете это сообщение об ошибке, попробуйте использовать xsd.exe. Типы, сформированные xsd.exe, могут использоваться в Windows Communication Foundation после применения к вашему контракту службы атрибута XmlSerializerFormatAttribute. Можно также использовать параметр --{1} для импорта этих типов в качестве типов XML для использования с атрибутом DataContractFormatAttribute в контракте службы.
tr: Veri anlaşması türlerini içe aktarmak için --{0} seçeneğini kullanıyorsanız ve bu hata iletisini alıyorsanız bunun yerine xsd.exe'yi kullanmayı düşünün. xsd.exe tarafından oluşturulan türler, hizmet anlaşmanıza XmlSerializerFormatAttribute özniteliği uygulandıktan sonra Windows Communication Foundation'da kullanılabilir. Alternatif olarak, hizmet anlaşmanızdaki DataContractFormatAttribute özniteliğiyle birlikte kullanmak üzere bu türleri XML türleri olarak içe aktarmak için --{1} seçeneğini kullanmayı düşünün.
zh_hans: 如果使用 --{0} 选项导入数据合约类型并收到此错误消息，请考虑改用 xsd.exe。在服务合约上应用 XmlSerializerFormatAttribute 属性后，xsd.exe 生成的类型可在 Windows Communication Foundation 中使用。或者，考虑使用 --{1} 选项将这些类型导入为 XML 类型，以便与服务合约上的 DataContractFormatAttribute 属性一起使用。
zh_hant: 如果您使用 --{0} 選項來匯入資料合約類型，且遇到錯誤訊息，請考慮改用 xsd.exe。在服務合約上套用 XmlSerializerFormatAttribute 屬性之後，xsd.exe 產生的類型可能會用於 Windows Communication Foundation。或者，請考慮使用 --{1} 選項，將這些類型匯入為 XML 類型，以在您的服務合約上搭配 DataContractFormatAttribute 屬性使用。

# Logo
source: Microsoft (R) dotnet-svcutil.xmlserializer tool, Version {0}. [{1}] {2}
cs: Nástroj Microsoft (R) dotnet-svcutil.xmlserializer, verze {0}. [{1}] {2}
es: Herramienta dotnet-svcutil.xmlserializer de Microsoft (R), versión {0}. [{1}] {2}
it: Strumento Microsoft (R) dotnet-svcutil.xmlserializer, versione {0}. [{1}] {2}
ja: Microsoft (R) dotnet-svcutil.xmlserializer ツール、バージョン {0}. [{1}] {2}
ko: Microsoft (R) dotnet-svcutil.xmlserializer 도구, 버전 {0}. [{1}] {2}
pl: Narzędzie Microsoft (R) dotnet-svcutil.xmlserializer, wersja {0}. [{1}] {2}
pt_br: Ferramenta Microsoft (R) dotnet-svcutil.xmlserializer, Versão {0}. [{1}] {2}
ru: Средство Microsoft (R) dotnet-svcutil.xmlserializer, версия{0}. [{1}] {2}
tr: Microsoft (R) dotnet-svcutil.xmlserializer aracı, Sürüm {0}. [{1}] {2}
zh_hans: Microsoft (R) dotnet-svcutil.xmlserializer 工具，版本 {0}。 [{1}] {2}
zh_hant: Microsoft (R) dotnet-svcutil.xmlserializer 工具，版本 {0}。 [{1}] {2}

# MoreHelp
source: If you would like more help, type "svcutil -{0}"
cs: Potřebujete-li další nápovědu, zadejte svcutil /{0}.
de: Geben Sie "svcutil /{0}" ein, um weitere Informationen anzuzeigen.
es: Si desea más ayuda, escriba "svcutil /{0}"
fr: Si vous souhaitez obtenir une aide supplémentaire, tapez "svcutil /{0}"
it: Per altre informazioni, digitare "svcutil -{0}"
ja: さらにヘルプが必要な場合は、「svcutil -{0}」と入力してください
ko: 자세한 정보를 보려면 "svcutil -{0}"을(를) 입력하세요.
pl: Jeśli potrzebujesz dalszej pomocy, wpisz „svcutil -{0}”
pt_br: Se desejar obter mais ajuda, digite "svcutil /{0}"
ru: Для получения дополнительных сведений введите "svcutil /{0}".
tr: Daha fazla yardım almak istiyorsanız "svcutil -{0}" yazın
zh_hans: 如果希望获取更多帮助，请键入 "svcutil /{0}"
zh_hant: 如需其他說明，請輸入 "svcutil /{0}"
