Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_DupGroupParticle
source: The content model can only have one of the following; 'all', 'choice', or 'sequence'.
cs: Obsahový model může obsahovat pouze jednu z následujících možností: all, choice nebo sequence
de: Das Inhaltsmodell kann nur einen der folgenden Werte enthalten: "all", "choice" oder "sequence".
es: El modelo de contenido solo puede tener los siguientes elementos: "all", "choice" o "sequence".
fr: Le modèle de contenu ne peut comporter qu'une occurrence de 'all', 'choice' ou 'sequence'.
it: Il modello di contenuto può contenere solo uno degli elementi seguenti: 'all', 'choice' o 'sequence'.
ja: コンテンツ モデルは次のどれか 1 つを持たなければなりません。'all'、'choice'、または 'sequence'。
ko: 콘텐츠 모델에는 'all', 'choice' 또는 'sequence' 중 하나만 사용할 수 있습니다.
pl: Model zawartości może zawierać tylko jeden z następujących elementów: „all”, „choice” lub „sequence”.
pt_br: O modelo de conteúdo só pode ter uma destas opções: 'all', 'choice' ou 'sequence'.
ru: Модель содержимого может включать только один из следующих элементов: all, choice или sequence.
tr: İçerik modeli yalnızca şunlardan biri olabilir: 'all', 'choice' veya 'sequence'.
zh_hans: 内容模型只能包含以下三项之一: "all"、"choice" 或 "sequence"。
zh_hant: 內容模型只能有下列其中一項: 'all'、'choice' 或 'sequence'。

# Sch_DupId
source: '{0}' is already used as an ID.
cs: Hodnota {0} je již používána jako identifikátor.
de: "{0}" wird bereits als ID verwendet.
es: "{0}" ya se utiliza como identificador.
fr: '{0}' est déjà utilisé comme ID.
it: '{0}' viene già usato come ID.
ja: '{0}' は ID として既に使われています。
ko: '{0}'은(는) 이미 사용되고 있는 ID입니다.
pl: Element „{0}” jest już używany jako identyfikator.
pt_br: '{0}' já é usado como uma ID.
ru: "{0}" уже используется в качестве идентификатора.
tr: '{0}' zaten ID olarak kullanılıyor.
zh_hans: “{0}”已用作 ID。
zh_hant: '{0}' 已用作為識別碼。

# Sch_DupIdAttribute
source: Duplicate ID attribute.
cs: Duplicitní atribut ID
de: Doppeltes ID-Attribut.
es: Atributo de identificador duplicado.
fr: Attribut ID dupliqué.
it: Attributo ID duplicato.
ja: 重複する ID 属性です。
ko: ID 특성이 중복되었습니다.
pl: Zduplikowany atrybut ID.
pt_br: Atributo ID duplicado.
ru: Повторяющийся атрибут ИД.
tr: Yinelenen ID özniteliği.
zh_hans: 重复的 ID 特性。
zh_hant: 識別碼屬性重複。

# Sch_DupIdentityConstraint
source: The identity constraint '{0}' has already been declared.
cs: Omezení identity {0} již bylo deklarováno.
de: Die Identitätseinschränkung "{0}" wurde bereits deklariert.
es: Ya se ha declarado la restricción de identidad "{0}".
fr: La contrainte d'identité '{0}' a déjà été déclarée.
it: Il vincolo di identità '{0}' è già stato dichiarato.
ja: identity 制約 '{0}' は既に宣言されています。
ko: identity 제약 조건 '{0}'이(가) 이미 선언되었습니다.
pl: Ograniczenie tożsamości „{0}” zostało już zadeklarowane.
pt_br: A restrição de identidade '{0}' já foi declarada.
ru: Ограничение по идентификатору "{0}" уже объявлено.
tr: '{0}' kimlik kısıtlaması zaten bildirilmiş.
zh_hans: 已声明标识约束“{0}”。
zh_hant: 已宣告身分識別條件約束 '{0}'。

# Sch_DupLengthFacet
source: This is a duplicate Length constraining facet.
cs: Toto je duplicitní omezující vlastnost Length.
de: Doppeltes Length-Einschränkungsfacet.
es: Faceta de restricción de Length duplicada.
fr: Il s'agit d'une facette de contrainte Length dupliquée.
it: Questo è un facet vincolante Length duplicato.
ja: Length 制約ファセットが重複しています。
ko: 중복 Length 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający Length.
pt_br: Esta é uma faceta de restrições Length duplicada.
ru: Это повторяющийся ограничивающий аспект Length.
tr: Bu yinelenen bir Length kısıtlama modeli.
zh_hans: 这是一个重复的 Length 约束方面。
zh_hant: 這是重複的 Length 條件約束 Facet。

# Sch_DupMaxExclusiveFacet
source: This is a duplicate MaxExclusive constraining facet.
cs: Toto je duplicitní omezující vlastnost MaxExclusive.
de: Doppeltes MaxExclusive-Einschränkungsfacet.
es: Faceta de restricción de MaxExclusive duplicada.
fr: Il s'agit d'une facette de contrainte MaxExclusive dupliquée.
it: Questo è un facet vincolante MaxExclusive duplicato.
ja: MaxExclusive 制約ファセットが重複しています。
ko: 중복 MaxExclusive 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MaxExclusive.
pt_br: Esta é uma faceta de restrições MaxExclusive duplicada.
ru: Это повторяющийся ограничивающий аспект MaxExclusive.
tr: Bu yinelenen bir MaxExclusive kısıtlama modeli.
zh_hans: 这是一个重复的 MaxExclusive 约束方面。
zh_hant: 這是重複的 MaxExclusive 條件約束 Facet。

# Sch_DupMaxInclusiveFacet
source: This is a duplicate MaxInclusive constraining facet.
cs: Toto je duplicitní omezující vlastnost MaxInclusive.
de: Doppeltes MaxInclusive-Einschränkungsfacet.
es: Faceta de restricción de MaxInclusive duplicada.
fr: Il s'agit d'une facette de contrainte MaxInclusive dupliquée.
it: Questo è un facet vincolante MaxInclusive duplicato.
ja: MaxInclusive 制約ファセットが重複しています。
ko: 중복 MaxInclusive 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MaxInclusive.
pt_br: Esta é uma faceta de restrições MaxInclusive duplicada.
ru: Это повторяющийся ограничивающий аспект MaxInclusive.
tr: Bu yinelenen bir MaxInclusive kısıtlama modeli.
zh_hans: 这是一个重复的 MaxInclusive 约束方面。
zh_hant: 這是重複的 MaxInclusive 條件約束 Facet。

# Sch_DupMaxLengthFacet
source: This is a duplicate MaxLength constraining facet.
cs: Toto je duplicitní omezující vlastnost MaxLength.
de: Doppeltes MaxLength-Einschränkungsfacet.
es: Faceta de restricción de MaxLength duplicada.
fr: Il s'agit d'une facette de contrainte MaxLength dupliquée.
it: Questo è un facet vincolante MaxLength duplicato.
ja: MaxLength 制約ファセットが重複しています。
ko: 중복 MaxLength 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MaxLength.
pt_br: Esta é uma faceta de restrições MaxLength duplicada.
ru: Это повторяющийся ограничивающий аспект MaxLength.
tr: Bu yinelenen bir MaxLength kısıtlama modeli.
zh_hans: 这是一个重复的 MaxLength 约束方面。
zh_hant: 這是重複的 MaxLength 條件約束 Facet。

# Sch_DupMinExclusiveFacet
source: This is a duplicate MinExclusive constraining facet.
cs: Toto je duplicitní omezující vlastnost MinExclusive.
de: Doppeltes MinExclusive-Einschränkungsfacet.
es: Faceta de restricción de MinExclusive duplicada.
fr: Il s'agit d'une facette de contrainte MinExclusive dupliquée.
it: Questo è un facet vincolante MinExclusive duplicato.
ja: MinExclusive 制約ファセットが重複しています。
ko: 중복 MinExclusive 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MinExclusive.
pt_br: Esta é uma faceta de restrições MinExclusive duplicada.
ru: Это повторяющийся ограничивающий аспект MinExclusive.
tr: Bu yinelenen bir MinExclusive kısıtlama modeli.
zh_hans: 这是一个重复的 MinExclusive 约束方面。
zh_hant: 這是重複的 MinExclusive 條件約束 Facet。

# Sch_DupMinInclusiveFacet
source: This is a duplicate MinInclusive constraining facet.
cs: Toto je duplicitní omezující vlastnost MinInclusive.
de: Doppeltes MinInclusive-Einschränkungsfacet.
es: Faceta de restricción de MinInclusive duplicada.
fr: Il s'agit d'une facette de contrainte MinInclusive dupliquée.
it: Questo è un facet vincolante MinInclusive duplicato.
ja: MinInclusive 制約ファセットが重複しています。
ko: 중복 MinInclusive 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MinInclusive.
pt_br: Esta é uma faceta de restrições MinInclusive duplicada.
ru: Это повторяющийся ограничивающий аспект MinInclusive.
tr: Bu yinelenen bir MinInclusive kısıtlama modeli.
zh_hans: 这是一个重复的 MinInclusive 约束方面。
zh_hant: 這是重複的 MinInclusive 條件約束 Facet。

# Sch_DupMinLengthFacet
source: This is a duplicate MinLength constraining facet.
cs: Toto je duplicitní omezující vlastnost MinLength.
de: Doppeltes MinLength-Einschränkungsfacet.
es: Faceta de restricción de MinLength duplicada.
fr: Il s'agit d'une facette de contrainte MinLength dupliquée.
it: Questo è un facet vincolante MinLength duplicato.
ja: MinLength 制約ファセットが重複しています。
ko: 중복 MinLength 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający MinLength.
pt_br: Esta é uma faceta de restrições MinLength duplicada.
ru: Это повторяющийся ограничивающий аспект MinLength.
tr: Bu yinelenen bir MinLength kısıtlama modeli.
zh_hans: 这是一个重复的 MinLength 约束方面。
zh_hant: 這是重複的 MinLength 條件約束 Facet。

# Sch_DupNotation
source: The notation '{0}' has already been declared.
cs: Notace {0} již byla deklarována.
de: Die Notation "{0}" wurde bereits deklariert.
es: Ya se ha declarado la notación "{0}".
fr: La notation '{0}' a déjà été déclarée.
it: La notazione '{0}' è già stata dichiarata.
ja: 形式は '{0}' は既に宣言されています。
ko: 표기법 '{0}'이(가) 이미 선언되었습니다.
pl: Notacja „{0}” została już zadeklarowana.
pt_br: A notação '{0}' já foi declarada.
ru: Нотация "{0}" уже объявлена.
tr: '{0}' yazım biçimi zaten bildirilmiş.
zh_hans: 已声明表示法“{0}”。
zh_hant: 已宣告標記法 '{0}'。

# Sch_DupNotationAttribute
source: No element type can have more than one NOTATION attribute specified.
cs: Pro žádný typ elementu nelze zadat více než jeden atribut NOTATION.
de: Für einen Elementtyp dürfen nicht mehrere NOTATION-Attribute angegeben werden.
es: Ningún tipo de elemento puede tener más de un atributo NOTATION especificado.
fr: Aucun type d'élément ne peut avoir plus d'un attribut NOTATION spécifié.
it: Nessun tipo di elemento può contenere più di un attributo NOTATION.
ja: 要素型に複数の NOTATION 属性を指定することはできません。
ko: 요소 형식에 NOTATION 특성을 둘 이상 지정할 수 없습니다.
pl: Dla żadnego typu elementu nie można określić więcej niż jednego atrybutu NOTATION.
pt_br: Nenhum tipo de elemento pode ter mais de um atributo NOTATION especificado.
ru: Ни одному типу элемента не может быть задано более одного атрибута NOTATION.
tr: Hiçbir öğe türünde birden fazla NOTATION özniteliği belirtilemez.
zh_hans: 任何元素类型都不能指定多个 NOTATION 特性。
zh_hant: 元素類型不可指定一個以上的 NOTATION 屬性。

# Sch_DupSelector
source: Selector cannot appear twice in one identity constraint.
cs: Selektor nelze v omezení identity použít dvakrát.
de: Die Auswahl kann in einer Identitätseinschränkung nicht zweimal verwendet werden.
es: El selector no puede aparecer dos veces en una restricción de identidad.
fr: Selector ne peut pas s'afficher deux fois dans une contrainte d'identité.
it: Il selettore non può essere presente due volte in un vincolo di identità.
ja: セレクターは 1 つの identity 制約に 2 度表示できません。
ko: 하나의 identity 제약 조건에 선택기를 두 번 사용할 수 없습니다.
pl: Selektor nie może pojawić się dwa razy w jednym ograniczeniu tożsamości.
pt_br: O seletor não pode aparecer duas vezes em uma restrição de identidade.
ru: Селектор не может дважды указываться в одном ограничении по идентификатору.
tr: Seçici, bir kimlik kısıtlamasında iki kez bulunamaz.
zh_hans: 选择器不能在一个标识约束中出现两次。
zh_hant: 選取器不可在同一個身分識別條件約束中出現兩次。

# Sch_DupSimpleType
source: The simpleType '{0}' has already been declared.
cs: Typ simpleType {0} již byl deklarován.
de: Der simpleType "{0}" wurde bereits deklariert.
es: Ya se ha declarado el valor de simpleType "{0}".
fr: simpleType '{0}' a déjà été déclaré.
it: L'elemento simpleType '{0}' è già stato dichiarato.
ja: simpleType '{0}' は既に宣言されています。
ko: simpleType '{0}'이(가) 이미 선언되었습니다.
pl: Element simpleType „{0}” został już zadeklarowany.
pt_br: O simpleType '{0}' já foi declarado.
ru: Элемент simpleType "{0}" уже объявлен.
tr: simpleType '{0}' zaten bildirilmiş.
zh_hans: 已声明 simpleType“{0}”。
zh_hant: 已經宣告 simpleType '{0}'。

# Sch_DupSimpleTypeChild
source: 'simpleType' should have only one child 'union', 'list', or 'restriction'.
cs: Třída simpleType by měla mít pouze jeden podřízený element union, list nebo restriction.
de: "simpleType" darf nur ein untergeordnetes Element "union", "list" oder "restriction" haben.
es: El elemento "simpleType" solo debe tener un valor de tipo "union", "list" o "restriction" secundario.
fr: 'simpleType' ne doit avoir qu'un 'union', 'list' ou 'restriction' enfant.
it: L'elemento 'simpleType' può contenere un solo elemento figlio 'union', 'list' o 'restriction'.
ja: 'simpleType' は、'union'、'list'、または 'restriction' のいずれか 1 つの子のみを持つ必要があります。
ko: 'simpleType'에는 하나의 자식으로 'union', 'list' 또는 'restriction'만 사용할 수 있습니다.
pl: Element „simpleType” powinien mieć tylko jeden element podrzędny „union”, „list” lub „restriction”.
pt_br: 'simpleType' deve ter apenas um 'union', 'list' ou 'restriction' filho.
ru: simpleType должен иметь только один дочерний элемент union, list или restriction.
tr: 'simpleType', yalnızca bir 'union', 'list' veya 'restriction' alt öğesine sahip olmalıdır.
zh_hans: "simpleType" 应该只有一个子级 "union"、"list" 或 "restriction"。
zh_hant: 'simpleType' 應只有一個子 'union'、'list' 或 'restriction'。

# Sch_DupTotalDigitsFacet
source: This is a duplicate TotalDigits constraining facet.
cs: Toto je duplicitní omezující vlastnost TotalDigits.
de: Doppeltes TotalDigits-Einschränkungsfacet.
es: Faceta de restricción de TotalDigits duplicada.
fr: Il s'agit d'une facette de contrainte TotalDigits dupliquée.
it: Questo è un facet vincolante TotalDigits duplicato.
ja: TotalDigits 制約ファセットが重複しています。
ko: 중복 TotalDigits 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający TotalDigits.
pt_br: Esta é uma faceta de restrições TotalDigits duplicada.
ru: Это повторяющийся ограничивающий аспект TotalDigits.
tr: Bu yinelenen bir TotalDigits kısıtlama modeli.
zh_hans: 这是一个重复的 TotalDigits 约束方面。
zh_hant: 這是重複的 TotalDigits 條件約束 Facet。

# Sch_DupWhiteSpaceFacet
source: This is a duplicate WhiteSpace constraining facet.
cs: Toto je duplicitní omezující vlastnost WhiteSpace.
de: Doppeltes WhiteSpace-Einschränkungsfacet.
es: Faceta de restricción de WhiteSpace duplicada.
fr: Il s'agit d'une facette de contrainte WhiteSpace dupliquée.
it: Questo è un facet vincolante WhiteSpace duplicato.
ja: WhiteSpace 制約ファセットが重複しています。
ko: 중복 WhiteSpace 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający WhiteSpace.
pt_br: Esta é uma faceta de restrições WhiteSpace duplicada.
ru: Это повторяющийся ограничивающий аспект WhiteSpace.
tr: Bu yinelenen bir WhiteSpace kısıtlama modeli.
zh_hans: 这是一个重复的 WhiteSpace 约束方面。
zh_hant: 這是重複的 WhiteSpace 條件約束 Facet。

# Sch_DupXsdElement
source: '{0}' is a duplicate XSD element.
cs: Element {0} je duplicitním elementem XSD.
de: "{0}" ist ein doppeltes XSD-Element.
es: "{0}" es un elemento duplicado XSD.
fr: '{0}' est un élément XSD dupliqué.
it: '{0}' è un elemento XSD duplicato.
ja: '{0}' は重複する XSD 要素です。
ko: '{0}'은(는) 중복 XSD 요소입니다.
pl: Element „{0}” jest zduplikowanym elementem XSD.
pt_br: '{0}' é um elemento XSD duplicado.
ru: "{0}" является повторяющимся элементом XSD.
tr: '{0}', yinelenen bir XSD öğesi.
zh_hans: “{0}”是重复的 XSD 元素。
zh_hant: '{0}' 是重複的 XSD 元素。

# Sch_DuplicateAttribute
source: The '{0}' attribute has already been validated and is a duplicate attribute.
cs: Atribut {0} již byl ověřen. Jedná se o duplicitní atribut.
de: Das {0}-Attribut wurde bereits überprüft und ist doppelt vorhanden.
es: Ya se ha validado el atributo "{0}" y es un atributo duplicado.
fr: L'attribut '{0}' a déjà été validé et est un attribut dupliqué.
it: L'attributo '{0}' è già stato convalidato ed è un attributo duplicato.
ja: '{0}' 属性は既に検証されています。この属性は重複しています。
ko: '{0}' 특성은 이미 유효성을 검사했으며 중복 특성입니다.
pl: Atrybut „{0}” został już zweryfikowany. To jest atrybut zduplikowany.
pt_br: O atributo '{0}' já foi validado e é um atributo duplicado.
ru: Атрибут "{0}" уже проверен и является повторяющимся атрибутом.
tr: '{0}' özniteliği, önceden doğrulandı ve yinelenen bir özniteliktir.
zh_hans: 已验证“{0}”特性，它是重复特性。
zh_hant: '{0}' 屬性已經過驗證且為重複的屬性。

# Sch_DuplicateKey
source: There is a duplicate key sequence '{0}' for the '{1}' key or unique identity constraint.
cs: Byla zjištěna duplicitní sekvence klíčů {0} v klíči {1} nebo v omezení jedinečnosti identity.
de: Für den Schlüssel "{1}" oder eine eindeutige Identitätseinschränkung ist eine doppelte Schlüsselsequenz "{0}" vorhanden.
es: Hay una secuencia de clave duplicada "{0}" para las restricciones de identidad KEY o UNIQUE "{1}".
fr: Il existe une séquence de clés dupliquée '{0}' pour la clé '{1}' ou une contrainte d'identité unique.
it: È presente una sequenza di chiave duplicata '{0}' per la chiave '{1}' o per il vincolo di identità univoco.
ja: '{1}' キーまたは一意の Identity 制約に対して、重複するキー シーケンス '{0}' が存在します。
ko: '{1}' 키 또는 고유한 identity 제약 조건에 중복 키 시퀀스 '{0}'이(가) 있습니다.
pl: Istnieje zduplikowana sekwencja klucza „{0}” dla klucza „{1}” lub ograniczenia unikatowości tożsamości.
pt_br: Existe uma sequência de chave duplicada '{0}' para a chave '{1}' ou uma restrição de identidade exclusiva.
ru: Существует повторяющаяся последовательность ключей "{0}" для ключа "{1}" или ограничение по уникальному идентификатору.
tr: '{1}' anahtarı veya benzersiz kimlik kısıtlaması için yinelenen bir '{0}' anahtar sıralaması var.
zh_hans: “{1}”键或唯一标识约束中包含重复的键序列“{0}”。
zh_hant: '{1}' 索引鍵或唯一身分識別條件約束中有重複的索引鍵序列 '{0}'。

# Sch_ElementCannotHaveValue
source: Element's type does not allow fixed or default value constraint.
cs: Typ elementu nepovoluje omezení s pevnou nebo výchozí hodnotou.
de: Der Typ des Elements lässt keine Einschränkungen des festen Werts oder Standardwerts zu.
es: El tipo de elemento no permite una restricción de valor fija o predeterminada.
fr: Le type de l'élément n'autorise pas de contrainte de valeur fixe ou par défaut.
it: Il tipo dell'elemento non consente vincoli di valore predefinito o fisso.
ja: 要素の型は固定、または既定値制約を許可しません。
ko: 요소의 형식은 고정 값 또는 기본값 제약 조건을 허용하지 않습니다.
pl: Typ elementu nie zezwala na ograniczenie wartości ustalonej lub domyślnej.
pt_br: O tipo do elemento não permite restrição de valor padrão nem fixo.
ru: Тип элемента не допускает использования ограничений по фиксированному значению или по значению по умолчанию.
tr: Öğenin türü sabit veya varsayılan değer kısıtlamasına izin vermiyor.
zh_hans: 元素的类型不允许使用固定值约束或默认值约束。
zh_hant: 元素的類型不允許固定或預設值條件約束。

# Sch_ElementCircularRef
source: Circular element reference.
cs: Cyklický odkaz na element
de: Zirkulärer Elementverweis.
es: Referencia circular del elemento.
fr: Référence d'élément circulaire.
it: Riferimento circolare a elemento.
ja: 要素の循環参照です。
ko: 순환 요소 참조입니다.
pl: Cykliczne odwołanie do elementu.
pt_br: Referência circular de elemento.
ru: Циклическая ссылка на элемент.
tr: Döngüsel öğe başvurusu.
zh_hans: 循环元素引用。
zh_hant: 循環項目參考。

# Sch_ElementFromAnyRule1
source: The namespace of element '{0}'is not valid with respect to the wildcard's namespace constraint in the base, Elt:Any -- NSCompat Rule 1.
cs: Obor názvů elementu {0} není platný s ohledem na omezení oboru názvů zástupného znaku v základním elementu, Elt:Any -- NSCompat Rule 1.
de: Der Namespace des Elements "{0}" ist in Bezug auf die Namespaceeinschränkung des Platzhalters in der Basis ungültig, Elt:Any -- NSCompat-Regel 1.
es: El espacio de nombres del elemento {0} no es válido con respecto a la restricción de espacio de nombres del comodín en la base, Elt:Any -- NSCompat Rule 1.
fr: L'espace de noms de l'élément '{0}' est non valide en ce qui concerne la contrainte d'espace de noms du caractère générique de la base, Elt:Any -- NSCompat Rule 1.
it: Lo spazio dei nomi dell'elemento '{0}' non è valido in relazione al vincolo dello spazio dei nomi del carattere jolly nella base (regola 1 di Elt:Any -- NSCompat).
ja: 要素 '{0}' の名前空間は、基本型におけるワイルドカードの名前空間の制約については正しくありません (Elt:Any -- NSCompat 規則 1)。
ko: 기본인 Elt:Any -- NSCompat Rule 1에서 와일드카드의 네임스페이스 제약 조건과 관련된 요소 '{0}'의 네임스페이스가 잘못되었습니다.
pl: Przestrzeń nazw elementu „{0}” nie jest prawidłowa przy uwzględnieniu ograniczenia przestrzeni nazw symbolu wieloznacznego w typie podstawowym (Elt:Any -- NSCompat: reguła 1).
pt_br: O namespace do elemento '{0}' é inválido em relação à restrição do namespace do curinga na base, Elt:Any -- NSCompat Rule 1.
ru: Пространство имен элемента "{0}" недействительно, учитывая ограничение пространства имен для подстановочного знака в базе, Elt:Any -- NSCompat Rule 1.
tr: '{0}' öğesinin ad alanı, temeldeki joker parçacığın ad alanı kısıtlamasına göre geçerli değil, Elt:Any -- NSCompat Kural 1.
zh_hans: 根据 Elt:Any -- NSCompat 规则 1，元素“{0}”的命名空间对基本属性的通配符命名空间约束无效。
zh_hant: 元素 '{0}' 的命名空間對基底萬用字元命名空間的條件約束無效，Elt:Any -- NSCompat Rule 1。

# Sch_ElementFromAnyRule2
source: The occurrence range of element '{0}'is not a valid restriction of the wildcard's occurrence range in the base, Elt:Any -- NSCompat Rule2.
cs: Rozsah výskytu elementu {0} není platné omezení rozsahu výskytů zástupného znaku v základním elementu, Elt:Any -- NSCompat Rule2.
de: Der Vorkommensbereich des Elements "{0}" ist keine gültige Einschränkung für den Vorkommensbereich des Platzhalters in der Basis, Elt:Any -- NSCompat-Regel 2.
es: El intervalo de aparición del elemento {0} no es una restricción válida del intervalo de aparición del comodín en la base, Elt:Any -- NSCompat Rule2.
fr: La plage d'occurrences de l'élément '{0}' n'est pas une restriction valide de la plage d'occurrences du caractère générique de la base, Elt:Any -- NSCompat Rule2.
it: L'intervallo di occorrenza dell'elemento '{0}' non è una restrizione valida dell'intervallo di occorrenza del carattere jolly nella base (regola 2 Elt:Any -- NSCompat).
ja: 要素 '{0}' の出現範囲は、基本型におけるワイルドカードの出現範囲の有効な制限ではありません (Elt:Any -- NSCompat 規則 2)。
ko: 요소 '{0}'의 발생 범위가 기본인 Elt:Any -- NSCompat Rule2에서 와일드카드 발생 범위의 유효한 제한이 아닙니다.
pl: Zakres wystąpień elementu „{0}” nie jest prawidłowym ograniczeniem zakresu wystąpień symbolu wieloznacznego w bazie (Elt:Any -- NSCompat: reguła 2).
pt_br: O intervalo de ocorrência do elemento '{0}' não é uma restrição válida do intervalo de ocorrência do curinga na base, Elt:Any -- NSCompat Rule2.
ru: Диапазон вхождения элемента "{0}" не является действительным ограничением для диапазона вхождения подстановочного знака в базе, Elt:Any -- NSCompat Rule 2.
tr: '{0}' öğesinin yinelenme aralığı, temeldeki joker parçacığın yinelenme aralığının geçerli bir kısıtlaması değil, Elt:Any -- NSCompat Kural 2.
zh_hans: 根据 Elt:Any -- NSCompat 规则 2，元素“{0}”的出现范围不是基本属性中通配符出现范围的有效限制。
zh_hant: 元素 '{0}' 的出現範圍不是基底萬用字元出現範圍的有效限制，Elt:Any -- NSCompat Rule2。

# Sch_ElementFromElement
source: Derived element '{0}' is not a valid restriction of base element '{1}' according to Elt:Elt -- NameAndTypeOK.
cs: Odvozený element {0} není platné omezení základního elementu {1} vzhledem k Elt:Elt -- NameAndTypeOK.
de: Das abgeleitete Element "{0}" ist gemäß Elt:Elt -- NameAndTypeOK keine gültige Einschränkung des Basiselements "{1}".
es: El elemento derivado "{0}" no es una restricción válida del elemento base "{1}" según Elt:Elt -- NameAndTypeOK.
fr: L'élément dérivé '{0}' n'est pas une restriction valide de l'élément de base '{1}', selon Elt:Elt -- NameAndTypeOK.
it: L'elemento derivato '{0}' non è una restrizione valida dell'elemento di base {1} in base alla regola Elt:Elt -- NameAndTypeOK.
ja: 派生型の要素 '{0}' は、Elt:Elt -- NameAndTypeOK により、基本型の要素 '{1}' の有効な制限とは認められません。
ko: 파생 요소 '{0}'은(는) Elt:Elt -- NameAndTypeOK에 따라 기본 요소 '{1}'의 유효한 제한이 아닙니다.
pl: Element pochodny „{0}” nie jest prawidłowym ograniczeniem elementu podstawowego „{1}” zgodnie z następującą regułą: Elt:Elt -- NameAndTypeOK.
pt_br: O elemento derivado '{0}' não é uma restrição válida do elemento base '{1}' de acordo com Elt:Elt -- NameAndTypeOK.
ru: Производный элемент "{0}" не является действительным ограничением для базового элемента "{1}" в соответствии с Elt:Elt — NameAndTypeOK.
tr: '{0}' türetilen öğesi, Elt:Elt -- NameAndTypeOK kuralına göre '{1}' temel öğesinin geçerli bir kısıtlaması değil.
zh_hans: 根据 Elt:Elt -- NameAndTypeOK，派生元素“{0}”不是基本元素“{1}”的有效限制。
zh_hant: 根據 Elt:Elt – NameAndTypeOK，衍生元素 '{0}' 不是基底元素 '{1}' 的有效限制。
