Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_MinIncMaxExlMismatch
source: It is an error if the derived 'minInclusive' facet value is greater than or equal to the parent 'maxExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minInclusive větší nebo rovna hodnotě nadřazené omezující vlastnosti maxExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minInclusive" größer oder gleich dem übergeordneten Wert des Facets "maxExclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minInclusive" derivado sea mayor o igual que el valor de faceta "maxExclusive" primario.
fr: La valeur de la facette du 'minInclusive' dérivé ne doit pas être supérieure ou égale à la valeur de la facette du 'maxExclusive' parent.
it: Il valore del facet derivato 'minInclusive' non può essere maggiore o uguale al valore del facet 'maxExclusive' padre.
ja: 派生型の 'minInclusive' ファセットの値が、親の 'maxExclusive' ファセットの値以上の場合はエラーです。
ko: 파생된 'minInclusive' 패싯 값이 부모 'maxExclusive' 패싯 값보다 크거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minInclusive” jest większa lub równa nadrzędnej wartości aspektu „maxExclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'minInclusive' derivada for maior ou igual ao valor da faceta 'maxExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minInclusive больше или равно значению родительского аспекта maxExclusive.
tr: Türetilen 'minInclusive' modeli değerinin üst 'maxExclusive' modeli değerinden büyük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "minInclusive" 方面值大于或等于父级 "maxExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minInclusive' Facet 值大於或等於父 'maxExclusive' Facet 的值，即為錯誤。

# Sch_MinInclusiveConstraintFailed
source: The MinInclusive constraint failed.
cs: Omezení MinInclusive nebylo úspěšné.
de: Fehler bei der MinInclusive-Einschränkung.
es: Error de restricción de MinInclusive.
fr: Échec de la contrainte MinInclusive.
it: Il vincolo MinInclusive non è riuscito.
ja: MinInclusive 制約が失敗しました。
ko: MinInclusive 제약 조건이 실패했습니다.
pl: Błąd ograniczenia elementu MinInclusive.
pt_br: Falha na restrição MinInclusive.
ru: Сбой ограничения MinInclusive.
tr: MinInclusive kısıtlaması başarısız oldu.
zh_hans: MinInclusive 约束失败。
zh_hant: MinInclusive 條件約束失敗。

# Sch_MinInclusiveExclusive
source: 'minInclusive' and 'minExclusive' cannot both be specified for the same data type.
cs: Omezení minInclusive a minExclusive nelze zadat současně pro stejný datový typ.
de: "minInclusive" und "minExclusive" dürfen nicht für den gleichen Datentyp angegeben werden.
es: No se puede especificar "minInclusive" y "minExclusive" para el mismo tipo de datos.
fr: 'minInclusive' et 'minExclusive' ne doivent pas être tous deux spécifiés pour le même type de données.
it: Non è possibile specificare sia 'minInclusive' che 'minExclusive' per lo stesso tipo di dati.
ja: 'minInclusive' と 'minExclusive' の両方を同じデータ型に対して指定することはできません。
ko: 동일한 데이터 형식에 대해 'minInclusive'와 'minExclusive'를 둘 다 지정할 수 없습니다.
pl: Elementy „minInclusive” oraz „minExclusive” nie mogą być jednocześnie określone dla tego samego typu danych.
pt_br: 'minInclusive' e 'minExclusive' não podem ser especificados simultaneamente para o mesmo tipo de dados.
ru: Для одного типа данных невозможно одновременно задать minInclusive и minExclusive.
tr: Aynı veri türü için hem 'minInclusive' hem de 'minExclusive' belirtilemez.
zh_hans: 不能为同一数据类型同时指定 "minInclusive" 和 "minExclusive"。
zh_hant: 不可為相同的資料類型同時指定 'minInclusive' 與 'minExclusive'。

# Sch_MinInclusiveFacetInvalid
source: The MinInclusive constraining facet is invalid - {0}
cs: Omezující vlastnost MinInclusive je neplatná – {0}
de: Ungültiges MinInclusive-Einschränkungsfacet – {0}
es: Faceta de restricción de MinInclusive no válida - {0}
fr: La facette de contrainte MinInclusive est non valide : {0}
it: Il facet vincolante MinInclusive non è valido - {0}
ja: MinInclusive 制約ファセットが無効です。{0}
ko: MinInclusive 제약 패싯이 잘못되었습니다. {0}
pl: Element MinInclusive ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MinInclusive é inválida – {0}
ru: Недопустимый ограничивающий аспект MinInclusive — {0}
tr: MinInclusive kısıtlama modeli geçersiz - {0}
zh_hans: MinInclusive 约束方面无效 - {0}
zh_hant: MinInclusive 條件約束 Facet 無效 - {0}

# Sch_MinInclusiveFacetProhibited
source: The MinInclusive constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MinInclusive je pro {0} zakázána.
de: Das MinInclusive-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MinInclusive prohibida para "{0}".
fr: La facette de contrainte MinInclusive est interdite pour '{0}'.
it: Il facet vincolante MinInclusive non è consentito per '{0}'.
ja: MinInclusive 制約ファセットは '{0}' で使用できません。
ko: MinInclusive 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MinInclusive ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições MinInclusive é proibida para '{0}'.
ru: Ограничивающий аспект MinInclusive запрещен для "{0}".
tr: '{0}' için MinInclusive kısıtlama modeli kullanılamaz.
zh_hans: MinInclusive 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MinInclusive 條件約束 Facet。

# Sch_MinInclusiveGtMaxExclusive
source: The value specified for 'minInclusive' cannot be greater than the value specified for 'maxExclusive' for the same data type.
cs: Hodnota zadaná pro omezení minInclusive nemůže být větší než hodnota zadaná pro omezení maxExclusive pro stejný datový typ.
de: Der für "minInclusive" angegebene Wert darf nicht größer sein als der für "maxExclusive" angegebene Wert für denselben Datentyp.
es: El valor especificado para "minInclusive" no puede ser superior al valor especificado para "maxExclusive" para el mismo tipo de datos.
fr: La valeur spécifiée pour 'minInclusive' ne doit pas être supérieure à la valeur spécifiée pour 'maxExclusive' pour le même type de données.
it: Il valore specificato per 'minInclusive' non può essere maggiore di quello specificato per 'maxExclusive' per lo stesso tipo di dati.
ja: データ型が同じ場合、'minInclusive' に指定された値を、'maxExclusive' に指定された値より大きくすることはできません。
ko: 'minInclusive'에 지정된 값은 동일한 데이터 형식의 'maxExclusive'에 지정된 값보다 클 수 없습니다.
pl: W obrębie jednego typu danych wartość określona dla elementu „minInclusive” nie może być większa niż wartość określona dla elementu „maxExclusive”.
pt_br: O valor especificado para 'minInclusive' não pode ser maior que o valor especificado para 'maxExclusive' para o mesmo tipo de dados.
ru: Значение minInclusive не может быть больше значения maxExclusive, заданного для того же типа данных.
tr: Aynı veri türünde, 'minInclusive' için belirtilen değer 'maxExclusive' için belirtilen değerden büyük olamaz.
zh_hans: 为 "minInclusive" 指定的值不能大于为同一数据类型的 "maxExclusive" 指定的值。
zh_hant: 在相同資料類型中，'minInclusive' 的指定值不可以大於 'maxExclusive' 的指定值。

# Sch_MinInclusiveGtMaxInclusive
source: The value specified for 'minInclusive' cannot be greater than the value specified for 'maxInclusive' for the same data type.
cs: Hodnota zadaná pro omezení minInclusive nemůže být větší než hodnota zadaná pro omezení maxInclusive pro stejný datový typ.
de: Der für "minInclusive" angegebene Wert darf nicht größer sein als der für "maxInclusive" angegebene Wert für denselben Datentyp.
es: El valor especificado para "minInclusive" no puede ser mayor que el valor especificado para "maxInclusive" para el mismo tipo de datos.
fr: La valeur spécifiée pour 'minInclusive' ne doit pas être supérieure à la valeur spécifiée pour 'maxInclusive' pour le même type de données.
it: Il valore specificato per 'minInclusive' non può essere maggiore di quello specificato per 'maxInclusive' per lo stesso tipo di dati.
ja: データ型が同じ場合、'minInclusive' に指定された値を、'maxInclusive' に指定された値より大きくすることはできません。
ko: 'minInclusive'에 지정된 값은 동일한 데이터 형식의 'maxInclusive'에 지정된 값보다 클 수 없습니다.
pl: W obrębie jednego typu danych wartość określona dla elementu „minInclusive” nie może być większa niż wartość określona dla elementu „maxInclusive”.
pt_br: O valor especificado para 'minInclusive' não pode ser maior que o valor especificado para 'maxInclusive' para o mesmo tipo de dados.
ru: Значение minInclusive не может быть больше значения maxInclusive, заданного для того же типа данных.
tr: Aynı veri türünde, 'minInclusive' için belirtilen değer 'maxInclusive' için belirtilen değerden büyük olamaz.
zh_hans: 为 "minInclusive" 指定的值不能大于为同一数据类型的 "maxInclusive" 指定的值。
zh_hant: 在相同資料類型中，'minInclusive' 的指定值不可以大於 'maxInclusive' 的指定值。

# Sch_MinInclusiveMismatch
source: It is an error if the derived 'minInclusive' facet value is less than the parent 'minInclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minInclusive menší než hodnota nadřazené omezující vlastnosti minInclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minInclusive" kleiner ist als der übergeordnete Wert des Facets "minInclusive", tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minInclusive "derivado sea menor que el valor de faceta "minInclusive" primario.
fr: La valeur de la facette du 'minInclusive' dérivé ne doit pas être inférieure à la valeur de la facette du 'minInclusive' parent.
it: Il valore del facet derivato 'minInclusive' non può essere minore del valore del facet 'minInclusive' padre.
ja: 派生型の 'minInclusive' ファセットの値が、親の 'minInclusive' ファセットの値よりも小さい場合は、エラーです。
ko: 파생된 'minInclusive' 패싯 값이 부모 'minInclusive' 패싯 값보다 작으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minInclusive” jest mniejsza niż nadrzędna wartość aspektu „minInclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'minInclusive' derivada for menor que o valor da faceta 'minInclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minInclusive меньше значения родительского аспекта minInclusive.
tr: Türetilen 'minInclusive' modeli değerinin üst 'minInclusive' modeli değerinden küçük olması hatadır.
zh_hans: 如果派生的 "minInclusive" 方面值小于父级 "minInclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minInclusive' Facet 值小於父 'minInclusive' Facet 的值，即為錯誤。

# Sch_MinLengthConstraintFailed
source: The actual length is less than the MinLength value.
cs: Skutečná délka je menší než hodnota MinLength.
de: Die tatsächliche Länge ist kleiner als der MinLength-Wert.
es: La longitud real es menor que el valor de MinLength.
fr: La longueur réelle est inférieure à la valeur MinLength.
it: La lunghezza effettiva è minore del valore di MinLength.
ja: 実際の値が MinLength 値より少ないです。
ko: 실제 길이가 MinLength 값보다 작습니다.
pl: Rzeczywista długość jest mniejsza niż wartość MinLength.
pt_br: O comprimento real é menor que o valor de MinLength.
ru: Фактическая длина меньше значения MinLength.
tr: Gerçek uzunluk MinLength değerinden küçük.
zh_hans: 实际长度小于 MinLength 值。
zh_hant: 實際長度小於 MinLength 的值。

# Sch_MinLengthFacetInvalid
source: The MinLength constraining facet is invalid - {0}
cs: Omezující vlastnost MinLength je neplatná – {0}
de: Ungültiges MinLength-Einschränkungsfacet – {0}
es: Faceta de restricción de MinLength no válida - {0}
fr: La facette de contrainte MinLength est non valide : {0}
it: Il facet vincolante MinLength non è valido - {0}
ja: MinLength 制約ファセットが無効です。{0}
ko: MinLength 제약 패싯이 잘못되었습니다. {0}
pl: Element MinLength ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MinLength é inválida – {0}
ru: Недопустимый ограничивающий аспект MinLength — {0}
tr: MinLength kısıtlama modeli geçersiz - {0}
zh_hans: MinLength 约束方面无效 - {0}
zh_hant: MinLength 條件約束 Facet 無效 - {0}

# Sch_MinLengthFacetProhibited
source: The MinLength constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MinLength je pro {0} zakázána.
de: Das MinLength-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MinLength prohibida para "{0}".
fr: La facette de contrainte MinLength est interdite pour '{0}'.
it: Il facet vincolante MinLength non è consentito per '{0}'.
ja: MinLength 制約ファセットは '{0}' で使用できません。
ko: MinLength 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MinLength ograniczający aspekt dla „{0}” jest zabroniony.
pt_br: A faceta de restrições MinLength é proibida para '{0}'.
ru: Ограничивающий аспект MinLength запрещен для "{0}".
tr: '{0}' için MinLength kısıtlama modeli kullanılamaz.
zh_hans: MinLength 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MinLength 條件約束 Facet。

# Sch_MinLengthGtBaseMinLength
source: It is an error if 'minLength' is among the members of {facets} of {base type definition} and {value} is less than the {value} of the parent 'minLength'.
cs: Pokud vlastnost minLength patří mezi členy {facets} typu {base type definition} a hodnota {value} je menší než hodnota {value} nadřazené vlastnosti minLength, jedná se o chybu.
de: Wenn "minLength" ein Member von {facets} der {base type definition} ist und {value} kleiner als der {value} der übergeordneten "minLength" ist, tritt ein Fehler auf.
es: Es incorrecto que "minLength" se encuentre entre los miembros de {facets} de {base type definition} y que {value} sea menor que {value} de "minLength" primario.
fr: 'minLength' ne doit pas faire partie des membres des {facets} de la {base type definition} et la {value} ne doit pas être inférieure à la {value} du 'minLength' parent.
it: Se 'minLength' è incluso nei membri di {facets} di {base type definition}, il valore {value} non deve essere minore di quello di 'minLength' padre.
ja: 'minLength' が {base type definition} の {facets} のメンバーの中にあり、かつ {value} が親 'minLength' の {value} よりも小さい場合は、エラーです。
ko: 'minLength'가 {base type definition}의 {facets} 멤버 중 하나인 경우 {value}가 부모 'minLength'의 {value}보다 작으면 오류가 발생합니다.
pl: Jeśli element „minLength” należy do składowych aspektów {facets} dla definicji {base type definition}, a wartość {value} jest mniejsza niż wartość {value} nadrzędnego elementu „minLength”, występuje błąd.
pt_br: Erro se 'minLength' estiver entre os membros de {facets} de {base type definition} e se {value} for menor que o {value} do 'minLength' pai.
ru: Является ошибкой то, что minLength указан среди членов {facets} для {base type definition} и {value} меньше, чем {value} родительского minLength.
tr: 'minLength'in {base type definition} tanımının {facets} esaslarının üyeleri arasında olması ve {value} değerinin üst 'minLength' {value} değerinden küçük olması hatadır.
zh_hans: 如果 "minLength" 是 {base type definition} 的 {facets} 的成员，并且 {value} 小于父级 "minLength" 的 {value}，则是错误的。
zh_hant: 若 'minLength' 是在 {base type definition} 內 {facets} 的成員之中，且 {value} 小於父 'minLength' 的 {value}，即為錯誤。

# Sch_MinLengthGtMaxLength
source: MinLength is greater than MaxLength.
cs: Hodnota MinLength je větší než hodnota MaxLength.
de: MinLength ist größer als MaxLength.
es: MinLength es mayor que MaxLength.
fr: MinLength est supérieur à MaxLength.
it: MinLength è maggiore di MaxLength.
ja: MinLength が MaxLength よりも大きい値です。
ko: MinLength가 MaxLength보다 큽니다.
pl: Element MinLength jest większy niż element MaxLength.
pt_br: MinLength é maior que MaxLength.
ru: Значение MinLength больше значения MaxLength.
tr: MinLength, MaxLength'ten büyük.
zh_hans: MinLength 大于 MaxLength。
zh_hant: MinLength 大於 MaxLength。

# Sch_MinMaxGroupRedefine
source: When group is redefined, the real value of both minOccurs and maxOccurs attribute must be 1 (or absent).
cs: Při předefinování skupiny musí skutečná hodnota atributů minOccurs a maxOccurs být rovna 1 nebo zcela chybět.
de: Wenn eine Gruppe neu definiert wird, müssen die tatsächlichen Werte des minOccurs- und maxOccurs-Attributs 1 (oder nicht vorhanden) sein.
es: Cuando se vuelve a definir el grupo, el valor real de los atributos minOccurs y maxOccurs debe ser 1 (o no estar presente).
fr: Quand le groupe est redéfini, la valeur réelle des attributs minOccurs et maxOccurs doit être 1 (ou absent).
it: Quando si ridefinisce il gruppo, il valore reale degli attributi minOccurs e maxOccurs (se presenti) deve essere 1.
ja: グループが再定義された場合、minOccurs および maxOccurs 属性の実際の値を 1 に設定するか、または省略しなければなりません。
ko: 그룹을 다시 정의하는 경우 minOccurs 및 maxOccurs 특성의 실제 값은 1이거나 없어야 합니다.
pl: Gdy grupa zostanie przedefiniowana, wartość rzeczywista obu atrybutów minOccurs i maxOccurs musi być równa 1 (lub brak).
pt_br: Quando o grupo é redefinido, o valor real dos atributos minOccurs e maxOccurs deve ser 1 (ou ausente).
ru: При переопределении группы фактическое значение атрибутов minOccurs и maxOccurs должно быть равно 1 (или отсутствовать).
tr: Grup yeniden tanımlandığında, hem minOccurs hem de maxOccurs özniteliğinin değeri 1 olmalıdır (veya belirtilmemelidir).
zh_hans: 重新定义组后，minOccurs 和 maxOccurs 特性的实际值都必须为 1 (或不存在)。
zh_hant: 當群組重新定義時，minOccurs 和 maxOccurs 屬性兩者的實際值必須為 1 (或空白)。

# Sch_MinOccursInvalid
source: The minOccurs attribute must have a value of 0 or 1.
cs: Atribut minOccurs musí mít hodnotu 0 nebo 1.
de: Der Wert des minOccurs-Attributs muss 0 oder 1 sein.
es: El atributo minOccurs debe tener un valor de 0 o 1.
fr: L'attribut minOccurs doit avoir la valeur 0 ou 1.
it: Il valore dell'attributo minOccurs deve essere 0 o 1.
ja: minOccurs 属性には値 0 か 1 を指定しなければなりません。
ko: minOccurs 특성 값은 0 또는 1이어야 합니다.
pl: Atrybut minOccurs musi mieć wartość 0 lub 1.
pt_br: O atributo minOccurs deve ter valor 0 ou 1.
ru: Атрибут minOccurs должен иметь значение 0 или 1.
tr: minOccurs özniteliğinin değeri 0 veya 1 olmalıdır.
zh_hans: minOccurs 特性必须具有值 0 或 1。
zh_hant: minOccurs 屬性必須有屬於 0 或 1 的值。

# Sch_MinOccursInvalidXsd
source: The value for the 'minOccurs' attribute must be xsd:nonNegativeInteger.
cs: Hodnota atributu minOccurs musí být typu xsd:nonNegativeInteger.
de: Der Wert für das minOccurs-Attribut muss "xsd:nonNegativeInteger" sein.
es: El valor del atributo "minOccurs" debe ser xsd:nonNegativeInteger.
fr: La valeur de l'attribut 'minOccurs' doit être xsd:nonNegativeInteger.
it: Il valore dell'attributo 'minOccurs' deve essere xsd:nonNegativeInteger.
ja: 'minOccurs' 属性の値は xsd:nonNegativeInteger でなければなりません。
ko: 'minOccurs' 특성 값은 xsd:nonNegativeInteger여야 합니다.
pl: Wartość dla atrybutu „minOccurs” musi być typu xsd:nonNegativeInteger.
pt_br: O valor do atributo 'minOccurs' deve ser xsd:nonNegativeInteger.
ru: Значение атрибута minOccurs должно быть xsd:nonNegativeInteger.
tr: 'minOccurs' özniteliğinin değeri xsd:nonNegativeInteger olmalıdır.
zh_hans: "minOccurs" 特性的值必须为 xsd:nonNegativeInteger。
zh_hant: 'minOccurs' 屬性值必須是 xsd:nonNegativeInteger。

# Sch_MismatchTargetNamespace
source: The attribute targetNamespace does not match the designated namespace URI.
cs: Obor názvů targetNamespace atributu neodpovídá určenému identifikátoru URI oboru názvů.
de: Der targetNamespace des Attributs stimmt nicht mit dem festgelegten Namespace-URI überein.
es: El atributo targetNamespace no coincide con el espacio de nombres URI designado.
fr: L'attribut targetNamespace ne correspond pas à l'URI d'espace de noms désigné.
it: L'attributo targetNamespace non corrisponde all'URI dello spazio dei nomi designato.
ja: 属性 targetNamespace が、指定された名前空間の URI と一致していません。
ko: targetNamespace 특성이 지정된 네임스페이스 URI와 일치하지 않습니다.
pl: Atrybut targetNamespace nie odpowiada wyznaczonemu identyfikatorowi URI przestrzeni nazw.
pt_br: O atributo targetNamespace não coincide com o URI do namespace designado.
ru: Атрибут targetNamespace не соответствует URI назначенного пространства имен.
tr: targetNamespace özniteliği, ayrılmış ad alanı URI ile eşleşmiyor.
zh_hans: targetNamespace 特性与指定的命名空间 URI 不匹配。
zh_hant: 屬性 targetNamespace 與指定的命名空間 URI 不符。

# Sch_MismatchTargetNamespaceEx
source: The targetNamespace parameter '{0}' should be the same value as the targetNamespace '{1}' of the schema.
cs: Parametr targetNamespace {0} musí mít stejnou hodnotu jako parametr targetNamespace {1} schématu.
de: Der Wert des targetNamespace-Parameters "{0}" muss dem Wert des targetNamespace "{1}" des Schemas entsprechen.
es: El parámetro targetNamespace "{0}" debe tener el mismo valor que el parámetro targetNamespace "{1}" del esquema.
fr: Le paramètre targetNamespace '{0}' doit avoir la même valeur que le paramètre targetNamespace '{1}' du schéma.
it: Il valore del parametro '{0}' di targetNamespace deve essere uguale a quello dell'elemento targetNamespace '{1}' dello schema.
ja: targetNamespace のパラメーター '{0}' は、スキーマの targetNamespace '{1}' と同じ値である必要があります。
ko: targetNamespace 매개 변수 '{0}'의 값은 스키마의 targetNamespace '{1}'과(와) 같아야 합니다.
pl: Parametr przestrzeni nazw targetNamespace „{0}” powinien mieć taką samą wartość jak parametr przestrzeni nazw targetNamespace „{1}” dla schematu.
pt_br: O parâmetro '{0}' de targetNamespace deve ter o mesmo valor que o parâmetro '{1}' do targetNamespace do esquema.
ru: Параметр targetNamespace "{0}" должен иметь то же значение, что и targetNamespace "{1}" схемы.
tr: '{0}' targetNamespace parametresinin değeri, şemadaki targetNamespace '{1}' ile aynı olmalı.
zh_hans: targetNamespace 参数“{0}”的值应与架构的 targetNamespace“{1}”的值相同。
zh_hant: targetNamespace 參數 '{0}' 的值應該與結構描述的 targetNamespace '{1}' 相同。

# Sch_MismatchTargetNamespaceImport
source: The namespace attribute '{0}' of an import should be the same value as the targetNamespace '{1}' of the imported schema.
cs: Atribut oboru názvů {0} importu by měl mít stejnou hodnotu jako obor názvů targetNamespace {1} importovaného schématu.
de: Der Wert des Namespaceattributs "{0}" eines Imports muss dem Wert des targetNamespace "{1}" des importierten Schemas entsprechen.
es: El atributo de espacio de nombres "{0}" de una importación debe tener el mismo valor que el elemento targetNamespace "{1}" del esquema importado.
fr: L'attribut d'espace de noms '{0}' d'une importation doit avoir la même valeur que le targetNamespace '{1}' du schéma importé.
it: Il valore dell'attributo '{0}' dello spazio dei nomi di un'importazione deve essere uguale quello dell'elemento targetNamespace '{1}' dello schema importato.
ja: インポートの名前空間属性 '{0}' は、インポートされたスキーマの targetNamespace '{1}' の値と同じ値である必要があります。
ko: 가져오기의 네임스페이스 특성 '{0}'의 값은 가져온 스키마의 targetNamespace '{1}'과(와) 같아야 합니다.
pl: Atrybut przestrzeni nazw „{0}” dla importu powinien mieć taką samą wartość jak przestrzeń nazw targetNamespace „{1}” dla zaimportowanego schematu.
pt_br: O atributo namespace '{0}' de uma importação deve ter o mesmo valor que o targetNamespace '{1}' do esquema importado.
ru: Атрибут пространства имен "{0}" для импортируемого элемента должен иметь то же значение, что и targetNamespace "{1}" импортированной схемы.
tr: İçeri aktarma işleminin '{0}' ad alanı özniteliği değeri, alınan şemadaki targetNamespace '{1}' ile aynı olmalı.
zh_hans: 导入的命名空间特性“{0}”应与导入架构的 targetNamespace“{1}”的值相同。
zh_hant: 輸入的命名空間屬性 '{0}' 應與已輸入的結構描述 targetNamespace '{1}' 有相同的值。
