Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlInvalidArraySyntax
source: SOAP-ENC:arrayType must end with a ']' character.
cs: Typ SOAP-ENC:arrayType musí končit znakem ].
de: SOAP-ENC:arrayType muss mit einem "]"-Zeichen enden.
es: SOAP-ENC:arrayType debe terminar con un carácter como "]".
fr: SOAP-ENC:arrayType doit finir par un caractère ']'.
it: SOAP-ENC:arrayType deve terminare con il carattere ']'.
ja: SOAP-ENC:arrayType は ']' の文字で終わらなければなりません。
ko: SOAP-ENC:arrayType은 ']' 문자로 끝나야 합니다.
pl: Element SOAP-ENC:arrayType musi być zakończony znakiem „]”.
pt_br: SOAP-ENC:arrayType deve terminar com um caractere ']'.
ru: SOAP-ENC:arrayType должен заканчиваться символом "]".
tr: SOAP-ENC:arrayType bir ']' karakteriyle sonlanmalı.
zh_hans: SOAP-ENC:arrayType 必须以 "]" 字符结束。
zh_hant: SOAP-ENC:arrayType 必須以 ']' 字元結尾。

# XmlInvalidArrayTypeName
source: The SOAP-ENC:arrayType references type is named '{0}'; a type named '{1}' was expected at {2}.
cs: Typ odkazů SOAP-ENC:arrayType je pojmenován jako {0}. V {2} byl očekáván typ s názvem {1}.
de: Der SOAP-ENC:arrayType-Verweistyp hat den Namen "{0}". Ein Typ mit dem Namen "{1}" wurde bei {2} erwartet.
es: Tipo de referencia SOAP-ENC:arrayType denominado "{0}"; se esperaba un tipo denominado "{1}" en {2}.
fr: Le type référence SOAP-ENC:arrayType est nommé '{0}' ; un type nommé '{1}' était attendu à {2}.
it: SOAP-ENC:arrayType fa riferimento a un tipo denominato '{0}'. Alla posizione {2} è previsto un tipo denominato '{1}'.
ja: SOAP-ENC:arrayType 参照型は '{0}' という名前ですが、'{1}' という名前の型が {2} で必要です。
ko: SOAP-ENC:arrayType이 이름이 '{0}'인 형식을 참조합니다. {2}에 이름이 '{1}'인 형식이 필요합니다.
pl: Typ odwołań SOAP-ENC:arrayType ma nazwę „{0}”; oczekiwano typu o nazwie „{1}” w {2}.
pt_br: O tipo de referência SOAP-ENC:arrayType chama-se '{0}'; um tipo chamado '{1}' era esperado em {2}.
ru: Тип ссылок SOAP-ENC:arrayType имеет имя "{0}"; в {2} ожидался тип с именем "{1}".
tr: SOAP-ENC:arrayType başvuruları türünün adı '{0}'; {2} konumunda '{1}' adlı bir tür bekleniyor.
zh_hans: SOAP-ENC:arrayType 引用类型名为“{0}”；{2} 处应为名为“{1}”的类型。
zh_hant: SOAP-ENC:arrayType 參考名稱為 '{0}' 的類型。名稱為 '{1}' 的類型必須在 {2}。

# XmlInvalidArrayTypeNamespace
source: The SOAP-ENC:arrayType references type is from namespace '{0}'; the namespace '{1}' was expected at {2}.
cs: Typ odkazů SOAP-ENC:arrayType pochází z oboru názvů {0}. V {2} byl očekáván obor názvů {1}.
de: Der SOAP-ENC:arrayType-Verweistyp stammt aus dem Namespace "{0}". Der Namespace "{1}" wurde bei {2} erwartet.
es: Tipo de referencia SOAP-ENC:arrayType del espacio de nombres "{0}"; se esperaba el espacio de nombres "{1}" en {2}.
fr: Le type référence SOAP-ENC:arrayType est issu de l'espace de noms '{0}' ; l'espace de noms '{1}' était attendu à {2}.
it: SOAP-ENC:arrayType fa riferimento a un tipo appartenente allo spazio dei nomi '{0}'. Alla posizione {2} è previsto lo spazio dei nomi '{1}'.
ja: SOAP-ENC:arrayType 参照型は名前空間 '{0}' から派生していますが、名前空間 '{1}' が {2} で必要です。
ko: SOAP-ENC:arrayType이 '{0}' 네임스페이스에서 형식을 참조합니다. {2}에 '{1}' 네임스페이스가 필요합니다.
pl: Typ odwołań SOAP-ENC:arrayType jest z przestrzeni nazw „{0}”; oczekiwano przestrzeni nazw „{1}” w {2}.
pt_br: O tipo de referência SOAP-ENC:arrayType é do namespace '{0}'; o namespace '{1}' era esperado em {2}.
ru: Тип ссылок SOAP-ENC:arrayType принадлежит пространству имен "{0}"; в {2} ожидалось пространство имен "{1}".
tr: SOAP-ENC:arrayType başvuruları türü '{0}' ad alanından; {2} konumunda '{1}' ad alanı bekleniyor.
zh_hans: SOAP-ENC:arrayType 引用类型来自命名空间“{0}”；{2} 处应为命名空间“{1}”。
zh_hant: SOAP-ENC:arrayType 參考來自命名空間 '{0}' 的類型。命名空間 '{1}' 必須在 {2}。

# XmlInvalidArrayTypeSyntax
source: Invalid wsd:arrayType syntax: '{0}'.
cs: Neplatná syntaxe wsd:arrayType: {0}
de: Ungültige wsd:arrayType-Syntax: "{0}".
es: Sintaxis wsd:arrayType no válida: "{0}".
fr: Syntaxe wsd:arrayType non valide : '{0}'.
it: Sintassi di wsd:arrayType non valida: '{0}'.
ja: wsd:arrayType 構文: '{0}' が無効です。
ko: wsd:arrayType 구문 '{0}'이(가) 잘못되었습니다.
pl: Nieprawidłowa składnia elementu wsd:arrayType: „{0}”.
pt_br: Sintaxe wsd:arrayType inválida: '{0}'.
ru: Недопустимый синтаксис wsd:arrayType: "{0}".
tr: Geçersiz wsd:arrayType sözdizimi: '{0}'.
zh_hans: 无效的 wsd:arrayType 语法:“{0}”。
zh_hant: wsd:arrayType 語法無效: '{0}'。

# XmlInvalidAttributeType
source: {0} may not be used on parameters or return values when they are not wrapped.
cs: Typ {0} nelze použít pro parametry ani návratové hodnoty, nejsou-li v obálce.
de: {0} kann nicht für Parameter oder Rückgabewerte verwendet werden, wenn diese nicht umschlossen sind.
es: No se puede utilizar {0} en parámetros o valores devueltos cuando no están ajustados.
fr: {0} ne doit pas être utilisé pour des paramètres ou des valeurs retournées non inclus dans un wrapper.
it: Non è possibile usare {0} su parametri o valori restituiti se non sono di tipo wrapped.
ja: ラップされているときに、{0} をパラメーターで使ったり戻り値にしたりすることはできません。
ko: {0}은(는) 래핑되지 않은 매개 변수 또는 반환 값에 사용할 수 없습니다.
pl: Element {0} nie może być używany dla parametrów lub zwracanych wartości, jeśli nie są one otoczone.
pt_br: {0} não deve ser usado em parâmetros nem em valores retornados sem encapsulamento.
ru: {0} не может использоваться для параметров или возвращаемых значений, когда они не заключены в оболочку.
tr: {0}, kapsanmış olmayan parametre veya dönüş değerlerinde kullanılamaz.
zh_hans: 当未对参数或返回值进行包装时不能在它们上面使用 {0}。
zh_hant: {0} 在尚未包裝之前，不可用於參數或傳回值。

# XmlInvalidAttributeUse
source: XML attributes may not be specified for the type {0}.
cs: Atributy XML nesmí být zadány pro typ {0}.
de: XML-Attribute können nicht für den Typ {0} angegeben werden.
es: No puede especificar atributos XML para el tipo {0}.
fr: Les attributs XML ne peuvent pas être spécifiés pour le type {0}.
it: È possibile che gli attributi XML per il tipo {0} non siano specificati.
ja: XML 属性を {0} 型に対して指定することはできません。
ko: {0} 형식에 대해 XML 특성을 지정할 수 없습니다.
pl: Atrybuty XML nie mogą być określone dla typu {0}.
pt_br: Atributos XML não podem ser especificados para o tipo {0}.
ru: Невозможно задать атрибуты XML для типа {0}.
tr: {0} türü için XML öznitelikleri belirtilemez.
zh_hans: 不得为类型 {0} 指定 XML 特性。
zh_hant: 類型 {0} 不可以指定 XML 屬性。

# XmlInvalidBaseType
source: Type {0} cannot derive from {1} because it already has base type {2}.
cs: Typ {0} nelze odvodit od {1}, protože již má základní typ {2}.
de: Der Typ {0} kann nicht von {1} abgeleitet werden, da er bereits den Basistyp {2} hat.
es: El tipo {0} no puede derivar de {1} porque ya tiene un tipo base {2}.
fr: Le type {0} ne peut pas dériver de {1}, car il a déjà un type de base {2}.
it: Il tipo {0} non può derivare da {1} perché contiene già il tipo di base {2}.
ja: 型 {0} には既に基本データ型 {2} が含まれているため、{1} から派生できません。
ko: {0} 형식은 이미 기본 형식 {2}을(를) 포함하고 있으므로 {1}에서 파생될 수 없습니다.
pl: Typ {0} nie może pochodzić od {1}, ponieważ ma już typ podstawowy {2}.
pt_br: O tipo {0} não pode derivar de {1} porque ele já tem tipo base {2}.
ru: Тип {0} не может быть получен из {1}, так как он уже имеет базовый тип {2}.
tr: {0} türü zaten {2} temel türüne sahip olduğundan {1} türünü türetemez.
zh_hans: 类型 {0} 不能从 {1} 派生，因为它已经具有基类型 {2}。
zh_hant: 類型 {0} 無法衍生自 {1}，因為它已經擁有基底類型 {2}。

# XmlInvalidCast
source: Cannot assign object of type {0} to an object of type {1}.
cs: Objekt typu {0} nelze přiřadit objektu typu {1}.
de: Ein Objekt vom Typ {0} kann einem Objekt vom Typ {1} nicht zugewiesen werden.
es: No se puede asignar el objeto de tipo {0} al objeto de tipo {1}.
fr: Impossible d'assigner un objet de type {0} à un objet de type {1}.
it: Non è possibile assegnare l'oggetto di tipo {0} a un oggetto di tipo {1}.
ja: 型 {0} のオブジェクトを型 {1} のオブジェクトに割り当てることはできません。
ko: {0} 형식의 개체는 {1} 형식의 개체에 할당할 수 없습니다.
pl: Nie można przypisać obiektu typu {0} do obiektu typu {1}.
pt_br: Não é possível atribuir objeto de tipo {0} a um objeto de tipo {1}.
ru: Невозможно назначить объект типа {0} объекту типа {1}.
tr: {0} türü bir nesne {1} türü bir nesneye atanamaz.
zh_hans: 无法将类型 {0} 的对象分配给类型 {1} 的对象。
zh_hant: 無法對類型 {1} 的物件指派 {0} 的物件。

# XmlInvalidCastWithId
source: Cannot assign object of type {0} to an object of type {1}. The error occurred while reading node with id='{2}'.
cs: Nelze přiřadit objekt typu {0} k objektu typu {1}. Při čtení uzlu s id={2} došlo k chybě.
de: Ein Objekt vom Typ {0} kann einem Objekt vom Typ {1} nicht zugewiesen werden. Fehler beim Lesen des Knotens mit id="{2}".
es: No se puede asignar un objeto del tipo {0} a un objeto del tipo {1}. El error se ha producido al leer el nodo con el id="{2}".
fr: Impossible d'assigner un objet de type {0} à un objet de type {1}. L'erreur s'est produite durant la lecture du nœud doté de la valeur id='{2}'.
it: Non è possibile assegnare l'oggetto di tipo {0} a un oggetto di tipo {1}. L'errore si è verificato durante la lettura del nodo con id='{2}'.
ja: 型 {0} のオブジェクトを型 {1} のオブジェクトに割り当てることはできません。このエラーは、ID が '{2}' のノードの読み取り中に発生しました。
ko: {0} 형식의 개체는 {1} 형식의 개체에 할당할 수 없습니다. ID='{2}'인 노드를 읽는 동안 오류가 발생했습니다.
pl: Nie można przypisać obiektu typu {0} do obiektu typu {1}. Wystąpił błąd podczas odczytywania węzła o identyfikatorze „{2}”.
pt_br: Não é possível atribuir objeto do tipo {0} a um objeto do tipo {1}. O erro ocorreu durante a leitura do nó com ID='{2}'.
ru: Невозможно назначить объект типа {0} объекту типа {1}. Ошибка при чтении узла с идентификатором="{2}".
tr: {0} türü nesne {1} türü nesneye atanamaz. Kimliği '{2}' olan düğüm okunurken hata oluştu.
zh_hans: 不能将 {0} 类型的对象分配给 {1} 类型的对象。读取 id='{2}' 的节点时出现该错误。
zh_hant: 無法對類型 {1} 的物件指派類型 {0} 的物件。讀取識別碼為 '{2}' 的節點時發生錯誤。

# XmlInvalidChoiceIdentifierValue
source: Invalid or missing value of the choice identifier '{1}' of type '{0}[]'.
cs: Neplatná nebo chybějící hodnota identifikátoru volby {1} typu {0}[]
de: Ungültiger oder fehlender Wert des Auswahlbezeichners "{1}" vom Typ "{0}[]".
es: Falta el valor del identificador de opción "{1}" del tipo "{0}[]" o no es válido.
fr: Valeur non valide ou manquante de l'identificateur de choix '{1}' de type '{0}[]'.
it: Il valore dell'identificatore choice '{1}' di tipo '{0}[]' manca o non è valido.
ja: 型 '{0}[]' の choice 識別子 '{1}' が無効か、見つかりません。
ko: '{0}[]' 형식의 choice ID '{1}'의 값이 없거나 잘못되었습니다.
pl: Nieprawidłowa lub brakująca wartość identyfikatora wyboru „{1}” typu „{0}[]”.
pt_br: Valor inválido ou inexistente do identificador de opção '{1}' do tipo '{0}[]'.
ru: Значение идентификатора выбора "{1}" типа "{0}[]" является недопустимым или отсутствует.
tr: '{0}[]' türündeki '{1}' seçim tanımlayıcısının değeri geçersiz veya eksik.
zh_hans: 类型“{0}[]”的选择标识符“{1}”的值无效或缺失。
zh_hant: 類型 '{0}[]' 之選擇識別碼 '{1}' 的值無效或遺漏該值。

# XmlInvalidConstantAttribute
source: Only XmlEnum may be used on enumerated constants.
cs: Pro výčtové konstanty lze použít pouze atribut XmlEnum.
de: In Enumerationskonstanten kann nur XmlEnum verwendet werden.
es: Solo se puede utilizar XmlEnum en constantes enumeradas.
fr: Seul XmlEnum peut être utilisé sur les constantes énumérées.
it: Sulle costanti enumerate è possibile usare solo XmlEnum.
ja: XmlEnum のみ列挙された定数で使うことができます。
ko: 열거형 상수에는 XmlEnum만 사용할 수 있습니다.
pl: Tylko element XmlEnum może być używany dla stałych wyliczeniowych.
pt_br: Somente XmlEnum pode ser usado em constantes enumeradas.
ru: Для перечисляемых констант может использоваться только XmlEnum.
tr: Listelenmiş sabitlerde yalnızca XmlEnum kullanılabilir.
zh_hans: 只有 XmlEnum 可以在枚举常数上使用。
zh_hant: 只有 XmlEnum 才可用於列舉的常數上。

# XmlInvalidContent
source: Invalid content {0}.
cs: Neplatný obsah {0}
de: Ungültiger Inhalt "{0}".
es: Contexto no válido {0}.
fr: Contenu non valide {0}.
it: Il contenuto {0} non è valido.
ja: コンテンツ {0} が無効です。
ko: 콘텐츠 {0}이(가) 잘못되었습니다.
pl: Nieprawidłowa zawartość elementu {0}.
pt_br: Conteúdo inválido {0}.
ru: Недопустимое содержимое {0}.
tr: {0} içeriği geçersiz.
zh_hans: 无效的内容 {0}。
zh_hant: 內容 {0} 無效。

# XmlInvalidDataTypeUsage
source: '{0}' is an invalid value for the {1} property. The property may only be specified for primitive types.
cs: Hodnota {0} je pro vlastnost {1} neplatná. Vlastnost lze zadat pouze pro primitivní typy.
de: "{0}" ist ein ungültiger Wert für die {1}-Eigenschaft. Die Eigenschaft kann nur für primitive Typen angegeben werden.
es: "{0}" es un valor no válido para la propiedad {1}. La propiedad solo se puede especificar con tipos primitivos.
fr: '{0}' est une valeur non valide pour la propriété {1}. La propriété ne peut être spécifiée que pour des types primitifs.
it: '{0}' non è un valore valido per la proprietà {1}. La proprietà può essere specificata solo per i tipi primitivi.
ja: '{0}' は、{1} プロパティには無効な値です。このプロパティはプリミティブ型に対してのみ指定できます。
ko: '{0}'은(는) {1} 속성에 사용할 수 없는 값입니다. 이 속성은 기본 형식에 대해서만 지정할 수 있습니다.
pl: Element „{0}” jest nieprawidłową wartością właściwości {1}. Właściwość może być określona tylko dla typów pierwotnych.
pt_br: '{0}' é um valor inválido para a propriedade {1}. A propriedade só pode ser especificada para tipos primitivos.
ru: "{0}" является недопустимым значением свойства {1}. Данное свойство может присваиваться только типам примитивов.
tr: '{0}', {1} özelliği için geçersiz bir değer. Özellik yalnızca temel türler için belirtilebilir.
zh_hans: “{0}”对属性 {1} 是无效值。只能为基元类型指定该属性。
zh_hant: '{0}' 對 {1} 屬性是無效值。只可為基本類型指定該屬性。

# XmlInvalidDefaultEnumValue
source: Enum {0} cannot be converted to {1}.
cs: Výčet {0} nelze převést na {1}.
de: Die Enumeration {0} kann nicht in {1} konvertiert werden.
es: La enumeración {0} no se puede convertir a {1}.
fr: L'enum {0} ne peut pas être converti en {1}.
it: L'enumerazione {0} non può essere convertita in {1}.
ja: 列挙値 {0} は {1} に変換できません。
ko: 열거형 {0}을(를) {1}(으)로 변환할 수 없습니다.
pl: Wyliczenie {0} nie może być konwertowane na {1}.
pt_br: A enumeração {0} não pode ser convertida em {1}.
ru: Невозможно преобразовать перечисление {0} в {1}.
tr: {0} sabit listesi, {1} türüne dönüştürülemiyor.
zh_hans: 枚举 {0} 无法转换为 {1}。
zh_hant: 無法將列舉 {0} 轉換為 {1}。

# XmlInvalidDefaultValue
source: Value '{0}' cannot be converted to {1}.
cs: Hodnotu {0} nelze převést na {1}.
de: Der Wert "{0}" kann nicht in {1} konvertiert werden.
es: No se puede convertir el valor "{0}" en {1}.
fr: La valeur '{0}' ne peut pas être convertie en {1}.
it: Il valore '{0}' non può essere convertito in {1}.
ja: 値 '{0}' を {1} に変換できません。
ko: '{0}' 값을 {1}(으)로 변환할 수 없습니다.
pl: Wartość „{0}” nie może być konwertowana na {1}.
pt_br: O valor '{0}' não pode ser convertido em {1}.
ru: Невозможно преобразовать значение "{0}" в {1}.
tr: '{0}' değeri, {1} türüne dönüştürülemez.
zh_hans: 值“{0}”不能转换为 {1}。
zh_hant: 值 '{0}' 無法轉換為 {1}。

# XmlInvalidElementAttribute
source: Only SoapElementAttribute or SoapAttributeAttribute may be used on members.
cs: Pro členy lze použít pouze atributy SoapElementAttribute a SoapAttributeAttribute.
de: In Membern kann nur SoapElementAttribute oder SoapAttributeAttribute verwendet werden.
es: Solo se puede utilizar SoapElementAttribute o SoapAttributeAttribute en miembros.
fr: Seul SoapElementAttribute ou SoapAttributeAttribute peut être utilisé sur les membres.
it: Sui membri è possibile usare solo SoapElementAttribute o SoapAttributeAttribute.
ja: SoapElementAttribute または SoapAttributeAttribute のみメンバーで使うことができます。
ko: 멤버에는 SoapElementAttribute 또는 SoapAttributeAttribute만 사용할 수 있습니다.
pl: Tylko atrybuty SoapElementAttribute lub SoapAttributeAttribute mogą być używane dla składowych.
pt_br: Somente SoapElementAttribute ou SoapAttributeAttribute pode ser usado em membros.
ru: Для членов может использоваться только SoapElementAttribute или SoapAttributeAttribute.
tr: Üyelerde yalnızca SoapElementAttribute veya SoapAttributeAttribute kullanılabilir.
zh_hans: 只有 SoapElementAttribute 或 SoapAttributeAttribute 可以在成员上使用。
zh_hant: 只有 SoapElementAttribute 或 SoapAttributeAttribute 可以在成員上使用。

# XmlInvalidEncoding
source: Referenced type '{0}' is only valid for encoded SOAP.
cs: Odkazovaný typ {0} je platný pouze pro kódovaný protokol SOAP.
de: Der Typ "{0}", auf den verwiesen wird, ist nur für codiertes SOAP gültig.
es: El tipo "{0}" al que se hace referencia solo es válido para SOAP codificado.
fr: Le type référencé '{0}' n'est valide que pour le SOAP encodé.
it: Il tipo '{0}' di riferimento è valido solo per SOAP codificato.
ja: 参照された型 '{0}' はエンコードされた SOAP に対してのみ有効です。
ko: 참조된 형식 '{0}'은(는) 인코딩된 SOAP에만 사용할 수 있습니다.
pl: Typ „{0}”, do którego nastąpiło odwołanie, jest prawidłowy tylko dla zakodowanego elementu SOAP.
pt_br: O tipo '{0}' referenciado só é válido para SOAP codificado.
ru: Тип "{0}", на который указывает ссылка, допустим только для кодированных SOAP.
tr: Başvurulan '{0}' türü yalnızca kodlanmış SOAP için geçerlidir.
zh_hans: 引用类型“{0}”仅对编码的 SOAP 有效。
zh_hant: 參考的類型 '{0}' 只對編碼的 SOAP 有效。

# XmlInvalidEncoding3
source: The encoding style '{0}' is not valid for this call. Valid values are '{1}' for SOAP 1.1 encoding or '{2}' for SOAP 1.2 encoding.
cs: Styl kódování {0} není pro toto volání platný. Platnými hodnotami jsou {1} pro kódování SOAP 1.1 a {2} pro kódování SOAP 1.2.
de: Der Codierungsstil "{0}" ist für diesen Aufruf nicht gültig. Gültige Werte sind "{1}" für SOAP 1.1-Codierung oder "{2}" für SOAP 1.2-Codierung.
es: El estilo de codificación "{0}" no es válido para esta llamada. Los valores válidos son "{1}" para codificación de SOAP 1.1 o "{2}" para codificación de SOAP 1.2.
fr: Le style d'encodage '{0}' est non valide pour cet appel. Les valeurs valides sont '{1}' pour l'encodage SOAP 1.1 ou '{2}' pour l'encodage SOAP 1.2.
it: Lo stile di codifica '{0}' non è valido per la chiamata corrente. I valori validi sono '{1}' per la codifica SOAP 1.1 o '{2}' per la codifica SOAP 1.2.
ja: エンコード スタイル '{0}' はこの呼び出しでは無効です。有効な値は、SOAP 1.1 エンコードの '{1}' または SOAP 1.2 エンコードの '{2}' です。
ko: 이 호출에 인코딩 스타일 '{0}'을(를) 사용할 수 없습니다. 유효한 값은 SOAP 1.1 인코딩의 경우 '{1}'이고 SOAP 1.2 인코딩의 경우 '{2}'입니다.
pl: Styl kodowania „{0}” jest nieprawidłowy dla tego wywołania. Prawidłowe wartości to „{1}” dla kodowania SOAP 1.1 lub „{2}” dla kodowania SOAP 1.2.
pt_br: O estilo de codificação '{0}' é inválido para esta chamada. Valores válidos são '{1}' para codificação SOAP 1.1 ou '{2}' para codificação SOAP 1.2.
ru: Стиль кодирования "{0}" для этого вызова является недействительным. Допустимыми значениями являются "{1}" для кодирования SOAP 1.1 и "{2}" для кодирования SOAP 1.2.
tr: '{0}' kodlama stili bu çağrı için geçerli değil. Geçerli değerler: SOAP 1.1 kodlaması için '{1}', SOAP 1.2 kodlaması için '{2}'.
zh_hans: 编码样式“{0}”对于此调用无效。对于 SOAP 1.1 编码，有效的值为“{1}”；对于 SOAP 1.2 编码，有效的值为“{2}”。
zh_hant: 編碼樣式 '{0}' 對此呼叫無效。對 SOAP 1.1 編碼有效的值為 '{1}'，對於 SOAP 1.2 編碼有效的值為 '{2}'。

# XmlInvalidEncodingNotEncoded1
source: The encoding style '{0}' is not valid for this call because this XmlSerializer instance does not support encoding. Use the SoapReflectionImporter to initialize an XmlSerializer that supports encoding.
cs: Styl kódování {0} není pro toto volání platný, protože tato instance objektu XmlSerializer nepodporuje kódování. K inicializaci objektu XmlSerializer, který podporuje kódování, použijte funkci SoapReflectionImporter.
de: Der Codierungsstil "{0}" ist für diesen Aufruf nicht gültig, da diese XmlSerializer-Instanz Codieren nicht unterstützt. Verwenden Sie SoapReflectionImporter, um einen XmlSerializer zu initialisieren, der Codieren unterstützt.
es: El estilo de codificación "{0}" no es válido para esta llamada porque la instancia XmlSerializer no admite codificación. Utilice SoapReflectionImporter para inicializar una instancia de XmlSerializer que admita codificación.
fr: Le style d'encodage '{0}' est non valide pour cet appel, car cette instance de XmlSerializer ne prend pas en charge l'encodage. Utilisez SoapReflectionImporter pour initialiser un XmlSerializer qui prend en charge l'encodage.
it: Lo stile di codifica '{0}' non è valido per la chiamata corrente perché questa istanza di XmlSerializer non supporta la codifica. Usare SoapReflectionImporter per inizializzare un elemento XmlSerializer che supporti la codifica.
ja: この XmlSerializer インスタンスはエンコードをサポートしないため、エンコード スタイル '{0}' はこの呼び出しでは無効です。エンコードをサポートする XmlSerializer を初期化するために SoapReflectionImporter を使用してください。
ko: 이 XmlSerializer 인스턴스는 인코딩을 지원하지 않으므로 이 호출에 인코딩 스타일 '{0}'을(를) 사용할 수 없습니다. SoapReflectionImporter를 사용하여 인코딩을 지원하는 XmlSerializer를 초기화하세요.
pl: Styl kodowania „{0}” jest nieprawidłowy dla tego wywołania, ponieważ to wystąpienie elementu XmlSerializer nie obsługuje kodowania. Aby zainicjować element XmlSerializer obsługujący kodowanie, użyj elementu SoapReflectionImporter.
pt_br: O estilo de codificação '{0}' é inválido para esta chamada, pois esta instância de XmlSerializer não dá suporte à codificação. Use o SoapReflectionImporter para inicializar um XmlSerializer que dê suporte à codificação.
ru: Стиль кодирования "{0}" для этого вызова является недействительным, так как этот интерфейс XmlSerializer не поддерживает кодирование. Используйте SoapReflectionImporter для инициализации XmlSerializer, который поддерживает кодирование.
tr: Bu XmlSerializer örneği kodlamayı desteklemediği için, '{0}' kodlama stili geçerli değil. Kodlamayı destekleyen XmlSerializer'ı başlatmak için SoapReflectionImporter kullanın.
zh_hans: 编码样式“{0}”对于此调用无效，因为此 XmlSerializer 实例不支持编码。请使用 SoapReflectionImporter 来初始化支持编码的 XmlSerializer。
zh_hant: 因為這個 XmlSerializer 執行個體不支援編碼方式，所以編碼樣式 '{0}' 對此呼叫無效。請使用 SoapReflectionImporter 來初始化支援編碼的 XmlSerializer。

# XmlInvalidEnumAttribute
source: Only SoapEnum may be used on enum constants.
cs: Na konstanty výčtu může být použita pouze vlastnost SoapEnum.
de: In Enumerationskonstanten kann nur SoapEnum verwendet werden.
es: Solo se puede utilizar SoapEnum en constantes de enumeración.
fr: Seul SoapEnum peut être utilisé sur les constantes enum.
it: Su costanti di enumerazione è possibile usare solo SoapEnum.
ja: SoapEnum のみ列挙型定数で使用できます。
ko: 열거형 상수에는 SoapEnum만 사용할 수 있습니다.
pl: Tylko element SoapEnum może być używany dla stałych wyliczeniowych.
pt_br: Somente SoapEnum pode ser usado em constantes de enumeração.
ru: Для перечисляемых констант может использоваться только SoapEnum.
tr: Listelenmiş sabitlerde yalnızca SoapEnum kullanılabilir.
zh_hans: 只有 SoapEnum 可以用于枚举常数。
zh_hant: 只有 SoapEnum 可以在列舉常數上使用。

# XmlInvalidEnumContent
source: Invalid content '{0}' for enumerated data type {1}.
cs: Neplatný obsah {0} pro výčtový datový typ {1}.
de: Ungültiger Inhalt "{0}" für den enumerierten Datentyp {1}.
es: Contenido no válido "{0}" para tipos de datos enumerados {1}.
fr: Contenu '{0}' non valide pour le type de données {1} énuméré.
it: Il contenuto '{0}' non è valido per il tipo di dati enumerato {1}.
ja: 列挙されたデータ型 {1} に対して無効なコンテンツ '{0}' です。
ko: 열거형 데이터 형식 {1}에 대한 '{0}' 콘텐츠가 잘못되었습니다.
pl: Nieprawidłowa zawartość „{0}” dla wyliczeniowego typu danych {1}.
pt_br: Conteúdo '{0}' inválido para tipo de dados enumerado {1}.
ru: Недопустимое содержимое "{0}" для перечисляемого типа данных {1}.
tr: {1} listelenmiş veri türü için geçersiz içerik: '{0}'.
zh_hans: 枚举数据类型 {1} 的无效内容“{0}”。
zh_hant: 列舉資料類型 {1} 的內容 '{0}' 無效。
