Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_InvalidWhiteSpace
source: The white space character, '{0}', is invalid.
cs: Prázdný znak {0} je neplatný.
de: Das Leerraumzeichen "{0}" ist ungültig.
es: El espacio en blanco, "{0}", no es válido.
fr: Le caractère espace blanc, '{0}', est non valide.
it: Il carattere '{0}' usato per lo spazio vuoto non è valido.
ja: 空白文字 '{0}' が無効です。
ko: 공백 문자 '{0}'이(가) 잘못되었습니다.
pl: Biały znak — „{0}” — jest nieprawidłowy.
pt_br: O caractere de espaço em branco, '{0}', é inválido.
ru: Знак пробела "{0}" является недопустимым.
tr: Boşluk karakteri '{0}' geçersiz.
zh_hans: 空格字符“{0}”无效。
zh_hant: 空白字元 '{0}' 無效。

# Sch_InvalidWhitespaceInEmpty
source: The element cannot contain white space. Content model is empty.
cs: Element nesmí obsahovat prázdné znaky. Model obsahu je prázdný.
de: Das Element darf keine Leerzeichen enthalten. Das Inhaltsmodell ist leer.
es: El elemento no puede contener espacios en blanco. El modelo de contenido está vacío.
fr: L'élément ne peut pas contenir d'espace blanc. Le modèle de contenu est vide.
it: Il modello di contenuto è vuoto. L'elemento non può contenere spazi vuoti.
ja: 要素に空白を含めることはできません。コンテンツ モデルが空です。
ko: 요소는 공백을 포함할 수 없습니다. 콘텐츠 모델이 비어 있습니다.
pl: Element nie może zawierać białego znaku. Model zawartości jest pusty.
pt_br: O elemento não pode conter espaço em branco. Modelo de conteúdo vazio.
ru: Элемент не может содержать пробелы. Модель содержимого пуста.
tr: Öğe boşluk içeremez. İçerik modeli boş.
zh_hans: 元素不能包含空格。内容模型为空。
zh_hant: 元素不可包含空白。內容模型為空白。

# Sch_InvalidXsdAttributeDatatypeValue
source: The value for the '{0}' attribute is invalid - {1}
cs: Hodnota atributu {0} je neplatná – {1}
de: Der Wert für das {0}-Attribut ist ungültig – {1}.
es: El valor del atributo "{0}" no es válido - {1}
fr: La valeur de l'attribut '{0}' est non valide - {1}
it: Il valore dell'attributo '{0}' non è valido - {1}
ja: '{0}' 属性の値が無効です。{1}
ko: '{0}' 특성의 값이 잘못되었습니다. {1}
pl: Wartość atrybutu „{0}” jest nieprawidłowa — {1}
pt_br: Valor do atributo '{0}' é inválido – {1}
ru: Недопустимое значение {1} атрибута "{0}"
tr: '{0}' özniteliğinin değeri geçersiz - {1}
zh_hans: “{0}”特性的值无效 - {1}
zh_hant: '{0}' 屬性的值無效 - {1}

# Sch_InvalidXsdAttributeValue
source: '{1}' is an invalid value for the '{0}' attribute.
cs: Hodnota {1} je pro atribut {0} neplatná.
de: "{1}" ist ein ungültiger Wert für das {0}-Attribut.
es: "{1}" no es un valor válido para el atributo "{0}".
fr: '{1}' est une valeur non valide pour l'attribut '{0}'.
it: '{1}' non è un valore valido per l'attributo '{0}'.
ja: '{1}' は '{0}' 属性に対して無効な値です。
ko: '{1}'은(는) '{0}' 특성에 사용할 수 없는 값입니다.
pl: Element „{1}” jest nieprawidłową wartością dla atrybutu „{0}”.
pt_br: '{1}' é um valor inválido para o atributo '{0}'.
ru: "{1}" является недопустимым значением для атрибута "{0}".
tr: '{1}', '{0}' özniteliği için geçersiz bir değer.
zh_hans: “{1}”值对于“{0}”特性无效。
zh_hant: '{1}' 對 '{0}' 屬性是無效的值。

# Sch_InvalidXsiNill
source: If the 'nillable' attribute is false in the schema, the 'xsi:nil' attribute must not be present in the instance.
cs: Pokud má atribut nillable ve schématu hodnotu false, nesmí být v instanci přítomen atribut xsi:nil.
de: Wenn das nillable-Attribut im Schema "false" ist, darf das xsi:nil-Attribut in der Instanz nicht vorhanden sein.
es: Si el atributo "nillable" es igual a false en el esquema, el atributo "xsi:nill" no puede estar presente en la instancia.
fr: Si l'attribut 'nillable' a la valeur false dans le schéma, l'attribut 'xsi:nil' ne doit pas être présent dans l'instance.
it: Se nello schema il valore dell'attributo 'nillable' è false, nell'istanza non deve essere presente l'attributo 'xsi:nil'.
ja: 'nillable' 属性がスキーマで false の場合、'xsi:nil' 属性はインスタンスに存在してはなりません。
ko: 스키마에서 'nillable' 특성이 false이면 'xsi:nil' 특성이 인스턴스에 없어야 합니다.
pl: Jeśli atrybut „nillable” ma w schemacie wartość false, atrybut „xsi:nil” musi być nieobecny w wystąpieniu.
pt_br: Se o atributo 'nillable' for false no esquema, o atributo 'xsi:nil' não deverá estar presente na instância.
ru: Если атрибут nillable в схеме имеет значение false (ложь), то атрибут xsi:nil не должен присутствовать в экземпляре.
tr: Şemada 'nillable' özniteliği 'false' ise, örnekte 'xsi:nil' özniteliği olmamalıdır.
zh_hans: 如果在架构中 "nillable" 特性为 false，则实例中不得存在 "xsi:nill" 特性。
zh_hant: 若結構描述中的 'nillable' 屬性為 False，'xsi:nil' 屬性就不可以出現於該執行個體中。

# Sch_LengthAndMinMax
source: It is an error for both length and minLength or maxLength to be present.
cs: Pokud jsou současně uvedeny atributy length a minLength či maxLength, jedná se o chybu.
de: Wenn sowohl "length" als auch "minLength" oder "maxLength" vorhanden sind, tritt ein Fehler auf.
es: Es incorrecto que tanto length como minLength o maxLength estén presentes.
fr: length et minLength ou maxLength ne doivent pas être présents ensemble.
it: Non è possibile usare contemporaneamente length e minLength o maxLength.
ja: length と minLength または maxLength が存在することはできません。
ko: length를 minLength 또는 maxLength와 함께 사용할 수 없습니다.
pl: Jednoczesna obecność elementów length oraz minLength lub maxLength jest błędem.
pt_br: A existência de length e minLength ou maxLength é um erro.
ru: Одновременное указание length и minLength или maxLength является ошибкой.
tr: Hem length, hem de minLength veya maxLength'in bulunması hatadır.
zh_hans: length 与 minLength 或 maxLength 同时存在是错误的。
zh_hant: 同時出現 length 與 minLength 或同時出現 length 與 maxLength，即為錯誤。

# Sch_LengthConstraintFailed
source: The actual length is not equal to the specified length.
cs: Skutečná délka není rovna zadané délce.
de: Die tatsächliche Länge stimmt nicht mit der angegebenen Länge überein.
es: La longitud actual no es igual a la longitud especificada.
fr: La longueur réelle n'est pas égale à la longueur spécifiée.
it: La lunghezza effettiva è diversa da quella specificata.
ja: 実際の値が指定された値と同等ではありません。
ko: 실제 길이가 지정한 길이와 다릅니다.
pl: Rzeczywista długość nie jest równa długości określonej.
pt_br: O comprimento atual não é igual ao comprimento especificado.
ru: Фактическая длина не совпадает с заданной длиной.
tr: Gerçek uzunluk belirtilen uzunluğa eşit değil.
zh_hans: 实际长度不等于指定长度。
zh_hant: 實際長度不等於指定的長度。

# Sch_LengthFacetInvalid
source: The Length constraining facet is invalid - {0}
cs: Omezující vlastnost Length je neplatná – {0}
de: Ungültiges Length-Einschränkungsfacet – {0}
es: Faceta de restricción de Length no válida - {0}
fr: La facette de contrainte Length est non valide : {0}
it: Il facet vincolante Length non è valido - {0}
ja: Length 制約ファセットが無効です。{0}
ko: Length 제약 패싯이 잘못되었습니다. {0}
pl: Element Length ograniczający aspekt jest nieprawidłowy — {0}
pt_br: A faceta de restrições Length é inválida – {0}
ru: Недопустимый ограничивающий аспект Length — {0}
tr: Length kısıtlama modeli geçersiz - {0}
zh_hans: 长度约束方面无效 - {0}
zh_hant: Length 條件約束 Facet 無效 - {0}

# Sch_LengthFacetProhibited
source: The length constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost length je pro {0} zakázána.
de: Das Längeneinschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de Length prohibida para "{0}".
fr: La facette de contrainte Length est interdite pour '{0}'.
it: Il facet vincolante Length non è consentito per '{0}'.
ja: Length 制約ファセットは '{0}' で使用できません。
ko: Length 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element Length ograniczający aspekt jest zabroniony dla elementu „{0}”.
pt_br: A faceta de restrições length é proibida para '{0}'.
ru: Ограничивающий аспект Length запрещен для "{0}".
tr: '{0}' için Length kısıtlama modeli kullanılamaz.
zh_hans: 长度约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 Length 條件約束 Facet。

# Sch_LengthGtBaseLength
source: It is an error if 'length' is among the members of {facets} of {base type definition} and {value} is greater than the {value} of the parent 'length'.
cs: Pokud atribut length patří mezi členy {facets} typu {base type definition} a hodnota {value} je větší než hodnota {value} atributu length nadřazeného elementu, jedná se o chybu.
de: Wenn "length" ein Member von {facets} der {base type definition} und {value} größer als der {value} der übergeordneten "length" ist, tritt ein Fehler auf.
es: Es incorrecto que "length" se encuentre entre los miembros de {facets} de {base type definition} y que {value} sea mayor que {value} de "length" primario.
fr: 'length' ne peut pas faire partie des membres des {facets} de la {base type definition} si la {value} est supérieure à la {value} du 'length' parent.
it: Se 'length' è incluso nei membri di {facets} di {base type definition}, il valore {value} non deve essere maggiore di quello dell'elemento 'length' padre.
ja: 'length' が {base type definition} の {facets} のメンバーの中にあり、{value} が親 'length' の {value} よりも大きい場合は、エラーです。
ko: 'length'가 {base type definition}의 {facets} 멤버 중 하나인 경우 {value}가 부모 'length'의 {value}보다 크면 오류가 발생합니다.
pl: Jeśli element „length” należy do składowych aspektów {facets} dla definicji {base type definition}, a wartość {value} jest większa niż wartość {value} nadrzędnego elementu „length”, występuje błąd.
pt_br: Erro se 'length' estiver entre os membros de {facets} de {base type definition} e se {value} for maior que o {value} do 'length' pai.
ru: Является ошибкой то, что length указан среди членов {facets} для {base type definition}, а {value} больше, чем {value} родительского length.
tr: 'length'in {base type definition} tanımının {facets} taraflarının üyeleri arasında olması ve {value} değerinin üst 'length'in {value} değerinden büyük olması hatadır.
zh_hans: 如果 "length" 是 {base type definition} 的 {facets} 的成员，并且 {value} 大于父级 "length" 的 {value}，则是错误的。
zh_hant: 若 'length' 是在 {base type definition} 內 {facets} 的成員之中，且 {value} 大於父 'length' 的 {value}，即為錯誤。

# Sch_ListFromNonatomic
source: A list data type must be derived from an atomic or union data type.
cs: Datový typ list musí být odvozen od datového typu atomic nebo union.
de: Ein Listendatentyp muss von einem atomarischen oder Union-Datentyp abgeleitet werden.
es: El tipo de datos de la lista debe derivarse de un tipo de datos atómico o de unión.
fr: Un type de données liste doit dériver d'un type de données atomique ou union.
it: Un tipo di dati list deve derivare da un tipo di dati atomic o union.
ja: List データ型は atomic または union データ型から派生しなければなりません。
ko: list 데이터 형식은 atomic 또는 union 데이터 형식에서 파생되어야 합니다.
pl: Typ danych listy musi pochodzić od podstawowego lub złożeniowego typu danych.
pt_br: Um tipo de dados de lista deve derivar de um tipo de dados atômico ou de união.
ru: Тип данных list должен быть производным от типа atomic или union.
tr: Bir liste veri türünün bir atomik veya birleşim veri türünden türetilmesi gerekir.
zh_hans: 列表数据类型必须从原子或联合数据类型派生。
zh_hant: 清單資料類型必須衍生自不可部分完成資料類型或等位資料類型。

# Sch_ManyMaxOccurs
source: When the order is many, the maxOccurs attribute must have a value of '*'.
cs: Je-li order nastaveno na many, musí mít atribut maxOccurs hodnotu *.
de: Wenn die Reihenfolge "many" ist, muss das maxOccurs-Attribut den Wert "*" haben.
es: Cuando el orden es igual a many, el atributo maxOccurs debe tener un valor de "*".
fr: Quand l'ordre est many, l'attribut maxOccurs doit avoir la valeur '*'.
it: Quando order è impostato su many, il valore dell'attributo maxOccurs deve essere '*'.
ja: 順序が 'many' の場合、maxOccurs 属性には '*' の値が含まれていなければなりません。
ko: order가 many인 경우 maxOccurs 특성의 값은 '*'여야 합니다.
pl: Gdy porządek jest określony jako „many”, atrybut maxOccurs musi mieć wartość „*”.
pt_br: Quando a ordem é many, o atributo maxOccurs deve ter valor '*'.
ru: При порядке many атрибут maxOccurs должен иметь значение "*".
tr: Düzen 'many' olduğunda, maxOccurs özniteliğinin değeri '*' olmalıdır.
zh_hans: 当顺序是 many 时，maxOccurs 特性必须具有值“*”。
zh_hant: 當順列為 many 時，maxOccurs 屬性的值必須是 '*'。

# Sch_MaxExclusiveConstraintFailed
source: The MaxExclusive constraint failed.
cs: Omezení MaxExclusive nebylo úspěšné.
de: Fehler bei der MaxExclusive-Einschränkung.
es: Error de restricción de MaxExclusive.
fr: Échec de la contrainte MaxExclusive.
it: Il vincolo MaxExclusive non è riuscito.
ja: MaxExclusive 制約が失敗しました。
ko: MaxExclusive 제약 조건이 실패했습니다.
pl: Błąd ograniczenia MaxExclusive.
pt_br: Falha na restrição MaxExclusive.
ru: Сбой ограничения MaxExclusive.
tr: MaxExclusive kısıtlaması başarısız oldu.
zh_hans: MaxExclusive 约束失败。
zh_hant: MaxExclusive 條件約束失敗。

# Sch_MaxExclusiveFacetInvalid
source: The MaxExclusive constraining facet is invalid - {0}
cs: Omezující vlastnost MaxExclusive je neplatná – {0}
de: Ungültiges MaxExclusive-Einschränkungsfacet – {0}
es: Faceta de restricción de MaxExclusive no válida - {0}
fr: La facette de contrainte MaxExclusive est non valide : {0}
it: Il facet vincolante MaxExclusive non è valido - {0}
ja: MaxExclusive 制約ファセットが無効です。{0}
ko: MaxExclusive 제약 패싯이 잘못되었습니다. {0}
pl: Element MaxExclusive ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MaxExclusive é inválida – {0}
ru: Недопустимый ограничивающий аспект MaxExclusive — {0}
tr: MaxExclusive kısıtlama modeli geçersiz - {0}
zh_hans: MaxExclusive 约束方面无效 - {0}
zh_hant: MaxExclusive 條件約束 Facet 無效 - {0}

# Sch_MaxExclusiveFacetProhibited
source: The MaxExclusive constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MaxExclusive je pro {0} zakázána.
de: Das MaxExclusive-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MaxExclusive prohibida para "{0}".
fr: La facette de contrainte MaxExclusive est interdite pour '{0}'.
it: Il facet vincolante MaxExclusive non è consentito per '{0}'.
ja: MaxExclusive 制約ファセットは '{0}' で使用できません。
ko: MaxExclusive 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MaxExclusive ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições MaxExclusive é proibida para '{0}'.
ru: Ограничивающий аспект MaxExclusive запрещен для "{0}".
tr: '{0}' için MaxExclusive kısıtlama modeli kullanılamaz.
zh_hans: MaxExclusive 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MaxExclusive 條件約束 Facet。

# Sch_MaxExclusiveMismatch
source: It is an error if the derived 'maxExclusive' facet value is greater than the parent 'maxExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti maxExclusive větší než hodnota nadřazené omezující vlastnosti maxExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "maxExclusive" größer ist als der übergeordnete Wert des Facets "maxExclusive", tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "maxExclusive" derivado sea mayor que el valor de faceta "maxExclusive" primario.
fr: La valeur de la facette du 'maxExclusive' dérivé ne doit pas être supérieure à la valeur de la facette du 'maxExclusive' parent.
it: Il valore del facet derivato 'maxExclusive' non può essere maggiore del valore del facet 'maxExclusive' padre.
ja: 派生型の 'maxExclusive' ファセットの値が、親の 'maxExclusive' ファセットの値よりも大きい場合は、エラーです。
ko: 파생된 'maxExclusive' 패싯 값이 부모 'maxExclusive' 패싯 값보다 크면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „maxExclusive” jest większa niż nadrzędna wartość aspektu „maxExclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'maxExclusive' derivada for maior que o valor da faceta 'maxExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта maxExclusive больше значения родительского аспекта maxExclusive.
tr: Türetilen 'maxExclusive' modeli değerinin üst 'maxExclusive modeli değerinden büyük olması hatadır.
zh_hans: 如果派生的 "maxExclusive" 方面值大于父级 "maxExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'maxExclusive' Facet 值大於父 'maxExclusive' Facet 的值，即為錯誤。

# Sch_MaxExlIncMismatch
source: It is an error if the derived 'maxExclusive' facet value is greater than or equal to the parent 'maxInclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti maxExclusive větší nebo rovna hodnotě nadřazené omezující vlastnosti maxInclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "maxExclusive" größer oder gleich dem übergeordneten Wert des Facets "maxInclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "maxExclusive" derivado sea mayor o igual que el valor de faceta "maxInclusive" primario.
fr: La valeur de la facette du 'maxExclusive' dérivé ne doit pas être supérieure ou égale à la valeur de la facette du 'maxInclusive' parent.
it: Il valore del facet derivato 'maxExclusive' non può essere maggiore o uguale al valore del facet 'maxInclusive' padre.
ja: 派生型の 'maxExclusive' ファセットの値が、親の 'maxInclusive' ファセットの値以上の場合は、エラーです。
ko: 파생된 'maxExclusive' 패싯 값이 부모 'maxInclusive' 패싯 값보다 크거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „maxExclusive” jest większa lub równa nadrzędnej wartości aspektu „maxInclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'maxExclusive' derivada for maior ou igual ao valor da faceta 'maxInclusive' pai.
ru: Является ошибкой то, что значение производного аспекта maxExclusive больше или равно значению родительского аспекта maxInclusive.
tr: Türetilen 'maxExclusive' modeli değerinin üst 'maxInclusive' modeli değerinden büyük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "maxExclusive" 方面值大于或等于父级 "maxInclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'maxExclusive' Facet 值大於或等於父 'maxInclusive' Facet 的值，即為錯誤。

# Sch_MaxIncExlMismatch
source: It is an error if the derived 'maxInclusive' facet value is greater than or equal to the parent 'maxExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti maxInclusive větší nebo rovna hodnotě nadřazené omezující vlastnosti maxExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "maxInclusive" größer oder gleich dem übergeordneten Wert des Facets "maxExclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "maxInclusive" derivado sea mayor o igual que el valor de faceta "maxExclusive" primario.
fr: La valeur de la facette du 'maxInclusive' dérivé ne doit pas être supérieure ou égale à la valeur de la facette du 'maxExclusive' parent.
it: Il valore del facet derivato 'maxInclusive' non può essere maggiore o uguale al valore del facet 'maxExclusive' padre.
ja: 派生型の 'maxInclusive' ファセットの値が、親の 'maxExclusive' ファセットの値以上の場合は、エラーです。
ko: 파생된 'maxInclusive' 패싯 값이 부모 'maxExclusive' 패싯 값보다 크거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „maxInclusive” jest większa lub równa nadrzędnej wartości aspektu „maxExclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'maxInclusive' derivada for maior ou igual ao valor da faceta 'maxExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта maxInclusive больше или равно значению родительского аспекта maxExclusive.
tr: Türetilen 'maxInclusive' modeli değerinin üst 'maxExclusive' modeli değerinden büyük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "maxInclusive" 方面值大于或等于父级 "maxExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'maxInclusive' Facet 值大於或等於父 'maxExclusive' Facet 的值，即為錯誤。

# Sch_MaxInclusiveConstraintFailed
source: The MaxInclusive constraint failed.
cs: Omezení MaxInclusive nebylo úspěšné.
de: Fehler bei der MaxInclusive-Einschränkung.
es: Error de restricción de MaxInclusive.
fr: Échec de la contrainte MaxInclusive.
it: Il vincolo MaxInclusive non è riuscito.
ja: MaxInclusive 制約が失敗しました。
ko: MaxInclusive 제약 조건이 실패했습니다.
pl: Błąd ograniczenia MaxInclusive.
pt_br: Falha na restrição MaxInclusive.
ru: Сбой ограничения MaxInclusive.
tr: MaxInclusive kısıtlaması başarısız oldu.
zh_hans: MaxInclusive 约束失败。
zh_hant: MaxInclusive 條件約束失敗。

# Sch_MaxInclusiveExclusive
source: 'maxInclusive' and 'maxExclusive' cannot both be specified for the same data type.
cs: Omezení maxInclusive a maxExclusive nelze zadat současně pro stejný datový typ.
de: "maxInclusive" und "maxExclusive" dürfen nicht für den gleichen Datentyp angegeben werden.
es: No se pueden especificar "maxInclusive" y "maxExclusive" para el mismo tipo de datos.
fr: 'maxInclusive' et 'maxExclusive' ne peuvent pas être spécifiés pour le même type de données.
it: Non è possibile specificare sia 'maxInclusive' che 'maxExclusive' per lo stesso tipo di dati.
ja: 'maxInclusive' と 'maxExclusive' の両方を同じデータ型に指定することはできません。
ko: 동일한 데이터 형식에 대해 'maxInclusive'와 'maxExclusive'를 둘 다 지정할 수 없습니다.
pl: Elementy „maxInclusive” oraz „maxExclusive” nie mogą być jednocześnie określone dla tego samego typu danych.
pt_br: 'maxInclusive' e 'maxExclusive' não podem ser especificados simultaneamente para o mesmo tipo de dados.
ru: Для одного типа данных невозможно одновременно задать maxInclusive и maxExclusive.
tr: Aynı veri türü için hem 'maxInclusive' hem de 'maxExclusive' belirtilemez.
zh_hans: 不能为同一数据类型同时指定 "maxInclusive" 和 "maxExclusive"。
zh_hant: 不可為相同的資料類型同時指定 'maxInclusive' 與 'maxExclusive'。

# Sch_MaxInclusiveFacetInvalid
source: The MaxInclusive constraining facet is invalid - {0}
cs: Omezující vlastnost MaxInclusive je neplatná – {0}
de: Ungültiges MaxInclusive-Einschränkungsfacet – {0}
es: Faceta de restricción de MaxInclusive no válida - {0}
fr: La facette de contrainte MaxInclusive est non valide : {0}
it: Il facet vincolante MaxInclusive non è valido - {0}
ja: MaxInclusive 制約ファセットが無効です。{0}
ko: MaxInclusive 제약 패싯이 잘못되었습니다. {0}
pl: Element MaxInclusive ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MaxInclusive é inválida – {0}
ru: Недопустимый ограничивающий аспект MaxInclusive — {0}
tr: MaxInclusive kısıtlama modeli geçersiz - {0}
zh_hans: MaxInclusive 约束方面无效 - {0}
zh_hant: MaxInclusive 條件約束 Facet 無效 - {0}

# Sch_MaxInclusiveFacetProhibited
source: The MaxInclusive constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MaxInclusive je pro {0} zakázána.
de: Das MaxInclusive-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MaxInclusive prohibida para "{0}".
fr: La facette de contrainte MaxInclusive est interdite pour '{0}'.
it: Il facet vincolante MaxInclusive non è consentito per '{0}'.
ja: MaxInclusive 制約ファセットは '{0}' で使用できません。
ko: MaxInclusive 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MaxInclusive ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições MaxInclusive é proibida para '{0}'.
ru: Ограничивающий аспект MaxInclusive запрещен для "{0}".
tr: '{0}' için MaxInclusive kısıtlama modeli kullanılamaz.
zh_hans: MaxInclusive 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MaxInclusive 條件約束 Facet。

# Sch_MaxInclusiveMismatch
source: It is an error if the derived 'maxInclusive' facet value is greater than the parent 'maxInclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti maxInclusive větší než hodnota nadřazené omezující vlastnosti maxInclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "maxInclusive" größer ist als der übergeordnete Wert des Facets "maxInclusive", tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "maxInclusive" derivado sea mayor que el valor de faceta "maxInclusive" primario.
fr: La valeur de la facette du 'maxInclusive' dérivé ne doit pas être supérieure à la valeur de la facette du 'maxInclusive' parent.
it: Il valore del facet derivato 'maxInclusive' non può essere maggiore del valore del facet 'maxInclusive' padre.
ja: 派生型の 'maxInclusive' ファセットの値が、親の 'maxInclusive' ファセットの値よりも大きい場合は、エラーです。
ko: 파생된 'maxInclusive' 패싯 값이 부모 'maxInclusive' 패싯 값보다 크면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „maxInclusive” jest większa niż nadrzędna wartość aspektu „maxInclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'maxInclusive' derivada for maior que o valor da faceta 'maxInclusive' pai.
ru: Является ошибкой то, что значение производного аспекта maxInclusive больше значения родительского аспекта maxInclusive.
tr: Türetilen 'maxInclusive' modeli değerinin üst 'maxInclusive' modeli değerinden büyük olması hatadır.
zh_hans: 如果派生的 "maxInclusive" 方面值大于父级 "maxInclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'maxInclusive' Facet 值大於父 'maxInclusive' Facet 的值，即為錯誤。
