Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_InvalidAnyAttribute
source: Invalid namespace in 'anyAttribute'.
cs: Neplatný obor názvů v atributu anyAttribute
de: Ungültiger Namespace in "anyAttribute".
es: Espacio de nombre no válido en "anyAttribute".
fr: Espace de noms non valide dans 'anyAttribute'.
it: Spazio dei nomi non valido in 'anyAttribute'.
ja: 'anyAttribute' に無効な名前空間があります。
ko: 'anyAttribute'에서 네임스페이스가 잘못되었습니다.
pl: Nieprawidłowa przestrzeń nazw w elemencie „anyAttribute”.
pt_br: Namespace inválido em 'anyAttribute'.
ru: Недопустимое пространство имен в anyAttribute.
tr: 'anyAttribute' içinde geçersiz ad alanı.
zh_hans: "anyAttribute" 中的命名空间无效。
zh_hant: 'anyAttribute' 中的命名空間無效。

# Sch_InvalidAnyAttributeRestriction
source: The base any attribute must be a superset of the derived 'anyAttribute'.
cs: Základní atribut any musí být nadmnožinou odvozeného atributu anyAttribute.
de: Das Basisattribut "any" muss eine Obermenge des abgeleiteten "anyAttribute" sein.
es: La base de cualquier atributo debe ser un supraconjunto del valor "anyAttribute" derivado.
fr: Le 'anyAttribute' de base doit être un sur-ensemble du 'anyAttribute' dérivé.
it: L'attributo any di base deve essere un superset dell'elemento 'anyAttribute' derivato.
ja: 基本型の any 属性は、派生した 'anyAttribute' のスーパーセットでなければなりません。
ko: 기본 any 특성은 파생된 'anyAttribute'의 상위 집합이어야 합니다.
pl: Podstawowy atrybut typu any musi być nadzbiorem pochodnego atrybutu „anyAttribute”.
pt_br: O atributo base any deve ser um superconjunto do 'anyAttribute' derivado.
ru: Базовый атрибут any должен являться супермножеством производного anyAttribute.
tr: Temel 'any' özniteliği, türetilen 'anyAttribute' özniteliğinin üst kümesi olmalıdır.
zh_hans: 基 any 特性必须是派生 "anyAttribute" 的超集。
zh_hant: 基底 any 屬性必須是衍生的 'anyAttribute' 之聯集。

# Sch_InvalidAnyDetailed
source: The value of the namespace attribute of the element or attribute wildcard is invalid - {0}
cs: Hodnota atributu oboru názvů zástupného znaku elementu nebo atributu je neplatná – {0}
de: Der Wert des namespace-Attributs für das Element oder den Attributplatzhalter ist ungültig – {0}.
es: El valor del atributo de espacio de nombres del comodín de atributo o elemento no es válido - {0}
fr: La valeur de l'attribut d'espace de noms de l'élément ou un caractère générique de l'attribut est non valide - {0}
it: Il valore dell'attributo dello spazio dei nomi dell'elemento o del carattere jolly dell'attributo non è valido - {0}
ja: 要素の名前空間属性の値、または属性のワイルドカードが無効です。{0}
ko: 요소 또는 특성 와일드카드의 네임스페이스 특성 값이 잘못되었습니다. {0}
pl: Wartość atrybutu przestrzeni nazw dla symbolu wieloznacznego elementu lub atrybutu jest nieprawidłowa — {0}.
pt_br: O valor do atributo namespace do curinga do atributo ou do elemento é inválido – {0}
ru: Значение атрибута пространства имен для элемента или подстановочный знак атрибута недействительны — {0}
tr: Öğenin ad alanı özniteliği değeri veya öznitelik joker parçacığı geçersiz - {0}
zh_hans: 元素或特性通配符的命名空间特性值无效 - {0}
zh_hant: 元素或屬性萬用字元的命名空間屬性值無效 - {0}

# Sch_InvalidAttribute
source: Invalid '{0}' attribute: '{1}'.
cs: Neplatný atribut {0}: {1}
de: Ungültiges {0}-Attribut: "{1}".
es: Atributo "{0}" no válido: "{1}".
fr: Attribut '{0}' non valide : '{1}'.
it: L'attributo '{0}' non è valido: {1}.
ja: 属性 '{0}' が無効です。'{1}'。
ko: '{0}' 특성이 잘못되었습니다. '{1}'
pl: Atrybut „{0}” jest nieprawidłowy: „{1}”.
pt_br: Atributo '{0}' inválido. '{1}'.
ru: Недопустимый атрибут "{0}": "{1}".
tr: Geçersiz '{0}' özniteliği: '{1}'.
zh_hans: 无效的“{0}”特性:“{1}”。
zh_hant: '{0}' 屬性無效: '{1}'。

# Sch_InvalidAttributeExtension
source: Invalid attribute extension.
cs: Neplatná přípona atributu
de: Ungültige Attributerweiterung.
es: Extensión de atributo no válida.
fr: Extension d'attribut non valide.
it: L'estensione dell'attributo non è valida.
ja: 属性の拡張が無効です。
ko: 특성 extension이 잘못되었습니다.
pl: Nieprawidłowe rozszerzenie atrybutu.
pt_br: Extensão de atributo inválida.
ru: Недопустимое расширение атрибута.
tr: Öznitelik uzantısı geçersiz.
zh_hans: 无效的特性扩展。
zh_hant: 屬性擴充無效。

# Sch_InvalidAttributeRef
source: If ref is present, all of 'simpleType', 'form', 'type', and 'use' must be absent.
cs: Je-li uveden parametr ref, musí chybět všechny atributy simpleType, form, type a use.
de: Wenn "ref" vorhanden ist, dürfen "simpleType", "form", "type" und "use" nicht vorhanden sein.
es: Si ref está presente, "simpleType", "form", "type" y "use" deben estar ausentes.
fr: Si ref est présent, 'simpleType', 'form', 'type' et 'use' doivent tous être absents.
it: Se è presente ref, non devono essere presenti tutti gli elementi 'simpleType', 'form', 'type' e 'use'.
ja: ref が存在する場合、'simpleType'、'form'、'type'、および 'use' はいずれも存在できません。
ko: ref가 있는 경우 'simpleType', 'form', 'type', 'use'는 모두 없어야 합니다.
pl: Jeśli obecne jest odwołanie (ref), wszystkie elementy „simpleType”, „form”, „type” oraz „use” muszą być nieobecne.
pt_br: Se ref estiver presente, 'simpleType', 'form', 'type' e 'use' deverão estar ausentes.
ru: Если присутствует ref, то следует исключить все simpleType, form, type и use.
tr: ref varsa simpleType, form, type ve use'dan hiçbiri olmamalıdır.
zh_hans: 如果存在 ref，则 "simpleType"、"form"、"type" 和 "use" 必须都不存在。
zh_hant: 若有 ref，就不可有 'simpleType'、'form'、'type' 與 'use'。

# Sch_InvalidBaseToEmpty
source: If the derived content type is Empty, then the base content type should also be Empty or Mixed with Emptiable particle according to rule 5.3 of Schema Component Constraint: Derivation Valid (Restriction, Complex).
cs: Pokud je odvozený typ obsahu Empty, měl by být základní typ obsahu také Empty nebo Mixed s částicí Emptiable v souladu s pravidlem 5.3 omezení součástí schématu: Derivation Valid (Restriction, Complex)
de: Wenn der abgeleitete Inhaltstyp "Empty" lautet, muss der Basisinhaltstyp gemäß Regel 5.3 von "Schema Component Constraint: Derivation Valid (Restriction, Complex)" ebenfalls "Empty" oder "Mixed" mit dem Partikel "Emptiable" lauten.
es: Si el tipo de contenido derivado está vacío, el tipo de contenido base también debe estar vacío o mezclado con partículas que se pueden vaciar según la regla 5.3 de la Restricción de componentes del esquema: Derivación válida (Restricción, compleja).
fr: Si le type de contenu dérivé est Empty, le type de contenu de base doit également être Empty ou Mixed avec la particule pouvant être vidée conformément à la règle 5.3 de contrainte de composant de schéma : dérivation valide (restriction, complexe).
it: Se il tipo di contenuto derivato è Empty, anche il tipo di contenuto di base deve essere Empty o Mixed con particella Emptiable in base alla regola 5.3 di Schema Component Constraint: Derivation Valid (Restriction, Complex).
ja: 派生型のコンテンツ型が Empty である場合、基本型のコンテンツ型も Empty である必要があります。または、「Schema Component Constraint: Derivation Valid (Restriction, Complex)」の項目 5.3 に従って、Empty にすることが可能なパーティクルと共に Mixed とする必要があります。
ko: 파생된 콘텐츠 형식이 Empty이면 Schema Component Constraint: Derivation Valid (Restriction, Complex)의 규칙 5.3에 따라 기본 콘텐츠 형식도 Empty이거나 Empty할 수 있는 파티클과 Mixed여야 합니다.
pl: Jeśli pochodny typ zawartości to Empty (Pusta), podstawowym typem zawartości powinien również być typ Empty (Pusta) lub Mixed (Mieszana) z cząstką typu Emptiable (Możliwa do wyczyszczenia) przy uwzględnieniu reguły 5.3 o nazwie „Schema Component Constraint: Derivation Valid (Restriction, Complex)”.
pt_br: Se o tipo de conteúdo derivado for Vazio, o tipo de conteúdo base também deverá ser Vazio ou Misto com partícula Esvaziável de acordo com a regra 5.3 da Restrição de Componente de Esquema: Derivação Válida (Restrição, Complexa).
ru: Если производный тип содержимого — Empty, то базовый тип содержимого тоже должен быть Empty или Mixed с частью Emptiable в соответствии с правилом 5.3 из Schema Component Constraint: Derivation Valid (Restriction, Complex).
tr: Türetilen içerik türü Empty ise, Şema Bileşeni Kısıtlaması: Geçerli Türetme (Kısıtlama, Karmaşık) 5.3 kuralına göre, temel içerik türü de Emptiable parçacığıyla Empty veya Mixed olmalıdır.
zh_hans: 根据 Schema Component Constraint: Derivation Valid (Restriction, Complex)的规则 5.3，如果派生内容类型为空，则基内容类型也应为空或混有可以为空的粒子。
zh_hant: 根據結構描述元件條件約束的規則 5.3，若衍生內容類型為空，則基底內容類型也應為空，或應與可成為空的物件結合:Derivation Valid (Restriction, Complex)。

# Sch_InvalidBaseToMixed
source: If the derived content type is Mixed, then the base content type should also be Mixed according to rule 5.4 of Schema Component Constraint: Derivation Valid (Restriction, Complex).
cs: Pokud je odvozený typ obsahu Mixed, měl by být základní typ obsahu také Mixed v souladu s pravidlem 5.4 omezení součástí schématu: Derivation Valid (Restriction, Complex)
de: Wenn der abgeleitete Inhaltstyp "Mixed" lautet, muss der Basisinhaltstyp gemäß Regel 5.4 von "Schema Component Constraint: Derivation Valid (Restriction, Complex)" ebenfalls "Mixed" lauten.
es: Si el tipo de contenido derivado es mixto, el tipo de contenido base también debe ser mixta según la regla 5.4 de la Restricción de componentes del esquema: Derivación válida (Restricción, compleja).
fr: Si le type de contenu dérivé est Mixed, le type de contenu de base doit également être Mixed conformément à la règle 5.4 de contrainte de composant de schéma : dérivation valide (restriction, complexe).
it: Se il tipo di contenuto derivato è Mixed, anche il tipo di contenuto di base deve essere Mixed in base alla regola 5.4 di Schema Component Constraint: Derivation Valid (Restriction, Complex).
ja: 派生型のコンテンツ型が Mixed である場合、「Schema Component Constraint: Derivation Valid (Restriction, Complex)」の項目 5.4 に従って、基本型のコンテンツ型も Mixed とする必要があります。
ko: 파생된 콘텐츠 형식이 Mixed이면 Schema Component Constraint: Derivation Valid (Restriction, Complex)의 규칙 5.4에 따라 기본 콘텐츠 형식도 Mixed여야 합니다.
pl: Jeśli pochodny typ zawartości to Mixed (Mieszana), podstawowym typem zawartości powinien również być typ Mixed (Mieszana) przy uwzględnieniu reguły 5.4 o nazwie „Schema Component Constraint: Derivation Valid (Restriction, Complex)”.
pt_br: Se o tipo de conteúdo derivado for Misto, o tipo de conteúdo base também deverá ser Misto de acordo com a regra 5.4 da Restrição de Componente de Esquema: Derivação Válida (Restrição, Complexa).
ru: Если производный тип содержимого — Mixed, то базовый тип содержимого также должен быть Mixed в соответствии с правилом 5.4 из Schema Component Constraint: Derivation Valid (Restriction, Complex).
tr: Türetilen içerik türü Mixed ise, Şema Bileşeni Kısıtlaması: Geçerli Türetme (Kısıtlama, Karmaşık) 5.4 kuralına göre, temel içerik türü de Mixed olmalıdır.
zh_hans: 根据 Schema Component Constraint: Derivation Valid (Restriction, Complex)的规则 5.4，如果派生内容类型为 Mixed，则基内容类型也应为 Mixed。
zh_hant: 根據結構描述元件條件約束規則 5.4，若衍生內容類型為結合的，則基底內容類型也應為結合的:Derivation Valid (Restriction, Complex)。

# Sch_InvalidBlockDefaultValue
source: The values 'list' and 'union' are invalid for the blockDefault attribute.
cs: Hodnoty list a union jsou pro atribut blockDefault neplatné.
de: Die Werte "list" und "union" sind für das blockDefault-Attribut ungültig.
es: Los valores "list" y "union" no son válidos para el atributo blockDefault.
fr: Les valeurs 'list' et 'union' sont non valides pour l'attribut blockDefault.
it: I valori 'list' e 'union' non sono validi per l'attributo blockDefault.
ja: blockDefault 属性に対し、値 'list' および 'union' は無効です。
ko: 'list' 및 'union' 값은 blockDefault 특성에 사용할 수 없습니다.
pl: Wartości „list” i „union” są nieprawidłowe dla atrybutu blockDefault.
pt_br: Os valores 'list' e 'union' são inválidos para o atributo blockDefault.
ru: Значения list и union для атрибута blockDefault недопустимы.
tr: 'list' ve 'union' değerleri blockDefault özniteliği için geçersiz.
zh_hans: 值 "list" 和 "union" 对于 blockDefault 特性无效。
zh_hant: 若是 blockDefault 屬性，'list' 與 'union' 均為無效值。

# Sch_InvalidCollection
source: The schema items collection cannot contain an object of type 'XmlSchemaInclude', 'XmlSchemaImport', or 'XmlSchemaRedefine'.
cs: Kolekce položek schématu nemůže obsahovat objekt typu XmlSchemaInclude, XmlSchemaImport nebo XmlSchemaRedefine.
de: Die Schemaelementsammlung kann kein Objekt vom Typ "XmlSchemaInclude", "XmlSchemaImport" oder "XmlSchemaRedefine" enthalten.
es: La colección de elementos de esquema no puede contener un objeto de tipo "XmlSchemaInclude", "XmlSchemaImport" o "XmlSchemaRedefine".
fr: La collection d'éléments de schéma ne peut pas contenir un objet de type 'XmlSchemaInclude', 'XmlSchemaImport' ou 'XmlSchemaRedefine'.
it: La raccolta di elementi dello schema non può contenere un oggetto di tipo 'XmlSchemaInclude', 'XmlSchemaImport' o 'XmlSchemaRedefine'.
ja: スキーマ項目コレクションは次の型のオブジェクトを含むことはできません。'XmlSchemaInclude'、'XmlSchemaImport' または 'XmlSchemaRedefine'。
ko: 스키마 항목 컬렉션에는 'XmlSchemaInclude', 'XmlSchemaImport' 또는 'XmlSchemaRedefine' 형식의 개체를 포함할 수 없습니다.
pl: Kolekcja elementów schematu nie może zawierać obiektu typu „XmlSchemaInclude”, „XmlSchemaImport” ani „XmlSchemaRedefine”.
pt_br: A coleção de itens do esquema não pode conter um objeto do tipo 'XmlSchemaInclude', 'XmlSchemaImport' ou 'XmlSchemaRedefine'.
ru: Коллекция элементов схемы не может содержать объекты типа XmlSchemaInclude, XmlSchemaImport и XmlSchemaRedefine.
tr: Şema öğeleri koleksiyonu 'XmlSchemaInclude', 'XmlSchemaImport' veya 'XmlSchemaRedefine' türü bir nesne içeremez.
zh_hans: 架构项集合不能包含类型为 "XmlSchemaInclude"、"XmlSchemaImport" 或 "XmlSchemaRedefine" 的对象。
zh_hant: 結構描述項目集合物件不可含有 'XmlSchemaInclude'、'XmlSchemaImport' 或 'XmlSchemaRedefine' 類型的物件。

# Sch_InvalidComplexTypeBlockValue
source: The values 'substitution', 'list', and 'union' are invalid for the block attribute on complexType.
cs: Hodnoty substitution, list a union jsou pro atribut block typu complexType neplatné.
de: Die Werte "substitution", "list" und "union" sind für das block-Attribut für complexType ungültig.
es: Los valores "substitution", "list" y "union" no son válidos para el atributo block de complexType.
fr: Les valeurs 'substitution', 'list' et 'union' sont non valides pour l'attribut block de complexType.
it: I valori 'substitution', 'list' e 'union' non sono validi per l'attributo block in complexType.
ja: complexType のブロック属性に対し、値 'substitution'、'list'、および 'union' は無効です。
ko: 'substitution', 'list' 및 'union' 값은 complexType의 block 특성에 사용할 수 없습니다.
pl: Wartości „substitution”, „list” lub „union” są nieprawidłowe dla atrybutu blokowego typu complexType.
pt_br: Os valores 'substitution', 'list' e 'union' são inválidos para o atributo block em complexType.
ru: Значения substitution, list и union для атрибута block элемента complexType недопустимы.
tr: 'substitution', 'list' ve 'union' değerleri complexType üzerindeki block özniteliği için geçersizdir.
zh_hans: 值 "substitution"、"list" 和 "union" 对于 complexType 上的 block 特性无效。
zh_hant: 若是 complexType 上的 block 屬性，'substitution'、'list' 和 'union' 均為無效值。

# Sch_InvalidComplexTypeFinalValue
source: The values 'substitution', 'list', and 'union' are invalid for the final attribute on complexType.
cs: Hodnoty substitution, list a union jsou pro atribut final typu complexType neplatné.
de: Die Werte "substitution", "list" und "union" sind für das final-Attribut für complexType ungültig.
es: Los valores "substitution", "list" y "union" no son válidos para el atributo final de complexType.
fr: Les valeurs 'substitution', 'list' et 'union' sont non valides pour l'attribut final de complexType.
it: I valori 'substitution', 'list' e 'union' non sono validi per l'attributo final in complexType.
ja: complexTypet の最後の属性に対し、値 'substitution'、'list'、および 'union' は無効です。
ko: 'substitution', 'list' 및 'union' 값은 complexType의 final 특성에 사용할 수 없습니다.
pl: Wartości „substitution”, „list” lub „union” są nieprawidłowe dla atrybutu końcowego typu complexType.
pt_br: Os valores 'substitution', 'list' e 'union' são inválidos para o atributo final em complexType.
ru: Значения substitution, list и union для атрибута final элемента complexType недопустимы.
tr: 'substitution', 'list' ve 'union' değerleri complexType üzerindeki final özniteliği için geçersiz.
zh_hans: 值 "substitution"、"list" 和 "union" 对于 complexType 上的 final 特性无效。
zh_hant: 若是 complexType 上的 final 屬性，'substitution'、'list' 和 'union' 均為無效值。

# Sch_InvalidContent
source: The element '{0}' has invalid content.
cs: Element {0} má neplatný obsah.
de: Der Inhalt des Elements "{0}" ist ungültig.
es: El elemento "{0}" tiene un contenido no válido.
fr: L'élément '{0}' a un contenu non valide.
it: Il contenuto dell'elemento '{0}' non è valido.
ja: 無効なコンテンツが要素 '{0}' に含まれています。
ko: '{0}' 요소의 콘텐츠가 잘못되었습니다.
pl: Element „{0}” ma nieprawidłową zawartość.
pt_br: O elemento '{0}' apresenta conteúdo inválido.
ru: Недопустимое содержимое элемента "{0}".
tr: '{0}' öğesinin içeriği geçersiz.
zh_hans: 元素“{0}”的内容无效。
zh_hant: 元素 '{0}' 的內容無效。

# Sch_InvalidContentRestriction
source: Invalid content type derivation by restriction.
cs: Neplatné odvození typu obsahu podle omezení
de: Ungültige Inhaltstypableitung durch Einschränkung.
es: Derivación de tipo de contenido por restricción no válida.
fr: Dérivation par restriction du type de contenu non valide.
it: La derivazione del tipo di contenuto per restrizione non è valida.
ja: 制限による無効なコンテンツ型の派生です。
ko: restriction에 의한 콘텐츠 형식 파생이 잘못되었습니다.
pl: Nieprawidłowe wyprowadzenie typu zawartości według ograniczenia.
pt_br: A derivação de tipo de conteúdo por restrição é inválida.
ru: Недопустимое получение производного типа содержимого путем ограничения.
tr: Kısıtlamaya göre içerik türü türetme geçersiz.
zh_hans: 通过限制进行的内容类型派生无效。
zh_hant: 由限制所產生的內容類型衍生項無效。

# Sch_InvalidContentRestrictionDetailed
source: Invalid content type derivation by restriction. {0}
cs: Neplatné odvození typu obsahu podle omezení. {0}
de: Ungültige Inhaltstypableitung durch Einschränkung. {0}
es: Derivación de tipo de contenido por restricción no válida. {0}
fr: Dérivation par restriction du type de contenu non valide. {0}
it: La derivazione del tipo di contenuto per restrizione non è valida. {0}
ja: 制約による無効なコンテンツ型の派生です。{0}
ko: restriction에 의한 콘텐츠 형식 파생이 잘못되었습니다. {0}
pl: Nieprawidłowe wyprowadzenie typu zawartości według ograniczenia. {0}
pt_br: A derivação de tipo de conteúdo por restrição é inválida. {0}
ru: Недопустимое получение производного типа содержимого путем ограничения. {0}
tr: Kısıtlamaya göre içerik türü türetme geçersiz. {0}
zh_hans: 通过限制进行的内容类型派生无效。{0}
zh_hant: 由限制所產生的內容類型衍生項無效。{0}

# Sch_InvalidDateTimeOption
source: The '{0}' value for the 'dateTimeOption' parameter is not an allowed value for the 'XmlDateTimeSerializationMode' enumeration.
cs: Hodnota {0} pro parametr dateTimeOption není povolená hodnota pro výčet XmlDateTimeSerializationMode.
de: Der Wert "{0}" für den Parameter "dateTimeOption" ist für die Enumeration "XmlDateTimeSerializationMode" nicht zulässig.
es: El valor "{0}" del parámetro "dateTimeOption" no es un valor permitido para la enumeración de "XmlDateTimeSerializationMode".
fr: La valeur '{0}' du paramètre 'dateTimeOption' n'est pas une valeur autorisée pour l'énumération 'XmlDateTimeSerializationMode'.
it: Il valore '{0}' per il parametro 'dateTimeOption' non è un valore consentito per l'enumerazione 'XmlDateTimeSerializationMode'.
ja: 'XmlDateTimeSerializationMode' 列挙体では、'dateTimeOption' パラメーターに値 '{0}' を使用することはできません。
ko: 'dateTimeOption' 매개 변수의 '{0}' 값이 'XmlDateTimeSerializationMode' 열거형에 허용되는 값이 아닙니다.
pl: Wartość „{0}” parametru „dateTimeOption” nie jest dozwolona dla wyliczenia „XmlDateTimeSerializationMode”.
pt_br: O valor '{0}' do parâmetro 'dateTimeOption' não é um valor permitido para a enumeração 'XmlDateTimeSerializationMode'.
ru: Значение "{0}" недопустимо для параметра dateTimeOption в перечислении XmlDateTimeSerializationMode.
tr: 'dateTimeOption' parametresine yönelik '{0}' değeri, 'XmlDateTimeSerializationMode' sabit listesinde izin verilen bir değer değil.
zh_hans: "dateTimeOption" 参数的“{0}”值不是 "XmlDateTimeSerializationMode" 枚举允许的值。
zh_hant: 'XmlDateTimeSerializationMode' 列舉不允許 'dateTimeOption' 參數的 '{0}' 值。

# Sch_InvalidElementBlockValue
source: The values 'list' and 'union' are invalid for the block attribute on element.
cs: Hodnoty list a union jsou pro atribut block elementu neplatné.
de: Die Werte "list" und "union" sind für das block-Attribut im Element ungültig.
es: Los valores "list" y "union" no son válidos para el atributo block del elemento.
fr: Les valeurs 'list' et 'union' sont non valides pour l'attribut block de l'élément.
it: I valori 'list' e 'union' non sono validi per l'attributo block nell'elemento.
ja: 要素のブロック属性に対し、値 'list' および 'union' は無効です。
ko: 'list' 및 'union' 값은 요소의 block 특성에 사용할 수 없습니다.
pl: Wartości „list” lub „union” są nieprawidłowe dla atrybutu blokowego elementu.
pt_br: Os valores 'list' e 'union' são inválidos para o atributo block do elemento.
ru: Значения list и union для атрибута block элемента недопустимы.
tr: 'list' ve 'union' değerleri öğe üzerindeki block özniteliği için geçersiz.
zh_hans: 值 "list" 和 "union" 对于元素上的 block 特性无效。
zh_hant: 若是元素上的 block 屬性，'list' 與 'union' 均為無效值。

# Sch_InvalidElementContent
source: The element {0} has invalid child element {1}.
cs: Element {0} obsahuje neplatný podřízený element {1}.
de: Das Element {0} enthält ein ungültiges untergeordnetes Element {1}.
es: El elemento {0} tiene un elemento secundario {1} no válido.
fr: L'élément {0} a un élément enfant non valide {1}.
it: L'elemento {0} contiene un elemento figlio non valido {1}.
ja: 要素 {0} に無効な子要素 {1} があります。
ko: 요소 {0}에 잘못된 자식 요소 {1}이(가) 있습니다.
pl: Element {0} ma nieprawidłowy element podrzędny {1}.
pt_br: O elemento {0} apresenta elemento filho {1} inválido.
ru: Элемент {0} имеет недопустимый дочерний элемент {1}.
tr: {0} öğesi geçersiz '{1}' alt öğesine sahip.
zh_hans: 元素 {0} 的子元素 {1} 无效。
zh_hant: 元素 {0} 含有無效的子項目 {1}。

# Sch_InvalidElementContentComplex
source: The element {0} has invalid child element {1} - {2}
cs: Element {0} má neplatný podřízený element {1} – {2}
de: Das Element {0} enthält ein ungültiges untergeordnetes Element {1} – {2}.
es: El elemento {0} tiene un elemento secundario no válido {1} - {2}
fr: L'élément {0} a un élément enfant non valide {1} - {2}
it: L'elemento {0} contiene un elemento figlio non valido {1} - {2}
ja: 要素 {0} に無効な子要素 {1} があります。{2}
ko: {0} 요소에 잘못된 자식 요소 {1}이(가) 있습니다. {2}
pl: Element {0} ma nieprawidłowy element podrzędny {1} — {2}.
pt_br: O elemento {0} apresenta elemento filho {1} – {2} inválido
ru: Элемент {0} имеет недопустимый дочерний элемент {1} — {2}
tr: {0} öğesi {1} geçersiz alt öğesine sahip - {2}
zh_hans: 元素 {0} 的子元素 {1} 无效 - {2}
zh_hant: 元素 {0} 含有無效的子項目 {1} - {2}

# Sch_InvalidElementContentExpecting
source: The element {0} has invalid child element {1}. List of possible elements expected: {2}.
cs: Element {0} obsahuje neplatný podřízený element {1}. Seznam možných očekávaných elementů: {2}
de: Das Element {0} enthält ein ungültiges untergeordnetes Element {1}. Erwartet wurde die Liste der möglichen Elemente: {2}.
es: El elemento {0} tiene un elemento secundario {1} no válido. Lista esperada de elementos posibles: {2}.
fr: L'élément {0} a un élément enfant non valide {1}. Liste d'éléments possibles attendus : {2}.
it: L'elemento {0} contiene un elemento figlio non valido {1}. Elenco dei possibili elementi previsti: {2}.
ja: 要素 {0} には無効な子要素 {1} が含まれています。必要とされる要素は {2} です。
ko: 요소 {0}에 잘못된 자식 요소 {1}이(가) 있습니다. 필요한 요소 목록: {2}
pl: Element {0} ma nieprawidłowy element podrzędny {1}. Lista oczekiwanych możliwych elementów: {2}.
pt_br: O elemento {0} apresenta elemento filho {1} inválido. Lista de possíveis elementos esperados: {2}.
ru: Элемент {0} имеет недопустимый дочерний элемент {1}. Список ожидаемых элементов: {2}.
tr: {0} öğesi geçersiz {1} alt öğesine sahip. Beklenen olası öğeler listesi: {2}.
zh_hans: 元素 {0} 的子元素 {1} 无效。应使用的元素如下: {2}。
zh_hant: 元素 {0} 含有無效的子項目 {1}。可能元素的清單應為: {2}。
