Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlBadName
source: A node of type '{0}' cannot have the name '{1}'.
cs: Uzel typu {0} nemůže mít název {1}.
de: Ein Knoten vom Typ "{0}" darf nicht den Namen "{1}" haben.
es: Un nodo del tipo "{0}" no puede tener el nombre "{1}".
fr: Un nœud de type '{0}' ne peut pas porter le nom '{1}'.
it: A un nodo di tipo '{0}' non può essere assegnato il nome '{1}'.
ja: '{0}' 型のノードには、名前 '{1}' を設定できません。
ko: '{0}' 형식의 노드에는 이름 '{1}'을(를) 지정할 수 없습니다.
pl: Węzeł typu „{0}” nie może mieć nazwy „{1}”.
pt_br: Um nó do tipo '{0}' não pode ter o nome '{1}'.
ru: Узел типа "{0}" не может иметь имя "{1}".
tr: '{0}' türündeki bir düğümün adı '{1}' olamaz.
zh_hans: “{0}”类型的节点不能具有名称“{1}”。
zh_hant: 類型 '{0}' 的節點不可為名稱 '{1}'。

# XmlBareAttributeMember
source: There was an error exporting '{0}': bare members cannot be attributes.
cs: Při exportu {0} došlo k chybě: Prosté členy nemohou být atributy.
de: Fehler beim Exportieren von "{0}": Leere Member können nicht als Attribute verwendet werden.
es: Error al exportar "{0}": los miembros vacíos no pueden ser atributos.
fr: Une erreur s'est produite durant l'exportation de '{0}' : les membres simples ne peuvent pas être des attributs.
it: Si è verificato un errore durante l'esportazione di '{0}': i membri bare non possono essere attributi.
ja: '{0}' のエクスポートでエラーが発生しました。Bare メンバーは属性にはなれません。
ko: '{0}'을(를) 내보내는 동안 오류가 발생했습니다. bare 멤버는 특성일 수 없습니다.
pl: Wystąpił błąd podczas eksportowania elementu „{0}”: surowe składowe nie mogą być atrybutami.
pt_br: Erro ao exportar '{0}': membros simples não podem ser atributos.
ru: Возникла ошибка при экспорте "{0}": простые члены не могут быть атрибутами.
tr: '{0}' dışarı aktarılırken bir hata oluştu: Sade üyeler öznitelik olamaz.
zh_hans: 导出“{0}”时出错: bare 成员不能是特性。
zh_hant: 在匯出 '{0}' 時發生錯誤: Bare 成員不可以有屬性。

# XmlBareTextMember
source: There was an error exporting '{0}': bare members cannot contain text content.
cs: Při exportu {0} došlo k chybě: Prosté členy nemohou mít textový obsah.
de: Fehler beim Exportieren von "{0}": Leere Member können keinen Text enthalten.
es: Error al exportar "{0}": los miembros vacíos no pueden contener texto.
fr: Une erreur s'est produite durant l'exportation de '{0}' : les membres simples ne peuvent pas contenir de texte.
it: Si è verificato un errore durante l'esportazione di '{0}': i membri bare non possono contenere testo.
ja: '{0}' のエクスポートでエラーが発生しました。Bare メンバーはテキスト コンテンツを保持できません。
ko: '{0}'을(를) 내보내는 동안 오류가 발생했습니다. bare 멤버에는 텍스트 콘텐츠를 포함할 수 없습니다.
pl: Wystąpił błąd podczas eksportowania elementu „{0}”: surowe składowe nie mogą mieć zawartości tekstowej.
pt_br: Erro ao exportar '{0}': membros simples não podem ter conteúdo de texto.
ru: Возникла ошибка при экспорте "{0}": простые члены не могут иметь текстовое содержимое.
tr: '{0}' dışarı aktarılırken bir hata oluştu: Sade üyelerde metin içeriği bulunamaz.
zh_hans: 导出“{0}”时出错: bare 成员不能包含文本内容。
zh_hant: 在匯出 '{0}' 時發生錯誤: Bare 成員不可以含有文字內容。

# XmlBin_InvalidQNameID
source: Invalid QName ID.
cs: Neplatný identifikátor QName ID
de: Ungültige QName-ID.
es: Id. de QName no válido.
fr: ID de QName non valide.
it: L'ID QName non è valido.
ja: QName ID が無効です。
ko: QName ID가 잘못되었습니다.
pl: Nieprawidłowy identyfikator QName.
pt_br: ID de QName inválida.
ru: Недопустимый идентификатор QName.
tr: QName kimliği geçersiz.
zh_hans: 无效的 QName ID。
zh_hant: QName 識別碼無效。

# XmlBin_MissingEndCDATA
source: CDATA end token is missing.
cs: Chybí koncový token CDATA.
de: CDATA-Endtoken fehlt.
es: Falta el token CDATA final.
fr: Jeton de fin CDATA manquant.
it: Manca il token di fine CDATA.
ja: CDATA 終端トークンがありません。
ko: CDATA 끝 토큰이 없습니다.
pl: Brak tokenu końcowego CDATA.
pt_br: Token final CDATA ausente.
ru: Отсутствует конечный маркер CDATA.
tr: CDATA bitiş belirteci eksik.
zh_hans: 缺少 CDATA 结束标记。
zh_hant: 遺漏 CDATA 與語彙基元。

# XmlBinary_AttrWithNsNoPrefix
source: Attribute '{0}' has namespace '{1}' but no prefix.
cs: Atribut {0} má obor názvů {1}, ale nemá žádnou předponu.
de: Das Attribut "{0}" hat den Namespace "{1}", aber kein Präfix.
es: El atributo "{0}" tiene espacio de nombres "{1}" pero no prefijo.
fr: L'attribut '{0}' à l'espace de noms '{1}' mais pas de préfixe.
it: L'attributo '{0}' contiene lo spazio dei nomi '{1}' ma nessun prefisso.
ja: 属性 '{0}' には、名前空間 '{1}' はありますが、プレフィックスがありません。
ko: 특성 '{0}'에 네임스페이스 '{1}'이(가) 있지만 접두사가 없습니다.
pl: Atrybut „{0}” ma przestrzeń nazw „{1}”, ale nie ma prefiksu.
pt_br: O atributo '{0}' tem namespace '{1}', mas nenhum prefixo.
ru: Атрибут "{0}" имеет пространство имен "{1}", но не имеет префикса.
tr: '{0}' özniteliğinde '{1}' ad alanı var, ancak önek yok.
zh_hans: 特性“{0}”具有命名空间“{1}”，但是没有前缀。
zh_hant: 屬性 '{0}' 有命名空間 '{1}' 但沒有前置詞。

# XmlBinary_CastNotSupported
source: Token '{0}' does not support a conversion to Clr type '{1}'.
cs: Token {0} nepodporuje převod na typ Clr {1}.
de: Das Token "{0}" unterstützt nicht die Konvertierung in den CLR-Typ "{1}".
es: El token "{0}" no admite la conversión al tipo Clr "{1}".
fr: Le jeton '{0}' ne prend pas en charge une conversion vers le type Clr '{1}'.
it: Il token '{0}' non supporta una conversione nel tipo CLR '{1}'.
ja: トークン '{0}' は、Clr 型 '{1}' への変換をサポートしていません。
ko: 토큰 '{0}'은(는) Clr 형식 '{1}'(으)로의 변환을 지원하지 않습니다.
pl: Token „{0}” nie obsługuje konwersji na typ Clr „{1}”.
pt_br: O token '{0}' não dá suporte à conversão em tipo CLR '{1}'.
ru: Маркер "{0}" не поддерживает преобразования к типу Clr "{1}".
tr: '{0}' belirteci '{1}' Clr türüne dönüştürmeyi desteklemiyor.
zh_hans: 令牌“{0}”不支持转换为 CLR 类型“{1}”。
zh_hant: 語彙基元 '{0}' 不支援轉換為 Clr 類型 '{1}'。

# XmlBinary_InvalidProtocolVersion
source: Invalid BinaryXml protocol version.
cs: Neplatná verze protokolu BinaryXml
de: Ungültige BinaryXml-Protokollversion.
es: Versión de protocolo BinaryXml no válida.
fr: Version de protocole BinaryXml non valide.
it: La versione del protocollo di BinaryXml non è valida.
ja: BinaryXml プロトコル バージョンが無効です。
ko: BinaryXml 프로토콜 버전이 잘못되었습니다.
pl: Nieprawidłowa wersja protokołu BinaryXml.
pt_br: Versão do protocolo BinaryXml inválida.
ru: Недопустимая версия протокола BinaryXml.
tr: Geçersiz BinaryXml protokolü sürümü.
zh_hans: 无效的 BinaryXml 协议版本。
zh_hant: BinaryXml 協定版本無效。

# XmlBinary_InvalidSignature
source: Invalid BinaryXml signature.
cs: Neplatný podpis BinaryXml
de: Ungültige BinaryXml-Signatur.
es: Signatura BinaryXml no válida.
fr: Signature BinaryXml non valide.
it: La firma di BinaryXml non è valida.
ja: BinaryXml 署名が無効です。
ko: BinaryXml 시그니처가 잘못되었습니다.
pl: Nieprawidłowa sygnatura elementu BinaryXml.
pt_br: Assinatura BinaryXml inválida.
ru: Недопустимая сигнатура BinaryXml.
tr: BinaryXml imzası geçersiz.
zh_hans: 无效的 BinaryXml 签名。
zh_hant: BinaryXml 簽章無效。

# XmlBinary_InvalidSqlDecimal
source: Unable to parse data as SQL_DECIMAL.
cs: Data nelze parsovat jako SQL_DECIMAL.
de: Daten können nicht als SQL_DECIMAL analysiert werden.
es: No se pueden analizar los datos como SQL_DECIMAL.
fr: Impossible d'analyser les données en tant que SQL_DECIMAL.
it: Non è possibile analizzare i dati come SQL_DECIMAL.
ja: データを SQL_DECIMAL として解析できません。
ko: 데이터를 SQL_DECIMAL로 구문 분석할 수 없습니다.
pl: Nie można przeanalizować danych w formacie SQL_DECIMAL.
pt_br: Não é possível analisar dados como SQL_DECIMAL.
ru: Не удается разобрать данные как SQL_DECIMAL.
tr: Veriler SQL_DECIMAL olarak ayrıştırılamıyor.
zh_hans: 无法将数据解析为 SQL_DECIMAL。
zh_hant: 無法將資料剖析為 SQL_DECIMAL。

# XmlBinary_InvalidStandalone
source: Invalid BinaryXml standalone token.
cs: Neplatný samostatný token BinaryXml
de: Ungültiges eigenständiges BinaryXml-Token.
es: Token BinaryXml independiente no válido.
fr: Jeton autonome BinaryXml non valide.
it: Il token autonomo di BinaryXml non è valido.
ja: BinaryXml スタンドアロン トークンが無効です。
ko: BinaryXml 독립형 토큰이 잘못되었습니다.
pl: Nieprawidłowy token autonomiczny BinaryXml.
pt_br: Token autônomo BinaryXml inválido.
ru: Недопустимый изолированный маркер BinaryXml.
tr: Geçersiz BinaryXml tek başına belirteci.
zh_hans: 无效的 BinaryXml 独立标记。
zh_hant: BinaryXml 獨立語彙基元無效。

# XmlBinary_ListsOfValuesNotSupported
source: Lists of BinaryXml value tokens not supported.
cs: Seznamy tokenů hodnot BinaryXml nejsou podporovány.
de: Listen von Token mit dem BinaryXml-Wert werden nicht unterstützt.
es: No se admiten listas de tokens de valores BinaryXml.
fr: Listes de jetons de valeur BinaryXml non prises en charge.
it: Gli elenchi di token valore di BinaryXml non sono supportati.
ja: BinaryXml 値トークンのリストはサポートされていません。
ko: BinaryXml 값 토큰 목록은 지원되지 않습니다.
pl: Listy tokenów wartości BinaryXml nie są obsługiwane.
pt_br: Não há suporte para listas de tokens de valor BinaryXml.
ru: Списки маркеров значений BinaryXml не поддерживаются.
tr: BinaryXml değeri belirteçleri listesi desteklenmiyor.
zh_hans: 不支持 BinaryXml 值标记列表。
zh_hant: 不支援 BinaryXml 值語彙基元的清單。

# XmlBinary_NoParserContext
source: BinaryXml Parser does not support initialization with XmlParserContext.
cs: Parser BinaryXml nepodporuje inicializaci s třídou XmlParserContext.
de: Der BinaryXml-Parser unterstützt keine Initialisierung mit XmlParserContext.
es: BinaryXml Parser no admite inicialización con XmlParserContext.
fr: L'analyseur BinaryXml ne prend pas en charge l'initialisation avec XmlParserContext.
it: Il parser di BinaryXml non supporta l'inizializzazione con XmlParserContext.
ja: BinaryXml パーサーでは、XmlParserContext による初期化をサポートしていません。
ko: BinaryXml 파서는 XmlParserContext를 사용한 초기화를 지원하지 않습니다.
pl: Analizator BinaryXml nie obsługuje inicjowania przy użyciu elementu XmlParserContext.
pt_br: O Analisador BinaryXml não dá suporte à inicialização com XmlParserContext.
ru: Компонент BinaryXml Parser не поддерживает инициализацию с аргументом XmlParserContext.
tr: BinaryXml Ayrıştırıcı, XmlParserContext ile başlatmayı desteklemiyor.
zh_hans: BinaryXml 分析器不支持使用 XmlParserContext 进行初始化。
zh_hant: BinaryXml Parser 不支援 XmlParserContext 的初始化。

# XmlBinary_NoRemapPrefix
source: Prefix '{0}' is already assigned to namespace '{1}' and cannot be reassigned to '{2}' on this tag.
cs: Předpona {0} je již přiřazena oboru názvů {1} a nelze ji přiřadit k {2} u této značky.
de: Das Präfix "{0}" wurde bereits dem Namespace "{1}" zugewiesen und kann "{2}" für dieses Tag nicht erneut zugewiesen werden.
es: El prefijo "{0}" ya está asignado al espacio de nombres "{1}" y no se puede volver a asignar a "{2}" en esta etiqueta.
fr: Le préfixe '{0}' est déjà assigné à l'espace de noms '{1}' et ne peut pas être réassigné à '{2}' sur cette balise.
it: Il prefisso '{0}' è già assegnato allo spazio dei nomi '{1}' e non può essere riassegnato a '{2}' in questo tag.
ja: プレフィックス '{0}' は、既に名前空間 '{1}' に割り当てられています。このため、このタグの '{2}' に再度割り当てることはできません。
ko: 접두사 '{0}'이(가) '{1}' 네임스페이스에 이미 할당되어 이 태그의 '{2}'에 다시 할당할 수 없습니다.
pl: Prefiks „{0}” został już przypisany do przestrzeni nazw „{1}” i nie można go ponownie przypisać do elementu „{2}” w obrębie tego tagu.
pt_br: O prefixo '{0}' já está atribuído ao namespace '{1}' e não pode ser reatribuído para '{2}' nesta marcação.
ru: Префикс "{0}" уже назначен пространству имен "{1}" и не может быть переназначен "{2}" для этого тега.
tr: '{0}' öneki zaten '{1}' ad alanına atandı ve bu etikette '{2}' alanına yeniden atanamaz.
zh_hans: 前缀“{0}”已分配给命名空间“{1}”，不能在此标记上重新分配给“{2}”。
zh_hant: 前置詞 '{0}' 已指派至命名空間 '{1}'，並且不能重新指派至此標記的 '{2}'。

# XmlBinary_UnexpectedToken
source: Unexpected BinaryXml token.
cs: Neočekávaný token BinaryXml
de: Unerwartetes BinaryXml-Token.
es: Token BinaryXml inesperado.
fr: Jeton BinaryXml inattendu.
it: Token di BinaryXml imprevisto.
ja: 予期しない BinaryXml トークンです。
ko: 예기치 않은 BinaryXml 토큰입니다.
pl: Nieoczekiwany token elementu BinaryXml.
pt_br: Token BinaryXml inesperado.
ru: Непредусмотренный маркер BinaryXml.
tr: Beklenmeyen BinaryXml belirteci.
zh_hans: 意外的 BinaryXml 标记。
zh_hant: 未預期的 BinaryXml 語彙基元。

# XmlBinary_UnsupportedCodePage
source: Unsupported BinaryXml codepage.
cs: Nepodporovaná znaková stránka BinaryXml
de: Nicht unterstützte BinaryXml-Codepage.
es: Página de códigos BinaryXml no compatible.
fr: Page de codes BinaryXml non prise en charge.
it: Tabella codici di BinaryXml non supportata.
ja: サポートされていない BinaryXml コードページです。
ko: 지원되지 않는 BinaryXml 코드 페이지입니다.
pl: Nieobsługiwana strona kodowa elementu BinaryXml.
pt_br: Página de código BinaryXml sem suporte.
ru: Неподдерживаемая кодовая страница BinaryXml.
tr: Desteklenmeyen BinaryXml kod sayfası.
zh_hans: 不受支持的 BinaryXml 代码页。
zh_hant: 未預期的 BinaryXml 字碼頁。

# XmlBinary_ValueTooBig
source: The value is too big to fit into an Int32. The arithmetic operation resulted in an overflow.
cs: Hodnota je na typ Int32 příliš velká. Výsledkem aritmetické operace je přetečení.
de: Der Wert ist zu groß für Int32. Die arithmetische Operation führte zu einem Überlauf.
es: El valor es demasiado grande para ajustarse a Int32. La operación aritmética dio como resultado un desbordamiento.
fr: La valeur est trop grande pour tenir dans un Int32. L'opération arithmétique a entraîné un dépassement.
it: Il valore è troppo grande per un Int32. L'operazione aritmetica ha generato un overflow.
ja: 値が大きすぎて、Int32 に収まりません。算術演算の結果がオーバーフローしました。
ko: 값이 너무 커서 Int32에 맞지 않습니다. 산술 연산으로 인해 오버플로가 발생했습니다.
pl: Wartość jest zbyt duża: nie pasuje do typu Int32. W wyniku operacji arytmetycznej nastąpiło przepełnienie.
pt_br: O valor é grande demais para se ajustar a um Int32. A operação aritmética resultou em estouro de capacidade.
ru: Размер значения превышает вместимость типа Int32. Переполнение при арифметической операции.
tr: Değer Int32'ye sığmayacak kadar büyük. Aritmetik işlem taşma ile sonuçlandı.
zh_hans: 值太大，Int32 无法容纳。该算术运算导致溢出。
zh_hant: 此值太大，無法放入 Int32。算數作業結果為溢位。

# XmlCannotIncludeInSchema
source: The type {0} may not be exported to a schema because the IncludeInSchema property of the XmlType attribute is 'false'.
cs: Typ {0} nesmí být exportován do schématu, protože vlastnost IncludeInSchema atributu XmlType má hodnotu false.
de: Der Typ {0} kann nicht in ein Schema exportiert werden, da die IncludeInSchema-Eigenschaft des XmlType-Attributs "false" ist.
es: El tipo {0} no puede exportarse a un esquema porque la propiedad IncludeInSchema del atributo XmlType es igual a "false".
fr: Le type {0} ne peut pas être exporté vers un schéma, car la propriété IncludeInSchema de l'attribut XmlType a la valeur 'false'.
it: È possibile che il tipo {0} non venga esportato in uno schema perché la proprietà IncludeInSchema dell'attributo XmlType è 'false'.
ja: XmlType 属性の IncludeInSchema プロパティが 'false' に設定されているため、型 {0} をスキーマにエクスポートすることはできません。
ko: XmlType 특성의 IncludeInSchema 속성이 'false'이므로 {0} 형식을 스키마로 내보낼 수 없습니다.
pl: Typ {0} nie może być eksportowany do schematu, ponieważ właściwość IncludeInSchema atrybutu XmlType ma wartość „false”.
pt_br: O tipo {0} não pode ser exportado para um esquema porque a propriedade IncludeInSchema do atributo XmlType é 'false'.
ru: Невозможно экспортировать тип {0} в схему, так как свойство IncludeInSchema атрибута XmlType имеет значение false (ложь).
tr: XmlType özniteliğinin IncludeInSchema özelliği 'false' olduğundan {0} türü bir şemaya aktarılamayabilir.
zh_hans: 类型 {0} 不能导出到架构，因为 XmlType 特性的 IncludeInSchema 属性为 "false"。
zh_hant: 類型 {0} 無法匯出至結構描述，因為 XmlType 屬性的 IncludeInSchema 屬性是 'false'。

# XmlCannotReconcileAccessor
source: The top XML element '{0}' from namespace '{1}' references distinct types {2} and {3}. Use XML attributes to specify another XML name or namespace for the element or types.
cs: Element XML nejvyšší úrovně {0} z oboru názvů {1} používá odkazy na různé typy {2} a {3}. K určení dalšího názvu XML nebo oboru názvů pro element nebo typy použijte atributy XML.
de: Das oberste XML-Element "{0}" aus dem Namespace "{1}" verweist auf die eindeutigen Typen {2} und {3}. Verwenden Sie XML-Attribute, um einen anderen XML-Namen oder -Namespace für das Element oder die Typen anzugeben.
es: El elemento XML "{0}" superior del espacio de nombres "{1}" hace referencia a tipos diferentes {2} y {3}. Utilice atributos XML para especificar otro espacio de nombres o nombre XML para el elemento o los tipos.
fr: L'élément XML appelé '{0}' de l'espace de noms '{1}' référence des types {2} et {3} distincts. Utilisez les attributs XML pour spécifier un autre nom ou espace de noms XML pour l'élément ou les types.
it: L'elemento XML '{0}', appartenente allo spazio dei nomi '{1}', fa riferimento ai tipi distinti {2} e {3}. Usare gli attributi XML per specificare uno spazio dei nomi o un nome XML diverso per l'elemento o per i tipi.
ja: 名前空間 '{1}' の最上位の XML 要素 '{0}' が、明示型である {2} および {3} を参照しています。XML 属性を使用して、この要素または型の代わりとなる別の XML 名または名前空間を指定してください。
ko: 네임스페이스 '{1}'의 최상위 XML 요소 '{0}'은(는) 고유한 형식 {2}과(와) {3}을(를) 참조합니다. XML 특성을 사용하여 해당 요소나 형식에 다른 XML 이름 또는 네임스페이스를 지정하세요.
pl: Główny element XML „{0}” z przestrzeni nazw „{1}” odwołuje się do odrębnych typów {2} i {3}. Określ inną nazwę lub przestrzeń nazw XML dla elementu lub dla typów przy użyciu atrybutów XML.
pt_br: O elemento XML superior '{0}' do namespace '{1}' faz referência aos tipos distintos {2} e {3}. Use atributos XML para especificar outro namespace ou nome XML para o elemento ou para os tipos.
ru: Верхний элемент XML "{0}" из пространства имен "{1}" ссылается на отдельные типы {2} и {3}. Используйте атрибуты XML, чтобы задать другое имя или пространство имен XML для элемента или типов.
tr: '{1}' ad alanındaki '{0}' XML öğesi farklı {2} ve {3} türlerine başvuruyor. Öğe veya türler için başka bir XML adı veya ad alanı belirtmek üzere XML özniteliklerini kullanın.
zh_hans: 来自命名空间“{1}”的顶层 XML 元素“{0}”引用了不同的类型 {2} 和 {3}。请使用 XML 特性为该元素或类型指定另一个 XML 名称或命名空间。
zh_hant: 來自命名空間 '{1}' 名稱為 '{0}' 的 XML 元素參考個別類型 {2} 和 {3}。請使用 XML 屬性指定元素或類型的其他 XML 名稱或命名空間。

# XmlCannotReconcileAccessorDefault
source: The global XML item '{0}' from namespace '{1}' has mismatch default value attributes: '{2}' and '{3}' and cannot be mapped to the same schema item. Use XML attributes to specify another XML name or namespace for one of the items, or make sure that the default values match.
cs: Globální položka XML {0} z oboru názvů {1} má neodpovídající atributy výchozí hodnoty {2} a {3} a nelze ji namapovat na stejnou položku schématu. Pomocí atributů XML zadejte jiný název XML nebo obor názvů pro jednu z položek nebo zajistěte, aby se výchozí hodnoty shodovaly.
de: Das globale XML-Element "{0}" aus dem Namespace "{1}" weist nicht übereinstimmende Standardattributwerte auf: "{2}" und "{3}" können nicht demselben Schemaelement zugeordnet werden. Verwenden Sie XML-Attribute, um einen anderen XML-Namen oder -Namespace für eines der Elemente anzugeben, oder stellen Sie sicher, dass die Standardwerte übereinstimmen.
es: El elemento XML global "{0}" del espacio de nombres "{1}" incluye atributos de valores predeterminados que no coinciden: "{2}" y "{3}", y no puede asignarse al mismo elemento de esquema. Utilice atributos XML para especificar otro espacio de nombres o nombre XML para uno de los elementos, o asegúrese de que los valores predeterminados coincidan.
fr: L'élément XML global '{0}' de l'espace de noms '{1}' a des attributs de valeur par défaut non compatibles : '{2}' et '{3}'. Cet élément ne peut pas être mappé au même élément de schéma. Utilisez des attributs XML afin d'indiquer un autre espace de noms ou nom XML pour l'un de ces éléments. Vous pouvez également vérifier que les valeurs par défaut sont compatibles.
it: L'elemento globale XML '{0}' appartenente allo spazio dei nomi '{1}' contiene attributi di valore predefinito non corrispondenti, '{2}' e '{3}', e non è possibile eseguirne il mapping allo stesso elemento dello schema. Usare gli attributi XML per specificare un altro nome XML o uno spazio dei nomi per uno degli elementi, oppure assicurarsi che i valori predefiniti corrispondano.
ja: 名前空間 '{1}' のグローバル XML アイテム '{0}' には、既定値の属性 '{2}' と '{3}' が含まれています。ただし、これらは一致していません。このため、これらを同じスキーマ アイテムにマップすることはできません。XML 属性を使用してこれらのアイテムのどちらかに別の XML 名または名前空間を指定するか、または既定値が一致するようにしてください。
ko: 네임스페이스 '{1}'의 전역 XML 항목 '{0}'에 일치하지 않는 기본값 특성인 '{2}'과(와) '{3}'이(가) 있으며 같은 스키마 항목으로 매핑할 수 없습니다. XML 특성을 사용하여 항목 중 하나에 다른 XML 이름 또는 네임스페이스를 지정하거나 기본값이 일치하는지 확인하세요.
pl: Globalny element XML „{0}” z przestrzeni nazw „{1}” ma niezgodne atrybuty wartości domyślnych „{2}” i „{3}”. Nie można go zamapować do tego samego elementu schematu. Określ inną nazwę lub przestrzeń nazw XML dla jednego z elementów przy użyciu atrybutów XML lub sprawdź, czy wartości domyślne są zgodne.
pt_br: O item XML global '{0}' do namespace '{1}' tem atributos de valor padrão incompatíveis: '{2}' e '{3}' e não pode ser mapeado para o mesmo item de esquema. Use atributos XML para especificar outro nome ou namespace XML para um dos itens ou verifique se os valores padrão são compatíveis.
ru: В глобальном элементе XML "{0}" из пространства имен "{1}" имеется несоответствие атрибутов значений по умолчанию: "{2}" и "{3}", и он не может быть сопоставлен тому же элементу схемы. Используйте атрибуты XML, чтобы задать другое имя или пространство имен XML для этих элементов, или убедитесь, что значения по умолчанию согласованы.
tr: '{1}' ad alanındaki '{0}' global XML öğesi '{2}' ve '{3}' varsayılan değer öznitelikleriyle uyuşmuyor ve aynı şema öğesine eşlenemiyor. Öğelerden biri için başka bir XML adı belirtmek üzere XML özniteliklerini kullanın veya varsayılan değerlerin eşleştiğinden emin olun.
zh_hans: 来自命名空间“{1}”的全局 XML 项“{0}”具有不匹配的默认值特性:“{2}”和“{3}”，因此无法映射到同一架构项。请使用 XML 特性为其中一项指定另一个 XML 名称或命名空间，或确保默认值匹配。
zh_hant: 命名空間 '{1}' 的全域 XML 項目 '{0}' 有不相符的預設值屬性: '{2}' 與 '{3}' 且無法對應至相同的結構描述項目。請使用 XML 屬性來為其中一個項目指定其他 XML 名稱或命名空間，或確定預設值相符。
