Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlSerializerUnsupportedMember
source: Cannot serialize member '{0}' of type '{1}', see inner exception for more details.
cs: Člen {0} typu {1} nelze serializovat. Další podrobnosti získáte v informacích o vnitřní výjimce.
de: Der Member "{0}" vom Typ "{1}" kann nicht serialisiert werden. Details finden Sie in der inneren Ausnahme.
es: No se puede serializar el miembro "{0}" del tipo "{1}", consulte la excepción interna para obtener detalles.
fr: Impossible de sérialiser le membre '{0}' de type '{1}'. Pour plus d'informations, consultez l'exception interne.
it: Non è possibile serializzare il membro '{0}' di tipo '{1}'. Per maggiori dettagli, vedere l'eccezione interna.
ja: 型 '{1}' のメンバー '{0}' をシリアル化できません。詳細については、内部例外を参照してください。
ko: 형식이 '{1}'인 멤버 '{0}'을(를) 직렬화할 수 없습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Nie można serializować składowej „{0}” typu „{1}” (szczegółowe informacje możesz znaleźć w opisie wyjątku wewnętrznego).
pt_br: Não é possível serializar o membro '{0}' do tipo '{1}'. Consulte a exceção interna para obter mais detalhes.
ru: Не удается сериализовать член "{0}" типа "{1}". Дополнительные сведения см. во внутреннем исключении.
tr: '{1}' türündeki '{0}' üyesi serileştirilemiyor, ayrıntılar için iç özel hataya bakın.
zh_hans: 无法序列化类型“{1}”的成员“{0}”，有关详细信息，请参见内部异常。
zh_hant: 無法序列化類別 '{1}' 的成員 '{0}'，請參閱內部例外狀況，以取得詳細資料。

# XmlSerializerUnsupportedType
source: {0} is an unsupported type. Please use [XmlIgnore] attribute to exclude members of this type from serialization graph.
cs: {0} je nepodporovaný typ. Pomocí atributu [XmlIgnore] vylučte členy tohoto typu z grafu serializace.
de: Der Typ {0} wird nicht unterstützt. Verwenden Sie das [XmlIgnore]-Attribut, um Member dieses Typs aus dem Serialisierungsgraph auszuschließen.
es: No se admite el tipo {0}. Utilice el atributo [XmlIgnore] para excluir a los miembros de este tipo del gráfico de serialización.
fr: {0} est un type non pris en charge. Utilisez l'attribut [XmlIgnore] pour exclure les membres de ce type du graphique de sérialisation.
it: {0} è un tipo non supportato. Usare l'attributo [XmlIgnore] per escludere i membri di questo tipo dal grafico di serializzazione.
ja: {0} は予期されない型です。[XmlIgnore] 属性を使用してシリアル化グラフからこの型のメンバーを除外してください。
ko: {0}은(는) 지원되지 않는 형식입니다. serialization 그래프에서 이 형식의 멤버를 제외하려면 [XmlIgnore] 특성을 사용하세요.
pl: Typ {0} nie jest obsługiwany. Wyklucz składowe tego typu z wykresu serializacji przy użyciu atrybutu [XmlIgnore].
pt_br: {0} é um tipo sem suporte. Use o atributo [XmlIgnore] para excluir membros desse tipo do grafo de serialização.
ru: {0} не является поддерживаемым типом. С помощью атрибута [XmlIgnore] исключите члены этого типа из графа сериализации.
tr: {0} türü desteklenmiyor. Lütfen bu tür üyelerini serileştirme grafının dışında bırakmak için [XmlIgnore] özniteliğini kullanın.
zh_hans: 不支持 {0} 类型。请使用 [XmlIgnore] 特性将此类型的成员从序列化图形中排除。
zh_hant: {0} 是不受支援的類型。請使用 [XmlIgnore] 屬性，從序列化圖表排除此類型的成員。

# XmlSoapCannotIncludeInSchema
source: The type {0} may not be exported to a schema because the IncludeInSchema property of the SoapType attribute is 'false'.
cs: Typ {0} nesmí být exportován do schématu, protože vlastnost IncludeInSchema atributu SoapType má hodnotu false.
de: Der Typ {0} kann nicht in ein Schema exportiert werden, da die IncludeInSchema-Eigenschaft des SoapType-Attributs "false" ist.
es: El tipo {0} no puede exportarse a un esquema porque la propiedad IncludeInSchema del atributo SoapType es igual a "false".
fr: Le type {0} ne peut pas être exporté vers un schéma, car la propriété IncludeInSchema de l'attribut SoapType a la valeur 'false'.
it: Il tipo {0} non può essere esportato in uno schema perché la proprietà IncludeInSchema dell'attributo SoapType è 'false'.
ja: SoapType 属性の IncludeInSchema プロパティが 'false' になっているため、型 {0} をスキーマにエクスポートすることはできません。
ko: SoapType 특성의 IncludeInSchema 속성이 'false'이므로 {0} 형식을 스키마로 내보낼 수 없습니다.
pl: Typ {0} nie może być eksportowany do schematu, ponieważ właściwość IncludeInSchema atrybutu SoapType ma wartość „false”.
pt_br: O tipo {0} não pode ser exportado para um esquema porque a propriedade IncludeInSchema do atributo SoapType é 'false'.
ru: Невозможно экспортировать тип {0} в схему, так как свойство IncludeInSchema атрибута SoapType имеет значение false (ложь).
tr: SoapType özniteliğinin IncludeInSchema özelliği 'false' olduğundan {0} türü bir şemaya aktarılamayabilir.
zh_hans: 类型 {0} 不能导出到架构中，因为 SoapType 特性的 IncludeInSchema 属性为 "false"。
zh_hant: 類型 {0} 不可以匯出至結構描述，因為 SoapType 屬性 (Attribute) 的 IncludeInSchema 屬性 (Property) 是 'false'。

# XmlSoapInvalidAttributeUse
source: Attributes are not supported with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}': use elements (not attributes) for fields/parameters.
cs: Atributy nejsou u kódovaného protokolu SOAP podporovány. Změňte definici typu schématu {0} z oboru názvů {1}: Použijte elementy (nikoli atributy) pro pole a parametry.
de: Attribute werden mit codiertem SOAP nicht unterstützt. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}": Verwenden Sie Elemente (keine Attribute) für Felder/Parameter.
es: Los atributos no son compatibles con SOAP codificado. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}": utilice elementos (no atributos) para campos o parámetros.
fr: Les attributs ne sont pas pris en charge avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}' : utilisez des éléments (et non des attributs) pour les champs/paramètres.
it: Gli attributi non sono supportati con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}' usando elementi e non attributi per i campi e i parametri.
ja: エンコードされた SOAP では、属性を使用できません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。フィールドまたはパラメーターには、属性ではなく要素を使用してください。
ko: 특성은 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 정의를 변경하고 필드/매개 변수에 대해 특성 대신 요소를 사용하세요.
pl: Atrybuty nie są obsługiwane przy użyciu zakodowanego protokołu SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”: dla pól/parametrów użyj elementów (nie atrybutów).
pt_br: Não há suporte para atributos com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}': use elementos (e não atributos) para campos/parâmetros.
ru: Атрибуты с кодированными SOAP не поддерживаются. Измените определение типа схемы "{0}" из пространства имен "{1}": для полей и параметров используйте элементы (а не атрибуты).
tr: Kodlanmış SOAP'ta öznitelikler desteklenmez. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin: Alanlar/parametreler için öğe (öznitelik değil) kullanın.
zh_hans: 编码的 SOAP 不支持特性。请更改来自命名空间“{1}”的架构类型“{0}”的定义: 对字段/参数使用元素(而非特性)。
zh_hant: 屬性不支援有 SOAP 編碼。請變更命名空間 '{1}' 的結構描述類型 '{0}' 之定義: 請為欄位/參數使用元素而非屬性。

# XmlSoapInvalidChoice
source: Choice is not supported with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}': use all or sequence (not choice) for fields/parameters.
cs: Možnost choice není u kódovaného protokolu SOAP podporována. Změňte definici typu schématu {0} z oboru názvů {1}: Pro pole a parametry použijte hodnotu all nebo sequence (nikoli choice).
de: Eine Auswahl wird mit codiertem SOAP nicht unterstützt. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}": Verwenden Sie alle oder eine Sequenz (keine Auswahl) für Felder/Parameter.
es: Choice no es compatible con SOAP codificado. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}": utilice all o sequence (no choice) para los campos o parámetros.
fr: Ce choix n'est pas pris en charge avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}' : utilisez tout ou une séquence (et non un choix) pour les champs/paramètres.
it: L'elemento choice non è supportato con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}' usando all o sequence e non choice per i campi e i parametri.
ja: エンコードされた SOAP では、choice を使用できません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。フィールドまたはパラメーターには、choice ではなく all または sequence を使用してください。
ko: Choice는 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 정의를 변경하고 필드/매개 변수에 대해 choice 대신 all 또는 sequence를 사용하세요.
pl: Element „choice” nie jest obsługiwany przy użyciu zakodowanego protokołu SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”: dla pól/parametrów użyj elementów „all” lub „sequence” (nie elementu „choice”).
pt_br: Não há suporte para opção com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}': use tudo ou sequência (e não opção) para campos/parâmetros.
ru: Выбор с кодированными SOAP не поддерживается. Измените определение типа схемы "{0}" из пространства имен "{1}": для полей и параметров используйте all или sequence (но не choice).
tr: Choice, kodlanmış SOAP'ta desteklenmiyor. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin: Alanlar/parametreler için all veya sequence (choice değil) kullanın.
zh_hans: 编码的 SOAP 不支持 choice。请更改来自命名空间“{1}”的架构类型“{0}”的定义: 对字段/参数使用 all 或 sequence (而非 choice)。
zh_hant: 編碼的 SOAP 不支援 Choice。請變更命名空間 '{1}' 的結構描述類型 '{0}': 請為欄位/參數使用 All 或 Sequence (非選擇)。

# XmlSoapUnsupportedGroupAny
source: Any may not be used with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}'.
cs: Atribut Any nesmí být použit spolu s kódovaným protokolem SOAP. Změňte prosím definici typu schématu {0} z oboru názvů {1}.
de: "any" kann nicht mit codiertem SOAP verwendet werden. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}".
es: No se puede utilizar Any con SOAP codificado. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}".
fr: Any ne peut pas être spécifié avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}'.
it: Non è possibile usare any con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}'.
ja: エンコードされた SOAP では、any を使用できません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。
ko: Any는 인코딩된 SOAP에서 사용할 수 없습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 정의를 변경하세요.
pl: Nie można używać elementu „any” razem z zakodowanym protokołem SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”.
pt_br: Any não pode ser usado com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}'.
ru: Any не может использоваться с кодированными SOAP. Измените определение типа схемы "{0}" из пространства имен "{1}".
tr: Any, kodlanmış SOAP'ta kullanılamıyor. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin.
zh_hans: any 不能与编码的 SOAP 一起使用。请更改来自命名空间“{1}”的架构类型“{0}”的定义。
zh_hant: Any 無法用於經過編碼的 SOAP。請變更命名空間 '{1}' 的結構描述類型 '{0}' 之定義。

# XmlSoapUnsupportedGroupNested
source: Nested groups may not be used with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}'.
cs: Vnořené skupiny nesmí být použity spolu s kódovaným protokolem SOAP. Změňte prosím definici typu schématu {0} z oboru názvů {1}.
de: Geschachtelte Gruppen können mit codiertem SOAP nicht verwendet werden. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}".
es: No se pueden utilizar grupos anidados con SOAP codificado. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}".
fr: Les groupes imbriqués ne peuvent pas être utilisés avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}'.
it: Non è possibile usare i gruppi annidati con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}'.
ja: エンコードされた SOAP では、入れ子になった group を使用できません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。
ko: 중첩 그룹은 인코딩된 SOAP에서 사용할 수 없습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 정의를 변경하세요.
pl: Nie można używać grup zagnieżdżonych razem z zakodowanym protokołem SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”.
pt_br: Grupos aninhados não podem ser usados com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}'.
ru: Вложенные группы не могут использоваться с кодированными SOAP. Измените определение типа схемы "{0}" из пространства имен "{1}".
tr: İç içe gruplar, kodlanmış SOAP'ta kullanılamıyor. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin.
zh_hans: 嵌套组不能与编码的 SOAP 一起使用。请更改来自命名空间“{1}”的架构类型“{0}”的定义。
zh_hant: 巢狀群組無法用於經過編碼的 SOAP。請變更命名空間 '{1}' 結構描述類型 '{0}' 的定義。

# XmlSoapUnsupportedGroupRef
source: The ref syntax for groups is not supported with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}': replace the group reference with local group declaration.
cs: Syntaxe ref pro skupiny není u kódovaného protokolu SOAP podporována. Změňte definici typu schématu {0} z oboru názvů {1}: Nahraďte odkaz na skupinu deklarací místní skupiny.
de: Die Verweissyntax für Gruppen wird mit codiertem SOAP nicht unterstützt. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}": Ersetzen Sie den Gruppenverweis durch eine lokale Gruppendeklaration.
es: La sintaxis de referencia para grupos no es compatible con SOAP codificado. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}": reemplace la referencia de grupo con una declaración de grupo local.
fr: La syntaxe de référence pour les groupes n'est pas prise en charge avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}' : remplacez la référence de groupe par une déclaration de groupe locale.
it: La sintassi di riferimento per i gruppi non è supportata con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}' sostituendo il riferimento al gruppo con la dichiarazione del gruppo locale.
ja: エンコードされた SOAP では、group に ref 構文を使用することはできません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。グループ参照をローカルのグループ宣言に置き換えてください。
ko: 그룹의 ref 구문은 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 정의를 변경하고 그룹 참조를 로컬 그룹 선언으로 바꾸세요.
pl: Składnia odwołania dla grup nie jest obsługiwana przy użyciu zakodowanego protokołu SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”: zastąp odwołanie do grupy deklaracją grupy lokalnej.
pt_br: Não há suporte para sintaxe ref para grupos com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}': substitua a referência de grupo por uma declaração de grupo local.
ru: Синтаксис ref для групп не поддерживается с кодированными SOAP. Измените определение типа схемы "{0}" из пространства имен "{1}": замените ссылку на группу локальным объявлением группы.
tr: Gruplara yönelik ref sözdizimi kodlanmış SOAP'ta desteklenmiyor. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin: Grup başvurusunu yerel grup bildirimiyle değiştirin.
zh_hans: 编码的 SOAP 不支持组的 ref 语法。请更改来自命名空间“{1}”的架构类型“{0}”的定义: 使用本地组声明替换组引用。
zh_hant: ref 語法無法用於編碼的 SOAP。請變更命名空間 '{1}' 結構描述類型 '{0}' 的定義: 以本機群組宣告取代群組參考。

# XmlSoapUnsupportedGroupRepeat
source: Group may not repeat. Unbounded groups are not supported with encoded SOAP. Please change definition of schema type '{0}' from namespace '{1}'.
cs: Skupina se nesmí opakovat. Skupiny bez vazeb nejsou u kódovaného protokolu SOAP podporovány. Změňte prosím definici typu schématu {0} z oboru názvů {1}.
de: Die Gruppe darf nicht wiederholt werden. Ungebundene Gruppen werden mit codiertem SOAP nicht unterstützt. Ändern Sie die Definition des Schematyps "{0}" aus dem Namespace "{1}".
es: No puede repetirse el grupo. Los grupos sin delimitar no son compatibles con codificación SOAP. Cambie la definición del tipo de esquema "{0}" del espacio de nombres "{1}".
fr: Le groupe ne peut pas être répété. Les groupes indépendants ne sont pas pris en charge avec le SOAP encodé. Changez la définition du type de schéma '{0}' de l'espace de noms '{1}'.
it: Non è possibile ripetere il gruppo. I gruppi unbounded non sono supportati con SOAP codificato. Modificare la definizione del tipo di schema '{0}' dello spazio dei nomi '{1}'.
ja: group を繰り返して使用することはできません。エンコードされた SOAP では、group の出現回数を無制限にすることはできません。名前空間 '{1}' のスキーマの型 '{0}' の定義を変更してください。
ko: 그룹을 반복할 수 없습니다. 바인딩되지 않은 그룹은 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}의 정의를 변경하세요.
pl: Grupa nie może się powtarzać. Grupy niepowiązane nie są obsługiwane przy użyciu zakodowanego protokołu SOAP. Zmień definicję typu schematu „{0}” z przestrzeni nazw „{1}”.
pt_br: Não é possível repetir grupos. Não há suporte para grupos não associados com SOAP codificado. Altere a definição do tipo de esquema '{0}' do namespace '{1}'.
ru: Группы не могут повторяться. Неограниченные группы с кодированными SOAP не поддерживаются. Измените определение типа схемы "{0}" из пространства имен "{1}".
tr: Grup yinelenemez. Bağlı olmayan gruplar kodlanmış SOAP'ta desteklenmiyor. Lütfen '{1}' ad alanındaki '{0}' şema türünün tanımını değiştirin.
zh_hans: 组不能重复。编码的 SOAP 不支持 Unbounded 组。请更改来自命名空间“{1}”的架构类型“{0}”的定义。
zh_hant: 群組不可重複。經過編碼的 SOAP 不支援未繫結的群組。請變更命名空間 '{1}' 結構描述類型 '{0}' 的定義。

# XmlSoleXmlnsAttribute
source: XmlNamespaceDeclarations attribute cannot be used in conjunction with any other custom attributes.
cs: Atribut XmlNamespaceDeclarations nelze použít současně s žádnými jinými vlastními atributy.
de: Das XmlNamespaceDeclarations-Attribut kann nicht in Verbindung mit anderen benutzerdefinierten Attributen verwendet werden.
es: No se puede utilizar el atributo XmlNamespaceDeclarations junto con otro atributo personalizado.
fr: Impossible d'utiliser l'attribut XmlNamespaceDeclarations avec d'autres attributs personnalisés.
it: Non è possibile usare l'attributo XmlNamespaceDeclarations insieme ad altri attributi personalizzati.
ja: XmlNamespaceDeclarations 属性はその他のカスタム属性と共に使用できません。
ko: XmlNamespaceDeclarations 특성은 다른 사용자 지정 특성과 함께 사용할 수 없습니다.
pl: Atrybut XmlNamespaceDeclarations nie może być używany w połączeniu z żadnymi innymi atrybutami niestandardowymi.
pt_br: O atributo XmlNamespaceDeclarations não pode ser usado juntamente com outros atributos personalizados.
ru: Атрибут XmlNamespaceDeclarations не может использоваться в сочетании с другими особыми атрибутами.
tr: XmlNamespaceDeclarations özniteliği başka bir özel öznitelikle birlikte kullanılamaz.
zh_hans: XmlNamespaceDeclarations 特性不能与其他任何自定义特性一起使用。
zh_hant: XmlNamespaceDeclarations 屬性不可以和其他的自訂屬性搭配使用。

# XmlTypeInaccessible
source: {0} is inaccessible due to its protection level. Only public types can be processed.
cs: Typ {0} je vzhledem k úrovni ochrany nepřístupný. Lze zpracovat pouze veřejné typy.
de: Auf {0} kann aufgrund des Schutzgrads nicht zugegriffen werden. Nur öffentliche Typen können verarbeitet werden.
es: {0} no es accesible por el nivel de protección. solo se pueden procesar tipos públicos.
fr: {0} est inaccessible en raison de son niveau de protection. Seuls les types publics peuvent être traités.
it: {0} non è accessibile a causa del relativo livello di protezione. È possibile elaborare solo i tipi pubblici.
ja: 保護レベルの設定が原因で '{0}' にアクセスできません。パブリックの型のみ処理できます。
ko: 보호 수준 때문에 {0}에 액세스할 수 없습니다. public 형식만 처리할 수 있습니다.
pl: Element {0} jest niedostępny z powodu swojego poziomu zabezpieczenia. Tylko typy publiczne mogą być przetwarzane.
pt_br: {0} é inacessível por causa do seu nível de proteção. Apenas tipos públicos podem ser processados.
ru: {0} недоступен в силу его уровня защиты. Возможна обработка только общих типов.
tr: Koruma düzeyi nedeniyle {0} erişilebilir değil. Yalnızca genel türler işlenebilir.
zh_hans: {0} 因其保护级别而不可访问。只能处理公共类型。
zh_hant: {0} 因為其保護層級而無法存取。只可處理公用類型。

# XmlTypeReflectionError
source: There was an error reflecting type '{0}'.
cs: Při reflexi typu {0} došlo k chybě.
de: Beim Reflektieren des Typs "{0}" ist ein Fehler aufgetreten.
es: Error al reflejar el tipo "{0}".
fr: Une erreur s'est produite durant la réflexion du type '{0}'.
it: Si è verificato un errore durante la reflection del tipo '{0}'.
ja: 型 '{0}' の反映でエラーが発生しました。
ko: '{0}' 형식을 반영하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd w czasie wykonywania odbicia typu „{0}”.
pt_br: Erro ao refletir o tipo '{0}'.
ru: Возникла ошибка при отражении типа "{0}".
tr: '{0}' türü yansıtılırken bir hata oluştu.
zh_hans: 反射类型“{0}”时出错。
zh_hant: 反映類型 '{0}' 時發生錯誤。

# XmlTypeStatic
source: {0} cannot be serialized. Static types cannot be used as parameters or return types.
cs: {0} nelze serializovat. Statické typy nelze používat jako parametry nebo návratové typy.
de: {0} kann nicht serialisiert werden. Statische Typen können nicht als Parameter oder Rückgabetypen verwendet werden.
es: {0} no se puede serializar. No se pueden utilizar tipos estáticos como parámetros o tipos devueltos.
fr: Impossible de sérialiser {0}. Les types statiques ne peuvent pas être utilisés comme paramètres ou types de retour.
it: Non è possibile serializzare {0}. Non si possono usare i tipi statici come parametri o tipi restituiti.
ja: {0} はシリアル化できません。静的型は、パラメーターや戻り値の型としては使用できません。
ko: {0}을(를) 직렬화할 수 없습니다. 정적 형식은 매개 변수 또는 반환 형식으로 사용할 수 없습니다.
pl: Nie można serializować elementu {0}. Typy statyczne nie mogą być używane jako parametry lub zwracane typy.
pt_br: {0} não pode ser serializado. Os tipos estáticos não podem ser usados como parâmetros ou tipos de retorno.
ru: Невозможно сериализовать {0}. Статические типы не могут использоваться в качестве параметров или возвращаемых типов.
tr: {0} serileştirilemiyor. Parametre ve dönüş türü olarak statik tür kullanılamaz.
zh_hans: 无法序列化 {0}。静态类型不能被用作参数或返回类型。
zh_hant: {0} 無法序列化。靜態類型無法用作為參數或傳回型別。

# XmlTypeUsedTwice
source: The type '{0}' from namespace '{1}' was used in two different ways.
cs: Typ {0} z oboru názvů {1} byl použit dvěma různými způsoby.
de: Der Typ "{0}" aus dem Namespace "{1}" wurde auf zwei unterschiedliche Arten verwendet.
es: El tipo "{0}" del espacio de nombres "{1}" se ha utilizado de dos formas diferentes.
fr: Le type '{0}' de l'espace de noms '{1}' a été utilisé de deux manières différentes.
it: Il tipo '{0}' dello spazio dei nomi '{1}' è stato usato in due modi diversi.
ja: 名前空間 '{1}' からの型 '{0}' は、異なる方法で 2 回使われました。
ko: 네임스페이스 '{1}'의 '{0}' 형식이 두 가지 방법으로 사용되었습니다.
pl: Typ „{0}” z przestrzeni nazw „{1}” był używany na dwa różne sposoby.
pt_br: O tipo '{0}' do namespace '{1}' foi usado de duas formas diferentes.
ru: Тип "{0}" из пространства имен "{1}" использовался двумя разными способами.
tr: '{1}' ad alanındaki '{0}' türü iki farklı şekilde kullanıldı.
zh_hans: 以两种不同的方式使用了命名空间“{1}”中的类型“{0}”。
zh_hant: 命名空間 '{1}' 中的類型 '{0}' 有兩種不同的使用方式。
