Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_NotSimpleContent
source: The content type of the base type must be a simple type definition or it must be mixed, and simpleType child must be present.
cs: Typ obsahu základního typu musí být definicí jednoduchého typu nebo smíšený. Zároveň musí být uveden podřízený typ simpleType.
de: Der Inhaltstyp des Basistyps muss eine einfache Typdefinition oder gemischt sein. Außerdem muss ein untergeordnetes Element "simpleType" vorhanden sein.
es: El tipo de contenido del tipo base debe ser una definición de tipo simple o debe ser mixto, y debe tener presente el elemento secundario simpleType.
fr: Le type de contenu du type de base doit être une définition de type simple ou doit être mélangé, et un enfant simpleType doit être présent.
it: Il tipo di contenuto del tipo di base deve essere una definizione di tipo semplice o deve essere mista e l'elemento simpleType figlio deve essere presente.
ja: 基本データ型のコンテンツ型は単純型の定義でなければなりません。そうでない場合、mixed で simpleType の子が存在しなければなりません。
ko: 기본 형식의 콘텐츠 형식은 단순 형식 정의여야 합니다. 그렇지 않은 경우 혼합되어 simpleType 자식이 있어야 합니다.
pl: Typ zawartości typu podstawowego musi być definicją typu prostego lub być mieszany; element podrzędny simpleType musi być obecny.
pt_br: O tipo de conteúdo do tipo base deve ser uma definição de tipo simples ou mista e o simpleType filho deve estar presente.
ru: Тип содержимого этого базового типа должен являться определением простого типа или быть комбинированным; кроме того, должен быть указан дочерний для simpleType элемент.
tr: Temel türün içerik türü bir basit tür tanımı olmalı ya da karışık olmalı ve simpleType bir altı bulunmalı.
zh_hans: 基类型的内容类型必须是简单类型定义，或者必须是混合型，但必须存在 simpleType 子级。
zh_hant: 基底類型的內容類型必須是簡單型別的定義，或是混合的定義，且一定要有 simpleType 子系。

# Sch_NotTokenString
source: line-feed (#xA) or tab (#x9) characters, leading or trailing spaces and sequences of one or more spaces (#x20) are not allowed in 'xs:token'.
cs: V typu xs:token nejsou povoleny znaky LF (#xA), tabulátory (#x9), mezery na začátku nebo na konci řetězce, ale ani posloupnosti mezer (#x20).
de: In "xs:token" sind die Zeichen für Zeilenvorschub (#xA) oder Tabstopp (#x9), vorangestellte oder nachgestellte Leerzeichen sowie Sequenzen mit einem oder mehreren Leerzeichen (#x20) nicht zulässig.
es: Los caracteres de salto de línea (#xA) o tabulación (#x9) y los espacios en blanco y secuencias iniciales o finales de uno o más espacios (#x20) no se permiten en xs:token.
fr: 'xs:token' n'autorise pas les caractères saut de ligne (#xA) ou tabulation (#x9), ni les espaces de début ou de fin et les séquences d'un ou de plusieurs espaces (#x20).
it: I caratteri di avanzamento riga (#xA) o di tabulazione (#x9), gli spazi iniziali e finali e le sequenze di due o più spazi (#x20) non sono consentiti in 'xs:token'.
ja: 'xs:token' には、改行 (#xA) またはタブ (#x9) の各文字、先頭または末尾のスペース、および先頭または末尾の 1 つ以上の連続したスペース (#x20) を記述できません。
ko: 'xs:token'에서는 줄 바꿈(#xA) 또는 탭 문자(#x9), 선행 또는 후행 공백 및 하나 이상의 공백으로 구성된 시퀀스(#x20)를 사용할 수 없습니다.
pl: Element „xs:token” nie może zawierać znaków wysuwu wiersza (#xA), znaków tabulacji (#x9), spacji wiodących i końcowych, jednej spacji ani sekwencji składającej się z co najmniej dwóch spacji (#x20).
pt_br: caracteres de alimentação de linha (#xA) ou de tabulação (#x9), espaços à esquerda ou à direita e sequências de dois ou mais espaços (#x20) não são permitidos em 'xs:token'.
ru: Знаки перевода строки (#xA) и табуляции (#x9), начальные и конечные пробелы, а также последовательности из одного и более пробелов (#x20) недопустимы в xs:token.
tr: 'xs:token' içinde, satır başı (#xA) veya sekme (#x9) karakterlerine, başında veya sonunda boşluk veya içinde bir veya daha fazla boşluk bulunan (#x20) karakterlerine izin verilmez.
zh_hans: xs:token 中不允许出现换行符(#xA)或制表符(#x9)、前导或尾随空格以及包含一个或多个空格的序列(#x20)。
zh_hant: xs:token 中不允許換行字元 (#xA)、定位字元 (#x9)、前端或後端空格或一或多個連續的空格 [#x20]。

# Sch_NotXsiAttribute
source: The attribute '{0}' does not match one of the four allowed attributes in the 'xsi' namespace.
cs: Atribut {0} neodpovídá jednomu ze čtyř povolených atributů v oboru názvů xsi.
de: Das {0}-Attribut entspricht keinem der vier zulässigen Attribute im xsi-Namespace.
es: El atributo "{0}" no coincide con uno de los cuatro atributos permitidos en el espacio de nombres "xsi".
fr: L'attribut '{0}' ne correspond à aucun des quatre attributs autorisés dans l'espace de noms 'xsi'.
it: L'attributo '{0}' non corrisponde a uno dei quattro attributi consentiti nello spazio dei nomi 'xsi'.
ja: 属性 '{0}' は、'xsi' 名前空間で許可されている 4 つの属性のいずれにも一致しません。
ko: 특성 '{0}'은(는) 'xsi' 네임스페이스에서 허용되는 네 가지 특성 중 하나와 일치하지 않습니다.
pl: Atrybut „{0}” nie jest zgodny z jednym z czterech dozwolonych elementów w przestrzeni nazw „xsi”.
pt_br: O atributo '{0}' não corresponde a nenhum dos quatro atributos permitidos no namespace 'xsi'.
ru: Атрибут "{0}" не соответствует одному из разрешенных атрибутов в пространстве имен xsi.
tr: '{0}' özniteliği, 'xsi' ad alanında izin verilen dört öznitelikten biriyle eşleşmiyor.
zh_hans: 特性“{0}”与 "xsi" 命名空间中允许的四个特性中的某一个不匹配。
zh_hant: 屬性 '{0}' 與 xsi 命名空間中允許的四個屬性不符。

# Sch_NotationAttributeOnEmptyElement
source: An attribute of type NOTATION must not be declared on an element declared EMPTY.
cs: Atribut typu NOTATION nesmí být deklarován pro element deklarovaný jako EMPTY.
de: Ein Attribut vom Typ NOTATION darf nicht für ein als EMPTY deklariertes Element deklariert werden.
es: Un atributo de tipo NOTATION no puede declararse en un elemento de tipo EMPTY.
fr: Un attribut de type NOTATION ne doit pas être déclaré sur un élément déclaré EMPTY.
it: Un attributo di tipo NOTATION non deve essere dichiarato in un elemento dichiarato EMPTY.
ja: EMPTY と宣言されている要素に対して、NOTATION 型の属性を宣言することはできません。
ko: NOTATION 형식의 특성은 EMPTY로 선언된 요소에서 선언되지 않아야 합니다.
pl: Nie można deklarować atrybutu typu NOTATION na elemencie zadeklarowanym jako EMPTY.
pt_br: Um atributo do tipo NOTATION não deve ser declarado em um elemento declarado EMPTY.
ru: Атрибут с типом NOTATION не должен объявляться для элемента, объявленного как EMPTY.
tr: NOTATION türü bir özniteliğin EMPTY olarak bildirilmiş bir öğede bildirimi yapılmamalıdır.
zh_hans: 不得在声明为 EMPTY 的元素上声明 NOTATION 类型的特性。
zh_hant: 不可在已宣告為 EMPTY 的元素上宣告類型 NOTATION 的屬性。

# Sch_NotationRequired
source: NOTATION cannot be used directly in a schema; only data types derived from NOTATION by specifying an enumeration value can be used in a schema. All enumeration facet values must match the name of a notation declared in the current schema.
cs: Typ NOTATION nelze ve schématu použít přímo. Ve schématu lze použít pouze datové typy odvozené od typu NOTATION určením hodnoty výčtu. Všechny hodnoty omezujících vlastností výčtu musí odpovídat názvu notace deklarované v aktuálním schématu.
de: NOTATION kann nicht direkt in einem Schema verwendet werden. Nur durch Angabe eines Enumerationswerts von NOTATION abgeleitete Datentypen können in einem Schema verwendet werden. Alle Enumerationsfacetwerte müssen mit dem Namen einer im aktuellen Schema deklarierten Notation übereinstimmen.
es: No se puede usar NOTATION directamente en un esquema; solo los tipos de datos que se deriven de NOTATION mediante la especificación de un valor de enumeración pueden usarse en un esquema. Los valores de todas las facetas de enumeración deben coincidir con el nombre de una notación declarada en el esquema actual.
fr: NOTATION ne peut pas être utilisé directement dans un schéma. Seuls les types de données dérivés de NOTATION via la spécification d'une valeur d'énumération peuvent être utilisés dans un schéma. Toutes les valeurs des facettes d'énumération doivent correspondre au nom d'une notation déclarée dans le schéma actuel.
it: Non è possibile usare NOTATION direttamente in uno schema. In uno schema si possono usare solo i tipi di dati derivati da NOTATION specificando un valore di enumerazione. I valori di tutti i facet di enumerazione devono inoltre corrispondere al nome di una notazione dichiarata nello schema corrente.
ja: NOTATION をスキーマで直接使うことはできません。列挙型の値を指定することによって NOTATION から派生したデータ型のみスキーマで使用できます。さらに、すべての列挙ファセット値は現在のスキーマで宣言された NOTATION の名前と一致しなければなりません。
ko: NOTATION을 스키마에 직접 사용할 수 없습니다. 열거형 값을 지정하여 NOTATION에서 파생된 데이터 형식만 스키마에 사용할 수 있습니다. 모든 열거형 패싯 값은 현재 스키마에서 선언된 표기법의 이름과 일치해야 합니다.
pl: Element NOTATION nie może być używany bezpośrednio w schemacie; w schemacie mogą być użyte jedynie typy danych pochodzące od elementu NOTATION utworzone przez określenie wartości wyliczenia. Wszystkie wartości aspektu wyliczenia muszą odpowiadać nazwie notacji zadeklarowanej w bieżącym schemacie.
pt_br: NOTATION não pode ser usada diretamente em um esquema. Só poderão ser usados em esquemas os tipos de dados derivados de NOTATION que especifiquem um valor de enumeração. Todos os valores da faceta de enumeração devem corresponder ao nome de uma notação declarada no esquema atual.
ru: Тип NOTATION не может использоваться в схеме напрямую; в схеме могут употребляться только производные от NOTATION типы данных путем задания значения перечисления. Все значения аспекта-перечисления должны соответствовать имени нотации, объявленной в текущей схеме.
tr: NOTATION, şemada doğrudan kullanılamaz; şemada yalnızca bir sabit listesi değeri belirtilerek NOTATION'dan türetilen veri türleri kullanılabilir. Tüm sabit listesi modeli değerleri, geçerli şemada bildirilen bir yazım biçimi adıyla eşleşmelidir.
zh_hans: 不能在架构中直接使用 NOTATION；只有通过指定枚举值从 NOTATION 派生的数据类型才可以在架构中使用。所有枚举方面值必须与当前架构中声明的表示法的名称匹配。
zh_hant: 無法在結構描述中直接使用 NOTATION。只有經由指定列舉值從 NOTATION 衍生的資料類型，才可用於結構描述。所有列舉 Facet 值都必須符合目前結構描述中所宣告的標記法名稱。

# Sch_NotationValue
source: '{0}' is not in the notation list.
cs: Hodnota {0} není v seznamu notací.
de: "{0}" ist nicht in der Notationliste enthalten.
es: "{0}" no está en la lista de notaciones.
fr: '{0}' ne se trouve pas dans la liste de notation.
it: '{0}' non è presente nell'elenco delle notazioni.
ja: '{0}' は表記一覧にありません。
ko: '{0}'이(가) 표기법 목록에 없습니다.
pl: Brak elementu „{0}” na liście notacji.
pt_br: '{0}' não está na lista de notações.
ru: "{0}" отсутствует в списке нотаций.
tr: '{0}', yazım biçimi listesinde yok.
zh_hans: “{0}”不在表示法列表中。
zh_hant: '{0}' 不在標記法清單中。

# Sch_NullValue
source: Value cannot be null.
cs: Hodnota nemůže být null.
de: Der Wert darf nicht NULL sein.
es: El valor no puede ser nulo.
fr: Valeur null non autorisée.
it: Il valore non può essere Null.
ja: 値を null にすることはできません。
ko: 값은 null일 수 없습니다.
pl: Wartość null jest niedozwolona.
pt_br: O valor não pode ser nulo.
ru: Значение не может быть NULL.
tr: Değer null olamaz.
zh_hans: 值不能为 null。
zh_hant: 值不可以是 null。

# Sch_OptionalDefaultAttribute
source: The 'use' attribute must be optional (or absent) if the default attribute is present.
cs: Je-li uveden atribut default, musí být atribut use volitelný (nebo zcela chybět).
de: Das use-Attribut muss optional (oder nicht vorhanden) sein, wenn das Standardattribut vorhanden ist.
es: El atributo "use" debe ser opcional (o no estar presente) si el atributo default está presente.
fr: L'attribut 'use' doit être facultatif (ou absent) si l'attribut par défaut est présent.
it: Se è presente l'attributo predefinito, l'attributo 'use' deve essere facoltativo (o assente).
ja: 'use' 属性は、既定値が存在する場合は、任意 (または存在しない) でなければなりません。
ko: 기본 특성이 있는 경우 'use' 특성은 선택적으로 사용하거나 없어야 합니다.
pl: Jeśli atrybut domyślny jest obecny, atrybut „use” musi być opcjonalny (lub nieobecny).
pt_br: O atributo 'use' deverá ser opcional (ou ausente) se o atributo padrão estiver presente.
ru: Если указан атрибут по умолчанию, то атрибут use должен быть необязательным (или отсутствовать).
tr: Varsayılan öznitelik varsa, 'use' özniteliği isteğe bağlı (veya yok) olmamalıdır.
zh_hans: 如果存在默认特性，则 "use" 特性必须是可选的(或不存在)。
zh_hant: 如果有預設的屬性，則 'use' 屬性必須為選擇性的屬性 (或不可使用)。

# Sch_ParEntityRefNesting
source: The parameter entity replacement text must nest properly within markup declarations.
cs: Náhradní text parametru entity musí být správně vnořen uvnitř deklarací značek.
de: Parameterentität-Ersetzungstext muss innerhalb der Markupdeklarationen korrekt geschachtelt sein.
es: El texto para reemplazar la entidad del parámetro debe estar anidado correctamente dentro de las declaraciones de marcado.
fr: Le texte de remplacement de l'entité de paramètre doit être imbriqué correctement dans les déclarations de balisage.
it: Il testo di sostituzione dell'entità parametro deve essere annidato correttamente nelle dichiarazioni dei markup.
ja: パラメーター エンティティ置換テキストは、マークアップ宣言内で正しく入れ子にしなければなりません。
ko: 매개 변수 엔터티 대체 텍스트를 태그 선언 내에 올바르게 중첩시켜야 합니다.
pl: Tekst zamiany jednostki parametru musi być prawidłowo zagnieżdżony w deklaracjach znacznika.
pt_br: O texto de substituição da entidade de parâmetro deve ser aninhado adequadamente nas declarações de marcação.
ru: Текст, подставляемый вместо сущности параметра, должен быть надлежащим образом заключен в объявления разметки.
tr: Parametre varlığı değiştirme metni işaretleme bildirimlerinde düzgün şekilde iç içe olmalıdır.
zh_hans: 参数实体替换文本必须正确嵌套在标记声明中。
zh_hant: 參數實體取代文字必須在標記宣告中適當地巢狀化。

# Sch_PatternConstraintFailed
source: The Pattern constraint failed.
cs: Omezení Pattern se nezdařilo.
de: Fehler bei der Pattern-Einschränkung.
es: Error de restricción de patrón.
fr: Échec de la contrainte Pattern.
it: Il vincolo Pattern non è riuscito.
ja: Pattern 制約が失敗しました。
ko: Pattern 제약 조건이 실패했습니다.
pl: Błąd ograniczenia elementu Pattern.
pt_br: Falha na restrição Pattern.
ru: Сбой ограничения Pattern.
tr: Pattern kısıtlaması başarısız oldu.
zh_hans: 模式约束失败。
zh_hant: Pattern 條件約束失敗。

# Sch_PatternFacetInvalid
source: The Pattern constraining facet is invalid - {0}
cs: Omezující vlastnost Pattern je neplatná – {0}
de: Ungültiges Pattern-Einschränkungsfacet – {0}
es: Faceta de restricción de patrón no válida - {0}
fr: La facette de contrainte Pattern est non valide : {0}
it: Il facet vincolante Pattern non è valido - {0}
ja: Pattern 制約ファセットが無効です。{0}
ko: Pattern 제약 패싯이 잘못되었습니다. {0}
pl: Element Pattern ograniczający aspekt jest nieprawidłowy — {0}
pt_br: A faceta de restrições Pattern é inválida – {0}
ru: Недопустимый ограничивающий аспект Pattern — {0}
tr: Pattern kısıtlama modeli geçersiz - {0}
zh_hans: 模式约束方面无效 - {0}
zh_hant: Pattern 條件約束 Facet 無效 - {0}

# Sch_PatternFacetProhibited
source: The Pattern constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost Pattern je pro {0} zakázána.
de: Das Pattern-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de patrón prohibida para "{0}".
fr: La facette de contrainte Pattern est interdite pour '{0}'.
it: Il facet vincolante Pattern non è consentito per '{0}'.
ja: Pattern 制約ファセットは '{0}' で使用できません。
ko: Pattern 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element Pattern ograniczający aspekt jest zabroniony dla elementu „{0}”.
pt_br: A faceta de restrições Pattern é proibida para '{0}'.
ru: Ограничивающий аспект Pattern запрещен для "{0}".
tr: '{0}' için Pattern kısıtlama modeli kullanılamaz.
zh_hans: 模式约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 Pattern 條件約束 Facet。

# Sch_ProhibitedAttribute
source: The '{0}' attribute is not allowed.
cs: Atribut {0} není povolen.
de: Das {0}-Attribut ist nicht zulässig.
es: No se permite el atributo "{0}".
fr: L'attribut '{0}' est interdit.
it: L'attributo '{0}' non è consentito.
ja: '{0}' 属性は使用できません。
ko: '{0}' 특성을 사용할 수 없습니다.
pl: Atrybut „{0}” jest niedozwolony.
pt_br: O atributo '{0}' não é permitido.
ru: Атрибут "{0}" не разрешен.
tr: '{0}' özniteliğine izin verilmez.
zh_hans: 不允许使用“{0}”特性。
zh_hant: 不允許 '{0}' 屬性。

# Sch_RedefineLocation
source: The 'redefine' element cannot appear at this location.
cs: Element redefine nemůže být použit na tomto umístění.
de: Das redefine-Element kann an dieser Stelle nicht verwendet werden.
es: El elemento "redefine" no puede aparecer en esta ubicación.
fr: L'élément 'redefine' ne peut pas s'afficher à cet emplacement.
it: In questa posizione non può essere presente l'elemento 'redefine'.
ja: 'redefine' 要素はこの場所に指定できません。
ko: 'redefine' 요소는 이 위치에 사용할 수 없습니다.
pl: Element „redefine” nie może pojawiać się w tym miejscu.
pt_br: O elemento 'redefine' não pode aparecer neste local.
ru: Элемент redefine не может находиться в этом месте.
tr: 'redefine' öğesi bu konumda bulunamaz.
zh_hans: "redefine" 元素不能出现在此位置。
zh_hant: 'redefine' 元素不可以出現在這個位置。

# Sch_RedefineNoSchema
source: 'SchemaLocation' must successfully resolve if <redefine> contains any child other than <annotation>.
cs: Pokud element <redefine> obsahuje jakýkoli podřízený element jiný než element <annotation>, vlastnost SchemaLocation musí být úspěšně rozpoznána.
de: "SchemaLocation" muss erfolgreich aufgelöst werden, wenn <redefine> andere untergeordnete Elemente als <annotation> enthält.
es: "SchemaLocation" se debe resolver correctamente si <redefine> contiene un elemento secundario que no sea <annotation>.
fr: La résolution de 'SchemaLocation' doit être réussie si <redefine> contient un autre enfant que <annotation>.
it: Se <redefine> contiene elementi figlio diversi da <annotation>, 'SchemaLocation' deve essere risolto correttamente.
ja: 'SchemaLocation' は、<redefine> が <annotation> 以外の子を含む場合は、正常に解決しなければなりません。
ko: 'SchemaLocation'은 <redefine>에 <annotation>이 아닌 다른 자식이 포함되어 있는지 여부를 확인해야 합니다.
pl: Rozpoznanie elementu „SchemaLocation” musi zakończyć się pomyślnie, jeśli element <redefine> zawiera element podrzędny inny niż <annotation>.
pt_br: 'SchemaLocation' deverá ser resolvido com êxito se <redefine> contiver qualquer filho diferente de <annotation>.
ru: Если <redefine> содержит любые дочерние элементы, кроме <annotation>, требуется успешное разрешение SchemaLocation.
tr: <redefine>, <annotation> dışında bir alt öğe içeriyorsa, 'SchemaLocation' başarıyla çözümlenmelidir.
zh_hans: 如果 <redefine> 包含除 <annotation> 以外的任何子级，则必须成功解析 "SchemaLocation"。
zh_hant: 若 <redefine> 中含有除了 <annotation> 以外的任何子系，則 SchemaLocation 必定可成功解析。

# Sch_RefInvalidAttribute
source: Reference to invalid attribute '{0}'.
cs: Odkaz na neplatný atribut {0}
de: Verweis auf das ungültige Attribut "{0}".
es: Referencia a un atributo "{0}" no válido.
fr: Référence à un attribut non valide '{0}'.
it: Riferimento all'attributo non valido '{0}'.
ja: 無効な属性 '{0}' への参照です。
ko: 잘못된 특성 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieprawidłowego atrybutu „{0}”.
pt_br: Referência a atributo inválido '{0}'.
ru: Ссылка на недопустимый атрибут "{0}".
tr: Geçersiz '{0}' özniteliğine başvuru.
zh_hans: 对无效特性“{0}”的引用。
zh_hant: 參考無效的屬性 '{0}'。

# Sch_RefInvalidCardin
source: Keyref '{0}' has different cardinality as the referred key or unique element.
cs: Element Keyref {0} má jinou mohutnost než odkazovaný element key nebo unique.
de: Keyref "{0}" hat eine andere Kardinalität als das key- oder unique-Element, auf das verwiesen wird.
es: Keyref "{0}" tiene una cardinalidad diferente al elemento key o unique al que se hace referencia.
fr: Keyref '{0}' a une cardinalité différente de l'élément key ou unique référencé.
it: L'elemento Keyref '{0}' ha una cardinalità diversa rispetto all'elemento key o unique a cui si fa riferimento.
ja: Keyref '{0}' は参照キーとしては異なるカーディナリティを持っているか、または一意の要素です。
ko: Keyref '{0}'과(와) 참조된 key 또는 unique 요소의 카디널리티가 다릅니다.
pl: Element Keyref „{0}” ma inną liczebność niż element key lub unique, do którego się odwołuje.
pt_br: A Keyref '{0}' tem cardinalidade diferente do elemento key ou unique referenciado.
ru: Элемент Keyref "{0}" и элемент key или unique, на который он ссылается, имеют разную кратность.
tr: Keyref '{0}', başvurulan anahtar veya benzersiz öğeden farklı kardinaliteye sahip.
zh_hans: Keyref“{0}”与引用的 key 或 unique 元素具有不同的基数。
zh_hant: Keyref '{0}' 使用了不同的基數作為參考的索引鍵或唯一元素。

# Sch_RefInvalidElement
source: Reference to invalid element '{0}'.
cs: Odkaz na neplatný element {0}
de: Verweis auf das ungültige Element "{0}".
es: Referencia a un elemento "{0}" no válido.
fr: Référence à un élément non valide '{0}'.
it: Riferimento all'elemento non valido '{0}'.
ja: 無効な要素 '{0}' への参照です。
ko: 잘못된 요소 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieprawidłowego elementu „{0}”.
pt_br: Referência a elemento inválido '{0}'.
ru: Ссылка на недопустимый элемент "{0}".
tr: Geçersiz '{0}' öğesine başvuru.
zh_hans: 对无效元素“{0}”的引用。
zh_hant: 參考無效的元素 '{0}'。

# Sch_RefInvalidIdentityConstraint
source: Reference to an invalid identity constraint, '{0}'.
cs: Odkaz na neplatné omezení identity {0}
de: Verweis auf eine ungültige Identitätseinschränkung, "{0}".
es: Referencia a una restricción de identidad no válida, "{0}".
fr: Référence à une contrainte d'identité non valide '{0}'.
it: Riferimento a un vincolo di identità non valido '{0}'.
ja: 無効な ID 制約 '{0}' への参照です。
ko: 잘못된 identity 제약 조건 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieprawidłowego ograniczenia tożsamości: „{0}”.
pt_br: Referência a uma restrição de identidade inválida '{0}'.
ru: Ссылка на недопустимое ограничение по идентификатору "{0}".
tr: Geçersiz '{0}' kimlik kısıtlamasına başvuru.
zh_hans: 对无效标识约束“{0}”的引用。
zh_hant: 參考無效的身分識別條件約束 '{0}'。

# Sch_RefNotInScope
source: The Keyref '{0}' cannot find the referred key or unique in scope.
cs: Element Keyref {0} nemůže v rámci oboru najít odkazovaný element key nebo unique.
de: Keyref "{0}" kann das key- oder unique-Element, auf das verwiesen wird, nicht im Bereich finden.
es: Keyref "{0}" no puede encontrar en el ámbito el elemento key o unique al que se hace referencia.
fr: Keyref '{0}' ne trouve pas l'élément key ou unique référencé dans la portée.
it: L'elemento Keyref '{0}' non riesce a trovare nell'ambito l'elemento key o unique a cui viene fatto riferimento.
ja: Keyref '{0}' が、参照キーを見つけることができないか、またはスコープ内で一意です。
ko: Keyref '{0}'이(가) 참조되는 key 또는 unique를 범위 안에서 찾을 수 없습니다.
pl: Element Keyref „{0}” nie może znaleźć w zakresie elementu „key” lub „unique”, do którego się odwołuje.
pt_br: A Keyref '{0}' não pode encontrar, no escopo, o elemento key ou unique referenciado.
ru: Keyref "{0}" не может найти в области элемент key или unique, на который ссылается.
tr: Keyref '{0}', başvurulan anahtarı veya benzersiz öğeyi kapsam içinde bulamıyor.
zh_hans: Keyref“{0}”无法在范围内找到引用的 key 或 unique。
zh_hant: Keyref '{0}' 在範圍中找不到參考的索引鍵或唯一項目。

# Sch_ReftoKeyref
source: The '{0}' Keyref can refer to key or unique only.
cs: Element Keyref {0} může odkazovat pouze na element key nebo unique.
de: Keyref "{0}" kann nur auf ein key- oder unique-Element verweisen.
es: Keyref "{0}" solo puede hacer referencia a un elemento key o unique.
fr: Keyref '{0}' ne peut faire référence qu'à un élément key ou unique.
it: L'elemento Keyref '{0}' può fare riferimento solo a un elemento key o unique.
ja: '{0}' Keyref はキーを参照することができるか、または一意です。
ko: Keyref '{0}'은(는) key 또는 unique만 참조할 수 있습니다.
pl: Element Keyref „{0}” może odwoływać się jedynie do elementu key lub unique.
pt_br: A Keyref '{0}' só pode fazer referência ao elemento key ou unique.
ru: Элемент Keyref "{0}" может ссылаться только на элемент key или unique.
tr: Keyref '{0}' yalnızca key veya unique başvurusu yapabilir.
zh_hans: “{0}”Keyref 只能引用 key 或 unique。
zh_hant: '{0}' Keyref 只可參考索引鍵或唯一的索引鍵。
