Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlIllegalArrayElement
source: An element declared at the top level of a schema cannot have maxOccurs > 1. Provide a wrapper element for '{0}' by using XmlArray or XmlArrayItem instead of XmlElementAttribute, or by using the Wrapped parameter style.
cs: Pro element deklarovaný na nejvyšší úrovni schématu nemůže platit maxOccurs > 1. Poskytněte element obálky pro {0}, a to použitím atributu XmlArray nebo XmlArrayItem místo atributu XmlElementAttribute, nebo použitím stylu parametru Wrapped.
de: Für ein auf oberster Schemaebene deklariertes Element darf maxOccurs nicht > 1 sein. Geben Sie ein Wrapperelement für "{0}" an, indem Sie XmlArray oder XmlArrayItem anstelle von XmlElementAttribute verwenden oder indem Sie den Wrapped-Parameterstil verwenden.
es: El elemento declarado en el nivel superior de un esquema no puede tener maxOccurs > 1. Debe proporcionar un elemento contenedor para "{0}" mediante XmlArray o XmlArrayItem en vez de XmlElementAttribute, o mediante el estilo de parámetro Wrapped.
fr: Un élément déclaré au niveau supérieur d'un schéma ne peut pas avoir maxOccurs > 1. Fournissez un élément wrapper pour '{0}' en utilisant XmlArray ou XmlArrayItem à la place de XmlElementAttribute ou en utilisant le style de paramètre Wrapped.
it: L'attributo maxOccurs di un elemento dichiarato al primo livello di uno schema non può essere impostato su un valore maggiore di 1. Fornire un elemento wrapper per '{0}' usando XmlArray o XmlArrayItem invece di XmlElementAttribute, oppure usando lo stile di parametro Wrapped.
ja: スキーマのトップ レベルで宣言された要素に maxOccurs > 1 の値を含めることはできません。XmlElementAttribute ではなく、XmlArray または XmlArrayItem 属性を使うか、または Wrapped パラメーター スタイルを使って '{0}' のラッパー要素を指定してください。
ko: 스키마의 맨 위에 선언된 요소에 maxOccurs를 1보다 큰 값으로 지정할 수 없습니다. XmlElementAttribute 대신 XmlArray 또는 XmlArrayItem을 사용하거나 Wrapped 매개 변수 스타일을 사용하여 '{0}'에 래퍼 요소를 제공하세요.
pl: Element zadeklarowany na najwyższym poziomie schematu nie może mieć elementu maxOccurs > 1. Dostarcz element otoki dla elementu „{0}”, używając elementu XmlArray lub XmlArrayItem zamiast elementu XmlElementAttribute albo używając stylu parametru Wrapped.
pt_br: Um elemento declarado no nível superior de um esquema não pode ter maxOccurs > 1. Forneça um elemento wrapper para '{0}' usando XmlArray ou XmlArrayItem em vez de XmlElementAttribute ou usando o estilo de parâmetro Wrapped.
ru: Значение maxOccurs для элемента, объявленного на верхнем уровне схемы, не может превышать 1. Укажите элемент-оболочку для "{0}", используя XmlArray или XmlArrayItem вместо XmlElementAttribute либо используя стиль параметра Wrapped.
tr: Şemanın en üst düzeyinde tanımlaman bir öğe için maxOccurs > 1 olamaz. XmlElementAttribute yerine XmlArray veya XmlArrayItem ya da Wrapped parametre stili kullanarak '{0}' için bir sarmalayıcı öğe belirtin.
zh_hans: 在架构的顶级声明的元素的 maxOccurs 不能大于 1。使用 XmlArray 或 XmlArrayItem 而不是 XmlElementAttribute，或使用 Wrapped 参数样式为“{0}”提供包装器元素。
zh_hant: 在結構描述最上層宣告的元素不可擁有 maxOccurs > 1。經由使用 XmlArray 或 XmlArrayItem，而非使用 XmlElementAttribute，或使用 Wrapped 參數樣式，可為 '{0}' 提供包裝函式元素。

# XmlIllegalArrayTextAttribute
source: Member '{0}' cannot be encoded using the XmlText attribute. You may use the XmlText attribute to encode primitives, enumerations, arrays of strings, or arrays of XmlNode.
cs: Člen {0} nemůže být kódován pomocí atributu XmlText. Atribut XmlText lze použít ke kódování primitiv, výčtů, polí řetězců nebo polí typu XmlNode.
de: Der Member "{0}" kann nicht mit dem XmlText-Attribut codiert werden. Sie können das XmlText-Attribut verwenden, um Primitive, Enumerationen, Zeichenfolgenarrays oder XmlNode-Arrays zu codieren.
es: No se puede codificar el miembro "{0}" utilizando el atributo XmlText. Puede utilizar el atributo XmlText para codificar tipos primitivos, enumeraciones, matrices de cadenas o matrices de XmlNode.
fr: Le membre '{0}' ne peut pas être encodé avec l'attribut XmlText. Vous pouvez utiliser l'attribut XmlText pour encoder les primitives, énumérations, tableaux de chaînes ou tableaux de XmlNode.
it: Il membro '{0}' non può essere codificato con l'attributo XmlText. L'attributo XmlText può essere usato per codificare primitive, enumerazioni, matrici di stringhe o matrici di XmlNode.
ja: メンバー '{0}' は XmlText 属性を使用してエンコードできません。プリミティブ、列挙、文字列の配列、または XmlNode の配列をエンコードするには、XmlText 属性を使用してください。
ko: XmlText 특성을 사용하여 '{0}' 멤버를 인코딩할 수 없습니다. XmlText 특성을 사용하여 기본 형식, 열거형, 문자열 배열 또는 XmlNode 배열을 인코딩할 수 있습니다.
pl: Składowa „{0}” nie może zostać zakodowana przy użyciu atrybutu XmlText. Możesz użyć atrybutu XmlText do kodowania obiektów pierwotnych, wyliczeń, tablic ciągów lub tablic elementów XmlNode.
pt_br: O membro '{0}' não pode ser codificado por meio do atributo XmlText. É possível usar o atributo XmlText para codificar primitivos, enumerações, matrizes de cadeias de caracteres ou matrizes de XmlNode.
ru: Невозможно закодировать член "{0}", используя атрибут XmlText. Для кодирования примитивов, перечислений, массивов строк и массивов XmlNode можно использовать атрибут XmlText.
tr: '{0}' üyesi XmlText özniteliği kullanılarak kodlanamaz. XmlText özniteliğini temel türleri, sabit listelerini, dize dizilerini ve XmlNode dizilerini kodlamak için kullanabilirsiniz.
zh_hans: 不能使用 XmlText 特性对成员“{0}”进行编码。可以用 XmlText 特性对基元、枚举、字符串数组或 XmlNode 数组进行编码。
zh_hant: 無法使用 XmlText 屬性對成員 '{0}' 進行編碼。您可使用 XmlText 屬性對基本、列舉、字串陣列或 XmlNode 陣列進行編碼。

# XmlIllegalAttrOrText
source: Cannot serialize member '{0}' of type {1}. XmlAttribute/XmlText cannot be used to encode complex types.
cs: Člen {0} typu {1} nelze serializovat. Atributy XmlAttribute a XmlText nelze použít ke kódování složitých typů.
de: Der Member "{0}" vom Typ {1} kann nicht serialisiert werden. XmlAttribute/XmlText kann nicht zum Codieren von komplexen Typen verwendet werden.
es: No se puede serializar el miembro "{0}" del tipo {1}. No se puede utilizar XmlAttribute o XmlText para codificar tipos complejos.
fr: Impossible de sérialiser le membre '{0}' de type {1}. XmlAttribute/XmlText ne peut pas être utilisé pour encoder des types complexes.
it: Non è possibile serializzare il membro '{0}' di tipo {1}. XmlAttribute/XmlText non può essere usato per codificare tipi complessi.
ja: 型 {1} のメンバー '{0}' はシリアル化できません。XmlAttribute および XmlText は、複合型のエンコードには使用できません。
ko: {1} 형식의 멤버 '{0}'을(를) 직렬화할 수 없습니다. XmlAttribute/XmlText는 복합 형식을 인코딩하는 데 사용할 수 없습니다.
pl: Nie można serializować składowej „{0}” typu {1}. Elementy XmlAttribute/XmlText nie mogą być używane do kodowania typów złożonych.
pt_br: Não é possível serializar o membro '{0}' do tipo {1}. XmlAttribute/XmlText não pode ser usado para codificar tipos complexos.
ru: Невозможно сериализовать член "{0}" типа {1}. XmlAttribute/XmlText не может использоваться для кодирования составных типов.
tr: {1} türündeki '{0}' üyesi serileştirilemiyor. XmlAttribute ve XmlText, karmaşık türleri kodlamada kullanılamaz.
zh_hans: 无法序列化类型 {1} 的成员“{0}”。XmlAttribute/XmlText 不能用于对复杂类型进行编码。
zh_hant: 無法序列化類型 {1} 的成員 '{0}'。XmlAttribute/XmlText 不可用來對複雜類型進行編碼。

# XmlIllegalAttrOrTextInterface
source: Cannot serialize member '{0}' of type {1}. XmlAttribute/XmlText cannot be used to encode types implementing {2}.
cs: Člen {0} typu {1} nelze serializovat. Atributy XmlAttribute a XmlText nelze použít ke kódování typů implementujících rozhraní {2}.
de: Der Member "{0}" vom Typ {1} kann nicht serialisiert werden. XmlAttribute/XmlText kann nicht zum Codieren von Typen verwendet werden, die {2} implementieren.
es: No se puede serializar el miembro "{0}" del tipo {1}. No se puede utilizar XmlAttribute o XmlText para codificar tipos que implementan {2}.
fr: Impossible de sérialiser le membre '{0}' de type {1}. XmlAttribute/XmlText ne peut pas être utilisé pour encoder les types implémentant {2}.
it: Non è possibile serializzare il membro '{0}' di tipo {1}. XmlAttribute/XmlText non può essere usato per codificare tipi che implementano {2}.
ja: 型 {1} のメンバー '{0}' はシリアル化できません。XmlAttribute および XmlText は、{2} を実装している型のエンコードには使用できません。
ko: {1} 형식의 멤버 '{0}'을(를) 직렬화할 수 없습니다. XmlAttribute/XmlText는 {2}을(를) 구현하는 형식을 인코딩하는 데 사용할 수 없습니다.
pl: Nie można serializować składowej „{0}” typu {1}. Elementy XmlAttribute/XmlText nie mogą być używane do kodowania typów implementujących element {2}.
pt_br: Não é possível serializar o membro '{0}' do tipo {1}. Não é possível usar XmlAttribute/XmlText para codificar tipos implementando {2}.
ru: Невозможно сериализовать член "{0}" типа {1}. XmlAttribute/XmlText не может использоваться для кодирования типов, реализующих {2}.
tr: {1} türündeki '{0}' üyesi serileştirilemiyor. XmlAttribute/XmlText, {2} uygulayan türleri kodlamada kullanılamaz.
zh_hans: 无法序列化 {1} 类型的成员“{0}”。XmlAttribute/XmlText 不能用来对类型实现 {2} 进行编码。
zh_hant: 無法序列化類型 {1} 的成員 '{0}'。XmlAttribute/XmlText 不可用來對類型實作 {2} 進行編碼。

# XmlIllegalAttribute
source: For non-array types, you may use the following attributes: XmlAttribute, XmlText, XmlElement, or XmlAnyElement.
cs: Pro jiné typy než pole můžete použít následující atributy: XmlAttribute, XmlText, XmlElement a XmlAnyElement
de: Für Nicht-Arraytypen können folgende Attribute verwendet werden: XmlAttribute, XmlText, XmlElement oder XmlAnyElement.
es: Para tipos que no sean matrices, puede utilizar los siguiente atributos: XmlAttribute, XmlText, XmlElement o XmlAnyElement.
fr: Pour les types autres que les types tableau, vous pouvez utiliser les attributs suivants : XmlAttribute, XmlText, XmlElement ou XmlAnyElement.
it: Per i tipi non matrice è possibile usare gli attributi seguenti: XmlAttribute, XmlText, XmlElement o XmlAnyElement.
ja: 非配列型に対して、以下の属性を使うことができます: XmlAttribute、XmlText、XmlElement、または XmlAnyElement。
ko: 배열 형식이 아닌 경우 XmlAttribute, XmlText, XmlElement 또는 XmlAnyElement 특성을 사용할 수 있습니다.
pl: Dla typów nietablicowych możesz używać następujących atrybutów: XmlAttribute, XmlText, XmlElement lub XmlAnyElement.
pt_br: Para tipos não matriz, é possível usar os seguintes atributos: XmlAttribute, XmlText, XmlElement ou XmlAnyElement.
ru: Для типов, не являющихся массивами, можно использовать следующие атрибуты: XmlAttribute, XmlText, XmlElement и XmlAnyElement.
tr: Dizi dışındaki türler için şu öznitelikleri kullanabilirsiniz: XmlAttribute, XmlText, XmlElement veya XmlAnyElement.
zh_hans: 对于非数组类型，可以使用以下特性: XmlAttribute、XmlText、XmlElement 或 XmlAnyElement。
zh_hant: 若是非陣列類型，可使用下列屬性: XmlAttribute、XmlText、XmlElement 或 XmlAnyElement。

# XmlIllegalAttributeFlagsArray
source: XmlAttribute cannot be used to encode array of {1}, because it is marked with FlagsAttribute.
cs: Atribut XmlAttribute nelze použít ke kódování pole typu {1}, protože je označeno atributem FlagsAttribute.
de: XmlAttribute kann nicht verwendet werden, um das {1}-Array zu codieren, da es mit FlagsAttribute markiert ist.
es: No se puede utilizar XmlAttribute para codificar la matriz de {1}, porque está marcada con el atributo FlagsAttribute.
fr: XmlAttribute ne permet pas d'encoder un tableau de {1}, car il est marqué avec FlagsAttribute.
it: XmlAttribute non può essere usato per codificare matrici di {1} perché è contrassegnato con FlagsAttribute.
ja: XmlAttribute は、FlagsAttribute でマークされているため、{1} の配列をエンコードするのに使用できません。
ko: XmlAttribute가 FlagsAttribute로 표시되어 있으므로 {1}의 배열을 인코딩하는 데 사용할 수 없습니다.
pl: Element XmlAttribute nie może być używany do kodowania tablicy {1} z powodu oznaczenia flagą FlagsAttribute.
pt_br: XmlAttribute não pode ser usado para codificar a matriz de {1} porque ela está marcada com FlagsAttribute.
ru: Невозможно использовать XmlAttribute для кодирования массива {1}, так как он помечен с помощью FlagsAttribute.
tr: FlagsAttribute ile işaretlenmiş olduğundan {1} dizisini kodlamak için XmlAttribute kullanılamaz.
zh_hans: XmlAttribute 不能用于对 {1} 的数组进行编码，原因是它用 FlagsAttribute 进行标记。
zh_hant: 因為 XmlAttribute 已標示有 FlagsAttribute，所以無法用於對 {1} 的陣列進行編碼。

# XmlIllegalAttributesArrayAttribute
source: XmlAttribute and XmlAnyAttribute cannot be used in conjunction with XmlElement, XmlText, XmlAnyElement, XmlArray, or XmlArrayItem.
cs: Atributy XmlAttribute a XmlAnyAttribute nelze použít současně s atributy XmlElement, XmlText, XmlAnyElement, XmlArray a XmlArrayItem.
de: XmlAttribute und XmlAnyAttribute können nicht zusammen mit XmlElement, XmlText, XmlAnyElement, XmlArray oder XmlArrayItem verwendet werden.
es: No se puede utilizar XmlAttribute y XmlAnyAttribute junto con XmlElement, XmlText, XmlAnyElement, XmlArray, o XmlArrayItem.
fr: XmlAttribute et XmlAnyAttribute ne peuvent pas être utilisés avec XmlElement, XmlText, XmlAnyElement, XmlArray ou XmlArrayItem.
it: Non è possibile usare XmlAttribute e XmlAnyAttribute insieme a XmlElement, XmlText, XmlAnyElement, XmlArray o XmlArrayItem.
ja: XmlAttribute および XmlAnyAttribute を XmlElement、XmlText、XmlAnyElement、XmlArray または XmlArrayItem と組み合わせて使うことはできません。
ko: XmlAttribute와 XmlAnyAttribute는 XmlElement, XmlText, XmlAnyElement, XmlArray 또는 XmlArrayItem과 함께 사용할 수 없습니다.
pl: Elementy XmlAttribute i XmlAnyAttribute nie mogą być używane w połączeniu z elementami XmlElement, XmlText, XmlAnyElement, XmlArray lub XmlArrayItem.
pt_br: XmlAttribute e XmlAnyAttribute não podem ser usados juntamente com XmlElement, XmlText, XmlAnyElement, XmlArray ou XmlArrayItem.
ru: Невозможно использовать XmlAttribute и XmlAnyAttribute совместно с XmlElement, XmlText, XmlAnyElement, XmlArray и XmlArrayItem.
tr: XmlAttribute ve XmlAnyAttribute, XmlElement, XmlText, XmlAnyElement, XmlArray veya XmlArrayItem ile birlikte kullanılamaz.
zh_hans: XmlAttribute 和 XmlAnyAttribute 不能与 XmlElement、XmlText、XmlAnyElement、XmlArray 或 XmlArrayItem 一起使用。
zh_hant: XmlAttribute 和 XmlAnyAttribute 不可以和 XmlElement、XmlText、XmlAnyElement、XmlArray 或 XmlArrayItem 結合使用。

# XmlIllegalDefault
source: The default value for XmlAttribute or XmlElement may only be specified for primitive types.
cs: Výchozí hodnotu atributu XmlAttribute nebo XmlElement lze zadat pouze pro primitivní typy.
de: Der Standardwert für XmlAttribute oder XmlElement kann nur für primitive Typen angegeben werden.
es: Solo puede especificar el valor predeterminado de XmlAttribute o XmlElement para tipos primitivos.
fr: La valeur par défaut pour XmlAttribute ou XmlElement ne peut être spécifiée que pour les types primitifs.
it: Il valore predefinito di XmlAttribute o XmlElement può essere specificato solo per tipi primitivi.
ja: XmlAttribute または XmlElement の既定値はプリミティブ型に対して指定されなければなりません。
ko: XmlAttribute 또는 XmlElement의 기본값은 기본 형식에 대해서만 지정할 수 있습니다.
pl: Domyślna wartość dla elementu XmlAttribute lub XmlElement może być określona tylko dla typów pierwotnych.
pt_br: O valor padrão de XmlAttribute ou XmlElement só pode ser especificado para tipos primitivos.
ru: Значение по умолчанию для XmlAttribute и XmlElement может задаваться только для типов примитивов.
tr: XmlAttribute veya XmlElement varsayılan değeri yalnızca temel türler için belirtilebilir.
zh_hans: 只能为基元类型指定 XmlAttribute 或 XmlElement 的默认值。
zh_hant: 只有基本類型可以指定 XmlAttribute 或 XmlElement 的預設值。

# XmlIllegalElementsArrayAttribute
source: XmlElement, XmlText, and XmlAnyElement cannot be used in conjunction with XmlAttribute, XmlAnyAttribute, XmlArray, or XmlArrayItem.
cs: Atributy XmlElement, XmlText a XmlAnyElement nelze použít současně s atributy XmlAttribute, XmlAnyAttribute, XmlArray a XmlArrayItem.
de: XmlElement, XmlText und XmlAnyElement können nicht zusammen mit XmlAttribute, XmlAnyAttribute, XmlArray oder XmlArrayItem verwendet werden.
es: No se puede utilizar XmlElement, XmlText, y XmlAnyElement junto con XmlAttribute, XmlAnyAttribute, XmlArray, o XmlArrayItem.
fr: XmlElement, XmlText et XmlAnyElement ne peuvent pas être utilisés avec XmlAttribute, XmlAnyAttribute, XmlArray ou XmlArrayItem.
it: Non è possibile usare XmlElement, XmlText e XmlAnyElement insieme a XmlAttribute, XmlAnyAttribute, XmlArray o XmlArrayItem.
ja: XmlElement、XmlText および XmlAnyElement を XmlAttribute、XmlAnyAttribute、XmlArray または XmlArrayItem と組み合わせて使用することはできません。
ko: XmlElement, XmlText 및 XmlAnyElement는 XmlAttribute, XmlAnyAttribute, XmlArray 또는 XmlArrayItem과 함께 사용할 수 없습니다.
pl: Elementy XmlElement, XmlText, i XmlAnyElement nie mogą być używane w połączeniu z elementami XmlAttribute, XmlAnyAttribute, XmlArray lub XmlArrayItem.
pt_br: XmlElement, XmlText e XmlAnyElement não podem ser usados juntamente com XmlAttribute, XmlAnyAttribute, XmlArray ou XmlArrayItem.
ru: Невозможно использовать XmlElement, XmlText и XmlAnyElement совместно с XmlAttribute, XmlAnyAttribute, XmlArray и XmlArrayItem.
tr: XmlElement, XmlText ve XmlAnyElement, XmlAttribute, XmlAnyAttribute, XmlArray veya XmlArrayItem ile birlikte kullanılamaz.
zh_hans: XmlElement、XmlText 和 XmlAnyElement 不能与 XmlAttribute、XmlAnyAttribute、XmlArray 或 XmlArrayItem 一起使用。
zh_hant: XmlElement、XmlText 和 XmlAnyElement 不可以和 XmlAttribute、XmlAnyAttribute、XmlArray 或 XmlArrayItem 結合使用。

# XmlIllegalForm
source: There was an error exporting '{0}': elements declared at the top level of a schema cannot be unqualified.
cs: Při exportu {0} došlo k chybě: Elementy deklarované na nejvyšší úrovni schématu nemohou být nekvalifikované.
de: Fehler beim Exportieren von "{0}": Auf der obersten Schemaebene deklarierte Elemente müssen qualifiziert sein.
es: Error al exportar "{0}": los elementos declarados en el nivel superior de un esquema no pueden estar incompletos.
fr: Erreur durant l'exportation de '{0}' : les éléments déclarés au niveau supérieur d'un schéma ne peuvent pas être non qualifiés.
it: Si è verificato un errore durante l'esportazione di '{0}': gli elementi dichiarati al primo livello dello schema devono essere qualificati.
ja: '{0}' のエクスポートでエラーが発生しました。スキーマのトップ レベルで宣言された要素を限定されない要素にすることはできません。
ko: '{0}'을(를) 내보내는 동안 오류가 발생했습니다. 스키마의 최상위에 선언된 요소는 비한정될 수 없습니다.
pl: Wystąpił błąd podczas eksportowania „{0}”: elementy zadeklarowane na najwyższym poziomie schematu nie mogą być niekwalifikowane.
pt_br: Erro ao exportar '{0}': elementos declarados no nível superior de um esquema não podem ser não qualificados.
ru: Возникла ошибка при экспорте "{0}": элементы, объявленные на верхнем уровне схемы, не могут иметь неточных имен.
tr: {0} dışarı aktarılırken bir hata oluştu: Şemanın en üst düzeyinde bildirilen öğeler nitelenmemiş olamaz.
zh_hans: 导出“{0}”时出错: 在架构的顶级声明的元素不能是非限定的。
zh_hant: 匯出 '{0}' 時發生錯誤: 結構描述最上層所宣告的元素不可不合格。

# XmlIllegalMultipleText
source: Cannot serialize object of type '{0}' because it has multiple XmlText attributes. Consider using an array of strings with XmlTextAttribute for serialization of a mixed complex type.
cs: Objekt typu {0} nelze serializovat, protože má několik atributů XmlText. Při serializaci smíšeného složitého typu zvažte možnost použít pole řetězců s atributem XmlTextAttribute.
de: Das Objekt vom Typ "{0}" kann nicht serialisiert werden, da es mehrere XmlText-Attribute enthält. Verwenden Sie ein Zeichenfolgenarray mit XmlTextAttribute zur Serialisierung eines gemischten komplexen Typs.
es: No se puede serializar el objeto de tipo "{0}" porque tiene varios atributos XmlText. Considere la posibilidad de usar una matriz de cadenas con XmlTextAttribute para la serialización de un tipo complejo mixto.
fr: Impossible de sérialiser l'objet de type '{0}', car il a plusieurs attributs XmlText. Utilisez plutôt un tableau de chaînes avec XmlTextAttribute pour la sérialisation d'un type complexe mixed.
it: Non è possibile serializzare l'oggetto di tipo '{0}' perché contiene più attributi XmlText. Per la serializzazione di un tipo complesso misto, provare a usare una matrice di stringhe con XmlTextAttribute.
ja: 複数の XmlText 属性を持っているため、型 '{0}' のオブジェクトをシリアル化できません。混合 complex 型のシリアル化をするには、文字列の配列を XmlTextAttribute と共に使用してください。
ko: '{0}' 형식의 개체에 여러 XmlText 특성이 있으므로 이 개체를 직렬화할 수 없습니다. 혼합된 복합 형식을 직렬화하려면 XmlTextAttribute가 있는 문자열 배열을 사용하세요.
pl: Nie można serializować obiektu typu „{0}”, ponieważ ma on wiele atrybutów XmlText. Rozważ użycie tablicy ciągów z atrybutem XmlTextAttribute do serializacji złożonego typu mieszanego.
pt_br: Não é possível serializar objeto do tipo '{0}' porque ele tem vários atributos XmlText. Considere usar uma matriz de cadeias de caracteres com XmlTextAttribute para a serialização de um tipo complexo misto.
ru: Невозможно сериализовать объект типа "{0}", так как он имеет несколько атрибутов XmlText. Попробуйте использовать массив строк с XmlTextAttribute для сериализации комбинированного составного типа.
tr: Birden çok XmlText özniteliği olduğundan '{0}' nesne serileştirilemiyor. Karışık bir karmaşık türü serileştirmek için XmlTextAttribute ile birlikte bir dize dizisi kullanmak isteyebilirsiniz.
zh_hans: 无法序列化类型“{0}”的对象，原因是它有多个 XmlText 特性。考虑使用带有 XmlTextAttribute 的字符串的数组来序列化混合的复杂类型。
zh_hant: 因為物件有多個 XmlText 屬性，所以無法序列化類型 '{0}' 的物件。請考慮改用含有 XmlTextAttribute 的字串陣列來對混合式的複雜類型進行序列化。

# XmlIllegalMultipleTextMembers
source: XmlText may not be used on multiple parameters or return values.
cs: Atribut XmlText nesmí být použit pro více parametrů nebo vrácených hodnot.
de: XmlText kann nicht in mehreren Parametern oder Rückgabewerten verwendet werden.
es: No se puede utilizar XmlText en varios parámetros o valores devueltos.
fr: XmlText ne doit pas être utilisé pour plusieurs paramètres ou valeurs retournées.
it: XmlText non può essere usato su più parametri o valori restituiti.
ja: XmlText は複数のパラメーター、または戻り値に使用できません。
ko: XmlText를 여러 매개 변수 또는 반환 값에 사용할 수 없습니다.
pl: Element XmlText nie może być użyty dla wielu parametrów lub zwracanych wartości.
pt_br: XmlText não pode ser usado em vários parâmetros ou valores retornados.
ru: Невозможно использовать XmlText для нескольких параметров или возвращаемых значений.
tr: XmlText, birden çok parametre veya dönüş değerleri üzerinde kullanılamaz.
zh_hans: XmlText 不能在多个参数或返回值上使用。
zh_hant: XmlText 不可用於多個參數或傳回值。
