Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_NonDeterministic
source: Multiple definition of element '{0}' causes the content model to become ambiguous. A content model must be formed such that during validation of an element information item sequence, the particle contained directly, indirectly or implicitly therein with which to attempt to validate each item in the sequence in turn can be uniquely determined without examining the content or attributes of that item, and without any information about the items in the remainder of the sequence.
cs: Více definic elementu {0} způsobuje nejednoznačnost obsahového modelu. Obsahový model musí být vytvořen tak, že během ověřování sekvence položek informací elementu je možné částici (obsaženou přímo, nepřímo nebo implicitně), podle které se má provést pokus o postupné ověření jednotlivých položek v sekvenci, určit jednoznačně bez prozkoumávání obsahu nebo atributů dané položky a bez jakýchkoli informací o položkách ve zbývající části sekvence.
de: Mehrere Definitionen des Elements "{0}" führen zu einem mehrdeutigen Inhaltsmodell. Ein Inhaltsmodell muss so gebildet werden, dass während der Validierung einer Elementinformationssequenz das darin direkt, indirekt oder implizit enthaltene Partikel, mit dem jedes Element in der Sequenz überprüft werden soll, wiederum ohne Untersuchung des Inhalts oder der Attribute dieses Elements und ohne Informationen zu den Elementen in der restlichen Sequenz eindeutig bestimmt werden kann.
es: La definición múltiple del elemento "{0}" provoca que el modelo de contenido sea ambiguo. Un modelo de contenido debe estar constituido de tal forma que, durante la validación de una secuencia de elementos de información de elemento, la partícula contenida directa, indirecta o implícitamente en este y con la que se debe intentar validar cada elemento de la secuencia pueda determinarse de forma exclusiva sin examinar el contenido o los atributos de dicho elemento, y sin ninguna información acerca de los elementos del resto de la secuencia.
fr: Le modèle de contenu devient ambigu quand l'élément '{0}' est défini plusieurs fois. Ce modèle de contenu doit être constitué selon un processus particulier. En effet, durant la validation de la séquence d'informations d'un élément, la particule contenue directement, indirectement ou implicitement, et avec laquelle chaque élément de la séquence doit être validé, doit pouvoir être déterminée de façon unique, sans qu'il soit nécessaire d'examiner le contenu ou les attributs de l'élément en question, et sans aucune information sur les autres éléments de la séquence.
it: Il modello di contenuto è ambiguo perché sono presenti più definizioni dell'elemento '{0}'. È necessario formare un modello di contenuto in modo che, durante la convalida di una sequenza di elementi di informazione dell'elemento, la particella contenuta direttamente, indirettamente o in modo implicito con cui provare a convalidare ogni elemento della sequenza possa essere a sua volta determinata in modo univoco, senza esaminare il contenuto o gli attributi di tale elemento e senza informazioni relative agli elementi rimanenti della sequenza.
ja: 要素 '{0}' の複数の定義があるため、コンテンツ モデルがあいまいになっています。コンテンツ モデルは、要素情報アイテム シーケンスの検証中に、そのシーケンスに直接、間接または暗黙的に含まれている、シーケンス内の各アイテムを順番に検証する際に使われるパーティクルが、各アイテムのコンテンツや属性を確認することなく、かつ、シーケンス内のその他のアイテムの情報も必要とせずに、一意に特定できるように構成される必要があります。
ko: 요소 '{0}'을(를) 여러 번 정의하면 콘텐츠 모델이 모호해질 수 있습니다. 콘텐츠 모델은 요소 정보 항목 시퀀스의 유효성을 검사하는 동안 파티클이 콘텐츠 모델에 직접, 간접 또는 암시적으로 포함되도록 구성해야 합니다. 그러면 이 파티클을 사용하여 시퀀스에 있는 각 항목의 유효성을 차례로 검사하려고 할 때 해당 항목의 콘텐츠나 특성을 검토하지 않고 나머지 시퀀스에 있는 항목에 대한 정보를 사용하지 않은 상태로 고유하게 확인할 수 있습니다.
pl: Wielokrotna definicja elementu „{0}” powoduje niejednoznaczność modelu zawartości. Model zawartości należy tak sformułować, aby podczas weryfikacji sekwencji pozycji informacji o elemencie cząstka uwzględniona w nim bezpośrednio, pośrednio lub niejawnie, przy użyciu której będzie przeprowadzana weryfikacja każdej pozycji w sekwencji, mogła zostać unikatowo określona, bez konieczności sprawdzania zawartości lub atrybutów danej pozycji, a także bez korzystania z żadnych informacji o pozycjach, które podano w pozostałej części sekwencji.
pt_br: Várias definições do elemento '{0}' deixam o modelo de conteúdo ambíguo. Um modelo de conteúdo deve ser formado de modo que, durante a validação de uma sequência de itens de informações de elementos, a partícula contida nele direta, indireta ou implicitamente, com a qual será possível validar cada item por vez na sequência, possa ser determinada de forma exclusiva sem o exame do conteúdo ou dos atributos desse item e sem informações sobre os itens do restante da sequência.
ru: Несколько определений элемента "{0}" вызывают неоднозначность модели содержимого. Модель содержимого должна быть сформирована таким образом, чтобы в процессе проверки последовательности информационных единиц элемента часть, содержащаяся в ней прямо, опосредованно или неявно, с которой должна проверяться каждая единица последовательности, в свою очередь могла быть однозначно определена без изучения содержимого или атрибутов этой единицы и получения дополнительных данных об остальных единицах в последовательности.
tr: '{0}' öğesinin birden çok tanımının olması içerik modelinin belirsizleşmesine neden olur. İçerik modeli, öğe bilgilerinin madde sıralamasının doğrulanması sırasında, sıralamadaki her maddeyi doğrulama girişiminde doğrudan, dolaylı veya örtülü olarak içerilen parçacık, ilgili maddenin içeriğini veya özniteliklerini incelemek veya sıralamanın geri kalanında bulunan maddelerle ilgili bilgi edinmek gerekmeden, benzersiz olarak belirlenebilecek şekilde oluşturulmalıdır.
zh_hans: 对元素“{0}”进行多次定义会导致内容模型变得不明确。必须形成内容模型，这样，在验证元素信息项序列时，其中直接、间接或隐式包含的、依次试图用来验证序列中每项的粒子就可以唯一确定，而不必检查该项的内容或特性，而且无需序列中其余项的信息。
zh_hant: 元素 '{0}' 的多重定義導致內容模型變得模稜兩可。內容模型形成的時機，必須在驗證元素資訊的項目序列期間，且直接或間接或者是隱含地包含物件，如此一來，可個別判斷每個嘗試循序驗證的項目，而無須檢查該項目的內容或屬性，且在序列的提示中也不用包含任何項目的資訊。

# Sch_NonDeterministicAny
source: The content model must be deterministic. Wildcard declaration along with a local element declaration causes the content model to become ambiguous.
cs: Model obsahu musí být deterministický. Deklarace zástupných znaků spolu s místní deklarací elementu způsobí, že model obsahu bude dvojznačný.
de: Das Inhaltsmodell muss deterministisch sein. Die Platzhalterdeklaration und eine lokale Elementdeklaration bewirken, dass das Inhaltsmodell mehrdeutig wird.
es: El modelo de contenido debe ser determinante. La declaración de comodín y la declaración del elemento local hacen que el modelo de contenido sea ambiguo.
fr: Le modèle de contenu doit être déterministe. Il devient ambigu en cas de déclaration de caractère générique accompagnée d'une déclaration d'élément local.
it: Il modello di contenuto deve essere deterministico. Una dichiarazione di carattere jolly insieme a un elemento dichiarato locale rendono ambiguo il modello di contenuto.
ja: コンテンツ モデルは、決定論的でなければなりません。ワイルドカード宣言をローカルの要素宣言と組み合わせると、コンテンツ モデルがあいまいになります。
ko: 콘텐츠 모델은 명확해야 합니다. 와일드카드 선언에 로컬 요소 선언을 포함하면 콘텐츠 모델이 모호해집니다.
pl: Model zawartości musi być deterministyczny. Deklaracja symboli wieloznacznych wraz z deklaracją elementu lokalnego powoduje niejednoznaczność modelu zawartości.
pt_br: O modelo de conteúdo deve ser determinístico. Declaração curinga junto com declaração do elemento local causa ambiguidade no modelo de conteúdo.
ru: Модель содержимого должна быть детерминированной. Объявления, содержащие подстановочные знаки, вместе с локальным определением элемента вызывают неоднозначность модели содержимого.
tr: İçerik modeli belirleyici olmalıdır. Yerel öğe bildirimi yanında joker parçacık bildirimi yapılması içerik modelinin belirsizleşmesine neden olur.
zh_hans: 内容模型必须确定。通配符声明和本地元素声明一起使用，会造成内容模型变得不明确。
zh_hant: 內容模型必須具有確定性。萬用字元宣告再加上本機元素宣告導致了內容模型變得模稜兩可。

# Sch_NonDeterministicAnyAny
source: Wildcards '{0}' and '{1}' have not empty intersection, and causes the content model to become ambiguous. A content model must be formed such that during validation of an element information item sequence, the particle contained directly, indirectly or implicitly therein with which to attempt to validate each item in the sequence in turn can be uniquely determined without examining the content or attributes of that item, and without any information about the items in the remainder of the sequence.
cs: Zástupné znaky {0} a {1} nemají prázdný průnik. To způsobuje, že obsahový model není jednoznačný. Obsahový model musí být vytvořen tak, že během ověřování sekvence položek informací elementu je možné částici (obsaženou přímo, nepřímo nebo implicitně), podle které se má provést pokus o postupné ověření jednotlivých položek v sekvenci, určit jednoznačně bez prozkoumávání obsahu nebo atributů dané položky a bez jakýchkoli informací o položkách ve zbývající části sekvence.
de: Die Platzhalter "{0}" und "{1}" haben eine nicht leere Schnittmenge und führen dazu, dass das Inhaltsmodell mehrdeutig wird. Ein Inhaltsmodell muss so gebildet werden, dass während der Validierung einer Elementinformationssequenz das darin direkt, indirekt oder implizit enthaltene Partikel, mit dem jedes Element in der Sequenz überprüft werden soll, wiederum ohne Untersuchung des Inhalts oder der Attribute dieses Elements und ohne Informationen zu den Elementen in der restlichen Sequenz eindeutig bestimmt werden kann.
es: Los comodines "{0}" y "{1}" no tienen intersecciones vacías y provocan que el modelo de contenido sea ambiguo. Un modelo de contenido debe estar constituido de tal forma que, durante la validación de una secuencia de elementos de información de elemento, la partícula contenida directa, indirecta o implícitamente en este y con la que se debe intentar validar cada elemento de la secuencia pueda determinarse de forma exclusiva sin examinar el contenido o los atributos de dicho elemento, y sin ninguna información acerca de los elementos del resto de la secuencia.
fr: Les caractères génériques '{0}' et '{1}' n'ont pas d'intersection vide, ce qui rend le modèle de contenu ambigu. Ce modèle de contenu doit être constitué selon un processus particulier. En effet, durant la validation de la séquence d'informations d'un élément, la particule contenue directement, indirectement ou implicitement, et avec laquelle chaque élément de la séquence doit être validé, doit pouvoir être déterminée de façon unique, sans qu'il soit nécessaire d'examiner le contenu ou les attributs de l'élément en question, et sans aucune information sur les autres éléments de la séquence.
it: I caratteri jolly '{0}' e '{1}' non contengono intersezioni vuote e rendono ambiguo il modello di contenuto. È necessario formare un modello di contenuto in modo che, durante la convalida di una sequenza di elementi di informazione dell'elemento, la particella contenuta direttamente, indirettamente o in modo implicito con cui provare a convalidare ogni elemento della sequenza possa essere a sua volta determinata in modo univoco, senza esaminare il contenuto o gli attributi di tale elemento e senza informazioni relative agli elementi rimanenti della sequenza.
ja: ワイルドカード '{0}' および '{1}' には空でない共通集合があるため、コンテンツ モデルがあいまいになっています。コンテンツ モデルは、要素情報アイテム シーケンスの検証中に、そのシーケンスに直接、間接または暗黙的に含まれている、シーケンス内の各アイテムを順番に検証する際に使われるパーティクルが、各アイテムのコンテンツや属性を確認することなく、かつ、シーケンス内のその他のアイテムの情報も必要とせずに、一意に特定できるように構成される必要があります。
ko: 와일드카드 '{0}'과(와) '{1}'의 공통 영역이 비어 있지 않으면 콘텐츠 모델이 모호해질 수 있습니다. 콘텐츠 모델은 요소 정보 항목 시퀀스의 유효성을 검사하는 동안 파티클이 콘텐츠 모델에 직접, 간접 또는 암시적으로 포함되도록 구성해야 합니다. 그러면 이 파티클을 사용하여 시퀀스에 있는 각 항목의 유효성을 차례로 검사하려고 할 때 해당 항목의 콘텐츠나 특성을 검토하지 않고 나머지 시퀀스에 있는 항목에 대한 정보를 사용하지 않은 상태로 고유하게 확인할 수 있습니다.
pl: Symbole wieloznaczne „{0}” i „{1}” mają niepustą część wspólną zbiorów. Powoduje to niejednoznaczność modelu zawartości. Model zawartości należy tak sformułować, aby podczas weryfikacji sekwencji pozycji informacji o elemencie cząstka uwzględniona w nim bezpośrednio, pośrednio lub niejawnie, przy użyciu której będzie przeprowadzana weryfikacja każdej pozycji w sekwencji, mogła zostać unikatowo określona, bez konieczności sprawdzania zawartości lub atrybutów danej pozycji, a także bez korzystania z żadnych informacji o pozycjach, które podano w pozostałej części sekwencji.
pt_br: Os curingas '{0}' e '{1}' não têm interseção vazia e deixam o modelo de conteúdo ambíguo. Um modelo de conteúdo deve ser formado de modo que, durante a validação de uma sequência de itens de informações de elementos, a partícula contida nele, direta, indireta ou implicitamente, com a qual será possível validar cada item por vez na sequência, possa ser determinada de forma exclusiva sem o exame do conteúdo ou dos atributos desse item e sem informações sobre os itens do restante da sequência.
ru: Подстановочные знаки "{0}" и "{1}" не имеют пустого пересечения и вызывают неоднозначность модели содержимого. Модель содержимого должна быть сформирована таким образом, чтобы в процессе проверки последовательности информационных единиц элемента часть, содержащаяся в ней прямо, опосредованно или неявно, с которой должна проверяться каждая единица последовательности, в свою очередь могла быть однозначно определена без изучения содержимого или атрибутов этой единицы и получения дополнительных данных об остальных единицах в последовательности.
tr: '{0}' ve '{1}' joker parçacıklarının kesişimi boş küme değildir ve içerik modelinin belirsizleşmesine neden olur.İçerik modeli, öğe bilgilerinin madde sıralamasının doğrulanması sırasında, sıralamadaki her maddeyi doğrulama girişiminde doğrudan, dolaylı veya örtülü olarak içerilen parçacık, ilgili maddenin içeriğini veya özniteliklerini incelemek veya sıralamanın geri kalanında bulunan maddelerle ilgili bilgi edinmek gerekmeden, benzersiz olarak belirlenebilecek şekilde oluşturulmalıdır.
zh_hans: 通配符“{0}”和“{1}”不包含空的交集，导致内容模型变得不明确。必须形成内容模型，这样，在验证元素信息项序列时，其中直接、间接或隐式包含的、依次试图用来验证序列中每项的粒子就可以唯一确定，而不必检查该项的内容或特性，而且无需序列中其余项的信息。
zh_hant: 萬用字元 '{0}' 和 '{1}' 沒有空的交集，且會使內容模組變得模稜兩可。內容模組形成的時機，必須在驗證元素資訊的項目序列，直接、間接或隱含地包含物件，如此一來，可個別判斷每一個嘗試循序驗證的項目，而不必檢查該項目的內容或屬性，且在序列的提示中也不用包含任何項目的資訊。

# Sch_NonDeterministicAnyEx
source: Wildcard '{0}' allows element '{1}', and causes the content model to become ambiguous. A content model must be formed such that during validation of an element information item sequence, the particle contained directly, indirectly or implicitly therein with which to attempt to validate each item in the sequence in turn can be uniquely determined without examining the content or attributes of that item, and without any information about the items in the remainder of the sequence.
cs: Zástupný znak {0} povoluje element {1}. To způsobuje, že obsahový model není jednoznačný. Obsahový model musí být vytvořen tak, že během ověřování sekvence položek informací elementu je možné částici (obsaženou přímo, nepřímo nebo implicitně), podle které se má provést pokus o postupné ověření jednotlivých položek v sekvenci, určit jednoznačně bez prozkoumávání obsahu nebo atributů dané položky a bez jakýchkoli informací o položkách ve zbývající části sekvence.
de: Der Platzhalter "{0}" lässt das Element "{1}" zu und führt dazu, dass das Inhaltsmodell mehrdeutig wird. Ein Inhaltsmodell muss so gebildet werden, dass während der Validierung einer Elementinformationssequenz das darin direkt, indirekt oder implizit enthaltene Partikel, mit dem jedes Element in der Sequenz überprüft werden soll, wiederum ohne Untersuchung des Inhalts oder der Attribute dieses Elements und ohne Informationen zu den Elementen in der restlichen Sequenz eindeutig bestimmt werden kann.
es: El comodín "{0}" permite el elemento "{1}" y hace que el modelo de contenido sea ambiguo. Un modelo de contenido debe estar constituido de forma que durante la validación de una secuencia de elementos de información de elemento, la partícula contenida directa, indirecta o implícitamente en este y con la que se debe intentar validar cada elemento de la secuencia se pueda determinar de forma exclusiva sin examinar el contenido o los atributos de dicho elemento, y sin ninguna información acerca de los elementos del resto de la secuencia.
fr: Le caractère générique '{0}' autorise l'élément '{1}', ce qui rend le modèle de contenu ambigu. Ce modèle de contenu doit être constitué selon un processus particulier. En effet, durant la validation de la séquence d'informations d'un élément, la particule contenue directement, indirectement ou implicitement, et avec laquelle chaque élément de la séquence doit être validé, doit pouvoir être déterminée de façon unique, sans qu'il soit nécessaire d'examiner le contenu ou les attributs de l'élément en question, et sans aucune information sur les autres éléments de la séquence.
it: Il carattere jolly '{0}' consente l'elemento '{1}' e rende ambiguo il modello di contenuto. È necessario formare un modello di contenuto in modo che, durante la convalida di una sequenza di elementi di informazione dell'elemento, la particella contenuta direttamente, indirettamente o in modo implicito con cui provare a convalidare ogni elemento della sequenza possa essere a sua volta determinata in modo univoco, senza esaminare il contenuto o gli attributi di tale elemento e senza informazioni relative agli elementi rimanenti della sequenza.
ja: ワイルドカード '{0}' は要素 '{1}' を許可しているため、コンテンツ モデルがあいまいになっています。コンテンツ モデルは、要素情報アイテム シーケンスの検証中に、そのシーケンスに直接、間接または暗黙的に含まれている、シーケンス内の各アイテムを順番に検証する際に使われるパーティクルが、各アイテムのコンテンツや属性を確認することなく、かつ、シーケンス内のその他のアイテムの情報も必要とせずに、一意に特定できるように構成される必要があります。
ko: 와일드카드 '{0}'에서 요소 '{1}'을(를) 허용하면 콘텐츠 모델이 모호해질 수 있습니다. 콘텐츠 모델은 요소 정보 항목 시퀀스의 유효성을 검사하는 동안 파티클이 콘텐츠 모델에 직접, 간접 또는 암시적으로 포함되도록 구성해야 합니다. 그러면 이 파티클을 사용하여 시퀀스에 있는 각 항목의 유효성을 차례로 검사하려고 할 때 해당 항목의 콘텐츠나 특성을 검토하지 않고 나머지 시퀀스에 있는 항목에 대한 정보를 사용하지 않은 상태로 고유하게 확인할 수 있습니다.
pl: Dla symbolu wieloznacznego „{0}” dozwolony jest element „{1}”. Powoduje to niejednoznaczność modelu zawartości. Model zawartości należy tak sformułować, aby podczas weryfikacji sekwencji pozycji informacji o elemencie cząstka uwzględniona w nim bezpośrednio, pośrednio lub niejawnie, przy użyciu której będzie przeprowadzana weryfikacja każdej pozycji w sekwencji, mogła zostać unikatowo określona, bez konieczności sprawdzania zawartości lub atrybutów danej pozycji, a także bez korzystania z żadnych informacji o pozycjach, które podano w pozostałej części sekwencji.
pt_br: O curinga '{0}' permite o elemento '{1}' e deixa o modelo de conteúdo ambíguo. Um modelo de conteúdo deve ser formado de modo que, durante a validação de uma sequência de itens de informações de elementos, a partícula contida nele, direta, indireta ou implicitamente, com a qual será possível validar cada item por vez na sequência, possa ser determinada de forma exclusiva sem o exame do conteúdo ou dos atributos desse item e sem informações sobre os itens do restante da sequência.
ru: Подстановочный знак "{0}" допускает элемент "{1}" и вызывает неоднозначность модели содержимого. Модель содержимого должна быть сформирована таким образом, чтобы в процессе проверки последовательности информационных единиц элемента часть, содержащаяся в ней прямо, опосредованно или неявно, с которой должна проверяться каждая единица последовательности, в свою очередь могла быть однозначно определена без изучения содержимого или атрибутов этой единицы и получения дополнительных данных об остальных единицах в последовательности.
tr: '{0}' joker parçacığı '{1}' öğesine izin verir ve içerik modelinin belirsizleşmesine neden olur. İçerik modeli, öğe bilgilerinin madde sıralamasının doğrulanması sırasında, sıralamadaki her maddeyi doğrulama girişiminde doğrudan, dolaylı veya örtülü olarak içerilen parçacık, ilgili maddenin içeriğini veya özniteliklerini incelemek veya sıralamanın geri kalanında bulunan maddelerle ilgili bilgi edinmek gerekmeden, benzersiz olarak belirlenebilecek şekilde oluşturulmalıdır.
zh_hans: 通配府“{0}”允许使用元素“{1}”，导致内容模型变得不明确。必须形成内容模型，这样，在验证元素信息项序列时，其中直接、间接或隐式包含的、依次试图用来验证序列中每项的粒子就可以唯一确定，而不必检查该项的内容或特性，而且无需序列中其余项的任何信息。
zh_hant: 萬用字元 '{0}' 允許元素 '{1}'，且會使內容模型變得模稜兩可。內容模型必須在驗證元素資訊項目序列期間形成，物件包含直接、非直接或暗示與在順序裡嘗試驗證的每個項目在其中，可以單獨地判定而無需檢查該項目內容或屬性，並且在順序餘項中不需任何該項目之相關資訊。

# Sch_NotAllAlone
source: 'all' is not the only particle in a group, or is being used as an extension.
cs: Atribut all není jedinou částicí ve skupině nebo je používán jako rozšíření.
de: "all" ist nicht das einzige Partikel in einer Gruppe oder wird als Erweiterung verwendet.
es: "all" no es la única partícula que pertenece a un grupo o se está utilizando como extensión.
fr: 'all' n'est pas la seule particule d'un groupe ou est utilisé en tant qu'extension.
it: 'all' non è l'unica particella di un gruppo o viene usata come estensione.
ja: 'all' が、group 内で唯一のパーティクルでないか、または extension として使用されています。
ko: 'all'은 그룹에서 유일한 파티클이 아니거나 extension으로 사용되고 있습니다.
pl: Element „all” nie jest jedyną cząstką w grupie lub jest używany jako rozszerzenie.
pt_br: 'all' não é a única partícula de um grupo ou está sendo usada como uma extensão.
ru: all не является единственной частью в группе или используется как расширение.
tr: 'all', bir gruptaki tek parçacık değil veya uzantı olarak kullanılıyor.
zh_hans: "all" 不是组中的唯一粒子，或正被用作扩展。
zh_hant: 'all' 不是群組中的唯一物件，或是已用作為延伸模組。

# Sch_NotComplexContent
source: The content type of the base type must not be a simple type definition.
cs: Typ obsahu základního typu nesmí být definicí jednoduchého typu.
de: Der Inhaltstyp des Basistyps darf keine einfache Typdefinition sein.
es: El tipo de contenido del tipo base no debe ser una definición de tipo simple.
fr: Le type de contenu du type de base ne doit pas être une définition de type simple.
it: Il tipo di contenuto del tipo di base non deve essere una definizione di tipo semplice.
ja: 基本データ型のコンテンツ型を単純型の定義にすることはできません。
ko: 기본 형식의 콘텐츠 형식은 단순 형식 정의일 수 없습니다.
pl: Typ zawartości typu podstawowego nie może być definicją typu prostego.
pt_br: O tipo de conteúdo do tipo base não deve ser uma definição de tipo simples.
ru: Тип содержимого базового типа не должен являться определением простого типа.
tr: Temel türün içerik türü bir basit tür tanımı olmamalıdır.
zh_hans: 基类型的内容类型不得是简单类型定义。
zh_hant: 基底類型的內容類型不可是簡單型別定義。

# Sch_NotNormalizedString
source: Carriage return (#xD), line feed (#xA), and tab (#x9) characters are not allowed in xs:normalizedString.
cs: V typu xs:normalizedString nelze používat znaky CR (#xD), LF (#xA) ani tabulátory (#x9).
de: In "xs:normalizedString" sind die Zeichen für Wagenrücklauf (#xD), Zeilenvorschub (#xA) und Tabstopp (#x9) nicht zulässig.
es: Los caracteres de retorno de carro (#xD), avance de línea (#xA) y tabulación (#x9) no se permiten en xs:normalizedString.
fr: xs:normalizedString n'autorise pas les caractères retour chariot (#xD), saut de ligne (#xA) et tabulation (#x9).
it: I caratteri di ritorno a capo (#xD), avanzamento riga (#xA) e tabulazione (#x9) non sono consentiti in xs:normalizedString.
ja: xs:normalizedString には、復帰 (#xD)、改行 (#xA) およびタブ (#x9) の各文字を記述できません。
ko: xs:normalizedString에서는 캐리지 리턴(#xD), 줄 바꿈(#xA) 및 탭 문자(#x9)를 사용할 수 없습니다.
pl: Element „xs:normalizedString” nie może zawierać znaków powrotu karetki (#xD), znaków wysuwu wiersza (#xA) ani znaków tabulacji (#x9).
pt_br: Caracteres de retorno de carro (#xD), de alimentação de linha (#xA) e de tabulação (#x9) não são permitidos em in xs:normalizedString.
ru: Знаки возврата каретки (#xD), перевода строки (#xA) и табуляции (#x9) недопустимы в xs:normalizedString.
tr: xs:normalizedString, satır sonu (#xD), satır başı (#xA) ve sekme (#x9) karakterlerini içermeyen bir dize kümesidir.
zh_hans: xs:normalizedString 中不允许出现回车符(#xD)、换行符(#xA)和制表符(#x9)。
zh_hant: xs:normalizedString 中不允許歸位字元 (#xD)、換行字元 (#xA) 以及定位字元 (#x9)。
