Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlInvalidXmlOverride
source: Member '{0}.{1}' hides inherited member '{2}.{3}', but has different custom attributes.
cs: Člen {0}.{1} skrývá zděděného člena {2}.{3}, ale má jiné vlastní atributy.
de: Der Member "{0}.{1}" blendet den geerbten Member "{2}.{3}" aus, hat aber unterschiedliche benutzerdefinierte Attribute.
es: El miembro "{0}.{1}" oculta el miembro heredado "{2}.{3}", pero tiene atributos personalizados diferentes.
fr: Le membre '{0}.{1}' masque le membre hérité '{2}.{3}', mais il a d'autres attributs personnalisés.
it: Il membro '{0}.{1}' nasconde il membro ereditato '{2}.{3}', ma contiene attributi personalizzati diversi.
ja: メンバー '{0}.{1}' は継承メンバー '{2}.{3}' を隠しますが、異なるカスタム属性を持っています。
ko: 멤버 '{0}.{1}'이(가) 상속된 멤버 '{2}.{3}'을(를) 숨기고 다른 사용자 지정 특성을 사용합니다.
pl: Składowa „{0}.{1}” ukrywa dziedziczoną składową „{2}.{3}”, ale ma inne atrybuty niestandardowe.
pt_br: O membro '{0}.{1}' oculta o membro herdado '{2}.{3}', mas tem atributos personalizados diferentes.
ru: Член "{0}.{1}" скрывает унаследованный член "{2}.{3}", но имеет другие особые атрибуты.
tr: '{0}.{1}' üyesi devralınan '{2}.{3}' üyesini gizliyor ancak farklı özel özniteliklere sahip.
zh_hans: 成员“{0}.{1}”隐藏继承成员“{2}.{3}”，但具有不同的自定义特性。
zh_hant: 成員 '{0}.{1}' 會隱藏繼承的成員 '{2}.{3}'，但內含不同的自訂屬性。

# XmlInvalidXmlns
source: Invalid namespace attribute: xmlns:{0}="".
cs: Neplatný atribut oboru názvů: xmlns:{0}=""
de: Ungültiges Namespaceattribut: xmlns:{0}="".
es: Atributo de espacio de nombres no válido: xmlns: {0}="".
fr: Attribut d'espace de noms non valide : xmlns:{0}="".
it: Attributo dello spazio dei nomi non valido: xmlns:{0}="".
ja: 名前空間属性 xmlns:{0}="" は無効です。
ko: 네임스페이스 특성이 잘못되었습니다. xmlns:{0}="".
pl: Nieprawidłowy atrybut przestrzeni nazw: xmlns:{0}="".
pt_br: Atributo de namespace inválido: xmlns:{0}="".
ru: Недопустимый атрибут пространства имен: xmlns:{0}="".
tr: Geçersiz ad alanı özniteliği: xmlns:{0}="".
zh_hans: 无效的命名空间特性: xmlns:{0}=""。
zh_hant: 命名空間屬性無效: xmlns:{0}=""。

# XmlInvalidXsdDataType
source: Value '{0}' cannot be used for the {1} property. The datatype '{2}' is missing.
cs: Hodnotu {0} nelze použít pro vlastnost {1}. Chybí datový typ {2}.
de: Der Wert "{0}" kann nicht für die {1}-Eigenschaft verwendet werden. Der Datentyp "{2}" ist nicht vorhanden.
es: El valor "{0}" no se puede utilizar para la propiedad {1}. Falta el tipo de datos "{2}".
fr: La valeur '{0}' ne peut pas être utilisée pour la propriété {1}. Le type de données '{2}' est manquant.
it: Non è possibile usare il valore '{0}' per la proprietà {1}. Manca il tipo di dati '{2}'.
ja: 値 '{0}' を {1} プロパティに対して使うことはできません。データ型 '{2}' がありません。
ko: '{0}' 값은 {1} 속성에 사용할 수 없습니다. 데이터 형식 '{2}'이(가) 없습니다.
pl: Wartość „{0}” nie może być używana dla właściwości {1}. Brak typu danych „{2}”.
pt_br: O valor '{0}' não pode ser usado para a propriedade {1}. Tipo de dados '{2}' ausente.
ru: Невозможно использовать значение "{0}" для свойства {1}. Отсутствует тип данных "{2}".
tr: '{0}' değeri {1} özelliği için kullanılamaz. '{2}' veri türü eksik.
zh_hans: 不能将值“{0}”用于属性 {1}。缺少数据类型“{2}”。
zh_hant: 值 '{0}' 不可使用於 {1} 屬性。遺漏資料類型 '{2}'。

# XmlMappingsScopeMismatch
source: Exported mappings must come from the same importer.
cs: Exportovaná mapování musí pocházet ze stejného programu pro import.
de: Exportierte Mappings müssen vom gleichen Importer stammen.
es: Las asignaciones exportadas deben provenir del mismo importador.
fr: Les mappages exportés doivent provenir du même importateur.
it: I mapping esportati devono provenire dalla stessa utilità di importazione.
ja: エクスポートされたマップは同じインポーターから指定しなければなりません。
ko: 내보낸 매핑은 동일한 가져오기에서 가져와야 합니다.
pl: Eksportowane mapowania muszą pochodzić z tego samego importera.
pt_br: Mapeamentos exportados devem vir do mesmo importador.
ru: Экспортированные сопоставления должны поступать из того же источника импорта.
tr: Dışarı aktarılan eşlemeler aynı içeri aktarıcıdan gelmelidir.
zh_hans: 导出的映射必须来自同一个导入程序。
zh_hant: 匯出的對應項目必須來自相同的匯入工具。

# XmlMelformMapping
source: This mapping was not crated by reflection importer and cannot be used in this context.
cs: Toto mapování nevytvořil program pro import reflexe a v tomto kontextu jej nelze používat.
de: Dieses Mapping wurde nicht vom Reflektionsimporter erstellt und kann in diesem Kontext nicht verwendet werden.
es: Esta asignación no ha sido creada por el importador de reflejos y no puede utilizarse en este contexto.
fr: Ce mappage n'a pas été créé par l'outil d'importation de réflexion et ne peut pas être utilisé dans ce contexte.
it: Questo mapping non è stato creato dall'utilità di importazione della reflection e non può essere usato in questo contesto.
ja: このマップはリフレクション インポーターによって値が設定されていないので、このコンテキストでは使用できません。
ko: 이 매핑은 반영 가져오기에서 만들지 않았으며 이 컨텍스트에서 사용할 수 없습니다.
pl: To mapowanie nie zostało utworzone przy użyciu importera odbić i nie może być używane w tym kontekście.
pt_br: Este mapeamento não foi criado por importador de reflexão e não pode ser usado neste contexto.
ru: Это сопоставление не было создано программой импорта отражений и не может использоваться в данном контексте.
tr: Bu eşleme yansıtma içeri aktarıcı tarafından oluşturulmadı ve bu bağlamda kullanılamaz.
zh_hans: 该映射不是由反射导入程序创建的，无法在该上下文中使用。
zh_hant: 此對應並非以反映匯入工具建立且不可用於此內容。

# XmlMembersDeriveError
source: These members may not be derived.
cs: Tyto členy nesmí být odvozeny.
de: Diese Member können nicht abgeleitet werden.
es: Estos miembros no pueden ser derivados.
fr: Ces membres ne peuvent pas être dérivés.
it: Questi membri specificati non possono essere derivati.
ja: これらのメンバーを派生させることはできません。
ko: 이러한 멤버는 파생될 수 없습니다.
pl: Te składowe nie mogą być elementami pochodnymi.
pt_br: Esses membros não podem ser derivados.
ru: Эти члены не могут быть производными.
tr: Bu üyeler türetilemez.
zh_hans: 这些成员不能是派生的。
zh_hant: 這些成員不可是衍生。

# XmlMethodTypeNameConflict
source: The XML element '{0}' from namespace '{1}' references a method and a type. Change the method's message name using WebMethodAttribute or change the type's root element using the XmlRootAttribute.
cs: Element XML {0} z oboru názvů {1} odkazuje na metodu a typ. Pomocí atributu WebMethodAttribute změňte název zprávy metody nebo pomocí atributu XmlRootAttribute změňte kořenový element typu.
de: Das XML-Element "{0}" aus dem Namespace "{1}" verweist auf eine Methode und einen Typ. Ändern Sie den Meldungsnamen der Methode mithilfe von WebMethodAttribute, oder ändern Sie das Stammelement des Typs mithilfe von XmlRootAttribute.
es: El elemento XML "{0}" del espacio de nombres "{1}" hace referencia a un método y a un tipo. Cambie el nombre del mensaje del método utilizando WebMethodAttribute o cambie el elemento raíz del tipo utilizando XmlRootAttribute.
fr: L'élément XML nommé '{0}' de l'espace de noms '{1}' référence une méthode et un type. Changez le nom de message de la méthode à l'aide de WebMethodAttribute, ou changez l'élément racine du type à l'aide de XmlRootAttribute.
it: L'elemento XML '{0}' dello spazio dei nomi '{1}' fa riferimento a un metodo e a un tipo. Modificare il nome del messaggio del metodo con WebMethodAttribute oppure modificare l'elemento radice del tipo con XmlRootAttribute.
ja: 名前空間 '{1}' の XML 要素 '{0}' は、メソッドおよび型を参照しています。WebMethodAttribute を使用してメソッドのメッセージを変更するか、XmlRootAttribute を使用して型のルート要素を変更してください。
ko: 네임스페이스 '{1}'의 XML 요소 '{0}'은(는) 메서드와 형식을 참조합니다. WebMethodAttribute를 사용하여 메서드의 메시지 이름을 변경하거나 XmlRootAttribute를 사용하여 형식의 루트 요소를 변경하세요.
pl: Element XML „{0}” z przestrzeni nazw „{1}” odwołuje się do metody i typu. Zmień nazwę komunikatu metody, używając atrybutu WebMethodAttribute, lub zmień element główny typu, używając atrybutu XmlRootAttribute.
pt_br: O elemento XML '{0}' do namespace '{1}' faz referência a um tipo e a um método. Altere o nome da mensagem do método usando WebMethodAttribute ou altere o elemento raiz do tipo usando XmlRootAttribute.
ru: Элемент XML "{0}" из пространства имен "{1}" ссылается на метод и тип. Измените имя сообщения метода, используя WebMethodAttribute, или измените корневой элемент типа, используя XmlRootAttribute.
tr: '{1}' ad alanındaki '{0}' XML öğesi bir metoda ve türe başvuruyor. WebMethodAttribute kullanarak metodun ileti adını veya XmlRootAttribute kullanarak türün kök öğesini değiştirin.
zh_hans: 来自命名空间“{1}”的 XML 元素“{0}”引用了某个方法和类型。请使用 WebMethodAttribute 更改该方法的消息名称，或使用 XmlRootAttribute 更改该类型的根元素。
zh_hant: 來自命名空間 '{1}' 名稱為 '{0}' 的 XML 元素參考了方法與類型。請使用 WebMethodAttribute 變更方法的訊息名稱，或使用 XmlRootAttribute 變更類型的根項目。

# XmlMismatchSchemaObjects
source: Warning: Cannot share {0} named '{1}' from '{2}' namespace. Several mismatched schema declarations were found.
cs: Upozornění: Nelze sdílet {0} s názvem {1} z oboru názvů {2}. Bylo nalezeno několik neshodných deklarací.
de: Warnung: {0} mit dem Namen "{1}" aus dem Namespace "{2}" kann nicht freigegeben werden. Mehrere nicht übereinstimmende Schemadeklarationen wurden gefunden.
es: Advertencia: No se puede compartir {0} denominado "{1}" del espacio de nombres "{2}". Varias declaraciones de esquema no coinciden.
fr: Avertissement : Impossible de partager le {0} nommé '{1}' dans l'espace de noms '{2}'. Plusieurs déclarations de schéma non compatibles ont été détectées.
it: Avviso: non è possibile condividere l'elemento {0} denominato '{1}' dello spazio dei nomi '{2}'. Sono state trovate diverse dichiarazioni dello schema non corrispondenti.
ja: 警告: '{2}' 名前空間の '{1}' という名前の {0} を共有できません。一致しないスキーマ宣言がいくつか見つかりました。
ko: 경고: '{2}' 네임스페이스에서 '{1}'(이)라는 {0}을(를) 공유할 수 없습니다. 일치하지 않는 여러 스키마 선언을 찾았습니다.
pl: Uwaga: nie można współużytkować elementu {0} o nazwie „{1}” z przestrzeni nazw „{2}”. Znaleziono kilka niezgodnych deklaracji schematów.
pt_br: Aviso: não é possível compartilhar o {0} chamado '{1}' do namespace '{2}'. Foram encontradas várias declarações de esquema incompatíveis.
ru: Предупреждение. Невозможно совместно использовать {0} с именем "{1}" из пространства имен "{2}". Найдено несколько несогласованных объявлений схемы.
tr: Uyarı: '{2}' ad alanındaki '{1}' adlı {0} paylaşılamıyor. Birkaç eşleşmeyen şema bildirimi bulundu.
zh_hans: 警告: 无法共享来自“{2}”命名空间、名为“{1}”的 {0}。发现多个不匹配的架构定义。
zh_hant: 警告: 無法共用 '{2}' 命名空間中名為 '{1}' 的 {0}。發生結構描述宣告不相符的問題。

# XmlMismatchedArrayBrackets
source: SOAP-ENC:arrayType has mismatched brackets.
cs: V typu SOAP-ENC:arrayType nesouhlasí lomené závorky.
de: SOAP-ENC:arrayType enthält nicht übereinstimmende Klammern.
es: Los corchetes SOAP-ENC:arrayType no coinciden.
fr: SOAP-ENC:arrayType a des crochets non appariés.
it: SOAP-ENC:arrayType contiene parentesi non corrispondenti.
ja: SOAP-ENC:arrayType に一致しないかっこがあります。
ko: SOAP-ENC:arrayType에 짝이 맞지 않는 괄호가 있습니다.
pl: W elemencie SOAP-ENC:arrayType znajdują się niedopasowane nawiasy klamrowe.
pt_br: SOAP-ENC:arrayType tem colchetes incompatíveis.
ru: SOAP-ENC:arrayType имеет непарные скобки.
tr: SOAP-ENC:arrayType, eşleşmeyen köşeli ayraçlara sahip.
zh_hans: SOAP-ENC:arrayType 有不匹配的括号。
zh_hant: SOAP-ENC:arrayType 的括號不相符。

# XmlMissingArrayType
source: SOAP-ENC:arrayType was missing at {0}.
cs: Typ SOAP-ENC:arrayType chybí v atributu {0}.
de: SOAP-ENC:arrayType fehlt bei {0}.
es: Falta SOAP-ENC:arrayType en {0}.
fr: SOAP-ENC:arrayType était manquant à {0}.
it: SOAP-ENC:arrayType mancante alla posizione {0}.
ja: SOAP-ENC:arrayType が {0} で見つかりません。
ko: {0}에서 SOAP-ENC:arrayType이 없습니다.
pl: Brak elementu SOAP-ENC:arrayType w {0}.
pt_br: SOAP-ENC:arrayType ausente em {0}.
ru: SOAP-ENC:arrayType отсутствует в {0}.
tr: SOAP-ENC:arrayType, {0} konumunda eksik.
zh_hans: {0} 处缺少 SOAP-ENC:arrayType。
zh_hant: {0} 遺漏 SOAP-ENC:arrayType。

# XmlMissingAttribute
source: The attribute {0} is missing.
cs: Chybí atribut {0}.
de: Das {0}-Attribut fehlt.
es: Falta el atributo {0}.
fr: L'attribut {0} est manquant.
it: Manca l'attributo {0}.
ja: {0} 属性がありません。
ko: {0} 특성이 없습니다.
pl: Brak atrybutu {0}.
pt_br: Atributo {0} ausente.
ru: Отсутствует атрибут {0}.
tr: {0} özniteliği eksik.
zh_hans: 缺少特性 {0}。
zh_hant: 遺漏屬性 {0}。

# XmlMissingAttributeGroup
source: The attribute group {0} is missing.
cs: Chybí skupina atributů {0}.
de: Die {0}-Attributgruppe fehlt.
es: Falta el grupo de atributo {0}.
fr: Le groupe d'attributs {0} est manquant.
it: Manca il gruppo di attributi {0}.
ja: 属性グループ {0} が見つかりません。
ko: {0} 특성 그룹이 없습니다.
pl: Brak grupy atrybutów {0}.
pt_br: Grupo de atributos {0} ausente.
ru: Отсутствует группа атрибутов {0}.
tr: {0} öznitelik grubu eksik.
zh_hans: 缺少特性组 {0}。
zh_hant: 遺漏屬性群組 {0}。

# XmlMissingDataType
source: The datatype '{0}' is missing.
cs: Chybí datový typ {0}.
de: Der Datentyp "{0}" fehlt.
es: Falta el tipo de datos "{0}".
fr: Le type de données '{0}' est manquant.
it: Manca il tipo di dati '{0}'.
ja: データ型 '{0}' が見つかりません。
ko: '{0}' 데이터 형식이 없습니다.
pl: Brak typu danych „{0}”.
pt_br: Tipo de dados '{0}' ausente.
ru: Отсутствует тип данных "{0}".
tr: '{0}' veri türü eksik.
zh_hans: 缺少数据类型“{0}”。
zh_hant: 遺漏資料類型 '{0}'。

# XmlMissingElement
source: The element '{0}' is missing.
cs: Chybí element {0}.
de: Das Element "{0}" fehlt.
es: Falta el elemento "{0}".
fr: L'élément '{0}' est manquant.
it: Manca l'elemento '{0}'.
ja: 要素 '{0}' が見つかりません。
ko: '{0}' 요소가 없습니다.
pl: Brak elementu „{0}”.
pt_br: Elemento '{0}' ausente.
ru: Отсутствует элемент "{0}".
tr: '{0}' öğesi eksik.
zh_hans: 缺少元素“{0}”。
zh_hant: 遺漏元素 '{0}'。

# XmlMissingGroup
source: Group {0} is missing.
cs: Chybí skupina {0}.
de: Die Gruppe {0} fehlt.
es: Falta el grupo {0}.
fr: Groupe {0} manquant.
it: Manca il gruppo {0}.
ja: グループ {0} が見つかりません。
ko: {0} 그룹이 없습니다.
pl: Brak grupy {0}.
pt_br: Grupo {0} ausente.
ru: Отсутствует группа {0}.
tr: {0} grubu eksik.
zh_hans: 缺少组 {0}。
zh_hant: 遺漏群組 {0}。

# XmlMissingHref
source: The referenced element with ID '{0}' is located outside the current document and cannot be retrieved.
cs: Odkazovaný element s identifikátorem {0} je umístěn mimo aktuální dokument a nelze jej načíst.
de: Das Element mit der ID "{0}", auf das verwiesen wird, befindet sich außerhalb des aktuellen Dokuments und kann nicht abgerufen werden.
es: El elemento con id. "{0}" al que se hace referencia está situado fuera del documento actual y no se puede recuperar.
fr: L'élément référencé avec l'ID '{0}' est situé en dehors du document actif et ne peut pas être récupéré.
it: L'elemento con ID '{0}' di riferimento si trova all'esterno del documento corrente e non può essere recuperato.
ja: 参照された ID '{0}' の要素は、現在のドキュメントの外側にあるため、取得できません。
ko: ID가 '{0}'인 참조된 요소는 현재 문서 외부에 있으므로 검색할 수 없습니다.
pl: Element o identyfikatorze „{0}”, do którego nastąpiło odwołanie, znajduje się poza bieżącym dokumentem i nie może zostać pobrany.
pt_br: O elemento referenciado com ID '{0}' está localizado fora do documento atual e não pode ser recuperado.
ru: Элемент с идентификатором "{0}", на который задана ссылка, находится вне текущего документа и не может быть извлечен.
tr: Başvurulan '{0}' kimliğine sahip öğe geçerli belgenin dışında bir konumda ve alınamaz.
zh_hans: ID 为“{0}”的引用元素位于当前文档外，不能被检索。
zh_hant: 擁有 ID '{0}' 的參考元素位於目前文件外，而且無法擷取。

# XmlMissingMethod
source: {0} was not found in {1}.
cs: Metoda {0} nebyla v {1} nalezena.
de: {0} wurde nicht gefunden in {1}.
es: No se puede encontrar {0} en {1}.
fr: {0} est introuvable dans {1}.
it: {0} non è stato trovato in {1}.
ja: {0} が {1} にありませんでした。
ko: {1}에서 {0}을(를) 찾을 수 없습니다.
pl: Element {0} nie został odnaleziony w elemencie {1}.
pt_br: {0} não foi encontrado em {1}.
ru: {0} не найден в {1}.
tr: {0}, {1} içinde bulunamadı.
zh_hans: {0} 在 {1} 中未找到。
zh_hant: 在 {1} 中找不到 {0}。

# XmlMissingMethodEnum
source: The method for enum {0} is missing.
cs: Chybí metoda pro výčet {0}.
de: Die Methode für die {0}-Enumeration fehlt.
es: Falta el método para la enumeración {0}.
fr: La méthode pour enum {0} est manquante.
it: Manca il metodo per l'enumerazione {0}.
ja: 列挙型 {0} のメソッドがありません。
ko: 열거형 {0}에 대한 메서드가 없습니다.
pl: Brak metody dla wyliczenia {0}.
pt_br: Método para enumeração {0} ausente.
ru: Метод перечисления {0} отсутствует.
tr: {0} sabit listesinin metodu eksik.
zh_hans: 缺少枚举 {0} 的方法。
zh_hant: 遺漏列舉 {0} 的方法。

# XmlMissingSchema
source: Missing schema targetNamespace="{0}".
cs: Chybí obor názvů targetNamespace={0} schématu.
de: Fehlender targetNamespace="{0}" für Schema.
es: Falta el esquema targetNamespace="{0}".
fr: Schéma manquant : targetNamespace="{0}".
it: Manca il valore targetNamespace="{0}" dello schema.
ja: スキーマ targetNamespace="{0}" が見つかりません。
ko: 스키마 targetNamespace="{0}"이(가) 없습니다.
pl: Brak schematu targetNamespace=„{0}”.
pt_br: Esquema de targetNamespace ausente = "{0}".
ru: Отсутствует схема targetNamespace="{0}".
tr: targetNamespace="{0}" şeması eksik.
zh_hans: 缺少架构 targetNamespace=“{0}”。
zh_hant: 缺少結構描述 targetNamespace="{0}"。

# XmlMissingType
source: Invalid serialization assembly: Required type {0} cannot be found in the generated assembly '{1}'.
cs: Neplatné sestavení serializace: Ve vygenerovaném sestavení {1} nebyl nalezen požadovaný typ {0}.
de: Ungültige Serialisierungsassembly: Der erforderliche Typ {0} wurde nicht in der generierten Assembly "{1}" gefunden.
es: Ensamblado de serialización no válido: falta el tipo {0} en el ensamblado generado "{1}".
fr: Assembly de sérialisation non valide : le type obligatoire {0} est introuvable dans l'assembly généré '{1}'.
it: Assembly di serializzazione non valido: il tipo obbligatorio {0} non è stato trovato nell'assembly generato '{1}'.
ja: シリアル化アセンブリが無効です。生成されたアセンブリ '{1}' から、必要な型 {0} が見つかりませんでした。
ko: serialization 어셈블리가 잘못되었습니다. 필요한 형식 {0}이(가) 생성된 어셈블리 '{1}'에 없습니다.
pl: Nieprawidłowy zestaw serializacji: w wygenerowanym zestawie „{1}” nie znaleziono wymaganego typu {0}.
pt_br: Serialização de assembly inválida: não foi possível encontrar o tipo {0} necessário no assembly gerado '{1}'.
ru: Недопустимая сборка сериализации: требуемый тип "{0}" не удается найти в созданной сборке {1}".
tr: Geçersiz serileştirme bütünleştirilmiş kodu: Gereken {0} türü oluşturulan '{1}' bütünleştirilmiş kodunda bulunamıyor.
zh_hans: 无效序列化程序集: 在生成的程序集“{1}”中找不到所需的类型 {0}。
zh_hant: 序列化組件無效: 在產生的組件 '{1}' 中找不到所需的類型 {0}。

# XmlMultipleAttributeOverrides
source: {0}. {1} already has attributes.
cs: {0}. {1} již má atributy.
de: {0}. {1} enthält bereits Attribute.
es: {0}. {1} ya tiene atributos.
fr: {0}. {1} a déjà des attributs.
it: {0}. {1} contiene già attributi.
ja: {0}.{1} には既に属性が指定されています。
ko: {0}. {1}에 이미 특성이 있습니다.
pl: Element {0}. {1} już ma atrybuty.
pt_br: {0}. {1} já tem atributos.
ru: {0}. {1} уже имеет атрибуты.
tr: {0}. {1}, zaten özniteliklere sahip.
zh_hans: {0}。{1} 已有特性。
zh_hant: {0}。{1} 已經有屬性。

# XmlMultipleXmlns
source: Cannot serialize object of type '{0}' because it has multiple XmlNamespaceDeclarations attributes.
cs: Objekt typu {0} nelze serializovat, protože má několik atributů XmlNamespaceDeclarations.
de: Das Objekt vom Typ "{0}" kann nicht serialisiert werden, da es mehrere XmlNamespaceDeclarations-Attribute enthält.
es: No se puede serializar el objeto de tipo "{0}" porque tiene varios atributos XmlNamespaceDeclarations.
fr: Impossible de sérialiser l'objet de type '{0}', car il a plusieurs attributs XmlNamespaceDeclarations.
it: Non è possibile serializzare l'oggetto di tipo '{0}' perché contiene più attributi XmlNamespaceDeclarations.
ja: 型 '{0}' のオブジェクトは、複数の XmlNamespaceDeclarations 属性を持っているため、シリアル化できません。
ko: XmlNamespaceDeclarations 특성이 여러 개 있으므로 '{0}' 형식의 개체를 직렬화할 수 없습니다.
pl: Nie można serializować obiektu typu „{0}”, ponieważ ma on wiele atrybutów XmlNamespaceDeclarations.
pt_br: Não é possível serializar objeto do tipo '{0}' porque ele tem vários atributos XmlNamespaceDeclarations.
ru: Невозможно сериализовать объект типа "{0}", так как он имеет несколько атрибутов XmlNamespaceDeclarations.
tr: Birden çok XmlNamespaceDeclarations özniteliklerine sahip olduğundan '{0}' türündeki nesne serileştirilemiyor.
zh_hans: 无法序列化类型“{0}”的对象，原因是它有多个 XmlNamespaceDeclarations 特性。
zh_hant: 因為物件有多個 XmlNamespaceDeclarations 的屬性，所以無法序列化類型 '{0}' 的物件。

# XmlMultipleXmlnsMembers
source: XmlNamespaceDeclarations may not be used on multiple parameters or return values.
cs: Atribut XmlNamespaceDeclarations nesmí být použit pro více parametrů nebo vrácených hodnot.
de: XmlNamespaceDeclarations kann nicht in mehreren Parametern oder Rückgabewerten verwendet werden.
es: No se puede utilizar el atributo XmlNamespaceDeclarations con varios parámetros o valores devueltos.
fr: Impossible d'utiliser l'attribut XmlNamespaceDeclarations sur plusieurs paramètres ou valeurs retournées.
it: Non è possibile usare XmlNamespaceDeclarations in più parametri o valori restituiti.
ja: XmlNamespaceDeclarations は複数のパラメーターまたは戻り値に使用できません。
ko: XmlNamespaceDeclarations는 여러 매개 변수 또는 반환 값에 사용할 수 없습니다.
pl: Elementy XmlNamespaceDeclarations nie mogą być używane na wielu parametrach lub wartościach zwracanych.
pt_br: XmlNamespaceDeclarations não podem ser usadas em vários parâmetros ou em valores retornados.
ru: Невозможно использовать XmlNamespaceDeclarations для нескольких параметров или возвращаемых значений.
tr: XmlNamespaceDeclarations, birden çok parametre veya dönüş değerinde kullanılamaz.
zh_hans: XmlNamespaceDeclarations 不能用在多个参数或返回值上。
zh_hant: XmlNamespaceDeclarations 不可以用於多個參數或傳回值。

# XmlNeedAttributeHere
source: The node must be either type XmlAttribute or a derived type.
cs: Uzel musí být buď typu XmlAttribute, nebo odvozeného typu.
de: Der Knoten muss den Typ XmlAttribute oder einen abgeleiteten Typ aufweisen.
es: El nodo debe ser de tipo XmlAttribute o un tipo derivado.
fr: Le nœud doit être de type XmlAttribute ou d'un type dérivé.
it: Il nodo deve essere di tipo XmlAttribute o di un tipo derivato.
ja: ノードは XmlAttribute 型またはその派生型でなければなりません。
ko: 노드는 XmlAttribute 형식 또는 파생된 형식이어야 합니다.
pl: Węzeł musi być typu XmlAttribute albo typu pochodnego.
pt_br: O nó deve ser do tipo XmlAttribute ou um tipo derivado.
ru: Узел должен иметь тип XmlAttribute или производный от него тип.
tr: Düğümün türü XmlAttribute veya türetilmiş bir tür olmalıdır.
zh_hans: 节点必须是 XmlAttribute 类型或派生类型。
zh_hant: 節點必須是 XmlAttribute 類型或衍生類型。
