Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_AnyAttributeLastChild
source: 'anyAttribute' must be the last child.
cs: Atribut anyAttribute musí být poslední podřízenou položkou.
de: "anyAttribute" muss das letzte untergeordnete Element sein.
es: "anyAttribute" debe ser el último elemento secundario.
fr: 'anyAttribute' doit être le dernier enfant.
it: 'anyAttribute' deve essere l'ultimo elemento figlio.
ja: 'anyAttribute' は最後の子でなければなりません。
ko: 'anyAttribute'는 마지막 자식이어야 합니다.
pl: Element „anyAttribute” musi być ostatnim elementem podrzędnym.
pt_br: 'anyAttribute' deve ser o último filho.
ru: anyAttribute должен быть последним дочерним элементом.
tr: 'anyAttribute' son alt olmalıdır.
zh_hans: "anyAttribute" 必须是最后一个子级。
zh_hant: 'anyAttribute' 必須是最後一個子系。

# Sch_AnyElement
source: any element
cs: jakýkoli element
de: beliebiges Element
es: cualquier elemento
fr: n'importe quel élément
it: qualsiasi elemento
ja: すべての要素
ko: 모든 요소
pl: dowolny element
pt_br: qualquer elemento
ru: любой элемент
tr: herhangi bir öğe
zh_hans: 任意元素
zh_hant: 任何項目

# Sch_AnyElementNS
source: any element in namespace '{0}'
cs: jakýkoli element v oboru názvů {0}
de: beliebiges Element im Namespace "{0}"
es: cualquier elemento en el espacio de nombres "{0}"
fr: élément any dans l'espace de noms '{0}'
it: qualsiasi elemento nello spazio dei nomi '{0}'
ja: 名前空間 '{0}' のすべての要素
ko: 네임스페이스 '{0}'의 any 요소
pl: dowolny element w przestrzeni nazw „{0}”
pt_br: qualquer elemento no namespace '{0}'
ru: любой элемент в пространстве имен "{0}"
tr: '{0}' ad alanındaki herhangi bir öğe
zh_hans: 命名空间“{0}”中的任意元素
zh_hant: 命名空間 '{0}' 中的任一元素

# Sch_AnyFromAnyRule1
source: The derived wildcard's occurrence range is not a valid restriction of the base wildcard's occurrence range, Any:Any -- NSSubset Rule 1.
cs: Odvozený rozsah výskytů zástupného znaku není platné omezení základního rozsahu výskytů zástupného znaku, Any:Any -- NSSubset Rule 1.
de: Der Vorkommensbereich des abgeleiteten Platzhalters ist keine gültige Einschränkung für den Vorkommensbereich des Basisplatzhalters, Any:Any -- NSSubset-Regel 1.
es: El intervalo de aparición del comodín derivado no es una restricción válida del intervalo de aparición del comodín base, Any:Any -- NSSubset Rule 1.
fr: La plage des occurrences du caractère générique dérivé ne constitue pas une restriction valide de la plage des occurrences du caractère générique de base, Any:Any -- NSSubset Rule 1.
it: L'intervallo di occorrenza del carattere jolly derivato non è una restrizione valida dell'intervallo di occorrenza del carattere jolly di base (regola 1 di Any:Any -- NSSubset).
ja: 派生型のワイルドカードの出現範囲は、基本型のワイルドカードの出現範囲の有効な制限ではありません (Any:Any -- NSSubset 規則 1)。
ko: 파생 와일드카드 발생 범위는 기본 와일드카드 발생 범위인 Any:Any -- NSSubset Rule 1의 유효한 제한이 아닙니다.
pl: Zakres wystąpień pochodnego symbolu wieloznacznego nie jest prawidłowym ograniczeniem zakresu wystąpień podstawowego symbolu wieloznacznego (Any:Any -- NSSubset: reguła 1).
pt_br: O intervalo de ocorrência do curinga derivado não é uma restrição válida do intervalo de ocorrência do curinga base, Any:Any -- NSSubset Rule 1.
ru: Диапазон вхождения производного подстановочного знака не является допустимым ограничением для диапазона вхождения базового подстановочного знака, Any:Any -- NSSubset Rule 1.
tr: Türetilen joker parçacığın yineleme aralığı, temel alınan joker parçacığa ilişkin yineleme aralığının geçerli bir kısıtlaması değil, Any:Any -- NSSubset Kural 1.
zh_hans: 根据 Any:Any -- NSSubset 规则 1，派生通配符的出现范围不是基本通配符出现范围的有效限制。
zh_hant: 衍生的萬用字元之出現範圍，不是基底萬用字元的出現範圍之有效限制，Any:Any -- NSSubset Rule 1。

# Sch_AnyFromAnyRule2
source: The derived wildcard's namespace constraint must be an intensional subset of the base wildcard's namespace constraint, Any:Any -- NSSubset Rule2.
cs: Odvozené omezení oboru názvů zástupného znaku musí být zamýšlenou podmnožinou základního omezení oboru názvů zástupného znaku, Any:Any -- NSSubset Rule2.
de: Die Namespaceeinschränkung des abgeleiteten Platzhalters muss eine gewollte Teilmenge der Namespaceeinschränkung des Basisplatzhalters sein, Any:Any -- NSSubset-Regel 2.
es: La restricción de espacio de nombres del comodín derivado debe ser un subconjunto intensional de la restricción de espacio de nombres del comodín base, Any:Any -- NSSubset Rule2.
fr: La contrainte d'espace de noms du caractère générique dérivé doit être un sous-ensemble intentionnel de la contrainte d'espace de noms du caractère générique de base, Any:Any -- NSSubset Rule2.
it: Il vincolo dello spazio dei nomi del carattere jolly derivato deve essere un sottoinsieme intenzionale del vincolo dello spazio dei nomi del carattere jolly di base (regola 2 Any:Any -- NSSubset).
ja: 派生型のワイルドカードの名前空間制約は、基本型のワイルドカードの名前空間制約の内包的なサブセットである必要があります。Any:Any -- NSSubset Rule2。
ko: 파생 와일드카드 네임스페이스 제약 조건은 기본 와일드카드 네임스페이스 제약 조건의 내포된 하위 집합이어야 합니다(Any:Any -- NSSubset Rule2).
pl: Ograniczenie przestrzeni nazw pochodnego symbolu wieloznacznego nie jest prawidłowym ograniczeniem zakresu wystąpień podstawowego symbolu wieloznacznego (Any:Any -- NSSubset: reguła 2).
pt_br: A restrição do namespace do curinga derivado deve ser um subconjunto mais forte da restrição do namespace do curinga base, Any:Any -- NSSubset Rule2.
ru: Ограничение пространства имен для производного подстановочного знака должно быть содержательным подмножеством ограничения пространства имен для базового подстановочного знака, Any:Any -- NSSubset Rule 2.
tr: Türetilen joker parçacığın ad alanı kısıtlaması, temel alınan joker parçacığın ad alanı kısıtlamasının belirli bir alt kümesi olmalı, Any:Any -- NSSubset Kural 2.
zh_hans: 根据 Any:Any -- NSSubset 规则 2，派生通配符的命名空间约束必须为基本通配符命名空间约束的内含子集。
zh_hant: 衍生的萬用字元條件約束必須是基底萬用字元命名空間條件約束的加強子集，Any:Any -- NSSubset Rule2。

# Sch_AnyFromAnyRule3
source: The derived wildcard's 'processContents' must be identical to or stronger than the base wildcard's 'processContents', where 'strict' is stronger than 'lax' and 'lax' is stronger than 'skip', Any:Any -- NSSubset Rule 3.
cs: Odvozený atribut processContents zástupného znaku musí být identický nebo silnější než základní atribut processContents zástupného znaku, kde hodnota strict představuje silnější nastavení než hodnota lax a hodnota lax představuje silnější nastavení než hodnota skip, Any:Any -- NSSubset Rule 3.
de: Das processContents-Attribut des abgeleiteten Platzhalters muss identisch mit dem oder strenger als das processContents-Attribut des Basisplatzhalters sein, wobei "strict" strenger als "lax" und "lax" strenger als "skip" ist, Any:Any -- NSSubset-Regel 3.
es: El elemento "processContents" del comodín derivado debe ser idéntico o más fuerte que el elemento "processContents" del comodín base, donde "strict" es más fuerte que "lax", y "lax" es más fuerte que "skip", Any:Any -- NSSubset Rule 3.
fr: Le 'processContents' du caractère générique dérivé doit être identique ou plus fort que le 'processContents' du caractère générique de base, où 'strict' est plus fort que 'lax', et 'lax' plus fort que 'skip', Any:Any -- NSSubset Rule 3.
it: La proprietà 'processContents' del carattere jolly derivato deve essere identica o superiore alla proprietà 'processContents' del carattere jolly di base, dove 'strict' è superiore a 'lax' e 'lax', a sua volta, è superiore a 'skip' (regola 3 Any:Any -- NSSubset).
ja: 派生型のワイルドカードの 'processContents' は、基本型のワイルドカードの 'processContents' と同じか強い値である必要があります。値は、'strict' が 'lax' より強く、'lax' が 'skip' より強くなります (Any:Any -- NSSubset 規則 3)。
ko: 파생 와일드카드 'processContents'는 기본 와일드카드의 'processContents'인 Any:Any -- NSSubset Rule 3과 같거나 더 강력해야 합니다. 여기서 'strict'는 'lax'보다 강력하고 'lax'는 'skip'보다 강력합니다.
pl: Element „processContents” pochodnego symbolu wieloznacznego musi być taki sam lub mocniejszy niż element „processContents” podstawowego symbolu wieloznacznego, przy czym element „strict” jest mocniejszy niż element „lax”, a element „lax” jest mocniejszy niż element „skip” (Any:Any -- NSSubset: reguła 3).
pt_br: O 'processContents' do curinga derivado deve ser idêntico ou mais forte que 'processContents' do curinga base, em que 'strict' é mais forte que 'lax' e 'lax' é mais forte que 'skip', Any:Any -- NSSubset Rule 3.
ru: processContents производного подстановочного знака должен быть идентичен или строже processContents базового подстановочного знака, где strict — строже, чем lax, а lax строже, чем skip, Any:Any -- NSSubset Rule 3.
tr: Türetilen joker parçacığın 'processContents'i, temel alınan joker parçacığın 'processContents'i ile aynı veya ondan daha güçlü olmalı; 'strict', 'lax' belirtiminden ve 'lax' ise 'skip' belirtiminden daha güçlüdür, Any:Any -- NSSubset Kural 3.
zh_hans: 根据 Any:Any -- NSSubset 规则 3，派生通配符的 "processContents" 必须等于或强于基本通配符的 "processContents"，其中 "strict" 强于 "lax"，"lax" 强于 "skip"。
zh_hant: 衍生的萬用字元 'processContents' 必須是唯一的或比基底萬用字元更加嚴密，例如 "strict" 比 "lax" 嚴密，而 "lax" 又比 "skip" 更嚴密，Any:Any -- NSSubset Rule 3。

# Sch_AttListPresence
source: An attribute of type ID must have a declared default of either #IMPLIED or #REQUIRED.
cs: Atribut typu ID musí mít deklarovanou výchozí hodnotu #IMPLIED nebo #REQUIRED.
de: Ein Attribut vom Typ "ID" muss einen deklarierten Standard von #IMPLIED oder #REQUIRED haben.
es: Los atributos de tipo ID deben tener #IMPLIED o #REQUIRED como valor predeterminado declarado.
fr: Un attribut d'ID de type doit avoir la valeur par défaut déclarée #IMPLIED ou #REQUIRED.
it: Il valore predefinito dichiarato di un attributo di tipo ID deve essere #IMPLIED o #REQUIRED.
ja: タイプ ID の属性には宣言された既定の #IMPLIED または #REQUIRED が必要です。
ko: 형식 ID 특성에는 선언된 기본값 #IMPLIED 또는 #REQUIRED가 있어야 합니다.
pl: Atrybut typu ID musi mieć zadeklarowaną wartość domyślną #IMPLIED albo #REQUIRED.
pt_br: Um atributo de ID de tipo deve ter um padrão declarado #IMPLIED ou #REQUIRED.
ru: Для атрибута с типом ID должно быть объявлено значение по умолчанию #IMPLIED или #REQUIRED.
tr: ID türü bir özniteliğin, değeri #IMPLIED ya da #REQUIRED olan bildirilmiş bir varsayılanı olmalıdır.
zh_hans: ID 类型的特性必须具有已声明的 #IMPLIED 或 #REQUIRED 默认值。
zh_hant: 類型識別的屬性必須擁有已宣告的 #IMPLIED 或 #REQUIRED 預設值。

# Sch_AttrGroupDoubleRedefine
source: Double redefine for attribute group.
cs: Skupina atributů byla předefinována dvakrát.
de: Doppelte Neudefinition für Attributgruppe.
es: Redefinición doble para el grupo de atributos.
fr: Double redéfinition pour le groupe d'attributs.
it: Doppia ridefinizione per il gruppo di attributi.
ja: 属性グループに対する二重定義です。
ko: 특성 그룹을 두 번 다시 정의했습니다.
pl: Podwójne przedefiniowanie dla grupy atrybutów.
pt_br: Redefinição dupla para grupo de atributos.
ru: Двойное переопределение для группы атрибутов.
tr: Öznitelik grubu için çift yeniden tanımlama.
zh_hans: 特性组的双重重定义。
zh_hant: 重新定義兩次屬性群組。

# Sch_AttrGroupRedefineNotFound
source: No attribute group to redefine.
cs: Nebyla nalezena žádná skupina atributů k předefinování.
de: Es ist keine Attributgruppe zum erneuten Definieren vorhanden.
es: No hay grupo de atributos para redefinir.
fr: Aucun groupe d'attributs à redéfinir.
it: Non ci sono gruppi di attributi da ridefinire.
ja: 再定義する属性グループがありません。
ko: 다시 정의할 특성 그룹이 없습니다.
pl: Brak grupy atrybutów do przedefiniowania.
pt_br: Nenhum grupo de atributos a ser redefinido.
ru: Отсутствует группа атрибутов для переопределения.
tr: Yeniden tanımlanacak öznitelik grubu yok.
zh_hans: 没有要重新定义的特性组。
zh_hant: 沒有屬性群組可重新定義。

# Sch_AttrUseAndWildId
source: It is an error if there is a member of the attribute uses of a type definition with type xs:ID or derived from xs:ID and another attribute with type xs:ID matches an attribute wildcard.
cs: Pokud existuje člen použití atributu definice typu s typem xs:ID nebo typem odvozeným z typu xs:ID a jiný atribut s typem xs:ID odpovídající zástupnému znaku atributu, jedná se o chybu.
de: Wenn ein Member des Attributs eine Typdefinition vom Typ "xs:ID" oder eine von "xs:ID" abgeleitete Typdefinition verwendet und ein anderes Attribut vom Typs "xs:ID" mit einem Attributplatzhalter übereinstimmt, tritt ein Fehler auf.
es: Es incorrecto que un miembro de los usos de atributo de una definición de tipo con tipo xs:ID o derivado de xs:ID y otro atributo con tipo xs:ID coincida con un comodín de atributo.
fr: Il s'agit d'une erreur si un membre de l'attribut utilise une définition de type avec un type xs:ID ou dérivé de xs:ID, et si un autre attribut de type xs:ID correspond au caractère générique d'un attribut.
it: Si verifica un errore se un membro dell'attributo usa la definizione di un tipo con xs:ID o derivato da xs:ID e un altro attributo con tipo xs:ID corrisponde a un carattere jolly dell'attributo.
ja: xs:ID 型を持つ型定義の uses 属性のメンバーが存在するか、または xs:ID から派生した uses 属性のメンバーが存在し、xs:ID 型の他の属性が属性のワイルドカードに一致する場合、これはエラーです。
ko: 멤버의 해당 특성이 xs:ID 또는 xs:ID에서 파생된 형식 정의를 사용하거나 멤버에 특성 와일드카드와 일치하는 xs:ID 형식의 다른 특성이 있으면 오류가 발생합니다.
pl: Jeśli istnieje składowa użyć atrybutu z definicją typu xs:ID lub pochodnego względem typu xs:ID, a inny atrybut typu xs:ID jest zgodny z symbolem wieloznacznym, występuje błąd.
pt_br: Erro se houver um membro dos usos do atributo de uma definição de tipo com tipo xs:ID ou derivado de xs:ID e outro atributo com tipo xs:ID corresponde ao curinga de um atributo.
ru: Считается ошибкой, если существует член атрибута uses с определением типа xs:ID или производным от xs:ID и другой атрибут типа xs:ID соответствует подстановочному знаку атрибута.
tr: Özniteliğin xs:ID türünde veya xs:ID'den türetilen tür tanımı kullanan bir üyesi olması ve xs:ID türündeki başka bir özniteliğin bir öznitelik joker parçacığıyla eşleşmesi hatadır.
zh_hans: 如果在类型定义的特性应用中类型为 xs:ID 或从 xs:ID 派生的类型的某个成员以及另一个类型为 xs:ID 特性均与某个特性通配符匹配，则是错误的。
zh_hant: 若某屬性成員使用類型 xs:ID 的類型定義或衍生自 xs:ID，且另一附有類型 xs:ID 的屬性符合屬性萬用字元，即為錯誤。

# Sch_AttributeCircularRef
source: Circular attribute reference.
cs: Cyklický odkaz na atribut
de: Zirkulärer Attributverweis.
es: Referencia circular a atributos.
fr: Référence d'attribut circulaire.
it: Riferimento circolare ad attributo.
ja: 属性の循環参照です。
ko: 순환 특성 참조입니다.
pl: Cykliczne odwołanie do atrybutu.
pt_br: Referência circular de atributo.
ru: Циклическая ссылка на атрибут.
tr: Döngüsel öznitelik başvurusu.
zh_hans: 循环特性引用。
zh_hant: 循環屬性參考。

# Sch_AttributeDefaultDataType
source: The default value of '{0}' attribute is invalid according to its datatype.
cs: Výchozí hodnota atributu {0} je vzhledem k jeho datovému typu neplatná.
de: Der Standardwert des {0}-Attributs ist gemäß seinem Datentyp ungültig.
es: El valor predeterminado del atributo "{0}" no es válido según el tipo de datos.
fr: La valeur par défaut de l'attribut '{0}' est non valide selon son type de données.
it: Il valore predefinito dell'attributo '{0}' non è valido in base al relativo tipo di dati.
ja: '{0}' 属性の既定値は datatype に対して無効です。
ko: '{0}' 특성의 기본값은 데이터 형식이 잘못되었습니다.
pl: Domyślna wartość atrybutu „{0}” jest nieprawidłowa przy uwzględnieniu jego typu danych.
pt_br: O valor padrão do atributo '{0}' é inválido de acordo com seu tipo de dados.
ru: Значение по умолчанию для атрибута "{0}" при этом типе данных является недопустимым.
tr: '{0}' özniteliğinin varsayılan değeri kendi veri türüne göre geçersiz.
zh_hans: 根据“{0}”特性的数据类型，其默认值无效。
zh_hant: 根據 '{0}' 屬性的資料類型，其預設值無效。

# Sch_AttributeFixedInvalid
source: Invalid attribute restriction. Derived attribute's fixed value must be the same as the base attribute's fixed value.
cs: Neplatné omezení atributů. Odvozená pevná hodnota atributu musí být stejná jako základní pevná hodnota atributu.
de: Ungültige Attributeinschränkung. Der feste Wert des abgeleiteten Attributs muss dem festen Wert des Basisattributs entsprechen.
es: Restricción de atributo no válida. El valor fijo del atributo derivado debe coincidir con el valor fijo del atributo base.
fr: Restriction d'attribut non valide. La valeur fixe de l'attribut dérivé doit être identique à celle de l'attribut de base.
it: La restrizione dell'attributo non è valida. Il valore fisso dell'attributo derivato deve essere uguale al valore fisso dell'attributo di base.
ja: 無効な属性制限です。派生型の属性の固定値は、基本型の属性の固定値と同じである必要があります。
ko: 특성 restriction이 잘못되었습니다. 파생 특성의 고정 값은 기본 특성의 고정 값과 같아야 합니다.
pl: Nieprawidłowe ograniczenie atrybutu. Ustalona wartość atrybutu pochodnego musi być taka sama jak ustalona wartość atrybutu podstawowego.
pt_br: Restrição de atributo inválida. O valor fixo do atributo derivado deve ser igual ao valor fixo do atributo base.
ru: Недопустимое ограничение атрибута. Фиксированное значение производного атрибута должно равняться фиксированному значению базового атрибута.
tr: Geçersiz öznitelik kısıtlaması. Türetilen özniteliğin sabit değeri temel alınan özniteliğin sabit değeriyle aynı olmalı.
zh_hans: 无效的特性限制。派生特性的固定值必须与基本特性的固定值相同。
zh_hant: 屬性限制無效。衍生屬性的固定值必須與 base 屬性的固定值相同。

# Sch_AttributeGroupCircularRef
source: Circular attribute group reference.
cs: Cyklický odkaz na skupinu atributů
de: Zirkulärer Attributgruppenverweis.
es: Referencia circular a grupo de atributos.
fr: Référence de groupe d'attributs circulaire.
it: Riferimento circolare a gruppo di attributi.
ja: 循環する属性グループ参照があります。
ko: 순환 특성 그룹 참조입니다.
pl: Cykliczne odwołanie do grupy atrybutów.
pt_br: Referência circular de grupo de atributos.
ru: Циклическая ссылка на группу атрибутов.
tr: Döngüsel öznitelik grubu başvurusu.
zh_hans: 循环特性组引用。
zh_hant: 循環屬性群組參考。

# Sch_AttributeIgnored
source: The '{0}' attribute is ignored, because the value of 'prohibited' for attribute use only prevents inheritance of an identically named attribute from the base type definition.
cs: Atribut {0} je ignorován, protože hodnota prohibited pro použití atributu slouží pouze k tomu, aby zabránila zdědění identicky pojmenovaného atributu z definice základního typu.
de: Das {0}-Attribut wird ignoriert, da der Wert "prohibited" für die Attributverwendung nur die Vererbung eines Attributs mit gleichem Namen aus der Basistypdefinition verhindert.
es: Se ha omitido el atributo "{0}" porque el valor "prohibited" para el uso de atributos solo impide que se herede un atributo de igual nombre de la definición de tipo base.
fr: L'attribut '{0}' est ignoré, car la valeur 'prohibited' pour l'utilisation de l'attribut empêche uniquement l'héritage d'un attribut portant le même nom à partir de la définition du type de base.
it: L'attributo '{0}' viene ignorato perché il valore 'prohibited' per l'uso dell'attributo impedisce solo l'ereditarietà di un attributo con nome identico dalla definizione del tipo di base.
ja: '{0}' 属性は無視されます。これは、属性での使用に限定されている 'prohibited' の値により、基本データ型の型定義で同じ名前の属性の継承が禁止されているためです。
ko: use 특성에 대한 'prohibited' 값은 기본 형식 정의에서 이름이 같은 특성이 상속되지 못하게 하는 역할만 하므로 '{0}' 특성을 무시합니다.
pl: Atrybut „{0}” jest ignorowany, ponieważ wartość „prohibited” użycia atrybutu umożliwia tylko uniknięcie dziedziczenia atrybutu o takiej samej nazwie z definicji typu podstawowego.
pt_br: O atributo '{0}' é ignorado, pois o valor de 'prohibited' para o uso do atributo só evita a herança de um atributo com nome idêntico à definição do tipo base.
ru: Атрибут "{0}" проигнорирован, так как значение prohibited для атрибута означает только запрещение наследования атрибута с тождественным именем из определения базового типа.
tr: Özniteliğe yönelik 'prohibited' değeri kullanımı, yalnızca temel tür tanımından aynı adlı özniteliğin devralınmasını önlediği için '{0}' özniteliği yok sayılır.
zh_hans: “{0}”特性被忽略，因为特性使用 "prohibited" 值仅为了防止从基类型定义继承同名的特性。
zh_hant: 已略過 '{0}' 屬性，因為此 'prohibited' 屬性使用的值只可用來避免從基底類型定義繼承相同命名的屬性。

# Sch_AttributeMutuallyExclusive
source: '{0}' and content model are mutually exclusive.
cs: Atribut {0} a model obsahu se vzájemně vylučují.
de: "{0}" und das Inhaltsmodell schließen sich gegenseitig aus.
es: "{0}" y el modelo de contenido se excluyen mutuamente.
fr: '{0}' et le modèle de contenu s'excluent mutuellement.
it: '{0}' e il modello di contenuto si escludono a vicenda.
ja: '{0}' およびコンテンツ モデルを併用することはできません。
ko: '{0}'과(와) 콘텐츠 모델은 함께 사용할 수 없습니다.
pl: Element „{0}” oraz model zawartości wykluczają się wzajemnie.
pt_br: '{0}' e o modelo de conteúdo são mutuamente excludentes.
ru: "{0}" и модель содержимого являются взаимоисключающими.
tr: '{0}' ve içerik modeli karşılıklı olarak birbirini dışlar.
zh_hans: “{0}”和内容模型互相排斥。
zh_hant: '{0}' 與內容模型互斥。

# Sch_AttributeNameRef
source: For attribute '{0}', either the name or the ref attribute must be present, but not both.
cs: Pro atribut {0} musí být přítomen buď atribut name, nebo atribut ref, ale nikoli oba současně.
de: Für das Attribut "{0}" darf entweder das name- oder das ref-Attribut vorhanden sein, aber nicht beide Attribute.
es: El atributo "{0}" tiene que tener presentes los atributos name o ref, pero no ambos.
fr: Pour l'attribut '{0}', l'attribut name ou l'attribut ref doit être présent, mais pas les deux.
it: Per l'attributo '{0}' deve essere presente l'attributo name o ref, ma non entrambi.
ja: 属性 '{0}' に対して、name または ref 属性のどちらかを指定しなければなりませんが、両方を同時に指定することはできません。
ko: '{0}' 특성에는 name 또는 ref 특성 중 하나를 지정해야 하지만 둘 다 지정할 필요는 없습니다.
pl: Dla atrybutu „{0}” musi być obecna nazwa albo atrybut odwołania, ale nie oba te elementy naraz.
pt_br: O atributo '{0}' deve ter o atributo name ou ref, mas não ambos.
ru: Для атрибута "{0}" обязательно наличие либо имени, либо атрибута ref, но не того и другого одновременно.
tr: '{0}' özniteliği için name veya ref özniteliği bulunmalıdır, ikisi birden bulunamaz.
zh_hans: 对于特性“{0}”，name 或 ref 特性中必须有一个存在，但不能同时存在。
zh_hant: 若是屬性 '{0}'，必須要有 name 或 ref 屬性，但兩者不可同時存在。

# Sch_AttributeRestrictionInvalid
source: Invalid attribute restriction. Derived attribute's type is not a valid restriction of the base attribute's type.
cs: Neplatné omezení atributů. Odvozený typ atributu nepředstavuje platné omezení základního typu atributu.
de: Ungültige Attributeinschränkung. Der Typ des abgeleiteten Attributs ist keine gültige Einschränkung des Typs des Basisattributs.
es: Restricción de atributo no válida. El tipo del atributo derivado no es una restricción válida del tipo del atributo base.
fr: Restriction d'attribut non valide. Le type de l'attribut dérivé ne constitue pas une restriction valide du type de l'attribut de base.
it: La restrizione dell'attributo non è valida. Il tipo dell'attributo derivato non è una restrizione valida del tipo dell'attributo di base.
ja: 無効な属性制限です。派生属性の型が、基本属性の型の有効な制限ではありません。
ko: 특성 restriction이 잘못되었습니다. 파생 특성 형식은 기본 특성 형식의 유효한 제한이 아닙니다.
pl: Nieprawidłowe ograniczenie atrybutu. Typ atrybutu pochodnego nie jest prawidłowym ograniczeniem typu atrybutu podstawowego.
pt_br: Restrição de atributo inválida. Tipo de atributo derivado não é uma restrição válida do tipo de atributo base.
ru: Недопустимое ограничение атрибута. Тип производного атрибута не является допустимым ограничением для типа базового атрибута.
tr: Geçersiz öznitelik kısıtlaması. Türetilen öznitelik türü temel alınan özniteliğin geçerli bir kısıtlaması değil.
zh_hans: 无效的特性限制。派生特性的类型不是基本特性类型的有效限制。
zh_hant: 屬性限制無效。衍生屬性的類型不是 base 屬性類型的有效限制。
