Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_SimpleTypeRestRefBaseNone
source: SimpleType restriction should have either the base attribute or a simpleType child to indicate the base type for the derivation.
cs: Omezení SimpleType by mělo mít buď základní atribut, nebo podřízený atribut simpleType k označení základního typu pro odvození.
de: Die SimpleType-Einschränkung muss das Basisattribut oder ein untergeordnetes Element "simpleType" aufweisen, um den Basistyp für die Ableitung anzugeben.
es: La restricción SimpleType debe tener el atributo base o un elemento secundario simpleType para indicar el tipo base para la derivación.
fr: La restriction SimpleType doit avoir l'attribut base ou un enfant simpleType, mais pas les deux pour indiquer le type de base de la dérivation.
it: Nella restrizione SimpleType deve essere presente l'attributo di base o un elemento figlio simpleType per indicare il tipo di base per la derivazione.
ja: 派生の基本データ型を示すには、SimpleType 制限に、base 属性か simpleType 子要素のどちらか一方が含まれている必要があります。
ko: SimpleType 제한에는 기본 특성이나 파생의 기본 형식을 나타내는 simpleType 자식 중 하나가 있어야 합니다.
pl: Ograniczenie typu SimpleType powinno mieć atrybut podstawowy lub element podrzędny typu simpleType, jeśli ma zostać wskazany typ podstawowy wyprowadzenia.
pt_br: A restrição SimpleType deve ter o atributo base ou um filho de simpleType para indicar o tipo base da derivação.
ru: Ограничение SimpleType должно иметь либо базовый атрибут, либо дочерний элемент simpleType, определяющий базовый тип для получения производных значений.
tr: SimpleType kısıtlamasında, türetme işlemine yönelik temel türü belirtmek için temel öznitelik veya simpleType alt öğesi bulunmalıdır.
zh_hans: SimpleType 限制应包含基特性或 simpleType 子级中的一个，指示派生的基类型。
zh_hant: SimpleType 限制要有 base 屬性或 simpleType 子系，才可指出衍生的 base 類型。

# Sch_SimpleTypeRestriction
source: 'simpleType' should be the first child of restriction.
cs: Atribut simpleType by měl být prvním podřízeným atributem omezení.
de: "simpleType" muss das erste untergeordnete Element der Einschränkung sein.
es: "simpleType" debe ser el primer elemento secundario de la restricción.
fr: 'simpleType' doit être le premier enfant de restriction.
it: 'simpleType' deve essere il primo elemento figlio della restrizione.
ja: 'simpleType' は制約の最初の子でなければなりません。
ko: 'simpleType'은 restriction의 첫 번째 자식이어야 합니다.
pl: Element „simpleType” powinien być pierwszym elementem podrzędnym ograniczenia.
pt_br: 'simpleType' deve ser o primeiro filho da restrição.
ru: simpleType должен являться первым дочерним элементом ограничения.
tr: 'simpleType' öğesi, kısıtlamanın ilk altı olmalıdır.
zh_hans: "simpleType" 应为限制的第一个子级。
zh_hant: 'simpleType' 應為限制的第一個子系。

# Sch_SimpleTypeUnionNoBase
source: Either the memberTypes attribute must be non-empty or there must be at least one simpleType child.
cs: Buď musí být atribut memberTypes neprázdný, nebo musí existovat nejméně jeden podřízený typ simpleType.
de: Das memberTypes-Attribut darf nicht leer sein, oder es muss mindestens ein untergeordnetes Element "simpleType" vorhanden sein.
es: El atributo memberTypes no puede estar vacío o debe haber al menos un elemento secundario de tipo simpleType.
fr: Soit l'attribut memberTypes est non vide, soit il existe au moins un seul enfant simpleType.
it: L'attributo memberTypes non deve essere vuoto oppure deve essere presente almeno un elemento figlio simpleType.
ja: memberTypes 属性に空でない値を指定するか、少なくとも 1 つの simpleType 子要素を指定しなければなりません。
ko: memberTypes 특성은 비어 있지 않거나 적어도 하나 이상의 simpleType 자식을 가져야 합니다.
pl: Atrybut memberTypes musi być niepusty albo musi istnieć co najmniej jeden element podrzędny simpleType.
pt_br: O atributo memberTypes deve ser não vazio ou deve ter pelo menos um simpleType filho.
ru: Атрибут memberTypes должен быть непустым, или должен присутствовать по меньшей мере один дочерний элемент simpleType.
tr: memberTypes özniteliği boş olmamalı ya da en az bir simpleType alt bulunmalıdır.
zh_hans: 或者 memberTypes 特性必须为非空，或者必须至少有一个 simpleType 子级。
zh_hant: memberTypes 屬性必須為非空白或至少必須要有一個 simpleType 子系。

# Sch_StandAlone
source: The standalone document declaration must have a value of 'no'.
cs: Samostatná deklarace dokumentu musí mít hodnotu no.
de: Die eigenständige Dokumentdeklaration muss den Wert "no" haben.
es: La declaración independiente del documento debe tener un valor igual a "no".
fr: La déclaration de document autonome doit avoir la valeur 'no'.
it: Il valore della dichiarazione del documento standalone deve essere 'no'.
ja: スタンドアロン ドキュメント宣言には "no" の値が必要です。
ko: 독립형 문서 선언의 값은 'no'여야 합니다.
pl: Autonomiczna deklaracja dokumentu musi mieć wartość „no”.
pt_br: A declaração de documento autônomo deve ter o valor 'no'.
ru: Изолированное объявление документа должно иметь значение no.
tr: Tek başına belge bildirimi 'no' değerine sahip olmalıdır.
zh_hans: 独立文档声明必须具有值 "no"。
zh_hant: 獨立文件的宣告的值必須是 'no'。

# Sch_StandAloneNormalization
source: StandAlone is 'yes' and the value of the attribute '{0}' contains a definition in an external document that changes on normalization.
cs: Vlastnost StandAlone má hodnotu yes a hodnota atributu {0} obsahuje definici v externím dokumentu, který se při normalizaci mění.
de: "StandAlone" ist "yes", und der Wert des Attributs "{0}" enthält eine Definition in einem externen Dokument, das bei Normalisierung geändert wird.
es: StandAlone es "yes" y el valor del atributo "{0}" contiene una definición en un documento externo que cambia al aplicar la normalización.
fr: StandAlone a la valeur 'yes' et la valeur de l'attribut '{0}' contient une définition dans un document externe qui change au moment de la normalisation.
it: Il valore di StandAlone è 'yes' e il valore dell'attributo '{0}' contiene una definizione in un documento esterno che cambia in caso di normalizzazione.
ja: StandAlone は 'yes' で、属性 '{0}' の値は正規化において変更する外部ドキュメントに定義を含んでいます。
ko: StandAlone은 'yes'이고 '{0}' 특성의 값에는 정규화에 따라 변경되는 외부 문서의 정의가 포함됩니다.
pl: Element StandAlone ma wartość „yes”, a wartość atrybutu „{0}” zawiera definicję w zewnętrznym dokumencie, który zmienia się przy normalizacji.
pt_br: StandAlone é 'yes' e o valor do atributo '{0}' contém uma definição em um documento externo que é alterada na normalização.
ru: StandAlone имеет значение yes, а значение атрибута "{0}" содержит определение во внешнем документе, которое изменяется при нормализации.
tr: StandAlone 'yes' olarak ayarlı ve '{0}' özniteliği, dış belgede, normalleştirmede değişen bir tanım içeriyor.
zh_hans: StandAlone 为 "yes"，并且特性“{0}”的值在外部文档中含有定义，该定义在正常化时会更改。
zh_hant: StandAlone 為 'yes' 且屬性 '{0}' 的值含有在正規化時所變更之外部文件中的定義。

# Sch_SubstitutionBlocked
source: Member element {0}'s type cannot be derived by restriction or extension from head element {1}'s type, because it has block='restriction' or 'extension'.
cs: Typ členského elementu {0} nemůže být odvozen omezením nebo rozšířením typu elementu head {1}, protože pro něj platí block=restriction nebo extension.
de: Der Typ des Memberelements {0} kann nicht durch Einschränkung oder Erweiterung im Typ des Head-Elements {1} abgeleitet werden, da für das Element block="restriction" oder "extension" gilt.
es: El tipo del elemento de miembro {0} no se puede derivar por restricción o extensión del tipo del elemento de encabezado {1}, incluye block="restriction" o "extension".
fr: Le type d'élément member {0} ne peut pas être dérivé par restriction ou extension à partir du type d'élément head {1}, car il contient block='restriction' ou 'extension'.
it: Il tipo dell'elemento membro {0} non può essere derivato per restrizione o estensione dal tipo dell'elemento head {1} perché contiene il valore block='restriction' o 'extension'.
ja: block='restriction' または block='extension' が設定されているため、メンバー要素 {0} の型は、head 要素 {1} の型の制限と拡張からは派生できません。
ko: 멤버 요소 {0}의 형식은 block='restriction' 또는 'extension'을 포함하므로 head 요소 {1} 형식의 제한 또는 확장에 의해 파생될 수 없습니다.
pl: Typ składowej {0} nie może zostać wyprowadzony przez ograniczenie lub rozszerzenie z typu elementu nagłówkowego {1}, ponieważ ustawiono dla niego właściwość block='restriction' lub block='extension'.
pt_br: O tipo de elemento do membro {0} não pode ser derivado por restrição nem por extensão do tipo de elemento head {1}, pois ele tem block='restriction' ou 'extension'.
ru: Недопустимо получение производного типа элемента-члена {0} путем ограничения или расширения типа элемента head {1}, поскольку block="restriction" или "extension".
tr: block='restriction' veya 'extension' olduğundan, {0} üye öğesinin türü {1} baş öğesi türünün kısıtlamasından veya uzantısından türetilemez.
zh_hans: 成员元素“{0}”的类型无法通过来自头元素“{1}”的类型的限制或扩展进行派生，因为它包含 block='restriction' 或 block='extension'。
zh_hant: 成員元素 {0} 的類型無法由限制衍生，或從標頭元素 {1} 的類型加以延伸，因為其有 block='restriction' 或 'extension'。

# Sch_SubstitutionCircularRef
source: Circular substitution group affiliation.
cs: Cyklické přidružení skupiny nahrazení
de: Gruppenzuordnung mit Zirkelersetzung.
es: Afiliación de grupo de sustitución circular.
fr: Affiliation de groupe de substitution circulaire.
it: Affiliazione circolare del gruppo di sostituzione.
ja: 循環する substitution group affiliation です。
ko: 순환 대체 그룹 affiliation입니다.
pl: Przynależność cyklicznej grupy podstawienia.
pt_br: Afiliação de grupo de substituição circular.
ru: Циклическое назначение группы подстановки.
tr: Döngüsel değiştirme grubu ilişkisi.
zh_hans: 循环替换组从属。
zh_hant: 循環的替代群組聯繫。

# Sch_SubstitutionNotAllowed
source: Element '{0}' cannot substitute in place of head element '{1}' because it has block='substitution'.
cs: Elementem {0} nelze nahradit element head {1}, protože pro něj platí block=substitution.
de: Das Element "{0}" kann nicht anstelle des Head-Elements "{1}" verwendet werden, da für das Element block="substitution" gilt.
es: El elemento "{0}" no puede sustituir al elemento de encabezado "{1}" porque incluye block="'substitution".
fr: L'élément '{0}' ne peut pas remplacer l'élément head '{1}', car il contient block = 'substitution'.
it: Non è possibile sostituire l'elemento head '{1}' con l'elemento '{0}' perché contiene il valore block='substitution'.
ja: block='substitution' が設定されているため、head 要素 '{1}' を要素 '{0}' で置き換えることはできません。
ko: 요소 '{0}'에는 block='substitution'이 있기 때문에 head 요소 '{1}' 대신 사용할 수 없습니다.
pl: Nie można podstawić elementu „{0}” w miejsce elementu nagłówkowego „{1}”, ponieważ ustawiono dla niego element block=„substitution”.
pt_br: O elemento '{0}' não pode substituir o elemento head '{1}', pois tem block='substitution'.
ru: Элемент "{0}" невозможно подставить вместо элемента head "{1}", поскольку он имеет block="substitution".
tr: '{0}' öğesinde block='substitution' olduğundan, '{1}' baş öğesinin yerine geçemez.
zh_hans: 元素“{0}”不能替代头元素“{1}”，因为它包含 block='substitution'。
zh_hant: 元素 '{0}' 不可替代標頭元素 '{1}'，因為其 block='substitution'。

# Sch_TargetNamespaceXsi
source: The target namespace of an attribute declaration, whether local or global, must not match http://www.w3.org/2001/XMLSchema-instance.
cs: Cílový obor názvů deklarace atributu (místního nebo globálního) nesmí odpovídat oboru http://www.w3.org/2001/XMLSchema-instance.
de: Der Zielnamespace einer lokalen oder globalen Attributdeklaration darf nicht mit http://www.w3.org/2001/XMLSchema-instance übereinstimmen.
es: El espacio de nombres de destino de una declaración de atributos, ya sea local o global, no debe coincidir con http://www.w3.org/2001/XMLSchema-instance.
fr: L'espace de noms cible d'une déclaration d'attribut, qu'elle soit locale ou globale, ne doit pas correspondre à http://www.w3.org/2001/XMLSchema-instance.
it: Lo spazio dei nomi di destinazione di una dichiarazione di attributo, sia locale che globale, non deve corrispondere a http://www.w3.org/2001/XMLSchema-instance.
ja: 属性宣言の名前空間は、ローカル、グローバルにかかわらず、http://www.w3.org/2001/XMLSchema-instance と同じにすることはできません。
ko: 지역 또는 전역 여부에 상관없이 특성 선언의 대상 네임스페이스는 http://www.w3.org/2001/XMLSchema-instance와 일치하면 안 됩니다.
pl: Docelowa przestrzeń nazw deklaracji atrybutu lokalnego lub globalnego nie może być zgodna z http://www.w3.org/2001/XMLSchema-instance.
pt_br: O namespace de destino de uma declaração de atributo, independentemente se local ou global, não deve corresponder a http://www.w3.org/2001/XMLSchema-instance.
ru: Конечное пространство имен для объявления атрибута, локального либо глобального, не должно совпадать с http://www.w3.org/2001/XMLSchema-instance.
tr: Yerel veya genel öznitelik bildiriminin hedef ad alanı http://www.w3.org/2001/XMLSchema-instance ile aynı olmamalıdır.
zh_hans: 特性声明的目标命名空间不论是局部的还是全局的，都不得与 http://www.w3.org/2001/XMLSchema-instance 匹配。
zh_hant: 屬性宣告的目標命名空間不論是否為本機或全域，皆不得與 http://www.w3.org/2001/XMLSchema-instance 相符。

# Sch_TextNotAllowed
source: The following text is not allowed in this context: '{0}'.
cs: Následující text není v tomto kontextu povolen: {0}
de: Folgender Text ist in diesem Kontext nicht zulässig: "{0}".
es: El siguiente texto no está permitido en este contexto: "{0}".
fr: Le texte suivant n'est pas autorisé dans ce contexte : '{0}'.
it: Il testo seguente non è consentito in questo contesto: '{0}'.
ja: 以下のテキストはこのコンテキストで使用できません: '{0}'。
ko: 이 컨텍스트에서는 다음 텍스트를 사용할 수 없습니다. '{0}'
pl: Następujący tekst nie jest dozwolony w tym kontekście: „{0}”.
pt_br: O texto a seguir não é permitido neste contexto: '{0}'.
ru: Следующий текст в этом контексте не разрешен: "{0}".
tr: Şu metne bu bağlamda izin verilmez: '{0}'.
zh_hans: 以下文本不允许出现在此上下文中:“{0}”。
zh_hant: 此內容中不允許下列文字: '{0}'。

# Sch_TotalDigitsConstraintFailed
source: The TotalDigits constraint failed.
cs: Omezení TotalDigits nebylo úspěšné.
de: Fehler bei der TotalDigits-Einschränkung.
es: Error de la restricción TotalDigits.
fr: Échec de la contrainte TotalDigits.
it: Il vincolo TotalDigits non è riuscito.
ja: TotalDigits 制約が失敗しました。
ko: TotalDigits 제약 조건이 실패했습니다.
pl: Błąd ograniczenia elementu TotalDigits.
pt_br: Falha na restrição TotalDigits.
ru: Сбой ограничения TotalDigits.
tr: TotalDigits kısıtlaması başarısız oldu.
zh_hans: TotalDigits 约束失败。
zh_hant: TotalDigits 條件約束失敗。

# Sch_TotalDigitsFacetInvalid
source: The TotalDigits constraining facet is invalid - {0}
cs: Omezující vlastnost TotalDigits je neplatná – {0}
de: Ungültiges TotalDigits-Einschränkungsfacet – {0}
es: Faceta de restricción de TotalDigits no válida - {0}
fr: La facette de contrainte TotalDigits est non valide : {0}
it: Il facet vincolante TotalDigits non è valido - {0}
ja: TotalDigits 制約ファセットが無効です。{0}
ko: TotalDigits 제약 패싯이 잘못되었습니다. {0}
pl: Element TotalDigits ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições TotalDigits é inválida – {0}
ru: Недопустимый ограничивающий аспект TotalDigits — {0}
tr: TotalDigits kısıtlama modeli geçersiz - {0}
zh_hans: TotalDigits 约束方面无效 - {0}
zh_hant: TotalDigits 條件約束 Facet 無效 - {0}

# Sch_TotalDigitsFacetProhibited
source: The TotalDigits constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost TotalDigits je pro {0} zakázána.
de: Das TotalDigits-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de TotalDigits prohibida para "{0}".
fr: La facette de contrainte TotalDigits est interdite pour '{0}'.
it: Il facet vincolante TotalDigits non è consentito per '{0}'.
ja: TotalDigits 制約ファセットは '{0}' に使用できません。
ko: TotalDigits 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element TotalDigits ograniczający aspekt jest zabroniony dla elementu „{0}”.
pt_br: A faceta de restrições TotalDigits é proibida para '{0}'.
ru: Ограничивающий аспект TotalDigits запрещен для "{0}".
tr: '{0}' için TotalDigits kısıtlama modeli kullanılamaz.
zh_hans: TotalDigits 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 TotalDigits 條件約束 Facet。

# Sch_TotalDigitsMismatch
source: It is an error if the derived 'totalDigits' facet value is greater than the parent 'totalDigits' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti totalDigits větší než hodnota nadřazené omezující vlastnosti totalDigits, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "totalDigits" größer ist als der übergeordnete Wert des Facets "totalDigits", tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "totalDigits" derivado sea mayor que el valor de faceta "totalDigits" primario.
fr: La valeur de la facette du 'totalDigits' dérivé ne doit pas être supérieure à la valeur de la facette du 'totalDigits' parent.
it: Il valore del facet derivato 'totalDigits' non può essere maggiore del valore del facet 'totalDigits' padre.
ja: 派生型の 'totalDigits' ファセットの値が、親の 'totalDigits' ファセットの値よりも大きい場合は、エラーです。
ko: 파생된 'totalDigits' 패싯 값이 부모 'totalDigits' 패싯 값보다 크면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „totalDigits” jest większa niż nadrzędna wartość aspektu „totalDigits”, występuje błąd.
pt_br: Erro se o valor da faceta 'totalDigits' derivada for maior que o valor da faceta 'totalDigits' pai.
ru: Является ошибкой то, что значение производного аспекта totalDigits больше значения родительского аспекта totalDigits.
tr: Türetilen 'totalDigits' modeli değerinin üst 'totalDigits' modeli değerinden büyük olması hatadır.
zh_hans: 如果派生的 "totalDigits" 方面值大于父级 "totalDigits" 方面值，则是错误的。
zh_hant: 若衍生的 'totalDigits' Facet 值大於父 'totalDigits' Facet 的值，即為錯誤。

# Sch_TwoIdAttrUses
source: Two distinct members of the attribute uses must not have type definitions which are both xs:ID or are derived from xs:ID.
cs: Dva odlišné členy použití atributu nemohou mít definice typu, které jsou obě xs:ID nebo odvozeny od xs:ID.
de: Zwei unterschiedliche Member der Attributverwendungen dürfen keine Typdefinitionen aufweisen, die beide "xs:ID" lauten oder von "xs:ID" abgeleitet sind.
es: Dos miembros distintos de usos de atributo no deben tener definiciones de tipo iguales a xs:ID o derivadas de xs:ID.
fr: Deux membres distincts de l'attribut uses ne doivent pas avoir de définitions de types qui sont toutes deux égales à xs:ID ou dérivées de xs:ID.
it: Due membri distinti degli usi dell'attributo non devono contenere definizioni di tipo che sono entrambe xs:ID o derivate da xs:ID.
ja: uses 属性の 2 つの異なるメンバーには、xs:ID である型定義または xs:ID から派生している型定義のいずれも指定できません。
ko: 특성 uses의 두 고유 멤버에는 xs:ID 또는 xs:ID에서 파생된 형식 정의를 지정하면 안 됩니다.
pl: Dla dwóch różnych składowych użycia atrybutu nie mogą istnieć definicje typów, których typ to xs:ID lub pochodny od typu xs:ID.
pt_br: Dois membros diferentes dos usos do atributo não devem ter definições de tipo que sejam xs:ID ou que derivem de xs:ID.
ru: Два отдельных члена атрибута uses не должны иметь определения типа, которые оба равны xs:ID или производны от xs:ID.
tr: İki ayrı attribute uses üyesinin tür tanımlarının her ikisinin de xs:ID olmaması veya xs:ID'den türetilmiş olmaması gerekir.
zh_hans: 特性应用的两个不同的成员不能全部是 xs:ID 类型或从 xs:ID 派生的类型的类型定义。
zh_hant: 兩個屬性使用的不同成員不可擁有 xs:ID 或衍生自 xs:ID 的類型定義。

# Sch_TypeAfterConstraints
source: 'simpleType' or 'complexType' cannot follow 'unique', 'key' or 'keyref'.
cs: Element simpleType nebo complexType nemůže následovat za elementem unique, key ani keyref.
de: "simpleType" oder "complexType" kann nicht nach "unique", "key" oder "keyref" angegeben werden.
es: Los elementos "simpleType" o "complexType" no pueden seguir a las restricciones "unique", "key" o "keyref".
fr: 'simpleType' ou 'complexType' ne peut pas suivre 'unique', 'key' ou 'keyref'.
it: 'simpleType' e 'complexType' non possono seguire 'unique', 'key' o 'keyref'.
ja: 'simpleType' または 'complexType' を、'unique'、'key' および 'keyref' の後に使用することはできません。
ko: 'simpleType' 또는 'complexType'은 'unique', 'key'또는 'keyref' 뒤에 올 수 없습니다.
pl: Element „simpleType” lub „complexType” nie może następować po elemencie „unique”, „key” ani „keyref”.
pt_br: 'simpleType' ou 'complexType' não pode seguir 'unique', 'key' ou 'keyref'.
ru: simpleType или complexType не может следовать за unique, key или keyref.
tr: 'unique', 'key' veya 'keyref' arkasından 'simpleType' veya 'complexType' gelemez.
zh_hans: "simpleType" 或 "complexType" 不能跟 "unique"、"key" 或 "keyref"。
zh_hant: 'simpleType' 或 'complexType' 之後不可接者 'unique'、'key' 或 'keyref'。

# Sch_TypeCircularRef
source: Circular type reference.
cs: Cyklický odkaz na typ
de: Zirkulärer Typverweis.
es: Referencia circular del tipo.
fr: Référence de type circulaire.
it: Riferimento circolare a tipo.
ja: 型の循環参照です。
ko: 순환 형식 참조입니다.
pl: Cykliczne odwołanie do typu.
pt_br: Referência circular de tipo.
ru: Циклическая ссылка на тип.
tr: Döngüsel tür başvurusu.
zh_hans: 循环类型引用。
zh_hant: 循環類型參考。

# Sch_TypeMutualExclusive
source: The type attribute cannot be present with either simpleType or complexType.
cs: Atribut typu nemůže být současně typu simpleType a typu complexType.
de: Das Typattribut darf bei "simpleType" oder "complexType" nicht vorhanden sein.
es: El atributo de tipo no puede estar presente con simpleType o complexType.
fr: L'attribut type ne peut pas être présent avec simpleType ou complexType.
it: Con simpleType o complexType non può essere presente l'attributo type.
ja: 型属性に simpleType と complexType を同時に指定することはできません。
ko: type 특성은 simpleType 또는 complexType과 함께 사용할 수 없습니다.
pl: Atrybut typu nie może występować razem z elementem simpleType ani complexType.
pt_br: O atributo type não pode estar presente com simpleType ou complexType.
ru: Атрибут type не может указываться вместе с simpleType или complexType.
tr: Tür özniteliği, simpleType ya da complexType ile birlikte bulunamaz.
zh_hans: type 特性不能和 simpleType 或 complexType 同时存在。
zh_hant: type 屬性無法和 simpleType 或 complexType 同時存在。

# Sch_UnSpecifiedDefaultAttributeInExternalStandalone
source: Markup for unspecified default attribute '{0}' is external and standalone='yes'.
cs: Nezadaný výchozí atribut {0} je uveden ve značkách external a standalone=yes.
de: Das Markup für das nicht angegebene Standardattribut "{0}" ist extern und standalone="yes".
es: El marcado para el atributo predeterminado "{0}" no especificado es externo y el valor standalone="yes".
fr: Le balisage pour l'attribut par défaut non spécifié '{0}' est externe et standalone='yes'.
it: Il markup per l'attributo predefinito non specificato '{0}' è esterno e standalone ha valore 'yes'.
ja: 未指定の既定属性 '{0}' のマークアップは external で standalone='yes' です。
ko: 지정되지 않은 기본 특성 '{0}'의 태그는 external이고 standalone은 'yes'입니다.
pl: Oznakowanie dla nieokreślonego atrybutu domyślnego „{0}” jest zewnętrzne oraz autonomiczne =„yes”.
pt_br: A marcação para o atributo padrão não especificado '{0}' é externa e autônoma='yes'.
ru: Разметка для незаданного атрибута по умолчанию "{0}" является внешней, и атрибут standalone равен yes.
tr: Belirtilmemiş '{0}' varsayılan özniteliğinin işaretlemesi dışta ve standalone='yes'.
zh_hans: 未指定的默认特性“{0}”的标记是外部的并且 standalone='yes'。
zh_hant: 未指定的預設屬性 '{0}' 之標記為外部標記，且 standalone='yes'。

# Sch_UndeclaredAttribute
source: The '{0}' attribute is not declared.
cs: Atribut {0} není deklarován.
de: Das {0}-Attribut wurde nicht deklariert.
es: No se ha declarado el atributo "{0}".
fr: L'attribut '{0}' n'est pas déclaré.
it: L'attributo '{0}' non è dichiarato.
ja: '{0}' 属性が宣言されていません。
ko: '{0}' 특성이 선언되지 않았습니다.
pl: Atrybut „{0}” nie został zadeklarowany.
pt_br: O atributo '{0}' não foi declarado.
ru: Атрибут "{0}" не объявлен.
tr: '{0}' özniteliği bildirilmedi.
zh_hans: 未声明“{0}”特性。
zh_hant: '{0}' 屬性未宣告。

# Sch_UndeclaredElement
source: The '{0}' element is not declared.
cs: Element {0} není deklarován.
de: Das {0}-Element wurde nicht deklariert.
es: No se ha declarado el elemento "{0}".
fr: L'élément '{0}' n'est pas déclaré.
it: L'elemento '{0}' non è dichiarato.
ja: '{0}' 要素が宣言されていません。
ko: '{0}' 요소가 선언되지 않았습니다.
pl: Element „{0}” nie został zadeklarowany.
pt_br: O elemento '{0}' não foi declarado.
ru: Элемент "{0}" не объявлен.
tr: '{0}' öğesi bildirilmedi.
zh_hans: 未声明“{0}”元素。
zh_hant: '{0}' 元素未宣告。
