Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_ValidateAttributeInvalidCall
source: If the partial validation type is 'XmlSchemaElement' or 'XmlSchemaType', the 'ValidateAttribute' method cannot be called.
cs: Pokud je částečné ověřování typu XmlSchemaElement nebo XmlSchemaType, nelze volat metodu ValidateAttribute.
de: Wenn der Teilvalidierungstyp "XmlSchemaElement" oder "XmlSchemaType" lautet, kann die ValidateAttribute-Methode nicht aufgerufen werden.
es: Si el tipo de validación parcial es "XmlSchemaElement" o XmlSchemaType", no se puede llamar al método "ValidateAttribute".
fr: Si le type de validation partielle est 'XmlSchemaElement' ou 'XmlSchemaType', la méthode 'ValidateAttribute' ne peut pas être appelée.
it: Se il tipo di convalida parziale è 'XmlSchemaElement' o 'XmlSchemaType', non è possibile chiamare il metodo 'ValidateAttribute'.
ja: 部分検証型が 'XmlSchemaElement' か 'XmlSchemaType' の場合、'ValidateAttribute' メソッドを呼び出すことはできません。
ko: 부분적 유효성 검사 형식이 'XmlSchemaElement' 또는 'XmlSchemaType'인 경우 'ValidateAttribute' 메서드를 호출할 수 없습니다.
pl: Jeśli typ częściowej weryfikacji to „XmlSchemaElement” lub „XmlSchemaType”, nie można wywołać metody „ValidateAttribute”.
pt_br: Se o tipo de validação parcial for 'XmlSchemaElement' ou 'XmlSchemaType', o método 'ValidateAttribute' não poderá ser chamado.
ru: Если тип неполной проверки XmlSchemaElement или XmlSchemaType, то вызвать метод ValidateAttribute нельзя.
tr: Kısmi doğrulama türü 'XmlSchemaElement' veya 'XmlSchemaType' ise, 'ValidateAttribute' metodu çağrılamaz.
zh_hans: 如果部分验证类型为 "XmlSchemaElement" 或 "XmlSchemaType"，则无法调用 "ValidateAttribute" 方法。
zh_hant: 若部分驗證類型是 'XmlSchemaElement' 或 'XmlSchemaType'，即無法呼叫 'ValidateAttribute' 方法。

# Sch_ValidateElementInvalidCall
source: If the partial validation type is 'XmlSchemaAttribute', the 'ValidateElement' method cannot be called.
cs: Pokud je částečné ověřování typu XmlSchemaAttribute, nelze volat metodu ValidateElement.
de: Wenn der Teilvalidierungstyp "XmlSchemaAttribute" lautet, kann die ValidateElement-Methode nicht aufgerufen werden.
es: Si el tipo de validación parcial es "XmlSchemaAttribute", no se puede llamar al método "ValidateElement".
fr: Si le type de validation partielle est 'XmlSchemaAttribute', la méthode 'ValidateElement' ne peut pas être appelée.
it: Se il tipo di convalida parziale è 'XmlSchemaAttribute', non è possibile chiamare il metodo 'ValidateElement'.
ja: 部分検証型が 'XmlSchemaAttribute' の場合、'ValidateElement' メソッドを呼び出すことはできません。
ko: 부분적 유효성 검사 형식이 'XmlSchemaAttribute'인 경우 'ValidateElement' 메서드를 호출할 수 없습니다.
pl: Jeśli typ częściowej weryfikacji to „XmlSchemaAttribute”, nie można wywołać metody „ValidateElement”.
pt_br: Se o tipo de validação parcial for 'XmlSchemaAttribute', o método 'ValidateElement' não poderá ser chamado.
ru: Если тип неполной проверки XmlSchemaAttribute, то вызвать метод ValidateElement нельзя.
tr: Kısmi doğrulama türü 'XmlSchemaAttribute' ise, 'ValidateElement' metodu çağrılamaz.
zh_hans: 如果部分验证类型为 "XmlSchemaAttribute"，则无法调用 "ValidateElement" 方法。
zh_hant: 若部分驗證類型是 'XmlSchemaAttribute'，即無法呼叫 'ValidateElement' 方法。

# Sch_WhiteSpaceFacetProhibited
source: The WhiteSpace constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost WhiteSpace je pro {0} zakázána.
de: Das WhiteSpace-Einschränkungsfacet ist für "{0}" nicht zulässig.
es: Faceta de restricción de WhiteSpace prohibida para "{0}".
fr: La facette de contrainte WhiteSpace est interdite pour '{0}'.
it: Il facet vincolante WhiteSpace non è consentito per '{0}'.
ja: WhiteSpace 制約ファセットを '{0}' で使用できません。
ko: WhiteSpace 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element WhiteSpace ograniczający aspekt jest zabroniony dla elementu „{0}”.
pt_br: A faceta de restrições WhiteSpace é proibida para '{0}'.
ru: Ограничивающий аспект WhiteSpace запрещен для "{0}".
tr: '{0}' için WhiteSpace kısıtlama modeli kullanılamaz.
zh_hans: WhiteSpace 方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 WhiteSpace 條件約束 Facet。

# Sch_WhiteSpaceRestriction1
source: It is an error if 'whiteSpace' is among the members of {facets} of {base type definition}, {value} is 'replace' or 'preserve', and the {value} of the parent 'whiteSpace' is 'collapse'.
cs: Pokud vlastnost whiteSpace patří mezi členy {facets} typu {base type definition}, hodnota {value} je replace nebo preserve a hodnota {value} nadřazené vlastnosti whiteSpace je collapse, jedná se o chybu.
de: Wenn "whiteSpace" ein Member von {facets} der {base type definition} ist, der {value} "replace" oder "preserve" lautet und der {value} des übergeordneten "whiteSpace" auf "collapse" festgelegt ist, tritt ein Fehler auf.
es: Es incorrecto que "whiteSpace" se encuentre entre los miembros de {facets} de {base type definition}, que {value} sea "replace" o "preserve" y que {value} de "whiteSpace" primario sea "collapse".
fr: 'whiteSpace' ne doit pas faire partie des membres des {facets} de la {base type definition}, la {value} ne doit pas être 'replace' ou 'preserve' et la {value} du 'whiteSpace' parent ne doit pas être 'collapse'.
it: Se 'whiteSpace' è incluso nei membri di {facets} di {base type definition}, il valore {value} non può essere 'replace' o 'preserve' se il valore {value} dell'elemento 'whiteSpace' padre è 'collapse'.
ja: 'whiteSpace' が {base type definition} の {facets} のメンバーの中にあり、かつ {value} が 'replace' か 'preserve' で、親 'whiteSpace' の {value} が 'collapse' の場合は、エラーです。
ko: 'whiteSpace'가 {base type definition}의 {facets} 멤버 중 하나이고 {value}가 'replace' 또는 'preserve'인 경우 부모 'whiteSpace'의 {value}가 'collapse'이면 오류가 발생합니다.
pl: Jeśli element „whiteSpace” należy do składowych aspektów {facets} dla definicji {base type definition}, wartość {value} to „replace” lub „preserve”, a wartość {value} nadrzędnego elementu „whiteSpace” to „collapse”, występuje błąd.
pt_br: Erro se 'whiteSpace' estiver entre os membros de {facets} de {base type definition}, {value} for 'replace' ou 'preserve' e {value} do 'whiteSpace' pai for 'collapse'.
ru: Ошибка заключается в том, что whiteSpace указан среди членов {facets} для {base type definition}, {value} — replace или preserve, а {value} родительского whiteSpace — collapse.
tr: 'whiteSpace'in {base type definition} tanımının {facets} üyeleri arasında olması, {value} değerinin 'replace' veya 'preserve' ve üst 'whiteSpace'in {value} değerinin 'collapse' olması hatadır.
zh_hans: 如果 "whiteSpace" 是 {base type definition} 的 {facets} 的成员，并且 {value} 为 "replace" 或 "preserve"，父级 "whiteSpace" 的 {value} 为 "collapse"，则是错误的。
zh_hant: 若 'whiteSpace' 是在 {base type definition} 內 {facets} 的成員之中，且 {value} 是 'replace' 或 'preserve'，同時父 'whiteSpace' 的 {value} 是 'collapse'，即為錯誤。

# Sch_WhiteSpaceRestriction2
source: It is an error if 'whiteSpace' is among the members of {facets} of {base type definition}, {value} is 'preserve', and the {value} of the parent 'whiteSpace' is 'replace'.
cs: Pokud vlastnost whiteSpace patří mezi členy {facets} typu {base type definition}, hodnota {value} je preserve a hodnota {value} nadřazené vlastnosti whiteSpace je replace, jedná se o chybu.
de: Wenn "whiteSpace" ein Member von {facets} der {base type definition} ist, der {value} "preserve" lautet und der {value} des übergeordneten "whiteSpace" auf "replace" festgelegt ist, tritt ein Fehler auf.
es: Es incorrecto que "whiteSpace" se encuentre entre los miembros de {facets} de {base type definition}, que {value} sea "preserve" y que {value} de "whiteSpace" primario sea "replace".
fr: 'whiteSpace' ne doit pas faire partie des membres des {facets} de la {base type definition}, la {value} ne doit pas être 'preserve' et la {value} du 'whiteSpace' parent ne doit pas être 'replace'.
it: Se 'whiteSpace' è incluso nei membri di {facets} di {base type definition}, il valore {value} non può essere 'preserve' se il valore {value} dell'elemento 'whiteSpace' padre è 'replace'.
ja: 'whiteSpace' が {base type definition} の {facets} のメンバーの中にあり、かつ {value} が 'preserve' で、親 'whiteSpace' の {value} が 'replace' の場合は、エラーです。
ko: 'whiteSpace'가 {base type definition}의 {facets} 멤버 중 하나이고 {value}가 'preserve'인 경우 부모 'whiteSpace'의 {value}가 'replace'이면 오류가 발생합니다.
pl: Jeśli element „whiteSpace” należy do składowych aspektów {facets} dla definicji {base type definition}, wartość {value} to „preserve”, a wartość {value} nadrzędnego elementu „whiteSpace” to „replace”, występuje błąd.
pt_br: Erro se 'whiteSpace' estiver entre os membros de {facets} de {base type definition}, {value} for 'preserve' e {value} do 'whiteSpace' pai for 'replace'.
ru: Ошибка заключается в том, что whiteSpace указан среди членов {facets} для {base type definition}, {value} — preserve, а {value} родительского whiteSpace — replace.
tr: 'whiteSpace'in {base type definition} tanımının {facets} üyeleri arasında olması, {value} değerinin 'preserve' ve üst 'whiteSpace'in {value} değerinin 'replace' olması hatadır.
zh_hans: 如果 "whiteSpace" 是 {base type definition} 的 {facets} 的成员，并且 {value} 为 "preserve"，父级 "whiteSpace" 的 {value} 为 replace，则是错误的。
zh_hant: 若 'whiteSpace' 是在 {base type definition} 內 {facets} 的成員之中，且 {value} 是 'preserve'，同時父 'whiteSpace' 的 {value} 是 'replace'，即為錯誤。

# Sch_XSDSchemaOnly
source: 'XmlSchemaSet' can load only W3C XML Schemas.
cs: Do třídy XmlSchemaSet lze načítat pouze schémata W3C XML.
de: "XmlSchemaSet" kann nur W3C XML-Schemas laden.
es: "XmlSchemaSet" solo puede cargar esquemas W3C XML.
fr: 'XmlSchemaSet' peut charger uniquement des schémas XML W3C.
it: 'XmlSchemaSet' può caricare solo XML Schema W3C.
ja: 'XmlSchemaSet' が読み込めるのは、W3C の XML スキーマのみです。
ko: 'XmlSchemaSet'은 W3C XML 스키마만 로드할 수 있습니다.
pl: Zestaw „XmlSchemaSet” umożliwia ładowanie tylko schematów W3C XML.
pt_br: 'XmlSchemaSet' pode carregar apenas Esquemas W3C XML.
ru: XmlSchemaSet может загружать только схемы XML W3C.
tr: 'XmlSchemaSet', yalnızca W3C XML Semalarını yükleyebilir.
zh_hans: "XmlSchemaSet" 只能加载 W3C XML 架构。
zh_hant: 'XmlSchemaSet' 僅可載入 W3C XML 結構描述。

# Sch_XSDSchemaRootExpected
source: The root element of a W3C XML Schema should be <schema> and its namespace should be 'http://www.w3.org/2001/XMLSchema'.
cs: Kořenovým elementem schématu W3C XML by mělo být <schema> a jeho oborem názvů by mělo být http://www.w3.org/2001/XMLSchema.
de: Das Stammelement eines W3C XML-Schemas muss <schema> lauten und den Namespace "http://www.w3.org/2001/XMLSchema" aufweisen.
es: El elemento raíz de un esquema W3C XML debe ser <schema> y su espacio de nombres "http://www.w3.org/2001/XMLSchema".
fr: L'élément racine d'un schéma XML W3C doit être <schema> et son espace de noms 'http://www.w3.org/2001/XMLSchema'.
it: L'elemento radice di un XML Schema W3C deve essere <schema> e il relativo spazio dei nomi deve essere 'http://www.w3.org/2001/XMLSchema'.
ja: W3C XML スキーマのルート要素は <schema> である必要があります。さらに、その名前空間は 'http://www.w3.org/2001/XMLSchema' である必要があります。
ko: W3C XML 스키마의 루트 요소는 <schema>여야 하며 해당 네임스페이스는 'http://www.w3.org/2001/XMLSchema'여야 합니다.
pl: Głównym elementem schematu W3C XML powinien być element <schema>, natomiast jego przestrzenią nazw powinna być przestrzeń „http://www.w3.org/2001/XMLSchema”.
pt_br: O elemento raiz de um Esquema XML W3C deve ser <schema> e seu namespace deve ser 'http://www.w3.org/2001/XMLSchema'.
ru: Корневой элемент схемы XML W3C должен быть <schema>, а его пространство имен — "http://www.w3.org/2001/XMLSchema".
tr: W3C XML Şemasının kök öğesi <schema> ve ad alanı da 'http://www.w3.org/2001/XMLSchema' olmalıdır.
zh_hans: W3C XML 架构的根元素应为 <schema>，命名空间应为 "http://www.w3.org/2001/XMLSchema"。
zh_hant: W3C XML 結構描述的根項目應該是 <schema>，且其命名空間應該是 'http://www.w3.org/2001/XMLSchema'。

# Sch_XmlNsAttribute
source: The value 'xmlns' cannot be used as the name of an attribute declaration.
cs: Hodnotu xmlns nelze použít jako název deklarace atributu.
de: Der Wert "xmlns" kann nicht als Name einer Attributdeklaration verwendet werden.
es: El valor "xmlns" no se puede utilizar como nombre de una declaración de atributos.
fr: La valeur 'xmlns' ne peut pas être utilisée comme nom d'une déclaration d'attribut.
it: Non è possibile usare il valore 'xmlns' come nome di una dichiarazione di attributo.
ja: 値 'xmlns' を属性宣言の名前として使うことはできません。
ko: 'xmlns' 값은 특성 선언의 이름으로 사용할 수 없습니다.
pl: Wartość „xmlns” nie może być używana jako nazwa deklaracji atrybutu.
pt_br: O valor 'xmlns' não pode ser usado como o nome de uma declaração de atributo.
ru: Значение xmlns не может использоваться в качестве имени для объявления атрибута.
tr: 'xmlns' değeri bir öznitelik bildiriminin adı olarak kullanılamaz.
zh_hans: 值 "xmlns" 不能用作特性声明的名称。
zh_hant: 數值 'xmlns' 無法當做屬性宣告的名稱使用。

# Sch_XmlSpace
source: Invalid xml:space syntax.
cs: Neplatná syntaxe xml:space
de: Ungültige xml:space-Syntax.
es: Sintaxis xml:space no válida.
fr: Syntaxe xml:space non valide.
it: La sintassi di xml:space non è valida.
ja: xml:space 構文が無効です。
ko: xml:space 구문이 잘못되었습니다.
pl: Nieprawidłowa składnia xml:space.
pt_br: Sintaxe xml:space inválida.
ru: Недопустимый синтаксис xml:space.
tr: Geçersiz xml:space sözdizimi.
zh_hans: 无效的 xml:space 语法。
zh_hant: xml:space 語法無效。

# Sch_XsdDateTimeCompare
source: Cannot compare '{0}' and '{1}'.
cs: Nelze porovnat {0} s {1}.
de: "{0}" und "{1}" können nicht verglichen werden.
es: No se pueden comparar "{0}" y "{1}".
fr: Impossible de comparer '{0}' et '{1}'.
it: Non è possibile confrontare '{0}' e '{1}'.
ja: '{0}' と '{1}' を比較できません。
ko: '{0}'과(와) '{1}'을(를) 비교할 수 없습니다.
pl: Nie można porównać elementów „{0}” i „{1}”.
pt_br: Não é possível comparar '{0}' com '{1}'.
ru: Невозможно сравнить "{0}" и "{1}".
tr: '{0}' ile '{1}' karşılaştırılamaz.
zh_hans: 无法比较“{0}”和“{1}”。
zh_hant: 無法比較 '{0}' 與 '{1}'。

# Sch_XsiNilAndFixed
source: There must be no fixed value when an attribute is 'xsi:nil' and has a value of 'true'.
cs: Nemůže být uvedena pevná hodnota, pokud je atributem xsi:nil a má hodnotu true.
de: Es darf kein fester Wert vorhanden sein, wenn ein Attribut "xsi:ni" ist und den Wert "true" aufweist.
es: No debe haber un valor fijado cuando el atributo es "xsi:nil" y tiene el valor "true".
fr: Une valeur fixe est impossible quand un attribut 'xsi:nil' a la valeur 'true'.
it: Quando è presente un attributo 'xsi:nil' con valore true, non deve essere presente alcun valore fisso.
ja: 属性が 'xsi:nil' で、値が 'true' のときは、固定値を指定することはできません。
ko: 값이 'true'인 'xsi:nil' 특성이 있을 경우에는 고정 값이 없어야 합니다.
pl: Wartość ustalona nie może istnieć, jeśli atrybut to „xsi:nil” o wartości „true” (prawda).
pt_br: Não deverá haver valor fixo quando o atributo for 'xsi:nil' e o valor for 'true'.
ru: При атрибуте xsi:nil со значением true (истина) не должны использоваться фиксированные значения.
tr: Öznitelik 'xsi:nil' ve değeri de 'true' olduğunda, sabit değer olmamalıdır.
zh_hans: 当特性为 "xsi:nil" 且值为 "true" 时，不得有固定值。
zh_hant: 當屬性為 'xsi:nil' 且值為 'true' 時，不能有固定值。

# Sch_XsiNilAndType
source: There can be no type value when attribute is 'xsi:nil' and has value 'true'.
cs: Nemůže být uvedena hodnota typu, pokud je atributem xsi:nil a má hodnotu true.
de: Es darf kein Typwert vorhanden sein, wenn das Attribut "xsi:nil" ist und den Wert "true" aufweist.
es: No puede haber ningún valor de tipo cuando el atributo es "xsi:nil" y tiene el valor "true".
fr: Il ne peut exister aucune valeur de type quand l'attribut 'xsi:nil' a la valeur 'true'.
it: Quando è presente l'attributo 'xsi:nil' con valore true, non deve essere presente alcun valore type.
ja: 属性が 'xsi:nil' で、値が 'true' のときは、型の値は存在できません。
ko: 값이 'true'인 'xsi:nil' 특성이 있을 경우에는 형식 값이 없어도 됩니다.
pl: Wartość typu nie może istnieć, jeśli atrybut to „xsi:nil” o wartości „true”.
pt_br: Não deverá haver valor de tipo quando o atributo for 'xsi:nil' e o valor for 'true'.
ru: При атрибуте xsi:nil со значением true (истина) не должны использоваться значения типа.
tr: Öznitelik 'xsi:nil' ve değeri de 'true' olduğunda tür değeri olmamalıdır.
zh_hans: 当特性为 "xsi:nil" 且值为 "true" 时，不得有类型值。
zh_hant: 當屬性為 'xsi:nil' 且值為 'true' 時，不可有類型值。

# Sch_XsiTypeAbstract
source: The xsi:type '{0}' cannot be abstract.
cs: Atribut xsi:type {0} nemůže být abstraktní.
de: Der xsi:type "{0}" kann nicht abstrakt sein.
es: El valor de xsi:type "{0}" no puede ser abstracto.
fr: Le xsi:type '{0}' ne peut pas être abstrait.
it: L'elemento xsi:type '{0}' non può essere astratto.
ja: xsi:type '{0}' は抽象型にはできません。
ko: xsi:type '{0}'은(는) 추상일 수 없습니다.
pl: Typ xsi:type „{0}” nie może być abstrakcyjny.
pt_br: O xsi:type '{0}' não pode ser abstrato.
ru: xsi:type "{0}" не может быть абстрактным.
tr: xsi:type '{0}' soyut olamaz.
zh_hans: xsi:type“{0}”不能是抽象的。
zh_hant: xsi:type '{0}' 不可為抽象。

# Sch_XsiTypeBlocked
source: The element '{0}' has xsi:type derivation blocked.
cs: Odvození xsi:type je pro element {0} blokováno.
de: Das Element "{0}" hat die xsi:type-Ableitung blockiert.
es: El elemento "{0}" tiene una derivación xsi:type bloqueada.
fr: La dérivation xsi:type de l'élément '{0}' est bloquée.
it: La derivazione xsi:type dell'elemento '{0}' è bloccata.
ja: 要素 '{0}' が、xsi:type の派生をブロックさせています。
ko: 요소 '{0}'은(는) xsi:type 파생이 차단되었습니다.
pl: Dla elementu „{0}” zablokowano tworzenie pochodnych xsi:type.
pt_br: O elemento '{0}' tem derivação xsi:type bloqueada.
ru: Для элемента "{0}" заблокировано получение производных xsi:type.
tr: '{0}' öğesinde xsi:type türetme engellenmiş.
zh_hans: 元素“{0}”阻止了 xsi:type 派生。
zh_hant: '{0}' 元素有 xsi:type 的衍生阻斷。

# Sch_XsiTypeBlockedEx
source: The xsi:type attribute value '{0}' is not valid for the element '{1}', either because it is not a type validly derived from the type in the schema, or because it has xsi:type derivation blocked.
cs: Hodnota atributu xsi:type {0} není platná pro element {1}, protože se nejedná o typ platně odvozený od typu ve schématu, nebo je blokováno odvozování od atributu xsi:type.
de: Der xsi:type-Attributwert "{0}" ist für das Element "{1}" nicht gültig, da es sich entweder nicht um einen Typ handelt, der vom Typ im Schema gültig abgeleitet wurde, oder da es die xsi:type-Ableitung blockiert.
es: El valor del atributo xsi:type "{0}" no es válido para el elemento "{1}", porque no es un tipo derivado de forma válida del tipo en el esquema o porque tiene la derivación xsi:type bloqueada.
fr: La valeur '{0}' de l'attribut xsi:type est non valide pour l'élément '{1}' : soit il ne s'agit pas d'un type correctement dérivé du type du schéma, soit la dérivation xsi:type est bloquée.
it: Il valore dell'attributo xsi:type '{0}' non è valido per l'elemento '{1}' perché non è un tipo derivato in modo valido dal tipo nello schema o perché la derivazione xsi:type è bloccata.
ja: 要素 '{1}' に対し、xsi:type 属性の値 '{0}' が無効です。この値がスキーマの型から正しく派生した型ではないか、または xsi:type の派生をブロックさせていることが原因です。
ko: xsi:type 특성 값 '{0}'은(는) 스키마의 형식에서 유효하게 파생된 형식이 아니거나 xsi:type 파생이 차단되었기 때문에 요소 '{1}'에 사용할 수 없습니다.
pl: Wartość atrybutu typu xsi:type „{0}” nie jest prawidłowa dla elementu „{1}”. Typ nie jest prawidłowym typem pochodnym typu schematu lub tworzenie typów pochodnych typu xsi:type zostało zablokowane.
pt_br: O valor '{0}' do atributo xsi:type é inválido para o elemento '{1}', porque não é um tipo validamente derivado do tipo do esquema ou porque a derivação xsi:type está bloqueada.
ru: Значение "{0}" атрибута xsi:type недопустимо для элемента {1}", поскольку его тип не был адекватно выведен из типа в схеме или для него заблокировано получение производных xsi:type.
tr: xsi:type '{0}' öznitelik değeri '{1}' öğesi için geçerli değil; bunun nedeni şemadaki türden geçerli bir şekilde türetilen bir tür olmaması veya xsi:type türetmenin engellenmiş olmasıdır.
zh_hans: xsi:type 特性值“{0}”对于元素“{1}”无效，要么因为它不是从架构中的类型所有效派生的类型，要么就是它阻止了 xsi:type 派生。
zh_hant: 元素 '{1}' 的 xsi:type 屬性值 '{0}' 無效，可能是因為在結構描述的類型為無效的衍生類型，或是因為有 xsi:type 的衍生阻斷。

# Sch_XsiTypeNotFound
source: This is an invalid xsi:type '{0}'.
cs: Toto je neplatný typ xsi:type {0}.
de: Ungültiger xsi:type "{0}".
es: El valor de xsi:type no es válido "{0}".
fr: xsi:type '{0}' non valide.
it: Questo è un elemento xsi:type '{0}' non valido.
ja: xsi:type '{0}' が無効です。
ko: xsi:type '{0}'이(가) 잘못되었습니다.
pl: To jest nieprawidłowy typ xsi:type „{0}”.
pt_br: Este xsi:type '{0}' é inválido.
ru: Не является допустимым xsi:type "{0}".
tr: Bu geçersiz bir xsi:type '{0}'.
zh_hans: 这是一个无效的 xsi:type“{0}”。
zh_hant: xsi:type '{0}' 無效。

# SqlTypes_ArithOverflow
source: Arithmetic Overflow.
cs: Aritmetické přetečení
de: Arithmetischer Überlauf.
es: Desbordamiento aritmético.
fr: Dépassement arithmétique.
it: Overflow aritmetico.
ja: 算術オーバーフローです。
ko: 산술 오버플로가 발생했습니다.
pl: Przepełnienie arytmetyczne.
pt_br: Estouro Aritmético.
ru: Арифметическое переполнение.
tr: Aritmetik Taşma.
zh_hans: 算术溢出。
zh_hant: 算術溢位。

# SqlTypes_ArithTruncation
source: Numeric arithmetic causes truncation.
cs: Číselná aritmetika způsobila zkrácení.
de: Die numerische Arithmetik bewirkt ein Abschneiden.
es: La aritmética numérica provoca truncamientos.
fr: L'arithmétique numérique génère une troncation.
it: Troncamento causato da un'operazione aritmetica.
ja: 数値演算で切り捨てが起こりました。
ko: 수치 연산을 수행하면 잘라내기가 발생합니다.
pl: Arytmetyka numeryczna powoduje obcięcie.
pt_br: Aritmética numérica causa truncamento.
ru: Арифметическая операция над числами вызвала усечение.
tr: Sayısal matematiksel işlem kesmeye neden oldu.
zh_hans: 数值算法导致截断。
zh_hant: 數字算術導致截斷。

# SqlTypes_DivideByZero
source: Divide by zero error encountered.
cs: Došlo k chybě dělení nulou.
de: Fehler aufgrund einer Division durch 0.
es: Error al dividir por cero.
fr: Erreur : division par zéro.
it: Errore di divisione per zero.
ja: 0 除算エラーが発生しました。
ko: 0으로 나눔 오류가 발생했습니다.
pl: Wystąpił błąd dzielenia przez zero.
pt_br: Erro de divisão por zero.
ru: Ошибка деления на нуль.
tr: Sıfıra bölme hatasıyla karşılaşıldı.
zh_hans: 出现被零除错误。
zh_hant: 發生除以零的錯誤。

# XPathDocument_MissingSchemas
source: An XmlSchemaSet must be provided to validate the document.
cs: Pro ověření dokumentu musí být zadána třída XmlSchemaSet.
de: Ein XmlSchemaSet muss zum Überprüfen des Dokuments bereitgestellt werden.
es: Se debe proporcionar XmlSchemaSet para validar el documento.
fr: Vous devez fournir un XmlSchemaSet pour valider le document.
it: È necessario specificare un elemento XmlSchemaSet per convalidare il documento.
ja: ドキュメントを検証するには、XmlSchemaSet が設定されている必要があります。
ko: 문서의 유효성을 검사하려면 XmlSchemaSet을 지정해야 합니다.
pl: Do weryfikacji dokumentu niezbędny jest element XmlSchemaSet.
pt_br: É necessário fornecer um XmlSchemaSet para validar o documento.
ru: Для проверки документа необходимо предоставить XmlSchemaSet.
tr: Belgeyi doğrulamak için XmlSchemaSet sağlanmalı.
zh_hans: 必须提供 XmlSchemaSet 才能验证文档。
zh_hant: 必須提供 XmlSchemaSet 才可驗證文件。

# XPathDocument_NotEnoughSchemaInfo
source: Element should have prior schema information to call this method.
cs: Element by před voláním této metody měl obsahovat informace o schématu.
de: Das Element muss über vorherige Schemainformationen verfügen, um diese Methode aufrufen zu können.
es: Para llamar a este método, el elemento debe tener información previa del esquema.
fr: L'élément doit disposer au préalable des informations de schéma pour pouvoir appeler cette méthode.
it: Per chiamare questo metodo, l'elemento deve contenere le informazioni precedenti dello schema.
ja: このメソッドを呼び出すには、前のスキーマ情報が要素に保持されている必要があります。
ko: 이 메서드를 호출하려면 요소에 이전 스키마 정보가 있어야 합니다.
pl: Aby wywołanie tej metody było możliwe, element musi zawierać informacje o poprzednim schemacie.
pt_br: O elemento deve ter informações de esquema anteriores para chamar o método.
ru: Для вызова этого метода элементу необходимы данные о схеме.
tr: Bu metodu çağırmak için öğede önceki şema bilgisi olmalı.
zh_hans: 元素应该具有优先架构信息，以调用该方法。
zh_hant: 元素應有優先的結構描述資訊，以呼叫此方法。
