Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_NotEnoughSpaceForSurrogatePair
source: The buffer is not large enough to fit a surrogate pair. Please provide a buffer of size at least 2 characters.
cs: Vyrovnávací paměť není dostatečně velká, aby do ní bylo možné uložit náhradní pár. Poskytněte prosím vyrovnávací paměť o velikosti alespoň 2 znaků.
de: Der Puffer ist nicht groß genug für ein Ersatzzeichenpaar. Stellen Sie einen Puffer mit einer Größe von mindestens 2 Zeichen bereit.
es: El búfer no es suficientemente grande para ajustarlo a un par suplente. Proporcione un búfer con un tamaño de al menos 2 caracteres.
fr: La taille de la mémoire tampon n'est pas suffisante pour prendre en charge une paire de substitution. Prévoyez une mémoire tampon d'une taille d'au moins 2 caractères.
it: Il buffer non è sufficiente per contenere una coppia di surrogati. Specificare un buffer con almeno 2 caratteri.
ja: バッファーには、サロゲート ペアを適合させるのに十分な大きさがありません。バッファー サイズには、少なくとも 2 桁を指定してください。
ko: 버퍼가 너무 작아서 서로게이트 쌍에 맞지 않습니다. 버퍼 크기를 2자 이상으로 지정하세요.
pl: Ten bufor nie jest wystarczająco duży, aby obsługa pary zastępczej była możliwa. Udostępnij bufor o rozmiarze wynoszącym co najmniej 2 znaki.
pt_br: O buffer não é grande o suficiente para se ajustar a um par alternativo. Forneça um buffer que tenha pelo menos 2 caracteres.
ru: Размера буфера недостаточно, чтобы вместить суррогатную пару. Необходимо предоставить буфер размером не менее двух символов.
tr: Arabellek yedek çift sığacak kadar büyük değil. Lütfen boyutu en az 2 karakter olan bir arabellek sağlayın.
zh_hans: 缓冲区不够大，无法容纳代理项对。请提供大小至少为 2 个字符的缓冲区。
zh_hant: 緩衝區不夠大，無法容納代理字組。請提供至少 2 個字元的緩衝區大小。

# Xml_NotSameNametable
source: Not the same name table.
cs: Není tabulka se stejným názvem.
de: Es handelt sich nicht um dieselbe Namenstabelle.
es: No es la misma tabla de nombres.
fr: Table de noms différente.
it: La tabella dei nomi è diversa.
ja: 同じ名前テーブルではありません。
ko: 같은 이름 테이블이 아닙니다.
pl: Inna tabela nazw.
pt_br: Tabela de nomes não é a mesma.
ru: Не является таблицей с тем же именем.
tr: Aynı ad tablosu değil.
zh_hans: 不是同一个名称表。
zh_hant: 並非相同名稱的資料表。

# Xml_NotTheFirst
source: WriteStartDocument needs to be the first call.
cs: Prvním voláním musí být volání funkce WriteStartDocument.
de: WriteStartDocument muss der erste Aufruf sein.
es: WriteStartDocument debe ser la primera llamada.
fr: WriteStartDocument doit être le premier appel.
it: WriteStartDocument deve essere la prima chiamata.
ja: WriteStartDocument は最初の呼び出しでなければなりません。
ko: WriteStartDocument를 먼저 호출해야 합니다.
pl: Element WriteStartDocument powinien być pierwszym wywołaniem.
pt_br: WriteStartDocument precisa ser a primeira chamada.
ru: Первым должен быть вызван метод WriteStartDocument.
tr: WriteStartDocument ilk çağrı olmalıdır.
zh_hans: WriteStartDocument 应是第一个调用。
zh_hant: WriteStartDocument 必須第一個呼叫。

# Xml_NullResolver
source: Resolving of external URIs was prohibited.
cs: Překlad externích identifikátorů URI byl zakázán.
de: Das Auflösen externer URIs war nicht zulässig.
es: No se pueden resolver identificadores URI externos.
fr: La résolution des URI externes est interdite.
it: La risoluzione di URI esterni non è consentita.
ja: 外部の URI を解決することは禁止されています。
ko: 외부 URI를 확인할 수 없습니다.
pl: Rozpoznawanie zewnętrznych identyfikatorów URI było zabronione.
pt_br: A resolução de URIs externos estava proibida.
ru: Разрешение внешних URI было запрещено.
tr: Dış URI'lerin çözümlenmesi yasaklandı.
zh_hans: 禁止解析外部 URI。
zh_hant: 禁止解析外部 URI。

# Xml_PartialContentNodeTypeNotSupported
source: This NodeType is not supported for partial content parsing.
cs: Tento typ NodeType není podporován pro parsování částečného obsahu.
de: Dieser NodeType wird zum Analysieren von Teilinhalten nicht unterstützt.
es: Este elemento NodeType no se admite para el análisis parcial de contenidos.
fr: Ce NodeType n'est pas pris en charge pour l'analyse de contenu partiel.
it: Questo elemento XmlNodeType non è supportato per l'analisi di contenuto parziale.
ja: この NodeType では、コンテンツの部分解析を行うことはできません。
ko: 이 NodeType은 일부 콘텐츠 구문 분석에 지원되지 않습니다.
pl: Ten element NodeType nie jest obsługiwany dla częściowej analizy zawartości.
pt_br: Não há suporte para NodeType para análise de conteúdo parcial.
ru: NodeType не поддерживается для разбора неполного содержимого.
tr: Bu NodeType kısmi içerik ayrıştırma için desteklenmiyor.
zh_hans: 部分内容分析不支持此 NodeType。
zh_hant: 部分內容剖析不支援此 NodeType。

# Xml_PartialContentNodeTypeNotSupportedEx
source: XmlNodeType {0} is not supported for partial content parsing.
cs: XmlNodeType {0} není podporován pro parsování částečného obsahu.
de: Der XmlNodeType {0} wird zum Analysieren von Teilinhalten nicht unterstützt.
es: XmlNodeType {0} no es compatible para análisis parcial de contenidos.
fr: XmlNodeType {0} n'est pas pris en charge pour l'analyse de contenu partiel.
it: L'elemento XmlNodeType {0} non è supportato per l'analisi di contenuto parziale.
ja: XmlNodeType {0} を使用してコンテンツの部分解析を行うことはできません。
ko: XmlNodeType {0}은(는) 일부 콘텐츠 구문 분석에 지원되지 않습니다.
pl: Typ XmlNodeType {0} nie jest obsługiwany w przypadku częściowej analizy zawartości.
pt_br: Não há suporte para XmlNodeType {0} para análise de conteúdo parcial.
ru: XmlNodeType {0} не поддерживается для разбора неполного содержимого.
tr: XmlNodeType {0} kısmi içerik ayrıştırma için desteklenmiyor.
zh_hans: 部分内容分析不支持 XmlNodeType {0}。
zh_hant: 部分內容剖析不支援 XmlNodeType {0}。

# Xml_PrefixForEmptyNs
source: Cannot use a prefix with an empty namespace.
cs: U prázdného oboru názvů nelze použít předponu.
de: Ein Präfix kann nicht mit einem leeren Namespace verwendet werden.
es: No se puede utilizar un prefijo en un espacio de nombres vacío.
fr: Impossible d'utiliser un préfixe avec un espace de noms vide.
it: Non è possibile usare un prefisso con uno spazio dei nomi vuoto.
ja: 空の名前空間でプレフィックスを使用できません。
ko: 빈 네임스페이스에 접두사를 사용할 수 없습니다.
pl: Nie można użyć prefiksu z pustą przestrzenią nazw.
pt_br: Não é possível usar um prefixo com um namespace vazio.
ru: Невозможно использовать префикс с пустым пространством имен.
tr: Ad alanı boş olan bir önek kullanılamaz.
zh_hans: 对空命名空间不能使用前缀。
zh_hant: 無法使用命名空間空白的前置詞。

# Xml_ReadBinaryContentNotSupported
source: {0} method is not supported on this XmlReader. Use CanReadBinaryContent property to find out if a reader implements it.
cs: Metoda {0} není pro tuto třídu XmlReader podporována. Pomocí vlastnosti CanReadBinaryContent zjistěte, zda ji čtecí zařízení implementuje.
de: Die {0}-Methode wird von diesem XmlReader nicht unterstützt. Verwenden Sie die CanReadBinaryContent-Eigenschaft, um herauszufinden, ob diese von einem Leser implementiert wird.
es: No se admite el método {0} en este XmlReader. Utilice la propiedad CanReadBinaryContent para averiguar si algún lector lo implementa.
fr: La méthode {0} n'est pas prise en charge par ce XmlReader. Utilisez la propriété CanReadBinaryContent pour savoir si un lecteur l'implémente.
it: Il metodo {0} non è supportato in questo elemento XmlReader. Usare la proprietà CanReadBinaryContent per sapere se è implementato da un lettore.
ja: この XmlReader は {0} メソッドをサポートしていません。リーダーがこれを実装しているかどうかを確認するには、CanReadBinaryContent プロパティを使用してください。
ko: {0} 메서드는 이 XmlReader에서 지원되지 않습니다. CanReadBinaryContent 속성을 사용하여 판독기가 이 메서드를 구현하는지 확인하세요.
pl: Metoda {0} nie jest obsługiwana w przypadku elementu XmlReader. Sprawdź, czy czytnik umożliwia jej zaimplementowanie, korzystając z właściwości CanReadBinaryContent.
pt_br: Não há suporte para o método {0} neste XmlReader. Use a propriedade CanReadBinaryContent para descobrir se um leitor o implementou.
ru: Метод {0} не поддерживается для этого XmlReader. Используйте свойство CanReadBinaryContent, чтобы выяснить, реализован ли он в модуле считывания.
tr: {0} metodu bu XmlReader'de desteklenmiyor. Bunu uygulayan bir okuyucu olup olmadığını bulmak için CanReadBinaryContent özelliğini kullanın.
zh_hans: 该 XmlReader 上不支持 {0} 方法。请使用 CanReadBinaryContent 属性查明是否有阅读器实现了它。
zh_hant: 此 XmlReader 上不支援 {0} 方法。請使用 CanReadBinaryContent 屬性來尋找讀取器是否實作了該方法。

# Xml_ReadContentAsFormatException
source: Content cannot be converted to the type {0}.
cs: Obsah nelze převést na typ {0}.
de: Der Inhalt kann nicht in den Typ {0} konvertiert werden.
es: El contenido no se puede convertir al tipo {0}.
fr: Le contenu ne peut pas être converti en type {0}.
it: Il contenuto non è convertibile nel tipo {0}.
ja: コンテンツを型 {0} に変換することはできません。
ko: 콘텐츠를 {0} 형식으로 변환할 수 없습니다.
pl: Nie można przekonwertować zawartości na typ {0}.
pt_br: Não é possível converter conteúdo no tipo {0}.
ru: Содержимое невозможно преобразовать в тип {0}.
tr: İçerik {0} türüne dönüştürülemiyor.
zh_hans: 内容无法转换为类型 {0}。
zh_hant: 內容無法轉換為類型 {0}。

# Xml_ReadOnlyProperty
source: The '{0}' property is read only and cannot be set.
cs: Vlastnost {0} je jen pro čtení a nelze ji nastavit.
de: Die {0}-Eigenschaft ist schreibgeschützt und kann nicht festgelegt werden.
es: La propiedad "{0}" es de solo lectura y no se puede establecer.
fr: La propriété '{0}' est en lecture seule et ne peut pas être définie.
it: La proprietà '{0}' è di sola lettura e non è possibile impostarla.
ja: '{0}' プロパティは読み取り専用のため、値を設定できません。
ko: '{0}' 속성은 읽기 전용이며 설정할 수 없습니다.
pl: Właściwość „{0}” jest przeznaczona tylko do odczytu i nie można jej ustawić.
pt_br: A propriedade '{0}' é somente leitura e não pode ser definida.
ru: Свойство "{0}" доступно только для чтения и не может быть установлено.
tr: '{0}' özelliği salt okunur ve ayarlanamaz.
zh_hans: “{0}”属性为只读，不能设置。
zh_hant: '{0}' 屬性為唯讀，且不可加以設定。

# Xml_ReadSubtreeNotOnElement
source: ReadSubtree() can be called only if the reader is on an element node.
cs: Metodu ReadSubtree() lze volat pouze v případě, že na uzlu elementu existuje čtecí zařízení.
de: ReadSubtree() kann nur aufgerufen werden, wenn sich der Leser auf einem Elementknoten befindet.
es: Solo se puede llamar a ReadSubtree() si el lector se encuentra en un nodo de elemento.
fr: ReadSubtree() peut uniquement être appelé si le lecteur se trouve sur un nœud d'élément.
it: ReadSubtree() può essere chiamato solo se il lettore si trova su un nodo di elemento.
ja: ReadSubtree() は要素ノードにリーダーがある場合のみ、呼び出すことができます。
ko: ReadSubtree()는 판독기가 요소 노드에 있는 경우에만 호출할 수 있습니다.
pl: Funkcję ReadSubtree() można wywołać tylko w sytuacji, gdy węzeł elementu zawiera czytnik.
pt_br: ReadSubtree() só poderá ser chamado se o leitor estiver em um nó de elemento.
ru: ReadSubtree() может быть вызван только в том случае, если модуль чтения находится в узле элемента.
tr: ReadSubtree(), yalnızca okuyucu öğe düğümündeyse çağrılabilir.
zh_hans: 仅当读取程序位于元素节点上时，才能调用 ReadSubtree()。
zh_hant: 僅當讀取器在元素節點上時才可呼叫 ReadSubtree()。

# Xml_ReadValueChunkNotSupported
source: ReadValueChunk method is not supported on this XmlReader. Use CanReadValueChunk property to find out if an XmlReader implements it.
cs: Metoda ReadValueChunk není pro tuto třídu XmlReader podporována. Pomocí vlastnosti CanReadValueChunk zjistěte, zda ji třída XmlReader implementuje.
de: Die ReadValueChunk-Methode wird von diesem XmlReader nicht unterstützt. Verwenden Sie die CanReadValueChunk-Eigenschaft, um zu ermitteln, ob diese von einem XmlReader implementiert wird.
es: No se admite el método ReadValueChunk en este elemento XmlReader. Utilice la propiedad CanReadValueChunk para averiguar si XmlReader lo implementa.
fr: La méthode ReadValueChunk n'est pas prise en charge par ce XmlReader. Utilisez la propriété CanReadValueChunk pour savoir si un XmlReader l'implémente.
it: Il metodo ReadValueChunk non è supportato su questo elemento XmlReader. Usare la proprietà CanReadValueChunk per sapere se è implementato da un elemento XmlReader.
ja: この XmlReader では ReadValueChunk メソッドをサポートしていません。XmlReader がこれを実装しているかどうかを確認するには、CanReadValueChunk プロパティを使用してください。
ko: ReadValueChunk 메서드가 이 XmlReader에서 지원되지 않습니다. XmlReader가 해당 메서드를 구현하는지 확인하려면 CanReadValueChunk 속성을 사용하세요.
pl: Metoda ReadValueChunk nie jest obsługiwana w przypadku tego elementu XmlReader. Sprawdź, czy element XmlReader umożliwia jej zaimplementowanie, korzystając z właściwości CanReadValueChunk.
pt_br: Não há suporte para o método ReadValueChunk neste XmlReader. Use a propriedade CanReadValueChunk para descobrir se um XmlReader o implementou.
ru: Метод ReadValueChunk не поддерживается для этого XmlReader. Используйте свойство CanReadValueChunk, чтобы выяснить, реализован ли он в составе XmlReader.
tr: ReadValueChunk metodu bu XmlReader'da desteklenmiyor. Bunu uygulayan bir XmlReader olup olmadığını bulmak için CanReadValueChunk özelliğini kullanın.
zh_hans: 此 XmlReader 上不支持 ReadValueChunk 方法。使用 CanReadValueChunk 属性确定 XmlReader 是否实现该方法。
zh_hant: ReadValueChunk 方法不支援此 XmlReader。若 XmlReader 實作，請使用 CanReadValueChunk 屬性查明。

# Xml_ReaderAsyncNotSetException
source: Set XmlReaderSettings.Async to true if you want to use Async Methods.
cs: Pokud chcete používat asynchronní metody, nastavte vlastnost XmlReaderSettings.Async na hodnotu true.
de: Legen Sie XmlReaderSettings.Async auf "true" fest, wenn Sie asynchrone Methoden verwenden möchten.
es: Establezca XmlReaderSettings.Async en true si desea usar métodos asincrónicos.
fr: Attribuez à XmlReaderSettings.Async la valeur true si vous souhaitez utiliser des méthodes asynchrones.
it: Per usare metodi asincroni, impostare XmlReaderSettings.Async su true.
ja: 非同期メソッドを使用する場合、XmlReaderSettings.Async を True に設定します。
ko: 비동기 메서드를 사용하려면 XmlReaderSettings.Async를 true로 설정하세요.
pl: Ustaw dla właściwości XmlReaderSettings.Async wartość True, jeśli chcesz używać metod asynchronicznych.
pt_br: Defina XmlReaderSettings.Async como true se desejar usar Métodos Assíncronos.
ru: Задайте для параметра XmlReaderSettings.Async значение true, чтобы использовать асинхронные методы.
tr: Async Metotlarını kullanmak istiyorsanız XmlReaderSettings.Async değerini true olarak ayarlayın.
zh_hans: 如果你想使用 Async 方法，请将 XmlReaderSettings.Async 设置为 True。
zh_hant: 若要使用非同步方法，請將 XmlReaderSettings.Async 設為 true。

# Xml_RecursiveGenEntity
source: General entity '{0}' references itself.
cs: Obecná entita {0} odkazuje sama na sebe.
de: Die allgemeine Entität "{0}" verweist auf sich selbst.
es: La entidad general "{0}" hace referencia a sí misma.
fr: L'entité générale '{0}' s'autoréférence.
it: L'entità generale '{0}' fa riferimento a se stessa.
ja: 一般エンティティ '{0}' は、それ自体を参照します。
ko: 일반 엔터티 '{0}'이(가) 자신을 참조합니다.
pl: Jednostka ogólna „{0}” odwołuje się do samej siebie.
pt_br: A entidade geral '{0}' faz referência a si mesma.
ru: Общая сущность "{0}" ссылается на себя.
tr: '{0}' genel varlığı kendine başvuruyor.
zh_hans: 常规实体“{0}”引用自身。
zh_hant: 一般實體 '{0}' 參考了本身。

# Xml_RecursiveParEntity
source: Parameter entity '{0}' references itself.
cs: Entita parametru {0} odkazuje sama na sebe.
de: Die Parameterentität "{0}" verweist auf sich selbst.
es: La entidad del parámetro "{0}" hace referencia a sí misma.
fr: L'entité de paramètre '{0}' s'autoréférence.
it: L'entità parametro '{0}' fa riferimento a se stessa.
ja: パラメーター エンティティ '{0}' は、それ自体を参照します。
ko: 매개 변수 엔터티 '{0}'이(가) 자신을 참조합니다.
pl: Jednostka parametru „{0}” odwołuje się do samej siebie.
pt_br: A entidade de parâmetro '{0}' faz referência a si mesma.
ru: Сущность параметра "{0}" ссылается на себя.
tr: '{0}' parametre varlığı kendine başvuruyor.
zh_hans: 参数实体“{0}”引用自身。
zh_hant: 參數實體 '{0}' 參考本身。

# Xml_RedefinePrefix
source: The prefix '{0}' cannot be redefined from '{1}' to '{2}' within the same start element tag.
cs: Předponu {0} nelze předefinovat z {1} na {2} v rámci stejné úvodní značky elementu.
de: Das Präfix "{0}" kann nicht von "{1}" in "{2}" innerhalb desselben Startelementtags neu definiert werden.
es: No se puede volver a definir el prefijo "{0}" de "{1}" a "{2}" dentro de la misma etiqueta de elemento inicial.
fr: Le préfixe '{0}' ne peut pas être redéfini à partir de '{1}' vers '{2}' au sein de la même balise d'élément de début.
it: Non è possibile ridefinire il prefisso '{0}' da '{1}' a '{2}' all'interno dello stesso tag dell'elemento di inizio.
ja: 要素の同一開始タグ内で、プレフィックス '{0}' の定義を '{1}' から '{2}' に変更することはできません。
ko: 접두사 '{0}'은(는) 같은 시작 요소 태그 내의 '{1}'에서 '{2}'(으)로 다시 정의할 수 없습니다.
pl: Nie można przedefiniować prefiksu „{0}” z „{1}” na „{2}” w tym samym tagu początkowym elementu.
pt_br: Não é possível redefinir o prefixo '{0}' de '{1}' para '{2}' na mesma marcação de elemento de início.
ru: Префикс "{0}" не может быть переопределен с "{1}" на "{2}" внутри того же начального тега элемента.
tr: '{0}' öneki, aynı başlangıç öğesi etiketinde '{1}' değerinden '{2}' değerine yeniden tanımlanamaz.
zh_hans: 在同一开始元素标记中，无法将前缀“{0}”从“{1}”重定义为“{2}”。
zh_hant: 前置詞 '{0}' 無法從 '{1}' 重新定義至在相同的開始元素標記中的 '{2}'。

# Xml_RelativeUriNotSupported
source: Relative URIs are not supported.
cs: Relativní identifikátory URI nejsou podporovány.
de: Relative URIs werden nicht unterstützt.
es: Los URI relativos no están admitidos.
fr: Les URI relatifs ne sont pas pris en charge.
it: Gli URI relativi non sono supportati.
ja: 相対 URI はサポートされていません。
ko: 상대 URI는 지원되지 않습니다.
pl: Względne identyfikatory URI nie są obsługiwane.
pt_br: Não há suporte para URIs relativos.
ru: Относительные идентификаторы URI не поддерживаются.
tr: Göreli URI'ler desteklenmez.
zh_hans: 不支持相对 URI。
zh_hant: 不支援相對 URI。

# Xml_StackOverflow
source: Stack overflow.
cs: Přetečení zásobníku
de: Stapelüberlauf.
es: Desbordamiento de pila.
fr: Dépassement de la capacité de la pile.
it: Overflow dello stack.
ja: スタックのオーバーフロー。
ko: 스택 오버플로입니다.
pl: Przepełnienie stosu.
pt_br: Excedente de pilha.
ru: Переполнение стека.
tr: Yığın taşması.
zh_hans: 堆栈溢出。
zh_hant: 堆疊溢位。

# Xml_SurrogatePairSplit
source: The second character surrogate pair is not in the input buffer to be written.
cs: Náhradní pár druhého znaku není určen k zapsání do vstupní vyrovnávací paměti.
de: Das zweite Ersatzzeichenpaar befindet sich nicht im zu schreibenden Eingabepuffer.
es: El segundo par suplente de caracteres no se encuentra en el búfer de entrada para escritura.
fr: La seconde paire de substitution de caractère ne se trouve pas dans la mémoire tampon d'entrée qui doit être écrite.
it: La seconda coppia di surrogati del carattere non si trova nel buffer di input da scrivere.
ja: 2 番目の文字のサロゲート ペアは、書き込む入力バッファーの中にありません。
ko: 기록할 입력 버퍼에 둘째 문자 서로게이트 쌍이 없습니다.
pl: Druga para dwuskładnikowa znaku nie znajduje się w buforze wejściowym, który ma zostać zapisany.
pt_br: O segundo par alternativo de caracteres não está no buffer de entrada a ser gravado.
ru: Второй символ суррогатной пары отсутствует в подлежащем записи входном буфере.
tr: İkinci karakter yedek çifti yazılacak giriş arabelleğinde değil.
zh_hans: 第二个字符代理项对不在要写的输入缓冲区中。
zh_hant: 代理字組的第二個字元不在要寫入的輸入緩衝區。

# Xml_SystemPathResolverCannotOpenUri
source: Cannot open '{0}'. The Uri parameter must be a file system relative or absolute path.
cs: Nelze otevřít {0}. Parametr Uri musí být relativní nebo absolutní cesta systému souborů.
de: "{0}" kann nicht geöffnet werden. Der Uri-Parameter muss ein relativer Pfad im Dateisystem oder ein absoluter Pfad sein.
es: No se puede abrir "{0}". El parámetro del identificador URI debe ser una ruta de acceso absoluta o relativa del sistema de archivos.
fr: Impossible d'ouvrir '{0}'. Le paramètre Uri doit être un chemin relatif ou absolu d'un système de fichiers.
it: Non è possibile aprire '{0}'. Il parametro URI deve essere un percorso assoluto o relativo del file system.
ja: '{0}' を開けません。URI パラメーターは、ファイル システムの相対パスまたは絶対パスである必要があります。
ko: '{0}'을(를) 열 수 없습니다. URI 매개 변수는 파일 시스템의 상대 또는 절대 경로여야 합니다.
pl: Nie można otworzyć elementu „{0}”. Parametr Uri musi być ścieżką względną lub bezwzględną w systemie plików.
pt_br: Não é possível abrir '{0}'. O parâmetro URI deve ser um caminho absoluto ou relativo de sistema de arquivos.
ru: Невозможно открыть "{0}". Параметр URI должен быть абсолютным путем или относительным путем в файловой системе.
tr: '{0}' açılamıyor. Uri parametresinin bir dosya sistemi göreli veya tam yolu olması gerekir.
zh_hans: 无法打开“{0}”。URI 参数必须是文件系统相对或绝对路径。
zh_hant: 無法開啟 '{0}'。URI 參數必須是檔案系統的相對或絕對路徑。

# Xml_TagMismatch
source: The '{0}' start tag on line {1} does not match the end tag of '{2}'.
cs: Počáteční značka {0} na řádku {1} neodpovídá koncové značce {2}.
de: Das Starttag "{0}" in Zeile "{1}" stimmt nicht mit dem Endtag von "{2}" überein.
es: La etiqueta inicial "{0}" en la línea {1} no coincide con la etiqueta final de "{2}".
fr: La balise de début '{0}' sur la ligne {1} ne correspond pas à la balise de fin de '{2}'.
it: Il tag di inizio '{0}' alla riga {1} non corrisponde al tag di fine di '{2}'.
ja: 行 {1} にある '{0}' の開始タグ と '{2}' の終了タグが対応していません。
ko: 줄 {1}의 '{0}' 시작 태그가 '{2}'의 끝 태그와 일치하지 않습니다.
pl: Tag początkowy „{0}” w wierszu {1} nie pasuje do tagu końcowego „{2}”.
pt_br: A marca de início '{0}' na linha {1} não corresponde à marca de fim de '{2}'.
ru: Начальный тег "{0}" в строке {1} не соответствует конечному тегу "{2}".
tr: {1}. satırdaki '{0}' başlangıç etiketi '{2}' bitiş etiketiyle eşleşmiyor.
zh_hans: 行 {1} 上的开始标记“{0}”与结束标记“{2}”不匹配。
zh_hant: 行 {1} 的 '{0}' 開始標記與 '{2}' 的結束標記不相符。

# Xml_TagMismatchEx
source: The '{0}' start tag on line {1} position {2} does not match the end tag of '{3}'.
cs: Počáteční značka {0} na řádku {1} a pozici {2} neodpovídá koncové značce {3}.
de: Das Starttag "{0}" in Zeile {1} Position {2} stimmt nicht mit dem Endtag "{3}" überein.
es: La etiqueta inicial "{0}" en la línea {1} posición {2} no coincide con la etiqueta final de "{3}".
fr: La balise de début '{0}' sur la ligne {1} à la position {2} ne correspond pas à la balise de fin de '{3}'.
it: Il tag di inizio '{0}' alla riga {1}, posizione {2}, non corrisponde al tag di fine di '{3}'.
ja: 行 {1}、位置 {2} にある '{0}' の開始タグと '{3}' の終了タグが対応していません。
ko: 줄 {1}, 위치 {2}의 '{0}' 시작 태그가 '{3}'의 끝 태그와 일치하지 않습니다.
pl: Tag początkowy „{0}” w wierszu {1} na pozycji {2} nie pasuje do tagu końcowego „{3}”.
pt_br: A marca de início '{0}' na linha {1}, posição {2} não corresponde à marca de fim de '{3}'.
ru: Начальный тег "{0}" в позиции {2} строки {1} не соответствует конечному тегу "{3}".
tr: {1}. satırda, {2} konumundaki '{0}' başlangıç etiketi '{3}' bitiş etiketiyle eşleşmiyor.
zh_hans: 第 {1} 行，位置 {2} 上的开始标记“{0}”与结束标记“{3}”不匹配。
zh_hant: 行 {1} 位置 {2} 的 '{0}' 開始標記與結束標記 '{3}' 不相符。

# Xml_UnclosedConditionalSection
source: There is an unclosed conditional section.
cs: Byl nalezen neuzavřený podmíněný oddíl.
de: Es ist ein nicht geschlossener Bedingungsabschnitt vorhanden.
es: Hay una sección condicional sin cerrar.
fr: Il existe une section conditionnelle non fermée.
it: È presente una sezione condizionale non chiusa.
ja: 閉じられていない条件付セクションがあります。
ko: 닫히지 않은 조건 섹션이 있습니다.
pl: Istnieje niezamknięta sekcja warunków.
pt_br: Existe uma seção condicional não fechada.
ru: Присутствует незакрытый условный раздел.
tr: Kapatılmamış koşullu bölüm var.
zh_hans: 存在未关闭的条件节。
zh_hant: 有一個未關閉的條件約束區段。

# Xml_UnclosedQuote
source: There is an unclosed literal string.
cs: Byl nalezen neuzavřený řetězcový literál.
de: Es ist eine offene Literalzeichenfolge vorhanden.
es: Hay una cadena de literal sin cerrar.
fr: Il existe une chaîne littérale non fermée.
it: È presente una stringa letterale non chiusa.
ja: 閉じていない文字列リテラルがあります。
ko: 닫히지 않은 리터럴 문자열이 있습니다.
pl: Istnieje niezamknięty ciąg literału.
pt_br: Existe uma cadeia de caracteres literal não fechada.
ru: Присутствует незакрытый строковый литерал.
tr: Kapatılmamış bir sabit değer dizesi var.
zh_hans: 有未闭合的字符串。
zh_hant: 有未封閉的常值字串。
