Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_AttributeRestrictionInvalidFromWildcard
source: The {base type definition} must have an {attribute wildcard} and the {target namespace} of the R's {attribute declaration} must be valid with respect to that wildcard.
cs: Typ {base type definition} musí obsahovat atribut {attribute wildcard} a obor názvů {target namespace} atributu {attribute declaration} obsaženého v omezení musí být platný vzhledem k danému zástupnému znaku.
de: {base type definition} muss einen {attribute wildcard} enthalten und der {target namespace} der {attribute declaration} von R muss in Bezug auf diesen Platzhalter gültig sein.
es: {base type definition} debe tener {attribute wildcard}. Además, {target namespace} de {attribute declaration} de R debe ser válido con respecto al carácter comodín.
fr: La {base type definition} doit comporter un {attribute wildcard}, et l'{target namespace} de la {attribute declaration} du R doit être valide par rapport à ce caractère générique.
it: L'elemento {base type definition} deve contenere un elemento {attribute wildcard} e l'elemento {target namespace} di {attribute declaration} di R deve essere valido in relazione a tale carattere jolly.
ja: {base type definition} は {attribute wildcard} を持つ必要があり、R の {attribute declaration} の {target namespace} がそのワイルドカードに対して有効でなければなりません。
ko: {base type definition}에는 {attribute wildcard}가 있어야 하고 R의 {attribute declaration}의 {target namespace}는 해당 와일드카드에 대해 유효해야 합니다.
pl: Element {base type definition} musi mieć {attribute wildcard} a {target namespace} z {attribute declaration} elementu R musi być prawidłowy względem tego symbolu wieloznacznego.
pt_br: A {base type definition} deve ter um {attribute wildcard} e o {target namespace} da {attribute declaration} de R deve ser válido em relação ao curinga.
ru: {base type definition} должен иметь {attribute wildcard}, и {target namespace} данного {attribute declaration} языка R должно быть действительным в отношении этого подстановочного знака.
tr: {base type definition} bir {attribute wildcard} sahibi olmalıdır ve R'nin {attribute declaration} bildiriminin {target namespace} değeri bu joker parçacığa göre geçerli olmalıdır.
zh_hans: {base type definition} 必须有 {attribute wildcard} 并且 R 的 {attribute declaration} 的 {target namespace} 相对于此通配符必须有效。
zh_hant: {base type definition} 必須要有 {attribute wildcard}，而且 R {attribute declaration} 的 {target namespace} 也必須為對應於該萬用字元的有效值。

# Sch_AttributeRestrictionProhibited
source: Invalid attribute restriction. Attribute restriction is prohibited in base type.
cs: Neplatné omezení atributů. Omezení atributů je v základním typu zakázáno.
de: Ungültige Attributeinschränkung. Eine Attributeinschränkung ist im Basistyp nicht zulässig.
es: Restricción de atributo no válida. La restricción de atributo está prohibida en el tipo base.
fr: Restriction d'attribut non valide. La restriction d'attribut n'est pas autorisée dans le type de base.
it: La restrizione dell'attributo non è valida. La restrizione dell'attributo non è consentita nel tipo di base.
ja: 無効な属性制限です。属性制限を基本データ型で使用することはできません。
ko: 특성 restriction이 잘못되었습니다. 기본 형식에서는 특성 restriction을 사용할 수 없습니다.
pl: Nieprawidłowe ograniczenie atrybutu. Ograniczenie atrybutu jest zabronione w typie podstawowym.
pt_br: Restrição de atributo inválida. Restrição de atributo proibida no tipo base.
ru: Недопустимое ограничение атрибута. Ограничение атрибута запрещено в базовом типе.
tr: Geçersiz öznitelik kısıtlaması. Öznitelik kısıtlaması temel türde kullanılamaz.
zh_hans: 无效的特性限制。在基类型中禁止使用特性限制。
zh_hant: 屬性限制無效。基底類型中禁止使用屬性限制。

# Sch_AttributeUseInvalid
source: Derived attribute's use has to be required if base attribute's use is required.
cs: Pokud je vyžadováno použití základního atributu, musí být vyžadováno i použití odvozeného atributu.
de: Die Verwendung des abgeleiteten Attributs muss erforderlich sein, wenn die Verwendung des Basisattributs erforderlich ist.
es: Si es necesario el uso del atributo base, se debe solicitar el uso del atributo derivado.
fr: L'utilisation de l'attribut dérivé doit être obligatoire, si l'utilisation de l'attribut de base est obligatoire.
it: L'uso dell'attributo derivato deve essere obbligatorio se è obbligatorio l'uso dell'attributo di base.
ja: 基本型の use 属性が required である場合は、派生型の use 属性を required にする必要があります。
ko: 기본 특성의 use가 필수이면 파생 특성의 use도 필수 항목이 되어야 합니다.
pl: Jeśli użycie atrybutu podstawowego jest wymagane, użycie atrybutu pochodnego również musi być wymagane.
pt_br: O uso do atributo derivado deverá ser necessário se o uso do atributo base for necessário.
ru: Использование производного атрибута должно быть обязательным, если обязательно использование базового атрибута.
tr: Temel alınan özniteliğin kullanılması gerekiyorsa türetilen özniteliğin de kullanılması gerekir.
zh_hans: 如果要求使用基本特性，则必须使用派生特性。
zh_hant: 若必須使用 base 屬性，則必須使用衍生屬性。

# Sch_AttributeValueDataType
source: The '{0}' attribute has an invalid value according to its data type.
cs: Hodnota atributu {0} je vzhledem k jeho datovému typu neplatná.
de: Der Wert des {0}-Attributs ist gemäß seinem Datentyp ungültig.
es: El atributo "{0}" tiene un valor no válido de acuerdo con su tipo de datos.
fr: L'attribut '{0}' a une valeur non valide selon son type de données.
it: Il valore dell'attributo '{0}' non è valido in base al relativo tipo di dati.
ja: このデータ型では無効な値が '{0}' 属性に含まれています。
ko: '{0}' 특성 값의 데이터 형식이 잘못되었습니다.
pl: Atrybut „{0}” ma nieprawidłową wartość przy uwzględnieniu jego typu danych.
pt_br: O valor do atributo '{0}' é inválido de acordo com seu tipo de dados.
ru: Атрибут "{0}" имеет значение, недопустимое с точки зрения его типа данных.
tr: '{0}' özniteliği kendi veri türüne göre geçersiz bir değere sahip.
zh_hans: 根据其数据类型，“{0}”特性的值无效。
zh_hant: 根據 '{0}' 屬性的資料類型，其數值無效。

# Sch_AttributeValueDataTypeDetailed
source: The '{0}' attribute is invalid - The value '{1}' is invalid according to its datatype '{2}' - {3}
cs: Atribut {0} je neplatný. Hodnota {1} je neplatná vzhledem k jejímu datovému typu {2} – {3}
de: Das {0}-Attribut ist ungültig. Der Wert "{1}" ist gemäß seinem Datentyp "{2}" ungültig – {3}.
es: El atributo "{0}" no es válido. El valor "{1}" no es válido según su tipo de datos "{2}" - {3}
fr: L'attribut '{0}' est non valide - La valeur '{1}' est non valide selon son type de données '{2}' - {3}
it: L'attributo '{0}' non è valido. Il valore '{1}' non è valido in base al relativo tipo di dati '{2}' - {3}
ja: '{0}' 属性は無効です。値 '{1}' はデータ型 '{2}' に対して無効です。{3}
ko: '{0}' 특성이 잘못되었습니다. 값 '{1}'의 데이터 형식 '{2}'이(가) 잘못되었습니다. {3}
pl: Atrybut „{0}” jest nieprawidłowy. Wartość „{1}” jest nieprawidłowa przy uwzględnieniu jego typu danych „{2}” — {3}.
pt_br: O atributo '{0}' é inválido – O valor '{1}' é inválido dependendo do tipo de dados '{2}' – {3}
ru: Атрибут "{0}" недействителен: значение "{1}" недействительно с точки зрения его типа данных "{2}" — {3}
tr: '{0}' özniteliği geçersiz. '{1}' değeri '{2}' veri türüne göre geçersiz - {3}
zh_hans: “{0}”特性无效 - 根据其数据类型“{2}”，值“{1}”无效 - {3}
zh_hant: '{0}' 屬性無效 – 根據數值 '{1}' 的資料類型 '{2}'，其值無效 - {3}

# Sch_BaseFinalExtension
source: The base type is the final extension.
cs: Základním typem je konečné rozšíření.
de: Der Basistyp ist die letzte Erweiterung.
es: El tipo base es la extensión final.
fr: Le type de base est l'extension finale.
it: Il tipo di base è l'estensione finale.
ja: 基本データ型は final extension です。
ko: 기본 형식은 final extension입니다.
pl: Typ podstawowy jest rozszerzeniem końcowym.
pt_br: O tipo base é a extensão final.
ru: Этот базовый тип является окончательным расширением.
tr: Temel tür son uzantıdır.
zh_hans: 基类型是 final 扩展。
zh_hant: 此基底類型是最終延伸模組。

# Sch_BaseFinalList
source: The base type is the final list.
cs: Základním typem je konečný seznam.
de: Der Basistyp ist die letzte Liste.
es: El tipo base es la lista final.
fr: Le type de base est la liste finale.
it: Il tipo di base è l'elenco finale.
ja: 基本データ型は final list です。
ko: 기본 형식은 final list입니다.
pl: Typ podstawowy jest listą końcową.
pt_br: O tipo base é a lista final.
ru: Этот базовый тип является окончательным списком.
tr: Temel tür son listedir.
zh_hans: 基类型是 final 列表。
zh_hant: 此基底類型是最終清單。

# Sch_BaseFinalRestriction
source: The base type is final restriction.
cs: Základním typem je konečné omezení.
de: Der Basistyp ist die letzte Einschränkung.
es: El tipo base es una restricción final.
fr: Le type de base est une restriction finale.
it: Il tipo di base è la restrizione finale.
ja: 基本データ型は final restriction です。
ko: 기본 형식은 final restriction입니다.
pl: Typ podstawowy jest ograniczeniem końcowym.
pt_br: O tipo base é a restrição final.
ru: Этот базовый тип является окончательным ограничением.
tr: Temel tür son kısıtlamadır.
zh_hans: 基类型是 final 限制。
zh_hant: 基底類型為最終限制。

# Sch_BaseFinalUnion
source: The base type is the final union.
cs: Základním typem je konečné sjednocení.
de: Der Basistyp ist die letzte Union.
es: El tipo base es la unión final.
fr: Le type de base est l'union finale.
it: Il tipo di base è l'unione finale.
ja: 基本データ型は final union です。
ko: 기본 형식은 final union입니다.
pl: Typ podstawowy jest unią końcową.
pt_br: O tipo base é a união final.
ru: Этот базовый тип является окончательным объединением.
tr: Temel tür son birleşimdir.
zh_hans: 基类型为 final 联合。
zh_hant: 此基底類型是最終等位。

# Sch_CannotLoadSchema
source: Cannot load the schema for the namespace '{0}' - {1}
cs: Nelze načíst schéma pro obor názvů {0} – {1}
de: Das Schema für den Namespace "{0}" kann nicht geladen werden – {1}.
es: No se puede cargar el esquema para el espacio de nombres "{0}" - {1}
fr: Impossible de charger le schéma pour l'espace de noms '{0}' - {1}
it: Non è possibile caricare lo schema per lo spazio dei nomi '{0}' - {1}
ja: 名前空間 '{0}' のスキーマを読み込めません。{1}
ko: 네임스페이스 '{0}'의 스키마를 로드할 수 없습니다. {1}
pl: Nie można załadować schematu dla przestrzeni nazw „{0}” — {1}
pt_br: Não é possível carregar o esquema para o namespace '{0}' – {1}
ru: Невозможно загрузить схему для пространства имен "{0}" — {1}
tr: '{0}' - {1} ad alanı için şema yüklenemiyor
zh_hans: 无法为命名空间“{0}”加载架构 - {1}
zh_hant: 無法載入命名空間 '{0}' 的結構描述 - {1}

# Sch_CannotLoadSchemaLocation
source: Cannot load the schema from the location '{0}' - {1}
cs: Nelze načíst schéma z umístění {0} – {1}
de: Das Schema kann nicht vom Speicherort "{0}" geladen werden – {1}.
es: No se puede cargar el esquema desde la ubicación "{0}" - {1}
fr: Impossible de charger le schéma pour l'emplacement '{0}' - {1}
it: Non è possibile caricare lo schema dal percorso '{0}' - {1}
ja: 場所 '{0}' からスキーマを読み込めません。{1}
ko: 위치 '{0}'에서 스키마를 로드할 수 없습니다. {1}
pl: Nie można załadować schematu z lokalizacji „{0}” — {1}
pt_br: Não é possível carregar o esquema do local '{0}' – {1}
ru: Невозможно загрузить схему из расположения "{0}" — {1}
tr: Şema '{0}' konumundan yüklenemiyor - {1}
zh_hans: 无法从位置“{0}”加载架构 - {1}
zh_hant: 無法從位置 '{0}' 載入結構描述 - {1}

# Sch_ComplexContentContentModel
source: Complex content restriction or extension should consist of zero or one of 'group', 'choice', 'sequence', or 'all'; followed by zero or more 'attribute' or 'attributeGroup'; followed by zero or one 'anyAttribute'.
cs: Složité omezení nebo rozšíření obsahu by mělo sestávat z 0 nebo 1 atributu group, choice, sequence nebo all, následovaného 0 či více vlastnostmi attribute nebo attributeGroup, a mělo by být ukončeno 0 nebo 1 vlastností anyAttribute.
de: Eine komplexe Inhaltseinschränkung oder Erweiterung muss aus Null oder "group", "choice", "sequence" oder "all" bestehen, gefolgt von Null oder mehreren Elementen "attribute" oder "attributeGroup" und anschließend gefolgt von Null oder einem "anyAttribute".
es: La restricción o extensión de contenido complejo debe ser cero o un elemento "group", "choice", "all" o "sequence" seguido de cero o varios elementos "attribute" o "attributeGroups" seguido de cero o un elemento "anyAttribute".
fr: Une restriction ou extension de contenu complexe doit se composer de zéro ou une occurrence de 'group', 'choice', 'sequence' ou 'all', suivie de zéro, un ou plusieurs 'attribute' ou 'attributeGroup', suivis de zéro ou un 'anyAttribute'.
it: L'estensione o la restrizione di contenuto complesso deve essere costituita al massimo da un elemento 'group', 'choice', 'sequence' o 'all', seguito da uno o più elementi 'attribute' o 'attributeGroup', a loro volta seguiti da non più di un elemento 'anyAttribute'.
ja: 複合型のコンテンツの制限または拡張は、次のもので構成しなければなりません。最初に、'group'、'choice'、'sequence'、'all' のうちの 0 個か 1 個。次に 'attribute' または 'attributeGroups' のうちの 0 個以上。最後に、'anyAttribute' を 0 個か 1 個。
ko: 복합 콘텐츠 제한 또는 확장은 0개 또는 하나의 'group', 'choice', 'sequence', 0개 이상의 'attribute'가 뒤에 오는 'all', 0개 또는 하나의 'anyAttribute'가 뒤에 오는 'attributeGroup' 등으로 구성되어야 합니다.
pl: Złożone rozszerzenie lub ograniczenie zawartości powinno składać się z zera lub jednej z czterech możliwości: „group”, „choice”, „sequence” lub „all”, po czym powinno następować zero lub więcej elementów „attribute” bądź „attributeGroup” oraz zero lub jeden element „anyAttribute”.
pt_br: Restrição ou extensão de conteúdo complexo deve ter zero ou 'group', 'choice', 'sequence' ou 'all' seguido de zero ou mais 'attribute' ou 'attributeGroup' seguido de zero ou um 'anyAttribute'.
ru: Ограничение или расширение для составного содержимого состоит не более чем из одного элемента group, choice, sequence или all, за которым следует нуль или более элементов attribute или attributeGroup, за которыми следует не более одного элемента anyAttribute.
tr: Karmaşık içerik kısıtlaması veya uzantısı, sıfır veya 'group', 'choice', 'sequence' veya 'all' öğelerinden birini, ardından sıfır veya birden çok 'attribute' veya 'attributeGroups' öğesini ve bunu izleyen bir sıfır veya 'anyAttribute' öğesi içermelidir.
zh_hans: 复杂内容限制或扩展应该包含 "group"、"choice"、"sequence" 或 "all" 中的零个或一个，后跟零个或多个 "attribute" 或 "attributeGroup"，后面再跟零个或一个 "anyAttribute"。
zh_hant: 複雜內容限制或延伸模組的組成應為 'group'、'choice'、'sequence' 或 'all' 中的零個或一個，之後加上零個或多個 'attribute' 或 'attributeGroup'，接著再加上零個或一個 'anyAttribute'。

# Sch_ComplexContentModel
source: Content model validation resulted in a large number of states, possibly due to large occurrence ranges. Therefore, content model may not be validated accurately.
cs: Ověřování modelu obsahu vedlo k velkému počtu stavů. Pravděpodobnou příčinou byly velké rozsahy výskytů. Proto je možné, že model obsahu nebude ověřován přesně.
de: Die Validierung des Inhaltsmodells führte möglicherweise aufgrund großer Vorkommensbereiche zu einer großen Anzahl von Zuständen. Deshalb kann das Inhaltsmodell u. U. nicht genau überprüft werden.
es: La validación del modelo de contenido ofrece un número excesivo de estados, puede que debido a intervalos de ocurrencia. Por tanto, el modelo de contenido no se puede validar con precisión.
fr: La validation du modèle de contenu a engendré un grand nombre d'états, probablement en raison d'importantes plages d'occurrences. Le modèle de contenu risque donc de ne pas être validé correctement.
it: La convalida del modello di contenuto ha determinato un numero elevato di stati, probabilmente a causa di ampi intervalli di occorrenza, di conseguenza la convalida del modello di contenuto potrebbe non essere accurata.
ja: コンテンツ モデルの検証の結果、多数の状態が生成されました。原因としては、出現範囲の値が大きいことが考えられます。したがって、このコンテンツ モデルの検証は正確に実行されない可能性があります。
ko: 발생 범위가 넓어서 콘텐츠 모델의 유효성을 검사하면 여러 상태가 나타날 수 있습니다. 따라서 이 콘텐츠 모델은 유효성을 정확하게 검사할 수 없습니다.
pl: Wynikiem weryfikacji modelu zawartości jest duża liczba stanów. Prawdopodobnie przyczyną takiej sytuacji są duże zakresy wystąpień. Z tego względu nie można dokładnie zweryfikować modelu zawartości.
pt_br: A validação do modelo de conteúdo resultou em um grande número de estados, possivelmente devido a amplos intervalos de ocorrência. Portanto, o modelo de conteúdo pode não ser validado com precisão.
ru: Проверка модели содержимого завершилась с большим количеством состояний, вероятно, из-за большого диапазона вхождения. Возможно, модель не проверена точно.
tr: İçerik modeli doğrulaması, büyük olasılıkla yüksek yineleme aralıkları nedeniyle çok sayıda durumla sonuçlandı. Bu nedenle, içerik modeli düzgün bir şekilde doğrulanamayabilir.
zh_hans: 可能由于出现范围很大，内容模型验证生成了大量状态。因此，内容模型可能无法准确验证。
zh_hant: 可能因為發生範圍大，所以內容模型驗證產生了大量的狀態。因此，內容模型可能無法正確驗證。

# Sch_ComplexToSimpleTypeRedefine
source: Cannot redefine a complex type as simple type.
cs: Složitý typ nelze předefinovat jako jednoduchý typ.
de: Ein komplexer Typ kann nicht als einfacher Typ neu definiert werden.
es: No se puede redefinir un tipo complejo como tipo simple.
fr: Impossible de redéfinir un type complexe en tant que type simple.
it: Non è possibile ridefinire un tipo complesso come tipo semplice.
ja: 複合型を単純型として再定義することはできません。
ko: 복합 형식을 단순 형식으로 다시 정의할 수 없습니다.
pl: Nie można przedefiniować typu złożonego jako typ prosty.
pt_br: Não é possível redefinir um tipo complexo como um tipo simples.
ru: Не удалось переопределить составной тип как простой.
tr: Karmaşık bir tür basit tür olarak yeniden tanımlanamaz.
zh_hans: 不能将复杂类型重新定义为简单类型。
zh_hant: 無法將複雜類型重新定義為簡單型別。

# Sch_ComplexTypeContentModel
source: The content model of a complex type must consist of 'annotation' (if present); followed by zero or one of the following: 'simpleContent', 'complexContent', 'group', 'choice', 'sequence', or 'all'; followed by zero or more 'attribute' or 'attributeGroup'; followed by zero or one 'anyAttribute'.
cs: Model obsahu složitého typu musí sestávat z atributu annotation (je-li přítomen) následovaného 0 nebo 1 z následujících atributů: simpleContent, complexContent, group, choice, sequence nebo all, následovaného 0 nebo více vlastnostmi attribute nebo attributeGroup, za kterými následuje 0 nebo 1 atribut anyAttribute.
de: Das Inhaltsmodell eines komplexen Typs muss aus "annotation" (falls vorhanden) bestehen, gefolgt von Null oder einem der folgenden Werte: "simpleContent", "complexContent", "group", "choice", "sequence" oder "all", gefolgt von Null oder mehreren Elementen "attribute" bzw. "attributeGroup", gefolgt von Null oder einem "anyAttribute".
es: El modelo de contenido de un tipo complejo debe ser "annotation" (si está presente); seguido de ningún elemento o uno de los elementos: "simpleContent", "complexContent", "group", "choice", "sequence" o "all"; seguido de ningún elemento o varios elementos "attribute" o "attributeGroup"; seguido de ningún elemento o un elemento "anyAttribute".
fr: Le modèle de contenu d'un type complexe doit se composer de 'annotation' (si présent), suivi de zéro ou une occurrence de 'simpleContent', 'complexContent', 'group', 'choice', 'sequence' ou 'all', suivie de zéro, un ou plusieurs 'attribute' ou 'attributeGroup', suivis de zéro ou un 'anyAttribute'.
it: Il modello di contenuto di un tipo complesso deve essere costituito dall'elemento 'annotation' (se presente), seguito da non più di un elemento 'simpleContent', 'complexContent', 'group', 'choice', 'sequence' o 'all', seguito da zero o più elementi 'attribute' o 'attributeGroup', a loro volta seguiti da non più di un elemento 'anyAttribute'.
ja: 複合型のコンテンツ モデルは、次のもので構成しなければなりません。最初に、'annotation' (存在する場合)。次に、'simpleContent'、'complexContent'、'group'、'choice'、'sequence'、'all' のうちの 0 個か 1 個。次に、'attribute' または 'attributeGroup' のうちの 0 個以上。最後に、'anyAttribute' を 0 個か 1 個。
ko: 복합 형식의 콘텐츠 모델은 0개 또는 하나의 'simpleContent', 'complexContent', 'group', 'choice', 'sequence'가 뒤에 오는 'annotation'(있을 경우), 0개 이상의 'attribute'가 뒤에 오는 'all', 0개 또는 하나의 'anyAttribute'가 뒤에 오는 'attributeGroup' 등으로 구성되어야 합니다.
pl: Model zawartości typu złożonego musi zawierać element „annotation” (jeśli istnieje), po którym następuje zero lub jeden z elementów „simpleContent”, „complexContent”, „group”, „choice”, „sequence” lub „all”, po czym powinno następować zero lub więcej elementów „attribute” bądź „attributeGroup” oraz zero lub jeden element „anyAttribute”.
pt_br: O modelo de conteúdo de um tipo complexo deverá consistir em 'annotation' (se houver); seguido de zero ou uma das seguintes opções: 'simpleContent', 'complexContent', 'group', 'choice', 'sequence' ou 'all'; seguido de zero ou mais 'attribute' ou 'attributeGroup'; seguido de zero ou um 'anyAttribute'.
ru: Модель содержимого составного типа должна состоять из annotation (если есть), за которым следует не более одного элемента simpleContent, complexContent, group, choice, sequence или all; за которым следует нуль или более элементов attribute или attributeGroup, за которыми следует не более одного элемента anyAttribute.
tr: Karmaşık bir türün içerik modeli, 'annotation' (varsa), arkasından sıfır veya 'simpleContent', 'complexContent', 'group', 'choice', 'sequence' veya 'all' öğelerinden birini, ardından sıfır veya birden çok 'attribute' veya 'attributeGroup' öğesini ve sonra da sıfır veya bir 'anyAttribute' öğesini içermelidir.
zh_hans: 复杂类型的内容模型必须包含 "annotation"(如果有)，后跟 "simpleContent"、"complexContent"、"group"、"choice"、"sequence" 或 "all" 中的零个或一个，后面再跟零个或多个 "attribute" 或 "attributeGroup"，最后再跟零个或一个 "anyAttribute"。
zh_hant: 複雜類型的內容模型必須包含 'annotation' (若有的話)，並於其後加上零或下列其中之一: 'simpleContent'、'complexContent'、'group'、'choice'、'sequence' 或 'all'; 之後加上零、更多 'attribute' 或 'attributeGroup'; 之後加上零或 'anyAttribute'。

# Sch_ComplexTypeDoubleRedefine
source: Double redefine for complex type.
cs: Složitý typ byl předefinován dvakrát.
de: Doppelte Neudefinition für komplexen Typ.
es: Redefinición doble para el tipo complejo.
fr: Double redéfinition pour le type complexe.
it: Doppia ridefinizione per il tipo complesso.
ja: 複合型に対する二重定義です。
ko: 복합 형식을 두 번 다시 정의했습니다.
pl: Podwójne przedefiniowanie dla typu złożonego.
pt_br: Redefinição dupla para tipo complexo.
ru: Двойное переопределение для составного типа.
tr: Karmaşık tür için çift yeniden tanımlama.
zh_hans: 复杂类型的双重重定义。
zh_hant: 重新定義兩次複雜類型。

# Sch_ComplexTypeRedefineNotFound
source: No complex type to redefine.
cs: Nebyl nalezen žádný složitý typ k předefinování.
de: Es ist kein komplexer Typ zum erneuten Definieren vorhanden.
es: No hay tipos complejos para redefinir.
fr: Aucun type complexe à redéfinir.
it: Non ci sono tipi complessi da ridefinire.
ja: 再定義する複合型がありません。
ko: 다시 정의할 복합 형식이 없습니다.
pl: Brak typu złożonego do przedefiniowania.
pt_br: Nenhum tipo complexo a ser redefinido.
ru: Отсутствует составной тип для переопределения.
tr: Yeniden tanımlanacak karmaşık tür yok.
zh_hans: 没有要重新定义的复杂类型。
zh_hant: 沒有複雜類型可以重新定義。
