Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlNoAddMethod
source: To be XML serializable, types which inherit from {2} must have an implementation of Add({1}) at all levels of their inheritance hierarchy. {0} does not implement Add({1}).
cs: Aby bylo možné provádět serializaci v jazyce XML, musí mít typy, které dědí z {2}, implementaci metody Add({1}) na všech úrovních své hierarchie dědičnosti. {0} neimplementuje metodu Add({1}).
de: Um XML-serialisierbar zu sein, müssen Typen, die von {2} erben, über eine Implementierung von Add({1}) auf allen Ebenen ihrer Vererbungshierarchie verfügen. Add({1}) wird von {0} nicht implementiert.
es: Para ser XML serializable, los tipos que heredan de {2} deben tener una implementación de Add({1}) a todos los niveles de su jerarquía de herencia. {0} no implementa Add({1}).
fr: Pour être sérialisables XML, les types qui héritent de {2} doivent avoir une implémentation de Add({1}) à tous les niveaux de leur hiérarchie d'héritage. {0} n'implémente pas Add({1}).
it: Per essere serializzabili in XML, i tipi che ereditano da {2} devono includere un'implementazione di Add({1}) a tutti i livelli della gerarchia di ereditarietà. {0} non implementa Add({1}).
ja: XML シリアル化を可能にするには、{2} から継承される型は、継承階層のすべてのレベルで Add({1}) が実装される必要があります。{0} には Add({1}) が実装されていません。
ko: XML을 직렬화하려면 {2}에서 상속되는 형식이 해당 상속 계층 구조의 모든 수준에서 Add({1})를 구현해야 합니다. {0}은(는) Add({1})를 구현하지 않습니다.
pl: Aby serializacja XML była możliwa, dla typów dziedziczących po elemencie {2} należy zaimplementować metodę Add({1}) na wszystkich poziomach hierarchii dziedziczenia. Dla elementu {0} metoda Add({1}) nie jest implementowana.
pt_br: Para ser serializável por XML, tipos que herdam de {2} devem ter uma implementação de Add({1}) em todos os níveis de sua hierarquia de herança. {0} não implementa Add({1}).
ru: Чтобы поддерживать сериализацию XML, типы, которые наследуют от {2}, должны иметь реализацию Add({1}) на всех уровнях иерархии наследования. {0} не реализует Add({1}).
tr: Serileştirilebilir XML olması için, {2} öğesinden devralınan türlerin devralma hiyerarşisindeki tüm düzeylerde Add({1}) uygulaması gerekir. {0} Add({1}) uygulamıyor.
zh_hans: 要使 XML 可序列化，从 {2} 继承的类型必须在继承层次结构的所有级别上实现 Add({1})。{0} 不支持实现 Add({1})。
zh_hant: 要 XML 序列化，類型繼承自 {2} 必須在所有繼承階層層級實作 Add({1})。{0} 沒有繼承 Add({1})。

# XmlNoAttributeHere
source: Cannot write a node of type XmlAttribute as an element value. Use XmlAnyAttributeAttribute with an array of XmlNode or XmlAttribute to write the node as an attribute.
cs: Uzel typu XmlAttribute nelze zapsat jako hodnotu elementu. Chcete-li uzel zapsat jako atribut, použijte atribut XmlAnyAttributeAttribute s polem typu XmlNode nebo XmlAttribute.
de: Ein Knoten vom Typ XmlAttribute kann nicht als Elementwert geschrieben werden. Verwenden Sie XmlAnyAttributeAttribute mit einem XmlNode- oder XmlAttribute-Array, um den Knoten als Attribut zu schreiben.
es: No se puede escribir un nodo de tipo XmlAttribute como valor de elemento. Utilice XmlAnyAttributeAttribute con una matriz de XmlNode o XmlAttribute para escribir el nodo como atributo.
fr: Impossible d'écrire un nœud de type XmlAttribute comme valeur d'élément. Utilisez XmlAnyAttributeAttribute avec un tableau de XmlNode ou XmlAttribute pour écrire un nœud en tant qu'attribut.
it: Non è possibile scrivere un nodo di tipo XmlAttribute come valore di elemento. Usare XmlAnyAttributeAttribute con una matrice di XmlNode o XmlAttribute per scrivere il nodo come attributo.
ja: XmlAttribute 型のノードを要素値として書き込むことはできません。ノードを属性として書き込むには、XmlNode または XmlAttribute の配列を持つ XmlAnyAttributeAttribute を使ってください。
ko: XmlAttribute 형식의 노드를 요소 값으로 쓸 수 없습니다. XmlNode의 배열이 있는 XmlAnyAttributeAttribute 또는 XmlAttribute를 사용하여 노드를 특성으로 쓰세요.
pl: Nie można zapisać węzła typu XmlAttribute jako wartości elementu. Użyj elementu XmlAnyAttributeAttribute z tablicą XmlNode lub XmlAttribute, aby zapisać węzeł jako atrybut.
pt_br: Não é possível gravar um nó do tipo XmlAttribute como um valor de elemento. Use XmlAnyAttributeAttribute com uma matriz de XmlNode ou XmlAttribute para gravar o nó como um atributo.
ru: Невозможно записать узел типа XmlAttribute как значение элемента. Для записи узла как атрибута используйте XmlAnyAttributeAttribute с массивом XmlNode или XmlAttribute.
tr: XmlAttribute türündeki bir düğüm öğe değeri olarak yazılamaz. Düğümü öznitelik olarak yazmak için XmlAnyAttributeAttribute'i bir XmlNode veya XmlAttribute dizisiyle kullanın.
zh_hans: 不能将 XmlAttribute 类型的节点作为元素值写入。使用带有 XmlNode 或 XmlAttribute 数组的 XmlAnyAttributeAttribute 将节点作为特性写入。
zh_hant: 無法將 XmlAttribute 類型的節點寫入成元素值。請使用內含 XmlNode 或 XmlAttribute 陣列的 XmlAnyAttributeAttribute，將節點寫入為屬性。

# XmlNoDefaultAccessors
source: You must implement a default accessor on {0} because it inherits from ICollection.
cs: V objektu {0} je nutné implementovat výchozí přístupový objekt, protože dědí z rozhraní ICollection.
de: Sie müssen aufgrund der Vererbung von ICollection eine Standardzugriffsmethode für {0} implementieren.
es: Debe implementar el descriptor de acceso predeterminado en {0} porque hereda de ICollection.
fr: Vous devez implémenter un accesseur par défaut sur {0}, car il hérite de ICollection.
it: È necessario implementare una funzione di accesso predefinita in {0} perché eredita da ICollection.
ja: {0} は ICollection から継承されるため、既定のアクセサーを実装する必要があります。
ko: 기본 접근자는 ICollection에서 상속되므로 {0}에서 이 접근자를 구현해야 합니다.
pl: Musisz zaimplementować domyślną metodę dostępu dla elementu {0}, ponieważ dziedziczy on z elementu ICollection.
pt_br: Você deve implementar um acessador padrão em {0} porque ele herda de ICollection.
ru: Требуется реализовать для {0} функцию доступа по умолчанию, так как он наследует из ICollection.
tr: ICollection'dan devraldığından {0} üzerinde bir varsayılan erişimci uygulamalısınız.
zh_hans: 必须在 {0} 上实现默认访问器，因为它继承自 ICollection。
zh_hant: 您必須在 {0} 上實作預設存取子，因為它繼承自 ICollection。

# XmlNoNameAllowed
source: A node of type '{0}' cannot have a name.
cs: Uzel typu {0} nemůže mít název.
de: Ein Knoten vom Typ "{0}" kann keinen Namen haben.
es: Un nodo del tipo "{0}" no puede tener un nombre.
fr: Un nœud de type '{0}' ne peut pas avoir de nom.
it: Non è possibile assegnare un nome a un nodo di tipo '{0}'.
ja: '{0}' 型のノードには、名前を設定できません。
ko: '{0}' 형식의 노드에는 이름을 지정할 수 없습니다.
pl: Węzeł typu „{0}” nie może mieć nazwy.
pt_br: Um nó do tipo '{0}' não pode ter um nome.
ru: Узел типа "{0}" не может иметь имени.
tr: '{0}' türündeki düğümün adı olamaz.
zh_hans: “{0}”类型的节点不能具有名称。
zh_hant: 類型 '{0}' 的節點不可擁有名稱。

# XmlNoPartialTrust
source: One or more assemblies referenced by the XmlSerializer cannot be called from partially trusted code.
cs: Jedno nebo více sestavení, na něž odkazuje objekt XmlSerializer, nelze volat z částečně důvěryhodného kódu.
de: Eine oder mehrere Assemblys, auf die vom XmlSerializer verwiesen wird, können von teilweise vertrauenswürdigem Code nicht aufgerufen werden.
es: No se puede llamar a uno o varios ensamblados a los que hace referencia XmlSerializer a partir de código de confianza parcial.
fr: Un ou plusieurs assemblys référencés par XmlSerializer ne peuvent pas être appelés à partir de code partiellement fiable.
it: Uno o più assembly a cui fa riferimento XmlSerializer non possono essere chiamati da codice parzialmente attendibile.
ja: XmlSerializer によって参照された 1 つ以上のアセンブリは、部分的に信頼できるコードから呼び出すことができません。
ko: XmlSerializer에서 참조하는 하나 이상의 어셈블리를 부분적으로 신뢰할 수 있는 코드에서 호출할 수 없습니다.
pl: Jeden lub więcej zestawów, do których odwołuje się element XmlSerializer, nie może zostać wywołanych przy użyciu częściowo zaufanego kodu.
pt_br: Um ou mais assemblies referenciados pelo XmlSerializer não podem ser chamados do código parcialmente confiável.
ru: Хотя бы одна сборка, на которую ссылается XmlSerializer, не может быть вызвана из кода с частичным доверием.
tr: XmlSerializer tarafından başvurulan bir veya daha fazla bütünleştirilmiş kod kısmen güvenilen koddan çağrılamıyor.
zh_hans: 无法从部分受信任的代码调用由 XmlSerializer 引用的一个或多个程序集。
zh_hant: XmlSerializer 所參考的其中一個或多個組件無法從部分信任的程式碼呼叫。

# XmlNoSerializableMembers
source: Cannot serialize object of type '{0}'. The object does not have serializable members.
cs: Objekt typu {0} nelze serializovat. Objekt nemá serializovatelné členy.
de: Das Objekt vom Typ "{0}" kann nicht serialisiert werden. Das Objekt enthält keine serialisierbaren Member.
es: No se puede serializar el objeto del tipo "{0}". El objeto no tiene miembros serializables.
fr: Impossible de sérialiser l'objet de type '{0}'. L'objet n'a pas de membre pouvant être sérialisé.
it: Non è possibile serializzare l'oggetto di tipo '{0}'. L'oggetto non contiene membri serializzabili.
ja: '{0}' 型のオブジェクトをシリアル化できません。このオブジェクトにはシリアル化可能なメンバーが含まれていません。
ko: '{0}' 형식의 개체를 직렬화할 수 없습니다. 이 개체에는 직렬화할 수 있는 멤버가 없습니다.
pl: Nie można serializować obiektu typu „{0}”. Obiekt nie ma składowych, które można serializować.
pt_br: Não é possível serializar o objeto do tipo '{0}'. O objeto não tem membros serializáveis.
ru: Невозможно сериализовать объект типа "{0}". Объект не содержит члены, которые можно сериализовать.
tr: '{0}' türündeki nesne serileştirilemiyor. Nesnenin serileştirilebilir üyesi yok.
zh_hans: 无法序列化类型“{0}”的对象。该对象没有可序列化的成员。
zh_hant: 無法將類型 '{0}' 的物件序列化。物件沒有可序列化的成員。

# XmlNotKnownDefaultValue
source: Schema importer extension {0} failed to parse '{1}'='{2}' attribute of type {3} from namespace='{4}'.
cs: Rozšíření programu pro import schématu {0} se nepodařilo parsovat atribut {1}={2} typu {3} z oboru názvů namespace={4}.
de: Die Schemaimporterweiterung {0} konnte das Attribut "{1}"="{2}" vom Typ {3} aus dem Namespace="{4}" nicht analysieren.
es: La extensión del importador de esquemas {0} no ha podido analizar el atributo "{1}"="{2}" de tipo {3} del espacio de nombres="{4}".
fr: L'extension d'importation de schéma {0} n'a pas réussi à analyser l'attribut '{1}'='{2}' de type {3} de namespace='{4}'.
it: L'estensione dell'utilità di importazione dello schema {0} non è riuscita ad analizzare l'attributo '{1}'='{2}' di tipo {3} dello spazio dei nomi '{4}'.
ja: スキーマ インポーターの拡張機能 {0} は、名前空間 '{4}' から、型が {3} で '{1}' と '{2}' が等しい属性を解析できませんでした。
ko: 스키마 가져오기 확장 {0}이(가) namespace='{4}'에서 {3} 형식의 '{1}'='{2}' 특성을 구문 분석하지 못했습니다.
pl: Wystąpił błąd rozszerzenia importera schematów {0} podczas analizowania atrybutu „{1}”=„{2}” typu {3} z przestrzeni nazw „{4}”.
pt_br: Falha ao analisar o atributo '{1}'='{2}' do tipo {3} do namespace='{4}' da extensão {0} do importador de esquema.
ru: Расширению программы импорта {0} не удалось разобрать атрибут "{1}"="{2}" типа {3} из пространства имен="{4}".
tr: Şema içeri aktarıcı uzantısı {0}, '{4}' ad alanından {3} türündeki '{1}'='{2}' özniteliğini ayrıştıramadı.
zh_hans: 架构导入程序扩展 {0} 解析来自 namespace='{4}'、{3} 类型的 '{1}'='{2}' 特性失败。
zh_hant: 結構描述匯入工具延伸模組 {0} 從 namespace='{4}' 剖析類型 {3} 的 '{1}'='{2}' 屬性失敗。

# XmlNotSerializable
source: Type '{0}' is not serializable.
cs: Typ {0} nelze serializovat.
de: Der Typ "{0}" ist nicht serialisierbar.
es: El tipo "{0}" no es serializable.
fr: Le type '{0}' ne peut pas être sérialisé.
it: Il tipo '{0}' non è serializzabile.
ja: 型 '{0}' はシリアル化できません。
ko: 형식 '{0}'은(는) 직렬화할 수 없습니다.
pl: Typu „{0}” nie można serializować.
pt_br: O tipo '{0}' não é serializável.
ru: Тип "{0}" нельзя сериализовать.
tr: '{0}' türü serileştirilemiyor.
zh_hans: 类型“{0}”不可序列化。
zh_hant: 類型 '{0}' 不可序列化。

# XmlPregenAssemblyDynamic
source: Cannot pre-generate serialization assembly. Pre-generation of serialization assemblies is not supported for dynamic assemblies. Save the assembly and load it from disk to use it with XmlSerialization.
cs: Nelze předběžně vygenerovat sestavení serializace. Pro dynamická sestavení není předběžné generování sestavení serializace podporováno. Uložte sestavení a načtěte jej z disku, aby jej bylo možné použít ve funkci XmlSerialization.
de: Es kann keine Serialisierungsassembly vorab generiert werden. Die Vorabgenerierung von Serialisierungsassemblys wird für dynamische Assemblys nicht unterstützt. Speichern Sie die Assembly, und laden Sie sie vom Datenträger, um sie mit XmlSerialization zu verwenden.
es: No se puede generar previamente el ensamblado de serialización. La generación previa de ensamblados de serialización no es compatible con los ensamblados dinámicos. Guarde el ensamblado y cárguelo desde el disco para usarlo con XmlSerialization.
fr: Impossible de prégénérer un assembly de sérialisation. La prégénération d'assemblys de sérialisation n'est pas prise en charge pour les assemblys dynamiques. Enregistrez l'assembly, puis chargez-le à partir du disque pour pouvoir l'utiliser avec XmlSerialization.
it: Non è possibile pregenerare l'assembly di serializzazione. La pregenerazione degli assembly di serializzazione non è supportata per gli assembly dinamici. Salvare l'assembly e caricarlo dal disco per usarlo con XmlSerialization.
ja: シリアル化アセンブリを事前生成できません。動的アセンブリでは、シリアル化アセンブリの事前生成はサポートされていません。XmlSerialization で使用するには、アセンブリを保存し、ディスクから読み込んでください。
ko: serialization 어셈블리를 미리 생성할 수 없습니다. 동적 어셈블리에 대해서는 serialization 어셈블리를 미리 생성할 수 없습니다. XmlSerialization에서 사용하려면 어셈블리를 저장하고 디스크에서 로드하세요.
pl: Nie można wstępnie wygenerować zestawu serializacji. Wstępne generowanie zestawów serializacji nie jest obsługiwane w przypadku zestawów dynamicznych. Aby użyć zestawu z elementem XmlSerialization, zapisz go, a następnie załaduj z dysku.
pt_br: Não é possível pré-gerar assembly de serialização. A pré-geração de assembly de serialização não tem suporte para assemblies dinâmicos. Salve o assembly e carregue-o do disco para usá-lo com XmlSerialization.
ru: Невозможно создать предварительную сборку сериализации. Создание сборок сериализации не поддерживается для динамических сборок. Сохраните сборку и загрузите ее с диска, чтобы использовать ее с XmlSerialization.
tr: Serileştirme bütünleştirilmiş kodu önceden oluşturulamıyor. Serileştirme bütünleştirilmiş kodlarının önceden hazırlanması dinamik bütünleştirilmiş kodlarda desteklenmez. Bütünleştirilmiş kodu kaydedin ve XmlSerialization ile kullanabilmek için diskten yükleyin.
zh_hans: 无法预先生成序列化程序集。动态程序集不支持预先生成序列化程序集。请保存程序集并从磁盘加载它，以便将其与 XmlSerialization 配合使用。
zh_hant: 無法預先產生序列化組件。不支援針對動態組件預先產生序列化組件。請儲存組件，並將其從磁碟機載入，以與 XmlSerialization 搭配使用。

# XmlPregenCannotLoad
source: Could not load file or assembly '{0}' or one of its dependencies. The system cannot find the file specified.
cs: Nelze načíst soubor nebo sestavení {0} či jednu z jeho závislostí. Systém nemůže najít zadaný soubor.
de: Die Datei oder Assembly "{0}" oder eine ihrer Abhängigkeiten konnte nicht geladen werden. Die angegebene Datei wurde nicht gefunden.
es: No se puede cargar el archivo o el ensamblado "{0}" o una de sus dependencias. El sistema no encuentra el archivo especificado.
fr: Impossible de charger le fichier ou l'assembly '{0}', ou une de ses dépendances. Le système ne parvient pas à localiser le fichier spécifié.
it: Non è stato possibile caricare il file o l'assembly '{0}' o una delle relative dipendenze. Il sistema non ha trovato il file specificato.
ja: ファイルまたはアセンブリ '{0}'、あるいはその依存関係の 1 つを読み込めませんでした。指定されたファイルが見つかりません。
ko: 파일이나 어셈블리 '{0}' 또는 해당 종속성 중 하나를 로드할 수 없습니다. 지정한 파일을 찾을 수 없습니다.
pl: Nie można załadować pliku lub zestawu „{0}” lub jednej z jego zależności. W systemie nie można odnaleźć określonego pliku.
pt_br: Não foi possível carregar o arquivo ou o assembly '{0}' ou uma de suas dependências. O sistema não pode encontrar o arquivo especificado.
ru: Не удалось загрузить файл или сборку "{0}" либо одну из их зависимостей. Не найден указанный файл.
tr: Dosya, '{0}' bütünleştirilmiş kodu veya bağımlılıklarından biri yüklenemedi. Sistem belirtilen dosyayı bulamıyor.
zh_hans: 无法加载文件或程序集“{0}”或其一个依赖项。系统找不到指定的文件。
zh_hant: 無法載入檔案或組件 '{0}' 或其依存。系統找不到指定的檔案。

# XmlPregenInvalidXmlSerializerAssemblyAttribute
source: Invalid XmlSerializerAssemblyAttribute usage. Please use {0} property or {1} property.
cs: Neplatné použití třídy XmlSerializerAssemblyAttribute. Použijte vlastnost {0} nebo vlastnost {1}.
de: Ungültige Verwendung von XmlSerializerAssemblyAttribute. Verwenden Sie die {0}-Eigenschaft oder die {1}-Eigenschaft.
es: Uso de XmlSerializerAssemblyAttribute no válido. Utilice la propiedad {0} o la propiedad {1}.
fr: Utilisation non valide de l'attribut XmlSerializerAssemblyAttribute. Utilisez la propriété {0} ou {1}.
it: La sintassi di XmlSerializerAssemblyAttribute non è valida. Usare la proprietà {0} o la proprietà {1}.
ja: XmlSerializerAssemblyAttribute の使い方が無効です。{0} プロパティまたは {1} プロパティを使用してください。
ko: XmlSerializerAssemblyAttribute 사용이 잘못되었습니다. {0} 속성 또는 {1} 속성을 사용하세요.
pl: Nieprawidłowe użycie atrybutu XmlSerializerAssemblyAttribute. Użyj właściwości {0} lub właściwości {1}.
pt_br: Uso inválido de XmlSerializerAssemblyAttribute. Use as propriedades {0} ou {1}.
ru: Недопустимое использование XmlSerializerAssemblyAttribute. Используйте свойство {0} или {1}.
tr: Geçersiz XmlSerializerAssemblyAttribute kullanımı. Lütfen {0} özelliğini veya {1} özelliğini kullanın.
zh_hans: XmlSerializerAssemblyAttribute 用法无效。请使用 {0} 属性或 {1} 属性。
zh_hant: XmlSerializerAssemblyAttribute 用法無效。請使用 {0} 屬性或 {1} 屬性。

# XmlPregenMissingDirectory
source: Could not find directory to save XmlSerializer generated assembly: {0}.
cs: Nelze najít adresář k uložení sestavení generovaného objektem XmlSerializer: {0}
de: Das Verzeichnis zum Speichern der von XmlSerializer generierten Assembly wurde nicht gefunden: {0}.
es: No se encuentra el directorio para guardar el ensamblado generado por XmlSerializer: {0}.
fr: Le répertoire d'enregistrement de l'assembly généré par XmlSerializer est introuvable : {0}.
it: La directory per il salvataggio dell'assembly generato da XmlSerializer non è stata trovata: {0}.
ja: XmlSerializer が生成したアセンブリ {0} を保存するディレクトリが見つかりませんでした。
ko: XmlSerializer 생성 어셈블리를 저장할 디렉터리를 찾을 수 없습니다: {0}.
pl: Nie można odnaleźć zestawu wygenerowanego przy użyciu elementu XmlSerializer: {0}.
pt_br: Não foi possível encontrar o diretório para salvar o assembly gerado XmlSerializer: {0}.
ru: Не удалось найти папку для сохранения сборки, созданной XmlSerializer: {0}.
tr: XmlSerializer tarafından oluşturulan bütünleştirilmiş kodun kaydedileceği dizin bulunamadı: {0}.
zh_hans: 找不到目录来保存 XmlSerializer 生成的程序集: {0}。
zh_hant: 找不到目錄可儲存 XmlSerializer 所產生的組件: {0}。

# XmlPregenMissingTempDirectory
source: Could not find TEMP directory to save XmlSerializer generated assemblies.
cs: Nelze najít dočasný adresář (TEMP) k uložení sestavení generovaného objektem XmlSerializer.
de: Das Verzeichnis TEMP zum Speichern der von XmlSerializer generierten Assemblys wurde nicht gefunden.
es: No se encuentra el directorio TEMP para guardar los ensamblados generados por XmlSerializer.
fr: Le répertoire TEMP d'enregistrement des assemblys générés par XmlSerializer est introuvable.
it: La directory TEMP per il salvataggio degli assembly generati da XmlSerializer non è stata trovata.
ja: XmlSerializer が生成したアセンブリを保存する TEMP ディレクトリが見つかりませんでした。
ko: XmlSerializer 생성 어셈블리를 저장할 TEMP 디렉터리를 찾을 수 없습니다.
pl: Nie można odnaleźć katalogu tymczasowego na potrzeby zapisywania zestawów wygenerowanych przy użyciu elementu XmlSerializer.
pt_br: Não foi possível encontrar o diretório TEMP para salvar os assemblies gerados XmlSerializer.
ru: Не удалось найти папку TEMP для сохранения сборок, созданных XmlSerializer.
tr: XmlSerializer tarafından oluşturulan bütünleştirilmiş kodların kaydedileceği TEMP dizini bulunamadı.
zh_hans: 找不到 TEMP 目录来保存 XmlSerializer 生成的程序集。
zh_hant: 找不到 TEMP 目錄可儲存 XmlSerializer 所產生的組件。

# XmlPregenOrphanType
source: Cannot pre-generate serializer for multiple assemblies. Type '{0}' does not belong to assembly {1}.
cs: Nelze předběžně vygenerovat serializátor pro více sestavení. Typ {0} nepatří do sestavení {1}.
de: Das Serialisierungsmodul für mehrere Assemblys konnte nicht vorab generiert werden. Der Typ "{0}" gehört nicht zur Assembly {1}.
es: No se puede generar previamente el serializador de varios ensamblados. El tipo "{0}" no pertenece al ensamblado {1}.
fr: Impossible de prégénérer un sérialiseur pour plusieurs assemblys. Le type '{0}' n'appartient pas à l'assembly {1}.
it: Non è possibile pregenerare il serializzatore per più assembly. Il tipo '{0}' non appartiene all'assembly {1}.
ja: 複数のアセンブリ用のシリアライザーを事前生成できません。型 '{0}' はアセンブリ {1} に属していません。
ko: 여러 어셈블리에 대한 직렬 변환기를 미리 생성할 수 없습니다. 형식 '{0}'은(는) 어셈블리 {1}에 속하지 않습니다.
pl: Nie można wstępnie wygenerować serializatora dla wielu zestawów. Typ „{0}” nie należy do zestawu {1}.
pt_br: Não é possível pré-gerar o serializador para vários assemblies. O tipo '{0}' não pertence ao assembly {1}.
ru: Невозможно создать предварительный сериализатор для нескольких сборок. Тип "{0}" не принадлежит сборке {1}.
tr: Serileştirici birden çok bütünleştirilmiş kod için önceden oluşturulamıyor. '{0}' türü {1} bütünleştirilmiş koduna ait değil.
zh_hans: 无法为多个程序集预生成序列化程序。类型“{0}”不属于程序集 {1}。
zh_hant: 找不到多個組件的預先產生序列化程式。類型 '{0}' 不屬於組件 {1}。

# XmlPregenTypeDynamic
source: Cannot pre-generate serialization assembly for type '{0}'. Pre-generation of serialization assemblies is not supported for dynamic types. Save the assembly and load it from disk to use it with XmlSerialization.
cs: Nelze předběžně vygenerovat sestavení serializace pro typ {0}. Pro dynamické typy není předběžné generování sestavení serializace podporováno. Uložte sestavení a načtěte jej z disku, aby jej bylo možné použít ve funkci XmlSerialization.
de: Für den Typ "{0}" konnte keine Serialisierungsassembly vorab generiert werden. Die Vorabgenerierung von Serialisierungsassemblys wird für dynamische Typen nicht unterstützt. Speichern Sie die Assembly, und laden Sie sie vom Datenträger, um sie mit XmlSerialization zu verwenden.
es: No se puede generar previamente el ensamblado de serialización del tipo "{0}". La generación previa de ensamblados de serialización no es compatible con los tipos dinámicos. Guarde el ensamblado y cárguelo desde el disco para utilizarlo con XmlSerialization.
fr: Impossible de prégénérer l'assembly de sérialisation pour le type '{0}'. La prégénération d'assemblys de sérialisation n'est pas prise en charge pour les types dynamiques. Enregistrez l'assembly, puis chargez-le à partir du disque pour pouvoir l'utiliser avec XmlSerialization.
it: Non è possibile pregenerare l'assembly di serializzazione per il tipo '{0}'. La pregenerazione degli assembly di serializzazione non è supportata per i tipi dinamici. Salvare l'assembly e caricarlo dal disco per usarlo con XmlSerialization.
ja: 型 '{0}' のシリアル化アセンブリを事前生成できません。動的型のシリアラル化アセンブリの事前生成はサポートされていません。XmlSerialization で使用するには、アセンブリを保存し、ディスクから読み込んでください。
ko: 형식 '{0}'에 대해 serialization 어셈블리를 미리 생성할 수 없습니다. 동적 형식에 대해서는 serialization 어셈블리의 미리 생성이 지원되지 않습니다. XmlSerialization에서 사용하려면 어셈블리를 저장하고 디스크에서 로드하세요.
pl: Nie można wstępnie wygenerować zestawu serializacji dla typu „{0}”. Wstępne generowanie zestawów serializacji nie jest obsługiwane w przypadku zestawów dynamicznych. Aby użyć zestawu z elementem XmlSerialization, zapisz go, a następnie załaduj z dysku.
pt_br: Não é possível pré-gerar assembly de serialização para o tipo '{0}'. Os tipos dinâmicos não dão suporte à pré-geração de assemblies de serialização. Salve o assembly e carregue-o do disco para usá-lo com XmlSerialization.
ru: Невозможно создать предварительную сборку сериализации для типа "{0}". Создание предварительных сборок сериализации для динамических типов не поддерживается. Сохраните сборку и загрузите ее с диска для использования с XmlSerialization.
tr: '{0}' türü için serileştirme bütünleştirilmiş kodu önceden oluşturulamıyor. Serileştirme bütünleştirilmiş kodlarının önceden hazırlanması dinamik bütünleştirilmiş kodlarda desteklenmez. Bütünleştirilmiş kodu kaydedin ve XmlSerialization ile kullanabilmek için diskten yükleyin.
zh_hans: 无法为类型“{0}”预生成序列化程序集。动态类型不支持预生成序列化程序集。请保存并从磁盘加载程序集，以便与 XmlSerialization 一起使用。
zh_hant: 找不到類型 '{0}' 的預先產生序列化組件。動態組件不支援預先產生序列化組件。請儲存組件，並將其從磁碟機載入以與 XmlSerialization 搭配使用。
