Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Arg_CannotCreateNode
source: Cannot create node of type {0}.
cs: Nelze vytvořit uzel typu {0}.
de: Ein Knoten vom Typ {0} kann nicht erstellt werden.
es: No se puede crear un nodo del tipo {0}.
fr: Impossible de créer le nœud de type {0}.
it: Non è possibile creare il nodo di tipo {0}.
ja: 型 {0} のノードを作成できません。
ko: {0} 형식의 노드를 만들 수 없습니다.
pl: Nie można utworzyć węzła typu {0}.
pt_br: Não é possível criar nó do tipo {0}.
ru: Не удалось создать узел типа {0}.
tr: {0} düğüm türü oluşturulamıyor.
zh_hans: 无法创建 {0} 类型的节点。
zh_hant: 無法建立類型 {0} 的節點。

# Arg_ExpectingXmlTextReader
source: The XmlReader passed in to construct this XmlValidatingReaderImpl must be an instance of a Microsoft.Xml.XmlTextReader.
cs: Třída XmlReader předaná k vytvoření této třídy XmlValidatingReaderImpl musí být instancí třídy Microsoft.Xml.XmlTextReader.
de: Bei dem zum Erstellen dieses XmlValidatingReaderImpl übergebenen XmlReader muss es sich um eine Instanz von System.Xml.XmlTextReader handeln.
es: El valor XmlReader pasado para construir este valor XmlValidatingReaderImpl debe ser una instancia de System.Xml.XmlTextReader.
fr: Le XmlReader passé pour construire ce XmlValidatingReaderImpl doit être une instance de Microsoft.Xml.XmlTextReader.
it: L'elemento XmlReader passato per costruire questo elemento XmlValidatingReaderImpl deve essere un'istanza di un elemento System.Xml.XmlTextReader.
ja: この XmlValidatingReaderImpl を作成するために渡される XmlReader は Microsoft.Xml.XmlTextReader のインスタンスである必要があります。
ko: 이 XmlValidatingReaderImpl을 구성하도록 전달된 XmlReader는 Microsoft.Xml.XmlTextReader 인스턴스여야 합니다.
pl: Element XmlReader przekazany w celu utworzenia tego elementu XmlValidatingReaderImpl musi być wystąpieniem elementu System.Xml.XmlTextReader.
pt_br: O XmlReader passado para construir esse XmlValidatingReaderImpl deve ser uma instância de um Microsoft.Xml.XmlTextReader.
ru: XmlReader, переданный для создания этого XmlValidatingReaderImpl, должен быть экземпляром Microsoft.Xml.XmlTextReader.
tr: Bu XmlValidatingReaderImpl'ı oluşturmak için geçirilen XmlReader bir Microsoft.Xml.XmlTextReader örneği olmalıdır.
zh_hans: 为构造此 XmlValidatingReaderImpl 而传入的 XmlReader 必须是 Microsoft.Xml.XmlTextReader 的实例。
zh_hant: 傳入要建置此 XmlValidatingReaderImpl 的 XmlReader，必須是 Microsoft.Xml.XmlTextReader 的執行個體。

# Enc_InvalidByteInEncoding
source: Invalid byte was found at index {0}.
cs: Na indexu {0} byl nalezen neplatný bajt.
de: Bei Index {0} wurde ein ungültiges Byte gefunden.
es: Byte no válido en el índice {0}.
fr: Un octet non valide a été trouvé à l'index {0}.
it: Il byte trovato alla posizione di indice {0} non è valido.
ja: インデックス {0} に無効なバイトが見つかりました。
ko: 인덱스 {0}에 잘못된 바이트가 있습니다.
pl: Znaleziono nieprawidłowy bajt pod indeksem {0}.
pt_br: Byte inválido encontrado no índice {0}.
ru: В индексе {0} найден недопустимый байт.
tr: {0} dizininde geçersiz bayt bulundu.
zh_hans: 在索引 {0} 处找到无效字节。
zh_hant: 在索引 {0} 中找到無效的位元組。

# RefSyntaxNotSupportedForElements0
source: Element reference syntax not supported with encoded SOAP. Replace element reference '{0}' from namespace '{1}' with a local element declaration.
cs: Kódovaný protokol SOAP nepodporuje syntaxi odkazu na element. Nahraďte odkaz na element {0} z oboru názvů {1} místní deklarací elementu.
de: Elementverweissyntax wird bei codiertem SOAP nicht unterstützt. Ersetzen Sie den Elementverweis "{0}" aus dem Namespace "{1}" durch eine lokale Elementdeklaration.
es: La sintaxis de referencia del elemento no es compatible con SOAP codificado. Reemplace la referencia del elemento "{0}" del espacio de nombres "{1}" con una declaración de elemento local.
fr: La syntaxe de référence de l'élément n'est pas prise en charge avec le SOAP encodé. Remplacez la référence de l'élément '{0}' de l'espace de noms '{1}' par une déclaration d'élément locale.
it: La sintassi di riferimento dell'elemento non è supportata con SOAP codificato. Sostituire il riferimento '{0}' all'elemento dello spazio dei nomi '{1}' con un elemento dichiarato locale.
ja: 要素参照構文は、エンコードされた SOAP ではサポートされません。名前空間 '{1}' の要素参照 '{0}' をローカル要素宣言に置き換えてください。
ko: 요소 참조 구문은 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'의 요소 참조 {0}을(를) 로컬 요소 선언으로 바꾸세요.
pl: Składnia odwołania do elementu nie jest obsługiwana przy użyciu zakodowanego protokołu SOAP. Zastąp odwołanie do elementu „{0}” z przestrzeni nazw „{1}” deklaracją elementu lokalnego.
pt_br: A sintaxe de referência do elemento não tem suporte com SOAP codificado. Substitua a referência do elemento '{0}' do namespace '{1}' por uma declaração do elemento local.
ru: Синтаксис со ссылками на элемент не поддерживается в кодированных SOAP. Используйте вместо ссылки на элемент "{0}" из пространства имен "{1}" локальное объявление элемента.
tr: SOAP ile kodlanan öğe başvurusu söz dizimi desteklenmiyor. '{1}' ad alanındaki '{0}' öğe başvurusunu yerel öğe bildirimiyle değiştirin.
zh_hans: 编码的 SOAP 不支持元素引用语法。请使用本地元素声明替换命名空间“{1}”中的元素引用“{0}”。
zh_hant: 經過編碼的 SOAP 不支援元素參考語法。請將命名空間 '{1}' 的元素參考 '{0}' 替換成本機元素宣告。

# SchInf_NoElement
source: There is no element to infer schema.
cs: Neexistuje žádný element pro odvození schématu.
de: Es ist kein Element vorhanden, von dem das Schema abgeleitet werden kann.
es: No hay ningún elemento para inferir el esquema.
fr: Aucun élément ne permet de déduire le schéma.
it: Non ci sono elementi per dedurre lo schema.
ja: スキーマを推論する要素がありません。
ko: 스키마를 유추할 요소가 없습니다.
pl: Brak elementów na potrzeby wnioskowania dotyczącego schematu.
pt_br: Não há nenhum elemento para inferir esquema.
ru: Отсутствует элемент для выведения схемы.
tr: Şema çıkarsanacak öğe yok.
zh_hans: 没有元素可用来推断架构。
zh_hant: 沒有能推斷結構描述的元素。

# SchInf_UnknownParticle
source: Expected Element. Schema was not generated using this tool.
cs: Byl očekáván element. Schéma nebylo vytvořeno pomocí tohoto nástroje.
de: Erwartet wurde ein Element. Das Schema wurde nicht mit diesem Tool generiert.
es: Se esperaba un elemento. El esquema no se ha generado con esta herramienta.
fr: Element attendu. Le schéma n'a pas été généré à l'aide de cet outil.
it: È previsto Element. Lo schema non è stato generato con questo strumento.
ja: 要素が必要です。スキーマはこのツールを使用して作成されていません。
ko: Element가 있어야 하는데 스키마가 이 도구를 사용하여 생성되지 않았습니다.
pl: Oczekiwano elementu. Schemat nie został wygenerowany za pomocą tego narzędzia.
pt_br: Elemento esperado. O esquema não foi gerado com essa ferramenta.
ru: Ожидался Element. Схема не была создана с помощью этого средства.
tr: Element bekleniyordu. Şema bu araç kullanılarak oluşturulamadı.
zh_hans: 应为 Element。架构不是使用此工具生成的。
zh_hant: 應要有元素，但並非使用此工具產生結構描述。

# SchInf_ct
source: Complex type expected to exist with at least one 'Element' at this point.
cs: Zde byl očekáván složitý typ s minimálně jednou hodnotou Element.
de: An dieser Stelle wird erwartet, dass ein komplexer Typ mit mindestens einem "Element" vorhanden ist.
es: Se esperaba la existencia de un tipo complejo con al menos un valor "Element" en este punto.
fr: Un type complexe est censé exister avec au moins un 'Element'.
it: Il tipo complesso deve esistere e contenere almeno un elemento 'Element' in questo punto.
ja: ここには、'Element' が少なくとも 1 つ設定されている複合型が必要です。
ko: 현재 하나 이상의 'Element'에 복합 형식이 있어야 합니다.
pl: W tym punkcie oczekiwano typu złożonego z co najmniej jednym elementem „Element”.
pt_br: Neste ponto, espera-se que o tipo complexo exista com pelo menos um 'Element'.
ru: Сложный тип должен существовать в этой точке по меньшей мере с одним элементом.
tr: Bu noktada, karmaşık türün en az bir 'Element' ile bulunması bekleniyordu.
zh_hans: 此处 Complex 类型应与至少一个 "Element" 共存。
zh_hant: 此時 Complex 類型至少會有一個 'Element'。

# SchInf_entity
source: Inference cannot handle entity references. Pass in an 'XmlReader' that expands entities.
cs: Při odvozování nelze zpracovat odkazy na entity. Je nutné předat třídu XmlReader pro rozšíření entit.
de: Entitätsverweise können nicht per Rückschluss behandelt werden. Übergeben Sie einen XmlReader, der Entitäten erweitert.
es: La inferencia no puede controlar las referencias de entidad. Pase un elemento "XmlReader" que expanda las entidades.
fr: L'inférence ne peut pas prendre en charge les références d'entité. Passez un 'XmlReader' qui développe les entités.
it: L'inferenza non può gestire riferimenti all'entità. Passare un elemento 'XmlReader' che espande le entità.
ja: 推論ではエンティティ参照を処理できません。エンティティを展開する 'XmlReader' に渡してください。
ko: 유추는 엔터티 참조를 처리할 수 없습니다. 엔터티를 확장하는 'XmlReader'로 전달하세요.
pl: Wnioskowanie nie umożliwia obsługi odwołań do jednostek. Przekaż element „XmlReader”, który umożliwia rozwijanie jednostek.
pt_br: A inferência não pode tratar referências de entidade. Passe um 'XmlReader' que expanda entidades.
ru: Выведение не поддерживает ссылки на сущности. Необходимо передать XmlReader, расширяющий сущности.
tr: Çıkarsama varlık başvurularını işlemiyor. Varlıkları genişleten 'XmlReader' içine aktarın.
zh_hans: 推断无法处理实体引用。请传入展开实体的 "XmlReader"。
zh_hant: 參考無法處理實體參考。請傳遞可展開實體的 'XmlReader'。

# SchInf_extension
source: Expected 'Extension' within 'SimpleContent'. Schema was not created using this tool.
cs: V rámci elementu SimpleContent byl očekáván element Extension. Schéma nebylo vytvořeno pomocí tohoto nástroje.
de: Erwartet wurde ''Extension" innerhalb von "SimpleContent". Das Schema wurde nicht mit diesem Tool erstellt.
es: Se esperaba un valor "Extension" dentro de "SimpleContent". El esquema no se ha creado con esta herramienta.
fr: 'Extension' attendu dans 'SimpleContent'. Le schéma n'a pas été créé à l'aide de cet outil.
it: In 'SimpleContent' è previsto l'elemento 'Extension'. Lo schema non è stato creato con questo strumento.
ja: 'SimpleContent' 内に 'Extension' が必要です。このツールを使用してスキーマは作成されませんでした。
ko: 'SimpleContent' 내에 'Extension'이 있어야 하는데 스키마가 이 도구를 사용하여 생성되지 않았습니다.
pl: Oczekiwano elementu „Extension” z elementem „SimpleContent”. Schemat nie został utworzony za pomocą tego narzędzia.
pt_br: 'Extension' esperada em 'SimpleContent'. O esquema não foi criado com essa ferramenta.
ru: Ожидается Extension внутри SimpleContent. Схема не была создана с помощью этого средства.
tr: 'SimpleContent' içinde 'Extension' bekleniyordu. Şema bu araç kullanılarak oluşturulamadı.
zh_hans: "SimpleContent" 中应有 "Extension"。架构不是使用此工具创建的。
zh_hant: 在 'SimpleContent' 中應要有 'Extension'，但並非使用此工具建立結構描述。

# SchInf_noct
source: Expected ComplexType. Schema was not generated using this tool.
cs: Byl očekáván element ComplexType. Schéma nebylo vytvořeno pomocí tohoto nástroje.
de: Erwartet wurde ComplexType. Das Schema wurde nicht mit diesem Tool generiert.
es: Se esperaba ComplexType. El esquema no se ha generado con esta herramienta.
fr: ComplexType attendu. Le schéma n'a pas été généré à l'aide de cet outil.
it: È previsto ComplexType. Lo schema non è stato generato con questo strumento.
ja: ComplexType が必要です。このツールを使用してスキーマは生成されませんでした。
ko: ComplexType이 있어야 하는데 스키마가 이 도구를 사용하여 생성되지 않았습니다.
pl: Oczekiwano typu ComplexType. Schemat nie został wygenerowany za pomocą tego narzędzia.
pt_br: ComplexType esperado. O esquema não foi gerado com essa ferramenta.
ru: Ожидался ComplexType. Схема не была создана с помощью этого средства.
tr: ComplexType bekleniyordu. Şema bu araç kullanılarak oluşturulamadı.
zh_hans: 应为 ComplexType。架构不是使用此工具生成的。
zh_hant: 應要有 ComplexType，但並非使用此工具產生結構描述。

# SchInf_noseq
source: The supplied schema contains particles other than Sequence and Choice. Only schemas generated by this tool are supported.
cs: Zadané schéma obsahuje jiné částice než Sequence a Choice. Podporována jsou pouze schémata generovaná tímto nástrojem.
de: Das angegebene Schema enthält andere Partikel als "Sequence" und "Choice". Nur mit diesem Tool generierte Schemas werden unterstützt.
es: El esquema proporcionado contiene partículas que no son Sequence y Choice. Solo se admiten esquemas generados con esta herramienta.
fr: Le schéma fourni contient d'autres particules que Sequence et Choice. Seuls les schémas générés par cet outil sont pris en charge.
it: Lo schema fornito contiene particelle diverse da Sequence e Choice. Sono supportati solo gli schemi generati da questo strumento.
ja: 渡されたスキーマには Sequence および Choice 以外のパーティクルが含まれていました。このツールで生成されたスキーマしか、サポートされません。
ko: 지정된 스키마에 Sequence 및 Choice가 아닌 파티클이 있습니다. 이 도구로 생성된 스키마만 지원됩니다.
pl: Udostępniony schemat zawiera cząstki inne niż „Sequence” i „Choice”. Tylko schematy utworzone za pomocą tego narzędzia są obsługiwane.
pt_br: O esquema fornecido contém outras partículas além de Sequence e Choice. Só há suporte para esquemas gerados por essa ferramenta.
ru: Предоставленная схема содержит части, отличные от Sequence и Choice. Поддерживаются только схемы, созданные этим средством.
tr: Sağlanan şemada Sequence ve Choice dışında parçacıklar var. Yalnızca bu araçla oluşturulan şemalar desteklenir.
zh_hans: 提供的架构包含 Sequence 和 Choice 以外的粒子。仅支持此工具生成的架构。
zh_hant: 提供的物件包含非 Sequence 與 Choice 的結構描述。僅支援以此工具產生的結構描述。

# SchInf_particle
source: Particle cannot exist along with 'ContentModel'.
cs: Částice nemůže existovat souběžně s vlastností ContentModel.
de: Das Partikel darf nicht gleichzeitig mit "ContentModel" vorhanden sein.
es: Esta partícula no puede existir junto con "ContentModel".
fr: La particule ne peut pas exister parallèlement à 'ContentModel'.
it: La particella non può coesistere con 'ContentModel'.
ja: パーティクルは 'ContentModel' と共には使用できません。
ko: 파티클은 'ContentModel'과 함께 있을 수 없습니다.
pl: Cząstka nie może istnieć wspólnie z elementem „ContentModel”.
pt_br: A partícula não pode existir junto com 'ContentModel'.
ru: Часть не может существовать вместе с ContentModel.
tr: Parçacık, 'ContentModel' ile birlikte bulunamaz.
zh_hans: 粒子不能与 "ContentModel" 共存。
zh_hant: 物件不可與 'ContentModel' 同時存在。

# SchInf_schema
source: The supplied xml instance is a schema or contains an inline schema. This class cannot infer a schema for a schema.
cs: Zadaná instance XML je schématem nebo obsahuje vložené schéma. Tato třída nemůže odvozovat schéma pro schéma.
de: Die angegebene XML-Instanz ist ein Schema oder enthält ein Inlineschema. Diese Klasse kann kein Schema für ein Schema ableiten.
es: La instancia xml proporcionada es un esquema o contiene un esquema alineado. Esta clase no puede inferir un esquema para un esquema.
fr: L'instance xml fournie est un schéma ou contient un schéma inline. Cette classe ne peut pas déduire un schéma à partir d'un schéma.
it: L'istanza XML fornita è uno schema oppure contiene uno schema inline. Questa classe non può dedurre uno schema per uno schema.
ja: 渡された xml インスタンスはスキーマであるか、またはインライン スキーマを含んでいます。このクラスでは、スキーマに渡すスキーマを推論できません。
ko: 지정된 xml 인스턴스가 스키마이거나 인라인 스키마가 포함되어 있습니다. 이 클래스는 스키마에 대한 스키마를 유추할 수 없습니다.
pl: Udostępnione wystąpienie xml to schemat lub wbudowany schemat. Ta klasa nie pozwala na wnioskowanie schematu na potrzeby schematu.
pt_br: A instância XML fornecida é um esquema ou contém um esquema embutido. Essa classe não pode inferir um esquema para um esquema.
ru: Предоставленный экземпляр xml является схемой или содержит встроенную схему. Этот класс не может выводить схему для схемы.
tr: Sağlanan xml örneği bir şemadır veya satır içi bir şema içerir. Bu sınıf şema için bir şema çıkarsayamaz.
zh_hans: 提供的 xml 实例是一个架构或包含内联架构。该类无法针对某架构来推断架构。
zh_hant: 提供的 xml 執行個體是一個結構描述或包含內嵌的結構描述。此層級無法由某結構描述來推斷另一個結構描述。

# SchInf_schematype
source: Inference can only handle simple built-in types for 'SchemaType'.
cs: Při odvozování lze zpracovat pouze jednoduché předdefinované typy pro třídu SchemaType.
de: Per Rückschluss können nur einfache integrierte Typen für "SchemaType" behandelt werden.
es: La inferencia solo puede controlar tipos integrados simples para "SchemaType".
fr: L'inférence peut uniquement prendre en charge les types intégrés simples de 'SchemaType'.
it: L'inferenza può gestire solo tipi semplici predefiniti per 'SchemaType'.
ja: 推論で処理できるのは、'SchemaType' については、単純な組み込み型のみです。
ko: 유추는 'SchemaType'에 대해 기본 제공된 단순 형식만 처리할 수 있습니다.
pl: W przypadku typu „SchemaType” wnioskowanie umożliwia tylko obsługę wbudowanych typów prostych.
pt_br: A inferência só pode tratar tipos internos simples de 'SchemaType'.
ru: Выведение может обрабатывать для SchemaType только простые встроенные типы.
tr: Çıkarsama 'SchemaType' için yalnızca basit yerleşik türleri işleyebilir.
zh_hans: 推断只能处理 "SchemaType" 的简单内置类型。
zh_hant: 只能推斷一些 'SchemaType' 類型中的簡易建置。

# SchInf_seq
source: sequence expected to contain elements only. Schema was not created using this tool.
cs: Očekávalo se, že sekvence bude obsahovat pouze elementy. Schéma nebylo vytvořeno pomocí tohoto nástroje.
de: Erwartet wurde, dass die Sequenz nur Elemente enthält. Das Schema wurde nicht mit diesem Tool erstellt.
es: Se esperaba que la secuencia contuviese solo elementos. El esquema no se ha creado con esta herramienta.
fr: sequence doit contenir uniquement des éléments. Le schéma n'a pas été créé à l'aide de cet outil.
it: la sequenza deve contenere solo elementi. Lo schema non è stato creato con questo strumento.
ja: シーケンスのコンテンツは要素のみである必要があります。このツールを使用してスキーマは作成されませんでした。
ko: sequence는 요소만 포함해야 하는데 스키마가 이 도구를 사용하여 생성되지 않았습니다.
pl: Oczekiwano, że sekwencja będzie zawierać wyłącznie elementy. Schemat nie został utworzony za pomocą tego narzędzia.
pt_br: espera-se que a sequência contenha apenas elementos. O esquema não foi criado com essa ferramenta.
ru: Ожидалось, что sequence содержит только элементы. Схема не была создана с помощью этого средства.
tr: sıralamasının yalnızca öğe içermesi bekleniyordu. Şema bu araç kullanılarak oluşturulamadı.
zh_hans: Sequence 应仅包含元素。架构不是使用此工具创建的。
zh_hant: 序列應只包含元素，但並非使用此工具來建立結構描述。

# SchInf_simplecontent
source: Expected simple content. Schema was not created using this tool.
cs: Byl očekáván jednoduchý obsah. Schéma nebylo vytvořeno pomocí tohoto nástroje.
de: Erwartet wurde einfacher Inhalt. Das Schema wurde nicht mit diesem Tool erstellt.
es: Se esperaba contenido simple. El esquema no se ha creado con esta herramienta.
fr: Contenu simple attendu. Le schéma n'a pas été créé à l'aide de cet outil.
it: È previsto contenuto semplice. Lo schema non è stato creato con questo strumento.
ja: 単純なコンテンツが必要です。このツールを使用してスキーマは作成されませんでした。
ko: 단순 콘텐츠가 있어야 하는데 스키마가 이 도구를 사용하여 생성되지 않았습니다.
pl: Oczekiwano zawartości prostej. Schemat nie został utworzony za pomocą tego narzędzia.
pt_br: Conteúdo simples esperado. O esquema não foi criado com essa ferramenta.
ru: Ожидалось простое содержимое. Схема не была создана с помощью этого средства.
tr: Basit içerik bekleniyordu. Şema bu araç kullanılarak oluşturulamadı.
zh_hans: 应为简单内容。架构不是使用此工具创建的。
zh_hant: 應為簡易內容。結構描述並非使用此工具加以建立。

# Sch_AbstractElement
source: The element '{0}' is abstract or its type is abstract.
cs: Element {0} nebo jeho typ je abstraktní.
de: Das Element "{0}" oder sein Typ ist abstrakt.
es: El elemento "{0}" o su tipo son abstractos.
fr: L'élément '{0}' est abstrait ou son type est abstrait.
it: L'elemento '{0}' o il relativo tipo è astratto.
ja: 要素 '{0}' が abstract であるか、またはその型が abstract です。
ko: 요소 '{0}'이(가) 추상이거나 해당 요소의 형식이 추상입니다.
pl: Element „{0}” jest abstrakcyjny lub jego typ jest abstrakcyjny.
pt_br: O elemento '{0}' é abstrato ou seu tipo é abstrato.
ru: Элемент "{0}" или его тип является абстрактным.
tr: '{0}' öğesi veya öğenin türü soyuttur.
zh_hans: 元素“{0}”或其类型是抽象的。
zh_hant: 元素 '{0}' 或其類型為抽象。

# Sch_AllElement
source: Element '{0}' cannot appear more than once if content model type is "all".
cs: Element {0} se nemůže objevit více než jednou, pokud je použit typ modelu obsahu all.
de: Das Element "{0}" darf nur einmal vorhanden sein, wenn der Inhaltsmodelltyp "all" ist.
es: El elemento "{0}" no puede aparecer más de una vez si el modelo de contenido es "all".
fr: L'élément '{0}' ne peut pas s'afficher plusieurs fois, si le type du modèle de contenu est "all".
it: L'elemento '{0}' non può essere presente più di una volta in un modello di contenuto "all".
ja: 要素 '{0}' はコンテンツ モデルの型が "all" の場合、2 回以上指定することはできません。
ko: '{0}' 요소는 콘텐츠 모델 형식이 "all"인 경우 두 번 이상 사용할 수 없습니다.
pl: Element „{0}” nie może pojawić się więcej niż jeden raz w modelu zawartości typu „all”.
pt_br: O elemento '{0}' não poderá aparecer mais de uma vez se o tipo do modelo de conteúdo for "all".
ru: Элемент "{0}" не может присутствовать в модели содержимого all несколько раз.
tr: '{0}' öğesi, içerik modeli türü "all" olduğundan birden fazla kez bulunamaz.
zh_hans: 如果内容模型类型为 "all"，则元素“{0}”不能多次出现。
zh_hant: 若內容模型的類型為 "all"，元素 '{0}' 不可出現超過一次。

# Sch_AllRefMinMax
source: The group ref to 'all' must have {min occurs}= 0 or 1 and {max occurs}=1.
cs: Odkaz skupina na all musí splňovat {min occurs}= 0 nebo 1 a {max occurs}=1.
de: Gruppenverweis auf "all" muss {min occurs} = 0 oder 1 und {max occurs} = 1 aufweisen.
es: La referencia de grupo a "all" debe tener {min occurs}= 0 o 1 y {max occurs}=1.
fr: La référence de groupe à 'all' doit avoir les valeurs {min occurs}= 0 ou 1 et {max occurs}=1.
it: Il riferimento di gruppo a 'all' deve contenere {min occurs}= 0 oppure 1 e ={max occurs}=1.
ja: 'all' への Group ref には、{min occurs}= 0 または {min occurs}= 1 の一方と {max occurs}=1 を指定する必要があります。
ko: 'all'에 대한 Group ref에는 {min occurs}= 0 또는 1 및 {max occurs}=1을 지정해야 합니다.
pl: Odwołanie grupowe do elementu „all” musi spełniać następujący warunek: {min occurs}= 0 lub 1 oraz {max occurs}=1.
pt_br: O grupo ref para 'all' deve ter {min occurs}= 0 ou 1 e {max occurs}=1.
ru: Для групповой ссылки на all должны соблюдаться условия {min occurs}=0 или 1 и {max occurs}=1.
tr: 'all' grup başvurusunda {min occurs}= 0 veya 1 ve {max occurs}=1 olmalı.
zh_hans: 对 "all" 的组引用必须使 {min occurs}= 0 或 1 并且 {max occurs}=1。
zh_hant: 'all' 的群組參考必須要有 {min occurs}= 0 或 1，且 {max occurs}=1。

# Sch_AllRefNotRoot
source: The group ref to 'all' is not the root particle, or it is being used as an extension.
cs: Odkaz skupiny na all není kořenovou částicí nebo je používán jako rozšíření.
de: Der Gruppenverweis auf "all" ist nicht das Stammpartikel oder wird als Erweiterung verwendet.
es: La referencia de grupo a "all" no es partícula de raíz ni se utiliza como extensión.
fr: La référence de groupe à 'all' n'est pas la particule racine, ou elle est utilisée en tant qu'extension.
it: Il riferimento di gruppo a 'all' non è la particella radice o viene usato come estensione.
ja: 'all' への Group ref は、ルート パーティクルでないか、または拡張子として使われています。
ko: 'all'에 대한 Group ref가 루트 파티클이 아니거나 extension으로 사용되고 있습니다.
pl: Odwołanie grupowe do modelu „all” nie jest cząstką główną lub jest używane jako rozszerzenie.
pt_br: Ou o grupo ref para 'all' não é a partícula raiz ou está sendo usado como uma extensão.
ru: Эта групповая ссылка на all не является частью корня или используется как расширение.
tr: 'all' grup başvurusu kök parçacığı değil veya uzantı olarak kullanılıyor.
zh_hans: 对 "all" 的组引用不是根粒子，或正被用作扩展。
zh_hant: 'all' 的群組參考不是根物件，或已用作為延伸模組。

# Sch_AnnotationLocation
source: The 'annotation' element cannot appear at this location.
cs: Element annotation nemůže být použit v tomto umístění.
de: Das annotation-Element kann nicht an dieser Stelle verwendet werden.
es: El elemento "annotation" no puede aparecer en esta ubicación.
fr: L'élément 'annotation' ne peut pas s'afficher à cet emplacement.
it: In questa posizione non può essere presente l'elemento 'annotation'.
ja: 'annotation' 要素はこの場所に指定できません。
ko: 'annotation' 요소는 이 위치에 사용할 수 없습니다.
pl: Element „annotation” nie może pojawić się w tym miejscu.
pt_br: O elemento 'annotation' não pode ser exibido neste local.
ru: Элемент annotation не может находиться в этом месте.
tr: 'annotation' öğesi bu konumda bulunamaz.
zh_hans: "annotation" 元素不能出现在此位置。
zh_hant: 'annotation' 元素不可出現於此處。
