Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_InvalidIdAttribute
source: Invalid 'id' attribute value: {0}
cs: Neplatná hodnota atributu id: {0}
de: Ungültiger id-Attributwert: {0}
es: Valor del atributo "id" no válido: {0}
fr: Valeur non valide de l'attribut 'id' : {0}
it: Il valore dell'attributo 'id' non è valido: {0}
ja: 'id' の属性値 {0} が無効です。
ko: 'id' 특성 값이 잘못되었습니다: {0}
pl: Nieprawidłowa wartość atrybutu „id”: {0}
pt_br: Valor de atributo 'id' inválido: {0}
ru: Недопустимое значение атрибута id: {0}
tr: Geçersiz 'id' özniteliği değeri: {0}
zh_hans: 无效的 "id" 特性值: {0}
zh_hant: 'id' 屬性值無效: {0}

# Sch_InvalidIncludeLocation
source: Cannot resolve the 'schemaLocation' attribute.
cs: Atribut schemaLocation nelze přeložit.
de: Das schemaLocation-Attribut kann nicht aufgelöst werden.
es: No se puede resolver el atributo "schemaLocation".
fr: Impossible de résoudre l'attribut 'schemaLocation'.
it: Non è possibile risolvere l'attributo 'schemaLocation'.
ja: 'schemaLocation' 属性を解決できません。
ko: 'schemaLocation' 특성을 확인할 수 없습니다.
pl: Nie można rozpoznać atrybutu „schemaLocation”.
pt_br: Não é possível resolver atributo 'schemaLocation'.
ru: Не удается разрешить атрибут schemaLocation.
tr: 'schemaLocation' özniteliği çözümlenemiyor.
zh_hans: 无法解析 "schemaLocation" 特性。
zh_hant: 無法解析 'schemaLocation' 屬性。

# Sch_InvalidLanguageId
source: '{0}' is an invalid language identifier.
cs: {0} je neplatný identifikátor jazyka.
de: "{0}" ist ein ungültiger Sprachbezeichner.
es: "{0}" es un identificador de lenguaje no válido.
fr: '{0}' est un identificateur de langue non valide.
it: '{0}' non è un identificatore lingua valido.
ja: '{0}' は無効な言語識別子です。
ko: '{0}'은(는) 잘못된 언어 식별자입니다.
pl: Wartość „{0}” nie jest prawidłowym identyfikatorem języka.
pt_br: '{0}' é um identificador de idioma inválido.
ru: "{0}" не является допустимым идентификатором языка.
tr: '{0}', geçersiz bir dil tanımlayıcısı.
zh_hans: “{0}”是无效的语言标识符。
zh_hant: '{0}' 是無效的語言識別碼。

# Sch_InvalidNameAttribute
source: Invalid 'name' attribute value: {0}.
cs: Neplatná hodnota atributu name: {0}
de: Ungültiger name-Attributwert: {0}.
es: Valor {0} del atributo "name" no válido.
fr: Valeur non valide de l'attribut 'name' : {0}.
it: Il valore dell'attributo 'name' non è valido: {0}.
ja: 'name' の属性値が無効です。{0}。
ko: 'name' 특성 값이 잘못되었습니다. {0}
pl: Nieprawidłowa wartość atrybutu „name”: {0}.
pt_br: Valor de atributo 'name' inválido: {0}.
ru: Недопустимое значение атрибута name: {0}.
tr: Geçersiz 'name' özniteliği değeri: {0}.
zh_hans: 无效的 "name" 特性值: {0}。
zh_hant: 'name' 屬性值無效: {0}。

# Sch_InvalidNameAttributeEx
source: Invalid 'name' attribute value '{0}': '{1}'.
cs: Neplatná hodnota atributu name {0}: {1}
de: Ungültiger name-Attributwert "{0}": "{1}".
es: Valor "{0}": "{1}" del atributo "name" no válido.
fr: Valeur non valide de l'attribut 'name' '{0}' : '{1}'.
it: Il valore {0} dell'attributo 'name' non è valido: '{1}'.
ja: 'name' の属性値 '{0}' が無効です。'{1}'。
ko: 'name' 특성 값 '{0}'이(가) 잘못되었습니다. '{1}'
pl: Nieprawidłowa wartość atrybutu „name” — „{0}”: „{1}”.
pt_br: Valor de atributo 'name' inválido '{0}'. '{1}'.
ru: Недопустимое значение атрибута name "{0}": "{1}".
tr: Geçersiz 'name' özniteliği değeri '{0}': '{1}'.
zh_hans: 无效的 "name" 特性值“{0}”:“{1}”。
zh_hant: 'name' 屬性值 '{0}' 無效: '{1}'。

# Sch_InvalidNamespace
source: The Namespace '{0}' is an invalid URI.
cs: Obor názvů {0} je neplatným identifikátorem URI.
de: Der Namespace "{0}" ist ein ungültiger URI.
es: El espacio de nombres "{0}" no es un identificador URI válido.
fr: L'espace de noms '{0}' est un URI non valide.
it: Lo spazio dei nomi '{0}' non è un URI valido.
ja: 名前空間 '{0}' の URI が無効です。
ko: 네임스페이스 '{0}'은(는) 잘못된 URI입니다.
pl: Przestrzeń nazw „{0}” jest nieprawidłowym identyfikatorem URI.
pt_br: O Namespace '{0}' é um URI inválido.
ru: Пространство имен "{0}" не является допустимым URI.
tr: '{0}' Ad Alanı geçersiz bir URI.
zh_hans: 命名空间“{0}”是无效的 URI。
zh_hant: 命名空間 '{0}' 是無效的 URI。

# Sch_InvalidNamespaceAttribute
source: The namespace attribute cannot have empty string as its value.
cs: Atribut oboru názvů nemůže mít jako hodnotu prázdný řetězec.
de: Das namespace-Attribut darf keine leere Zeichenfolge als Wert aufweisen.
es: El atributo de espacio de nombres no puede tener como valor una cadena vacía.
fr: La valeur de l'attribut namespace ne peut pas être une chaîne vide.
it: Il valore dell'attributo dello spazio dei nomi non può essere una stringa vuota.
ja: 名前空間属性の値に空の文字列を指定することはできません。
ko: 네임스페이스 특성은 빈 문자열을 값으로 사용할 수 없습니다.
pl: Wartością atrybutu przestrzeni nazw nie może być pusty ciąg.
pt_br: O atributo namespace não pode ter uma cadeia de caracteres vazia como valor.
ru: Атрибут пространства имен не может иметь в качестве значения пустую строку.
tr: Ad alanı özniteliğinin değeri boş dize olamaz.
zh_hans: 命名空间特性的值不得为空字符串。
zh_hant: 命名空間屬性的值不能為空白字串。

# Sch_InvalidPIComment
source: The element cannot contain comment or processing instruction. Content model is empty.
cs: Element nesmí obsahovat komentář nebo pokyny ke zpracování. Model obsahu je prázdný.
de: Das Element darf keinen Kommentar bzw. keine Verarbeitungsanweisung enthalten. Das Inhaltsmodell ist leer.
es: El elemento no puede contener comentarios ni instrucciones de procesamiento. El modelo de contenido está vacío.
fr: L'élément ne peut pas contenir de commentaire ou d'instruction de traitement. Le modèle de contenu est vide.
it: Il modello di contenuto è vuoto. L'elemento non può contenere commenti o istruzioni di elaborazione.
ja: この要素にはコメントまたは処理命令は使用できません。コンテンツ モデルが空です。
ko: 요소에는 설명이나 처리 명령이 포함될 수 없습니다. 콘텐츠 모델이 비어 있습니다.
pl: Element nie może zawierać komentarzy ani instrukcji przetwarzania. Model zawartości jest pusty.
pt_br: O elemento não pode conter instrução de processamento nem comentário. Modelo de conteúdo vazio.
ru: Элемент не может содержать комментарий или команду обработки. Модель содержимого пуста.
tr: Öğe açıklama veya işleme yönergesi içeremez. İçerik modeli boş.
zh_hans: 元素不能包含注释或处理指令。内容模型为空。
zh_hant: 元素不可包含或處理指示。內容模型為空。

# Sch_InvalidPartialValidationType
source: The partial validation type has to be 'XmlSchemaElement', 'XmlSchemaAttribute', or 'XmlSchemaType'.
cs: Částečné ověřování musí být typu XmlSchemaElement, XmlSchemaAttribute nebo XmlSchemaType.
de: Der Teilvalidierungstyp muss "XmlSchemaElement", "XmlSchemaAttribute" oder "XmlSchemaType" lauten.
es: El tipo de validación parcial tiene que ser "XmlSchemaElement", "XmlSchemaAttribute" o "XmlSchemaType".
fr: Le type de validation partielle doit être 'XmlSchemaElement', 'XmlSchemaAttribute' ou 'XmlSchemaType'.
it: Il tipo della convalida parziale deve essere 'XmlSchemaElement', 'XmlSchemaAttribute' o 'XmlSchemaType'.
ja: 部分検証型は、'XmlSchemaElement'、'XmlSchemaAttribute'、または 'XmlSchemaType' のいずれかである必要があります。
ko: 부분적 유효성 검사 형식은 'XmlSchemaElement', 'XmlSchemaAttribute' 또는 'XmlSchemaType'이어야 합니다.
pl: Typ częściowej weryfikacji należy ustawić na „XmlSchemaElement”, „XmlSchemaAttribute” lub „XmlSchemaType”.
pt_br: O tipo de validação parcial precisa ser 'XmlSchemaElement', 'XmlSchemaAttribute' ou 'XmlSchemaType'.
ru: Тип неполной проверки должен быть XmlSchemaElement, XmlSchemaAttribute или XmlSchemaType.
tr: Kısmi doğrulama türü 'XmlSchemaElement', 'XmlSchemaAttribute' veya 'XmlSchemaType' olmalıdır.
zh_hans: 部分验证类型必须为 "XmlSchemaElement"、"XmlSchemaAttribute" 或 "XmlSchemaType"。
zh_hant: 部分驗證類型必須為 'XmlSchemaElement'、'XmlSchemaAttribute' 或 'XmlSchemaType'。

# Sch_InvalidParticleRestriction
source: Invalid particle derivation by restriction.
cs: Neplatné odvození částice podle omezení
de: Ungültige Partikelableitung durch Einschränkung.
es: Derivación de partícula por restricción no válida.
fr: Dérivation de particule par restriction non valide.
it: La derivazione della particella per restrizione non è valida.
ja: 制限による無効なパーティクルの派生です。
ko: restriction에 의한 파티클 파생이 잘못되었습니다.
pl: Nieprawidłowe wyprowadzenie cząstki według ograniczenia.
pt_br: Derivação de partícula por restrição inválida.
ru: Недопустимое получение производной части путем ограничения.
tr: Kısıtlamaya göre parçacık türetme geçersiz.
zh_hans: 通过限制进行的粒子派生无效。
zh_hant: 限制的物件衍生無效。

# Sch_InvalidParticleRestrictionDetailed
source: Invalid particle derivation by restriction - '{0}'.
cs: Neplatné odvození částice podle omezení – {0}
de: Ungültige Partikelableitung durch Einschränkung: "{0}".
es: Derivación de partícula por restricción no válida - "{0}".
fr: Dérivation de particule par restriction non valide : '{0}'.
it: La derivazione della particella per restrizione non è valida - '{0}'.
ja: 制限 '{0}' による無効なパーティクルの派生です。
ko: 제한에 의해 파티클 파생이 잘못되었습니다. '{0}'.
pl: Nieprawidłowe wyprowadzenie cząstki według ograniczenia — „{0}”.
pt_br: Derivação de partícula por restrição inválida – '{0}'.
ru: Недопустимое получение производной части путем ограничения — "{0}".
tr: Kısıtlamaya göre parçacık türetme geçersiz - '{0}'.
zh_hans: 通过限制进行的粒子派生无效 -“{0}”。
zh_hant: 限制的物件衍生無效 - '{0}'。

# Sch_InvalidPublicAttribute
source: Public attribute '{0}' is an invalid URI.
cs: Veřejný atribut {0} je neplatný identifikátor URI.
de: Das öffentliche {0}-Attribut ist ein ungültiger URI.
es: El atributo Public "{0}" no es un identificador URI válido.
fr: L'attribut public '{0}' est un URI non valide.
it: L'attributo pubblico '{0}' non è un URI valido.
ja: Public 属性 '{0}' の URI が無効です。
ko: 공용 특성 '{0}'이(가) 잘못된 URI입니다.
pl: Atrybut publiczny „{0}” jest nieprawidłowym identyfikatorem URI.
pt_br: O atributo público '{0}' é um URI inválido.
ru: Общий атрибут "{0}" не является допустимым URI.
tr: '{0}' genel özniteliği, geçersiz bir URI.
zh_hans: 公共特性“{0}”是无效的 URI。
zh_hant: 功用屬性 '{0}' 是無效的 URI。

# Sch_InvalidSchemaLocation
source: The SchemaLocation '{0}' is an invalid URI.
cs: Atribut SchemaLocation {0} má neplatný identifikátor URI.
de: SchemaLocation "{0}" ist ein ungültiger URI.
es: SchemaLocation "{0}" no es un URI válido.
fr: SchemaLocation '{0}' est un URI non valide.
it: L'elemento SchemaLocation '{0}' non è un URI valido.
ja: SchemaLocation '{0}' の URI が無効です。
ko: SchemaLocation '{0}'은(는) URI에 사용할 수 없습니다.
pl: Element SchemaLocation „{0}” jest nieprawidłowym identyfikatorem URI.
pt_br: O SchemaLocation '{0}' é um URI inválido.
ru: SchemaLocation "{0}" не является допустимым URI.
tr: SchemaLocation '{0}' geçersiz bir URI.
zh_hans: SchemaLocation“{0}”是无效的 URI。
zh_hant: SchemaLocation '{0}' 是無效的 URI。

# Sch_InvalidSimpleTypeFinalValue
source: The values 'substitution' and 'extension' are invalid for the final attribute on simpleType.
cs: Hodnoty substitution a extension jsou neplatné pro atribut final typu simpleType.
de: Die Werte "substitution" und "extension" sind für das final-Attribut für simpleType ungültig.
es: Los valores "substitution" y "extension" no son válidos para el atributo final de simpleType.
fr: Les valeurs 'substitution' et 'extension' sont non valides pour l'attribut final de simpleType.
it: I valori 'substitution' ed 'extension' non sono validi per l'attributo final di simpleType.
ja: simpleType の最後の属性に対し、値 'substitution' および 'extension' は無効です。
ko: 'substitution' 및 'extension' 값은 simpleType의 final 특성에 사용할 수 없습니다.
pl: Wartości „substitution” lub „extension” są nieprawidłowe dla atrybutu końcowego typu simpleType.
pt_br: Os valores 'substitution' e 'extension' são inválidos para o atributo final em simpleType.
ru: Значения substitution и extension для атрибута final элемента simpleType недопустимы.
tr: 'substitution' ve 'extension' değerleri simpleType üzerindeki final özniteliği için geçersizdir.
zh_hans: 值 "substitution" 和 "extension" 对于 simpleType 上的 final 特性无效。
zh_hant: 若是 simpleType 上的 final 屬性，'substitution' 與 'extension' 均為無效值。

# Sch_InvalidSimpleTypeRestriction
source: Restriction of 'anySimpleType' is not allowed.
cs: Omezení typu anySimpleType není povoleno.
de: Eine Einschränkung für "anySimpleType" ist nicht zulässig.
es: No se permite la restricción de "anySimpleType".
fr: La restriction de 'anySimpleType' n'est pas autorisée.
it: La restrizione di 'anySimpleType' non è consentita.
ja: 'anySimpleType' の制限は使用できません。
ko: 'anySimpleType'은 제한할 수 없습니다.
pl: Ograniczenie „anySimpleType” jest niedozwolone.
pt_br: A restrição de 'anySimpleType' não é permitida.
ru: Ограничение anySimpleType запрещено.
tr: 'anySimpleType' kısıtlamasına izin verilmez.
zh_hans: 不允许限制 "anySimpleType"。
zh_hant: 'anySimpleType' 不能有限制。

# Sch_InvalidStartTransition
source: It is invalid to call the '{0}' method in the current state of the validator. The '{1}' method must be called before proceeding with validation.
cs: Není povoleno volat metodu {0} v aktuálním stavu ověřovatele. Před pokračováním v ověřování musí být volána metoda {1}.
de: Der Aufruf der {0}-Methode im aktuellen Zustand der Bestätigung ist ungültig. Die {1}-Methode muss aufgerufen werden, bevor die Validierung fortgesetzt wird.
es: No se puede llamar al método "{0}" con el estado actual del validador. Se debe llamar al método "{1}" antes de continuar con la validación.
fr: L'appel de la méthode '{0}' est non valide en raison de l'état actuel du validateur. Vous devez appeler la méthode '{1}' pour pouvoir continuer la validation.
it: Non è possibile chiamare il metodo '{0}' nello stato corrente del validator. È necessario chiamare il metodo '{1}' prima di procedere con la convalida.
ja: 検証コントロールの状態が現在のようである場合、'{0}' メソッドを呼び出すことは無効です。'{1}' メソッドは、検証が行われる前に呼び出される必要があります。
ko: 현재 상태의 유효성 검사기에서 '{0}' 메서드를 호출할 수 없습니다. 유효성 검사를 계속하려면 '{1}' 메서드를 호출해야 합니다.
pl: Nie można wywoływać metody „{0}” przy bieżącym stanie modułu weryfikacji. Metodę „{1}” należy wywołać przed kontynuowaniem weryfikacji.
pt_br: É inválido chamar o método '{0}' no estado atual do validador. Chame o método '{1}' antes de continuar com a validação.
ru: Нельзя вызвать метод "{0}" в текущем состоянии проверки. Перед тем как продолжить проверку, необходимо вызвать метод "{1}".
tr: Doğrulayıcının şu andaki durumunda '{0}' metodunu çağırmak geçersizdir. Doğrulama işlemine devam etmeden önce '{1}' metodu çağrılmalıdır.
zh_hans: 在验证程序的当前状态下调用“{0}”方法无效。继续验证之前必须先调用“{1}”方法。
zh_hant: 在目前驗證程式的狀態下呼叫 '{0}' 方法無效。必須在繼續驗證前先呼叫 '{1}'。

# Sch_InvalidStateTransition
source: The transition from the '{0}' method to the '{1}' method is not allowed.
cs: Přechod od metody {0} k metodě {1} není povolen.
de: Der Übergang von der {0}-Methode zur {1}-Methode ist nicht zulässig.
es: No se permite la transición del método "{0}" al método "{1}".
fr: La transition de la méthode '{0}' à la méthode '{1}' n'est pas autorisée.
it: La transizione dal metodo '{0}' al metodo '{1}' non è consentita.
ja: '{0}' メソッドから '{1}' メソッドへは遷移できません。
ko: '{0}' 메서드에서 '{1}' 메서드로 전환할 수 없습니다.
pl: Przejście z metody „{0}” do metody „{1}” nie jest dozwolone.
pt_br: A transição do método '{0}' para o método '{1}' não é permitida.
ru: Переход от метода "{0}" к методу "{1}" не разрешен.
tr: '{0}' metodundan '{1}' metoduna geçmeye izin verilmez.
zh_hans: 不允许从“{0}”方法转换到“{1}”方法。
zh_hant: 不允許從 '{0}' 方法換換至不允許的 '{1}' 方法。

# Sch_InvalidSubstitutionMember
source: '{0}' cannot be a member of substitution group with head element '{1}'.
cs: {0} nemůže být členem skupiny nahrazení s elementem {1}.
de: "{0}" kann kein Member der Ersetzungsgruppe mit dem Head-Element "{1}" sein.
es: "{0}" no puede ser un miembro de un grupo de sustitución con el elemento de encabezado "{1}".
fr: '{0}' ne peut pas être un membre du groupe de substitution avec l'élément head '{1}'.
it: '{0}' non può essere membro di un gruppo di sostituzione con elemento head '{1}'.
ja: '{0}' は、head 要素 '{1}' を持つ代替グループのメンバーになることはできません。
ko: '{0}'은(는) head 요소 '{1}'이(가) 있는 대체 그룹의 멤버일 수 없습니다.
pl: Element „{0}” nie może być składową grupy podstawienia z elementem nagłówkowym „{1}”.
pt_br: '{0}' não pode ser um membro de grupo de substituição com elemento head '{1}'.
ru: "{0}" не может являться членом группы подстановки с элементом head "{1}".
tr: '{0}', '{1}' baş öğesi olan değiştirme grubunun üyesi olamaz.
zh_hans: “{0}”不能是具有头元素“{1}”的替换组的成员。
zh_hant: '{0}' 不可為具備標頭元素 '{1}' 的替代群組成員。

# Sch_InvalidSystemAttribute
source: System attribute '{0}' is an invalid URI.
cs: Systémový atribut {0} je neplatným identifikátorem URI.
de: Das Systemattribut "{0}" ist ein ungültiger URI.
es: El atributo System "{0}" no es un identificador URI válido.
fr: L'attribut système '{0}' est un URI non valide.
it: L'attributo di sistema '{0}' non è un URI valido.
ja: System 属性 '{0}' の URI が無効です。
ko: 시스템 특성 '{0}'이(가) 잘못된 URI입니다.
pl: Atrybut systemowy „{0}” jest nieprawidłowym identyfikatorem URI.
pt_br: O atributo do sistema '{0}' é um URI inválido.
ru: Системный атрибут "{0}" не является допустимым URI.
tr: '{0}' sistem özniteliği geçersiz bir URI.
zh_hans: 系统特性“{0}”是无效的 URI。
zh_hant: 系統屬性 '{0}' 是無效的 URI。

# Sch_InvalidTargetNamespaceAttribute
source: The targetNamespace attribute cannot have empty string as its value.
cs: Atribut targetNamespace nemůže mít jako hodnotu prázdný řetězec.
de: Das targetNamespace-Attribut darf keine leere Zeichenfolge als Wert aufweisen.
es: El atributo targetNamespace no puede tener como valor una cadena vacía.
fr: La valeur de l'attribut targetNamespace ne peut pas être une chaîne vide.
it: Il valore dell'attributo targetNamespace non può essere una stringa vuota.
ja: targetNamespace 属性の値に空の文字列を指定することはできません。
ko: targetNamespace 특성은 빈 문자열을 값으로 사용할 수 없습니다.
pl: Wartością atrybutu targetNamespace nie może być pusty ciąg.
pt_br: O atributo targetNamespace não pode ter uma cadeia de caracteres vazia como valor.
ru: Атрибут targetNamespace не может иметь в качестве значения пустую строку.
tr: targetNamespace özniteliğinin değeri boş dize olamaz.
zh_hans: targetNamespace 特性值不得为空字符串。
zh_hant: targetNamespace 屬性的值不能為空白字串。

# Sch_InvalidTextInElement
source: The element {0} cannot contain text.
cs: Element {0} nesmí obsahovat text.
de: Das Element {0} darf keinen Text enthalten.
es: El elemento {0} no puede contener texto.
fr: L'élément {0} ne peut pas contenir de texte.
it: L'elemento {0} non può contenere testo.
ja: 要素 {0} はテキストを含むことはできません。
ko: 요소 {0}은(는) 텍스트를 포함할 수 없습니다.
pl: Element {0} nie może zawierać tekstu.
pt_br: O elemento {0} não pode conter texto.
ru: Элемент {0} не может содержать текст.
tr: {0} öğesi metin içeremez.
zh_hans: 元素 {0} 不能包含文本。
zh_hant: 元素 {0} 不可包含文字。

# Sch_InvalidTextInElementExpecting
source: The element {0} cannot contain text. List of possible elements expected: {1}.
cs: Element {0} nesmí obsahovat text. Seznam možných očekávaných elementů: {1}
de: Das Element {0} darf keinen Text enthalten. Erwartet wurde die Liste der möglichen Elemente: {1}.
es: El elemento {0} no puede contener texto. Lista esperada de posibles elementos: {1}.
fr: L'élément {0} ne peut pas contenir de texte. Liste d'éléments possibles attendus : {1}.
it: L'elemento {0} non può contenere testo. Elenco dei possibili elementi previsti: {1}.
ja: 要素 {0} にテキストを含めることはできません。必要とされる要素は {1} です。
ko: 요소 {0}은(는) 텍스트를 포함할 수 없습니다. 필요한 요소 목록: {1}.
pl: Element {0} nie może zawierać tekstu. Lista oczekiwanych możliwych elementów: {1}.
pt_br: O elemento {0} não pode conter texto. Lista de possíveis elementos esperados: {1}.
ru: Элемент {0} не может содержать текст. Список ожидаемых элементов: {1}.
tr: {0} öğesi metin içeremez. Beklenen olası öğeler listesi: {1}.
zh_hans: 元素 {0} 不能包含文本。应使用的元素如下: {1}。
zh_hant: 元素 {0} 不可包含文字。可能元素的清單應為: {1}。

# Sch_InvalidTextInEmpty
source: The element cannot contain text. Content model is empty.
cs: Element nesmí obsahovat text. Model obsahu je prázdný.
de: Das Element darf keinen Text enthalten. Das Inhaltsmodell ist leer.
es: El elemento no puede contener texto. El modelo de contenido está vacío.
fr: L'élément ne peut pas contenir de texte. Le modèle de contenu est vide.
it: Il modello di contenuto è vuoto. L'elemento non può contenere testo.
ja: 要素にテキストを含めることはできません。コンテンツ モデルが空です。
ko: 요소는 텍스트를 포함할 수 없습니다. 콘텐츠 모델이 비어 있습니다.
pl: Element nie może zawierać tekstu. Model zawartości jest pusty.
pt_br: O elemento não pode conter texto. Modelo de conteúdo vazio.
ru: Элемент не может содержать текст. Модель содержимого пуста.
tr: Öğe metin içeremez. İçerik modeli boş.
zh_hans: 元素不能包含文本。内容模型为空。
zh_hant: 元素不可包含文字。內容模型為空白。

# Sch_InvalidTypeRedefine
source: If type is being redefined, the base type has to be self-referenced.
cs: Je-li typ předefinován, musí základní typ odkazovat sám na sebe.
de: Wenn ein Typ neu definiert wird, muss der Basistyp auf sich selbst verweisen.
es: Si se está redefiniendo el tipo, el tipo base tiene que hacer referencia a sí mismo.
fr: Si le type est redéfini, le type de base doit être autoréférencé.
it: Se il tipo viene ridefinito, il tipo di base deve fare riferimento a se stesso.
ja: 型を再定義する場合、基本データ型は自己参照しなければなりません。
ko: 형식이 다시 정의되는 경우 기본 형식은 자신을 다시 참조해야 합니다.
pl: Jeśli typ jest ponownie definiowany, typ podstawowy musi być odwołaniem do samego siebie.
pt_br: Se o tipo estiver sendo redefinido, o tipo base deverá fazer referência a si mesmo.
ru: Если тип переопределяется, то базовый тип должен являться рекурсивной ссылкой.
tr: Tür yeniden tanımlanıyorsa, temel tür kendine başvuru içermelidir.
zh_hans: 如果类型正在重新定义，则基类型必须自引用。
zh_hant: 若要重新定義類型，基底類型必須是自我參考。

# Sch_InvalidValue
source: The value '{0}' is invalid according to its data type.
cs: Hodnota {0} je vzhledem ke svému datovému typu neplatná.
de: Der Wert "{0}" ist gemäß seinem Datentyp zufolge ungültig.
es: El valor "{0}" no es válido de acuerdo con su tipo de datos.
fr: La valeur '{0}' est non valide selon son type de données.
it: Il valore '{0}' non è valido in base al relativo tipo di dati.
ja: 値 '{0}' は、データ型に対して無効です。
ko: 값 '{0}'의 데이터 형식이 잘못되었습니다.
pl: Wartość „{0}” jest nieprawidłowa przy uwzględnieniu jej typu danych.
pt_br: O valor '{0}' é inválido de acordo com seu tipo de dados.
ru: Значение "{0}" недопустимо с точки зрения его типа данных.
tr: '{0}' değeri kendi türüne göre geçersiz.
zh_hans: 根据其数据类型，值“{0}”无效。
zh_hant: 根據值 '{0}' 的資料類型，該值無效。

# Sch_InvalidValueDetailed
source: The value '{0}' is invalid according to its schema type '{1}' - {2}
cs: Hodnota {0} je vzhledem ke svému typu schématu {1} neplatná – {2}
de: Der Wert "{0}" ist gemäß seinem Schematyp "{1}" ungültig – {2}.
es: El valor "{0}" no es válido según su tipo de esquema "{1}" - {2}
fr: La valeur '{0}' est non valide selon son type de schéma '{1}' - {2}
it: Il valore '{0}' non è valido in base al relativo tipo di dati '{1}' - {2}
ja: 値 '{0}' は、そのスキーマの型 '{1}' に対して無効です。{2}
ko: 값 '{0}'의 스키마 형식 '{1}'이(가) 잘못되었습니다. {2}
pl: Wartość „{0}” jest nieprawidłowa przy uwzględnieniu jej typu schematu „{1}” — {2}
pt_br: O valor '{0}' é inválido de acordo com seu tipo de esquema '{1}' – {2}
ru: Значение "{0}" недопустимо с точки зрения его типа схемы "{1}" — {2}.
tr: '{0}' değeri, değerin '{1}' olan şema türüne göre geçersiz - {2}
zh_hans: 根据其架构类型“{1}”，值“{0}”无效 - {2}
zh_hant: 根據其結構描述類型 '{1}' - {2}，值 '{0}' 無效

# Sch_InvalidValueDetailedAttribute
source: The attribute '{0}' has an invalid value '{1}' according to its schema type '{2}' - {3}
cs: Atribut {0} má podle svého typu schématu {2} neplatnou hodnotu {1} – {3}
de: Das Attribut "{0}" weist gemäß seinem Schematyp "{2}" einen ungültigen Wert "{1}' auf – {3}.
es: El atributo "{0}" tiene un valor no válido "{1}" de acuerdo con su tipo de esquema "{2}" - {3}
fr: L'attribut '{0}' a une valeur non valide '{1}' selon son type de schéma '{2}' - {3}
it: Il valore '{1}' dell'attributo '{0}' non è valido in base al relativo tipo di schema '{2}' - {3}
ja: 属性 '{0}' の値 '{1}' はスキーマ型 '{2}' に対して無効です。{3}
ko: '{0}' 특성의 값 '{1}'이(가) 스키마 형식 '{2}'에 맞지 않습니다. {3}
pl: Atrybut „{0}” ma nieprawidłową wartość „{1}” przy uwzględnieniu jego typu schematu „{2}” — {3}
pt_br: O atributo '{0}' tem um valor inválido '{1}' de acordo com seu tipo de esquema '{2}' – {3}
ru: Атрибут "{0}" имеет недопустимое значение "{1}" в соответствии с его типом схемы "{2}" — {3}
tr: '{0}' özniteliği, '{2}' - {3} şema türüne göre '{1}' geçersiz değerine sahip
zh_hans: 根据其架构类型“{2}”，特性“{0}”的值“{1}”无效 - {3}
zh_hant: 根據結構描述類型 '{2}'，屬性 '{0}' 的值 '{1}' 無效 - {3}
