Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlTypesDuplicate
source: Types '{0}' and '{1}' both use the XML type name, '{2}', from namespace '{3}'. Use XML attributes to specify a unique XML name and/or namespace for the type.
cs: Typy {0} a {1} používají název typu XML {2} z oboru názvů {3}. Pomocí atributů XML zadejte pro typ jedinečný název XML a/nebo obor názvů.
de: Die Typen "{0}" und "{1}" verwenden beide den XML-Typnamen "{2}" aus dem Namespace "{3}". Geben Sie mit XML-Attributen einen eindeutigen XML-Namen und/oder -Namespace für den Typ an.
es: Los tipos "{0}" y "{1}" utilizan el nombre de tipo XML, "{2}", del espacio de nombres "{3}". Utilice atributos XML para especificar un nombre XML único y/o espacio de nombres para el tipo.
fr: Les types '{0}' et '{1}' utilisent le nom de type XML '{2}' de l'espace de noms '{3}'. Utilisez les attributs XML pour spécifier un nom XML unique et/ou un espace de noms pour le type.
it: I tipi '{0}' e '{1}' usano entrambi il nome di tipo XML '{2}' dello spazio dei nomi '{3}'. Usare gli attributi XML per specificare uno spazio dei nomi e/o un nome XML univoco per il tipo.
ja: 型 '{0}' および '{1}' は、名前空間 '{3}' の XML 型名 '{2}' を使用しています。この型の、一意の XML または名前空間を指定するには XML 属性を使用してください。
ko: 형식 '{0}'과(와) '{1}' 모두 네임스페이스 '{3}'에서 XML 형식 이름 '{2}'을(를) 사용합니다. XML 특성을 사용하여 해당 형식에 대한 고유 XML 이름 및/또는 네임스페이스를 지정하세요.
pl: Zarówno dla typu „{0}”, jak i „{1}” używana jest nazwa typu XML „{2}” z przestrzeni nazw „{3}”. Użyj atrybutów XML, aby określić unikatową nazwę i/lub przestrzeń nazw XML dla typu.
pt_br: Tipos '{0}' e '{1}' usam nome de tipo XML, '{2}', do namespace '{3}'. Use atributos XML para especificar um namespace e/ou nome XML para o tipo.
ru: Типы "{0}" и "{1}" используют имя типа XML "{2}" из пространства имен "{3}". Используйте атрибуты XML, чтобы задать для типа уникальное имя и/или пространство имен XML.
tr: '{0}' ve '{1}' türlerinin her ikisi de '{3}' ad alanındaki '{2}' XML türü adını kullanıyor. Tür için XML özniteliklerini kullanarak benzersiz bir XML adı ve/veya ad alanı belirtin.
zh_hans: 类型“{0}”和“{1}”都使用来自命名空间“{3}”的 XML 类型名称“{2}”。请使用 XML 特性为该类型指定唯一的 XML 名称和/或命名空间。
zh_hant: 類型 '{0}' 和 '{1}' 使用來自命名空間 '{3}' 的 XML 類型名稱 '{2}'。使用 XML 屬性指定類型的唯一 XML 名稱及 (或) 命名空間。

# XmlUdeclaredXsdType
source: The type, {0}, is undeclared.
cs: Typ {0} není deklarován.
de: Der Typ {0} wurde nicht deklariert.
es: El tipo, {0}, está sin declarar.
fr: Le type, {0}, n'est pas déclaré.
it: Il tipo {0} non è dichiarato.
ja: 型 {0} は宣言されていません。
ko: {0} 형식이 선언되지 않았습니다.
pl: Typ {0} jest niezadeklarowany.
pt_br: O tipo {0} é não declarado.
ru: Тип {0} не объявлен.
tr: {0} türü bildirilmedi.
zh_hans: 类型 {0} 未声明。
zh_hant: 未宣告類型 {0}。

# XmlUndefinedAlias
source: Namespace prefix '{0}' is not defined.
cs: Předpona oboru názvů {0} není definována.
de: Das Namespacepräfix "{0}" wurde nicht definiert.
es: No se ha definido el prefijo "{0}" de espacio de nombres.
fr: Le préfixe d'espace de noms '{0}' n'est pas défini.
it: Il prefisso dello spazio dei nomi '{0}' non è definito.
ja: 名前空間の接頭語 '{0}' は定義されていません。
ko: 네임스페이스 접두사 '{0}'이(가) 정의되지 않았습니다.
pl: Prefiks przestrzeni nazw „{0}” nie jest zdefiniowany.
pt_br: O prefixo de namespace '{0}' não está definido.
ru: Префикс пространства имен "{0}" не определен.
tr: Ad alanı önceki '{0}' tanımlanmadı.
zh_hans: 未定义命名空间前缀“{0}”。
zh_hant: 未定義命名空間前置詞 '{0}'。

# XmlUnknownAnyElement
source: The XML element '{0}' from namespace '{1}' was not expected. The XML element name and namespace must match those provided via XmlAnyElementAttribute(s).
cs: Element XML {0} z oboru názvů {1} nebyl očekáván. Obor názvů a název elementu XML musí odpovídat hodnotám poskytnutým atributy XmlAnyElementAttribute.
de: Das XML-Element "{0}" aus dem Namespace "{1}" wurde nicht erwartet. Der XML-Elementname und -Namespace müssen mit dem über XmlAnyElementAttribute(s) bereitgestellten Namen und Namespace übereinstimmen.
es: No se esperaba el elemento XML "{0}" del espacio de nombres "{1}". El espacio de nombres y el nombre del elemento XML deben coincidir con los proporcionados por XmlAnyElementAttribute.
fr: L'élément XML nommé '{0}' dans l'espace de noms '{1}' n'était pas attendu. Le nom de l'élément XML et l'espace de noms doivent correspondre à ceux fournis via XmlAnyElementAttribute(s).
it: L'elemento XML '{0}' dello spazio dei nomi '{1}' non è previsto. Il nome e lo spazio dei nomi dell'elemento XML devono corrispondere a quelli specificati tramite XmlAnyElementAttribute(s).
ja: 名前空間 '{1}' の XML 要素 '{0}' は予期されていませんでした。XML 要素名と名前空間は、XmlAnyElementAttribute(s) を通して指定されたものと一致しなければなりません。
ko: 네임스페이스 '{1}'의 XML 요소 '{0}'은(는) 사용할 수 없습니다. XML 요소 이름과 네임스페이스는 XmlAnyElementAttribute를 통해 지정한 이름과 일치해야 합니다.
pl: Nie oczekiwano elementu XML o nazwie „{0}” z przestrzeni nazw „{1}”. Nazwa elementu i przestrzeń nazw XML muszą być zgodne z dostarczonymi za pomocą atrybutów XmlAnyElementAttribute.
pt_br: O elemento XML '{0}' do namespace '{1}' não era esperado. O namespace e o nome do elemento XML devem coincidir com os fornecidos via XmlAnyElementAttribute(s).
ru: Элемент XML "{0}" из пространства имен "{1}" не ожидался. Имя элемента XML и пространство имен должны соответствовать имени и пространству имен, считанным через XmlAnyElementAttribute.
tr: '{1}' ad alanından '{0}' XML öğesi beklenmiyordu. XML öğesi adı ile ad alanı, XmlAnyElementAttribute(s) aracılığıyla belirtilenlerle eşleşmelidir.
zh_hans: 不应是来自命名空间“{1}”的 XML 元素“{0}”。XML 元素名称和命名空间必须与通过 XmlAnyElementAttribute 提供的元素名称和命名空间匹配。
zh_hant: 來自命名空間 '{1}' 名稱為 '{0}' 的 XML 元素不是必須的元素。XML 元素名稱和命名空間必須和經由 XmlAnyElementAttribute 所提供的名稱和命名空間相符。

# XmlUnknownConstant
source: Instance validation error: '{0}' is not a valid value for {1}.
cs: Chyba ověřování instance: Hodnota {0} není platná pro {1}.
de: Instanzvalidierungsfehler: "{0}" ist kein gültiger Wert für {1}.
es: Error de validación de instancia: "{0}" no es un valor válido para {1}.
fr: Erreur de validation d'instance : '{0}' est une valeur non valide pour {1}.
it: Errore di convalida dell'istanza: '{0}' non è un valore valido per {1}.
ja: インスタンス検証エラー : '{0}' は {1} の有効な値ではありません。
ko: 인스턴스 유효성 검사 오류: '{0}'은(는) {1}에 사용할 수 없는 값입니다.
pl: Błąd weryfikacji wystąpienia: „{0}” nie jest prawidłową wartością elementu {1}.
pt_br: Erro de validação de instância: '{0}' não é um valor válido para {1}.
ru: Ошибка проверки экземпляра: "{0}" не является допустимым значением {1}.
tr: Örnek doğrulama hatası: '{0}', {1} için geçerli bir değer değil.
zh_hans: 实例验证错误:“{0}”不是 {1} 的有效值。
zh_hant: 執行個體驗證錯誤: '{0}' 不是 {1} 的有效值。

# XmlUnknownNode
source: {0} was not expected.
cs: Uzel {0} nebyl očekáván.
de: {0} wurde nicht erwartet.
es: No se esperaba {0}.
fr: {0} n'était pas attendu.
it: {0} è imprevisto.
ja: {0} は指定できません。
ko: {0}은(는) 올 수 없습니다.
pl: Nie oczekiwano elementu {0}.
pt_br: {0} não era esperado.
ru: {0} не ожидался.
tr: {0} beklenmiyordu.
zh_hans: 不应有 {0}。
zh_hant: 不應出現 {0}。

# XmlUnknownType
source: The specified type was not recognized: name='{0}', namespace='{1}', at {2}.
cs: Zadaný typ nebyl rozpoznán: název={0}, obor názvů={1}, pozice: {2}
de: Der angegebene Typ wurde nicht erkannt: Name="{0}", Namespace="{1}", bei {2}.
es: No se reconoce el tipo especificado: nombre="{0}", espacio de nombres="{1}", en {2}.
fr: Le type spécifié n'était pas reconnu : nom='{0}', espace de noms='{1}', à {2}.
it: Il tipo specificato non è stato riconosciuto: nome='{0}', spazio dei nomi='{1}', alla posizione {2}.
ja: 指定された型は認識されませんでした: name='{0}'、namespace='{1}'、場所 {2}
ko: 지정한 형식을 인식할 수 없습니다. name='{0}', namespace='{1}', 위치: {2}
pl: Określony typ nie został rozpoznany: nazwa=„{0}”, przestrzeń nazw=„{1}”, w {2}.
pt_br: O tipo especificado não foi reconhecido: nome='{0}', namespace='{1}', em {2}.
ru: Указанный тип не был распознан: имя="{0}", пространство имен="{1}", в {2}.
tr: Belirtilen tür tanınamadı: adı='{0}', ad alanı='{1}', konumu {2}.
zh_hans: 未识别指定的类型: name='{0}'，namespace='{1}'，位于 {2}。
zh_hant: 指定的類型無法辨識: 位於 {2} 的 name='{0}', namespace='{1}'。

# XmlUnsupportedDefaultType
source: The default value type, {0}, is unsupported.
cs: Výchozí typ hodnoty {0} není podporován.
de: Der Standardwerttyp "{0}" wird nicht unterstützt.
es: Tipo de valor predeterminado, {0}, no compatible.
fr: Le type valeur par défaut, {0}, n'est pas pris en charge.
it: Il tipo valore predefinito {0} non è supportato.
ja: 既定値の型 {0} はサポートされません。
ko: 기본값 형식 {0}이(가) 지원되지 않습니다.
pl: Domyślny typ wartości — {0} — nie jest obsługiwany.
pt_br: Não há suporte para o tipo de valor padrão {0}.
ru: Значение для типа по умолчанию {0} не поддерживается.
tr: {0} varsayılan değer türü desteklenmiyor.
zh_hans: 不支持默认值类型 {0}。
zh_hant: 不支援預設實值型別 {0}。

# XmlUnsupportedDefaultValue
source: The formatter {0} cannot be used for default values.
cs: Formátovací modul {0} nelze použít pro výchozí hodnoty.
de: Die Formatierung {0} kann nicht für Standardwerte verwendet werden.
es: No se puede utilizar el formateador {0} para valores predeterminados.
fr: Impossible d'utiliser le formateur {0} pour les valeurs par défaut.
it: Non è possibile usare il formattatore {0} per valori predefiniti.
ja: フォーマッタ {0} は既定値に使用できません。
ko: {0} 포맷터를 기본값에 사용할 수 없습니다.
pl: Program formatujący {0} nie może być używany dla wartości domyślnych.
pt_br: O formatador {0} não pode ser usado para valores padrão.
ru: Средство форматирования {0} не может использоваться для значений по умолчанию.
tr: {0} biçimlendiricisi varsayılan değerlerle kullanılamaz.
zh_hans: 格式化程序 {0} 无法用于默认值。
zh_hant: 預設值不可使用格式器 {0}。

# XmlUnsupportedIDictionary
source: The type {0} is not supported because it implements IDictionary.
cs: Typ {0} není podporován, protože implementuje rozhraní IDictionary.
de: Der Typ "{0}" wird nicht unterstützt, da er IDictionary implementiert.
es: El tipo {0} no es compatible porque implementa IDictionary.
fr: Le type {0} n'est pas pris en charge, car il implémente IDictionary.
it: Il tipo {0} non è supportato perché implementa IDictionary.
ja: 型 {0} は IDictionary を実装するため、サポートされません。
ko: {0} 형식은 IDictionary를 구현하므로 지원되지 않습니다.
pl: Typ {0} nie jest obsługiwany, ponieważ implementuje on element IDictionary.
pt_br: Não há suporte para o tipo {0} porque ele implementa IDictionary.
ru: Тип {0} не поддерживается, так как он реализует IDictionary.
tr: IDictionary uyguladığından {0} türü desteklenmiyor.
zh_hans: 不支持类型 {0}，因为它实现 IDictionary。
zh_hant: 不支援類型 {0}，因為它實作 IDictionary。

# XmlUnsupportedIDictionaryDetails
source: Cannot serialize member {0} of type {1}, because it implements IDictionary.
cs: Člen {0} typu {1} nelze serializovat, protože implementuje rozhraní IDictionary.
de: Der Member {0} vom Typ {1} kann nicht serialisiert werden, da er IDictionary implementiert.
es: No se puede serializar el miembro {0} del tipo {1}, ya que implementa IDictionary.
fr: Impossible de sérialiser le membre {0} de type {1}, car il implémente IDictionary.
it: Non è possibile serializzare il membro {0} di tipo {1} perché implementa IDictionary.
ja: IDictionary が実装されているため、型 {1} のメンバー {0} はシリアル化できません。
ko: {1} 형식의 멤버 {0}은(는) IDictionary를 구현하기 때문에 직렬화할 수 없습니다.
pl: Nie można serializować składowej {0} typu {1}, ponieważ implementuje ona interfejs IDictionary.
pt_br: Não é possível serializar o membro {0} do tipo {1}, pois ele implementa IDictionary.
ru: Невозможно сериализовать член {0} типа {1}, так как он содержит реализацию IDictionary.
tr: {1} türü {0} üyesi, IDictionary uyguladığından serileştirilemiyor.
zh_hans: 无法序列化 {1} 类型的成员 {0}，因为它实现 IDictionary。
zh_hant: 無法序列化類型 {1} 的成員 {0}，因為它實作 IDictionary。

# XmlUnsupportedInheritance
source: Using {0} as a base type for a class is not supported by XmlSerializer.
cs: Používání {0} jako základního typu pro třídu není objektem XmlSerializer podporováno.
de: Die Verwendung von {0} als Basistyp für eine Klasse wird von XmlSerializer nicht unterstützt.
es: XmlSerializer no admite el uso de {0} como tipo base de una clase.
fr: L'utilisation de {0} comme type de base pour une classe n'est pas prise en charge par XmlSerializer.
it: XmlSerializer non supporta l'uso di {0} come tipo di base per una classe.
ja: XmlSerializer では、クラスの基本データ型として {0} を使用することはできません。
ko: XmlSerializer에서는 클래스의 기본 형식으로 {0}을(를) 사용할 수 없습니다.
pl: Klasa XmlSerializer nie obsługuje użycia elementu {0} jako typu bazowego dla klasy.
pt_br: XmlSerializer não dá suporte ao uso de {0} como tipo base para uma classe.
ru: Использование {0} в качестве базового типа для класса не поддерживается XmlSerializer.
tr: Sınıf için temel tür olarak {0} kullanımı XmlSerializer tarafından desteklenmez.
zh_hans: XmlSerializer 不支持使用 {0} 作为类的基类型。
zh_hant: XmlSerializer 不支援將 {0} 當作類別的基底類型。

# XmlUnsupportedInterface
source: Cannot serialize interface {0}.
cs: Rozhraní {0} nelze serializovat.
de: Die Schnittstelle {0} kann nicht serialisiert werden.
es: No se puede serializar la interfaz {0}.
fr: Impossible de sérialiser l'interface {0}.
it: Non è possibile serializzare l'interfaccia {0}.
ja: インターフェイス {0} をシリアル化できません。
ko: {0} 인터페이스를 직렬화할 수 없습니다.
pl: Nie można serializować interfejsu {0}.
pt_br: Não é possível serializar a interface {0}.
ru: Невозможно сериализовать интерфейс {0}.
tr: {0} arabirimi serileştirilemiyor.
zh_hans: 无法序列化接口 {0}。
zh_hant: 無法序列化介面 {0}。

# XmlUnsupportedInterfaceDetails
source: Cannot serialize member {0} of type {1} because it is an interface.
cs: Člen {0} typu {1} nelze serializovat, protože se jedná o rozhraní.
de: Der Member {0} vom Typ {1} kann nicht serialisiert werden, da er eine Schnittstelle ist.
es: No se puede serializar el miembro {0} de tipo {1} porque es una interfaz.
fr: Impossible de sérialiser le membre {0} de type {1}, car il s'agit d'une interface.
it: Non è possibile serializzare il membro {0} di tipo {1} perché è un'interfaccia.
ja: 型 {1} のメンバー {0} はインターフェイスなのでシリアル化できません。
ko: 형식 {1}의 멤버 {0}은(는) 인터페이스이므로 직렬화할 수 없습니다.
pl: Nie można serializować składowej {0} typu {1}, ponieważ jest ona interfejsem.
pt_br: Não é possível serializar o membro {0} do tipo {1} porque ele é uma interface.
ru: Невозможно сериализовать член {0} типа {1}, так как он является интерфейсом.
tr: Bir arabirim olduğundan {1} türündeki {0} üyesi serileştirilemiyor.
zh_hans: 类型 {1} 的成员 {0} 是接口，因此无法将其序列化。
zh_hant: 因為該成員為介面，所以無法序列化類型 {1} 的成員 {0}。

# XmlUnsupportedOpenGenericType
source: Type {0} is not supported because it has unbound generic parameters. Only instantiated generic types can be serialized.
cs: Typ {0} není podporován, protože obsahuje obecné parametry bez vazby. Serializovat lze pouze obecné typy s instancemi.
de: Der Typ {0} wird nicht unterstützt, da er ungebundene generische Parameter aufweist. Nur instanziierte generische Typen können serialisiert werden.
es: El tipo {0} no es compatible porque tiene parámetros genéricos sin enlazar. solo se pueden serializar tipos genéricos con una instancia en curso.
fr: Le type {0} n'est pas pris en charge, car il a des paramètres génériques indépendants. Seuls les types génériques instanciés peuvent être sérialisés.
it: Il tipo {0} non è supportato perché contiene parametri generici non associati. È possibile serializzare solo i tipi generici di cui è stata creata un'istanza.
ja: 型 {0} にはバインドされていない汎用パラメーターがあるため、サポートされません。一般的な型のインスタンスしか、シリアル化できません。
ko: 형식 {0}에는 바인딩되지 않은 일반 매개 변수가 있기 때문에 지원되지 않습니다. 인스턴스화된 제네릭 형식만 직렬화할 수 있습니다.
pl: Typ {0} nie jest obsługiwany, ponieważ ma niezwiązane parametry ogólne. Serializować można tylko typy ogólne z utworzonymi wystąpieniami.
pt_br: O tipo {0} não tem suporte porque tem parâmetros genéricos não associados. Somente tipos genéricos instanciados podem ser serializados.
ru: Тип {0} не поддерживается, так как имеет несвязанные универсальные параметры. Универсальные типы могут быть сериализованы только после создания экземпляра.
tr: {0} türünde bağlı olmayan genel parametreler olduğundan, bu tür desteklenmiyor. Yalnızca örneği oluşturulan genel türler serileştirilebilir.
zh_hans: 不支持类型 {0}，因为它具有未绑定的一般参数。只能序列化示例化的一般类型。
zh_hant: 不支援類型 {0}，因為它有未繫結的泛用參數。只有執行個體化的泛用類型可以序列化。

# XmlUnsupportedRank
source: Cannot serialize object of type {0}. Multidimensional arrays are not supported.
cs: Objekt typu {0} nelze serializovat. Vícerozměrná pole nejsou podporována.
de: Das Objekt vom Typ {0} kann nicht serialisiert werden. Mehrdimensionale Arrays werden nicht unterstützt.
es: No se puede serializar el objeto de tipo {0}. No se admiten las matrices multidimensionales.
fr: Impossible de sérialiser l'objet de type {0}. Les tableaux à plusieurs dimensions ne sont pas pris en charge.
it: Non è possibile serializzare l'oggetto di tipo {0}. Le matrici multidimensionali non sono supportate.
ja: 型 {0} のオブジェクトをシリアル化できません。Multidimensional 配列はサポートされていません。
ko: 형식이 {0}인 개체를 직렬화할 수 없습니다. 다차원 배열은 지원되지 않습니다.
pl: Nie można serializować obiektu typu {0}. Tablice wielowymiarowe nie są obsługiwane.
pt_br: Não é possível serializar objeto do tipo {0}. Não há suporte para matrizes multidimensionais.
ru: Невозможно сериализовать объект типа {0}. Многомерные массивы не поддерживаются.
tr: {0} türündeki nesne serileştirilemiyor. Çok boyutlu diziler desteklenmiyor.
zh_hans: 无法序列化类型 {0} 的对象。不支持多维数组。
zh_hant: 無法序列化類型 {0} 的物件。不支援多維陣列。

# XmlUnsupportedRedefine
source: Cannot import schema for type '{0}' from namespace '{1}'. Redefine not supported.
cs: Nelze importovat schéma pro typ {0} z oboru názvů {1}. Předefinování není podporováno.
de: Das Schema für den Typ "{0}" aus dem Namespace "{1}" kann nicht importiert werden. Die Neudefinition wird nicht unterstützt.
es: No se puede importar el esquema para el tipo "{0}" del espacio de nombres "{1}". No se admite la redefinición.
fr: Impossible d'importer un schéma pour le type '{0}' de l'espace de noms '{1}'. Redefine non pris en charge.
it: Non è possibile importare lo schema per il tipo '{0}' dallo spazio dei nomi '{1}'. La ridefinizione non è supportata.
ja: 型 '{0}' のスキーマを名前空間 '{1}' からインポートできません。再定義はサポートされていません。
ko: 네임스페이스 '{1}'에서 형식 '{0}'에 대한 스키마를 가져올 수 없습니다. 재정의가 지원되지 않습니다.
pl: Nie można zaimportować schematu dla typu „{0}” z przestrzeni nazw „{1}”. Przedefiniowywanie nie jest obsługiwane.
pt_br: Não é possível importar o esquema para o tipo '{0}' do namespace '{1}'. Não há suporte para a redefinição.
ru: Невозможно импортировать схему для типа "{0}" из пространства имен "{1}". Переопределение не поддерживается.
tr: '{0}' türünün şeması '{1}' ad alanından içeri aktarılamıyor. Yeniden tanımlama desteklenmiyor.
zh_hans: 无法从命名空间“{1}”导入类型“{0}”的架构。不支持重定义。
zh_hant: 無法從命名空間 '{1}' 匯入類型 '{0}' 的結構描述。不支援重新定義。

# XmlUnsupportedSoapTypeKind
source: The type {0} may not be serialized with SOAP-encoded messages. Set the Use for your message to Literal.
cs: Typ {0} nemůže být serializován se zprávami zakódovanými v protokolu SOAP. Nastavte vlastnost Use zprávy na hodnotu Literal.
de: Der Typ {0} kann nicht mit codierten SOAP-Nachrichten serialisiert werden. Legen Sie die Verwendung für Ihre Nachricht auf "Literal" fest.
es: No se puede serializar el tipo {0} con mensajes codificados de SOAP. Establezca el uso para su mensaje en Literal.
fr: Le type {0} ne peut pas être sérialisé avec les messages encodés à partir de SOAP. Définissez Use pour votre message à Literal.
it: Il tipo {0} non può essere serializzato con messaggi con codifica SOAP. Impostare Use su Literal per il messaggio.
ja: 型 {0} を、SOAP でエンコードされたメッセージでシリアル化することはできません。メッセージの Use を Literal に設定してください。
ko: {0} 형식을 SOAP 인코딩된 메시지로 직렬화할 수 없습니다. 메시지의 Use를 Literal로 설정하세요.
pl: Typ {0} nie może być serializowany z kodowanymi komunikatami SOAP. Ustaw dla komunikatu element Use na wartość Literal.
pt_br: O tipo {0} não pode ser serializado com mensagens codificadas em SOAP. Defina a opção Usar nas suas mensagens como Literal.
ru: Тип {0} невозможно сериализовать с сообщениями, закодированными как SOAP. Установите для своего сообщения свойство Use равным Literal.
tr: {0} türü, SOAP kodlanmış ilerilerle serileştirilemiyor. İletiniz için Use ayarını Literal yapın.
zh_hans: 类型 {0} 不能用 SOAP 编码的消息序列化。请将消息的 Use 设置为 Literal。
zh_hant: 類型 {0} 無法以 SOAP 編碼的訊息序列化。請將訊息的 Use 設定為 Literal。

# XmlUnsupportedType
source: {0} is an unsupported type.
cs: {0} je nepodporovaný typ.
de: {0} ist ein nicht unterstützter Typ.
es: {0} es un tipo no compatible.
fr: {0} est un type non pris en charge.
it: {0} è un tipo non supportato.
ja: {0} はサポートされない型です。
ko: {0}은(는) 지원되지 않는 형식입니다.
pl: Typ {0} nie jest obsługiwany.
pt_br: {0} é um tipo sem suporte.
ru: {0} является неподдерживаемым типом.
tr: {0}, desteklenmeyen bir tür.
zh_hans: {0} 是一种不受支持的类型。
zh_hant: {0} 是不受支援的類型。

# XmlUnsupportedTypeKind
source: The type {0} may not be serialized.
cs: Typ {0} nesmí být serializován.
de: Der Typ {0} darf nicht serialisiert werden.
es: No se puede serializar el tipo {0}.
fr: Le type {0} ne peut pas être sérialisé.
it: Il tipo {0} non può essere serializzato.
ja: 型 {0} をシリアル化することはできません。
ko: {0} 형식을 직렬화할 수 없습니다.
pl: Typ {0} nie może być serializowany.
pt_br: O tipo {0} não pode ser serializado.
ru: Невозможно сериализовать тип {0}.
tr: {0} türü serileştirilemez.
zh_hans: 不能序列化类型 {0}。
zh_hant: 類型 {0} 無法序列化。

# XmlUnxpectedType
source: The type {0} was not expected. Use the XmlInclude or SoapInclude attribute to specify types that are not known statically.
cs: Typ {0} nebyl očekáván. K určení typů, které nejsou známy staticky, použijte atribut XmlInclude nebo SoapInclude.
de: Der Typ {0} wurde nicht erwartet. Verwenden Sie das XmlInclude- oder das SoapInclude-Attribut, um Typen anzugeben, die nicht statisch sind.
es: No se esperaba el tipo {0}. Utilice el atributo XmlInclude o SoapInclude para especificar los tipos que no se conocen estáticamente.
fr: Le type {0} n'était pas attendu. Utilisez l'attribut XmlInclude ou SoapInclude pour spécifier les types qui ne sont pas connus statiquement.
it: Il tipo {0} è imprevisto. Usare l'attributo XmlInclude o SoapInclude per specificare tipi non noti a livello statico.
ja: 型 {0} は指定されていません。スタティックに使用できない型を指定するには XmlInclude または SoapInclude 属性を使ってください。
ko: {0} 형식은 사용할 수 없습니다. XmlInclude 또는 SoapInclude 특성을 사용하여 정적으로 알려지지 않은 형식을 지정하세요.
pl: Nie oczekiwano typu {0}. Użyj atrybutu XmlInclude lub elementu SoapInclude, aby określić typy, które nie są podane statycznie.
pt_br: O tipo {0} não era esperado. Use o atributo XmlInclude ou SoapInclude para especificar tipos que não são conhecidos estaticamente.
ru: Тип {0} не ожидался. Используйте атрибут XmlInclude или SoapInclude для задания типов, которые не известны как статические.
tr: {0} beklenmiyordu. Statik olarak bilinen türler için XmlInclude veya SoapInclude özniteliğini belirtin.
zh_hans: 不应是类型 {0}。使用 XmlInclude 或 SoapInclude 特性静态指定非已知的类型。
zh_hant: 不需要類型 {0}。請使用 XmlInclude 或 SoapInclude 屬性指定非已知的靜態類型。
