Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlDocument_ValidateInvalidNodeType
source: Validate method can be called only on nodes of type Document, DocumentFragment, Element, or Attribute.
cs: Metodu Validate je možné volat pouze pro uzly typu Document, DocumentFragment, Element nebo Attribute.
de: Die Validate-Methode kann nur für Knoten vom Typ "Document", "DocumentFragment", "Element" oder "Attribute" aufgerufen werden.
es: Solo se puede llamar al método Validate en nodos del tipo Document, DocumentFragment, Element o Attribute.
fr: La méthode Validate ne peut être appelée que sur les nœuds de type Document, DocumentFragment, Element ou Attribute.
it: Il metodo Validate può essere chiamato solo su nodi di tipo Document, DocumentFragment, Element o Attribute.
ja: Validate メソッドを呼び出せるのは、Document、DocumentFragment、Element または Attribute 型のノード上でのみです。
ko: Validate 메서드는 Document, DocumentFragment, Element 또는 Attribute 형식의 노드에서만 호출할 수 있습니다.
pl: Metodę weryfikacji można wywoływać tylko w przypadku węzłów typu Document, DocumentFragment, Element i Attribute.
pt_br: O método Validate só pode ser chamado em nós do tipo Document, DocumentFragment, Element ou Attribute.
ru: Метод Validate можно вызвать только для узлов типа Document, DocumentFragment, Element или Attribute.
tr: Validate metodu, yalnızca Document, DocumentFragment, Element veya Attribute türündeki düğümlerde çağrılabilir.
zh_hans: 只能在 Document、DocumentFragment、Element 或 Attribute 类型的节点上调用 Validate 方法。
zh_hant: 僅可在類型 Document、DocumentFragment、Element 或 Attribute 呼叫 Validate 方法。

# XmlDropArrayAttributeValue
source: '{0}' attribute on array-like elements is not supported in this version of the .Net Framework. Ignoring {0}='{1}' attribute on element name='{2}'.
cs: Atribut {0} není v této verzi rozhraní .NET Framework u elementů v podobě pole podporován. Atribut {0}={1} bude u elementu name='{2}' ignorován.
de: Das Attribut "{0}" für arrayähnliche Elemente wird von dieser .NET Framework-Version nicht unterstützt. Das Attribut {0}="{1}" für den Elementnamen="{2}" wird ignoriert.
es: Esta versión de .Net Framework no admite el atributo "{0}" en elementos tipo matriz. Se omite el atributo {0}="{1}" en el nombre de elemento="{2}".
fr: L'attribut '{0}' des éléments de type tableau n'est pas pris en charge dans cette version du .Net Framework. L'attribut {0}='{1}' sera ignoré dans element name='{2}'.
it: L'attributo '{0}' in elementi simili a matrice non è supportato in questa versione di .NET Framework. L'attributo {0}='{1}' nell'elemento name='{2}' verrà ignorato.
ja: 配列に似た要素の '{0}' 属性は、このバージョンの .Net Framework ではサポートされていません。要素名 ='{2}' の {0}='{1}' 属性を無視します。
ko: 배열 형식 요소의 '{0}' 특성은 이 버전의 .NET Framework에서 지원되지 않습니다. 요소 이름='{2}'에서 {0}='{1}' 특성을 무시합니다.
pl: Atrybut „{0}” związany z elementami wykazującymi podobieństwo do tablic nie jest obsługiwany w tej wersji programu .Net Framework. Ignorowanie atrybutu {0}=„{1}” dla nazwy elementu = „{2}”.
pt_br: Não há suporte para o atributo '{0}' de elementos de tipo matriz nesta versão do .NET Framework. Ignorando atributo {0}='{1}' no elemento de nome ='{2}'.
ru: Атрибут "{0}" для элементов, имеющих вид массива, в этой версии .Net Framework не поддерживается. Атрибут {0}="{1}" для имени элемента ="{2}" проигнорирован.
tr: Diziye benzer öğelerdeki '{0}' özniteliği bu .Net Framework sürümünde desteklenmiyor. adı='{2}' olan öğedeki {0}='{1}' özniteliği yoksayılıyor.
zh_hans: 此版本的 .Net Framework 中不支持类似数组的元素上的“{0}”特性。忽略 element name='{2}' 上的 {0}='{1}' 特性。
zh_hant: 此版本的 .Net Framework 不支援在陣列形式的元素上出現 '{0}' 屬性。將略過 element name='{2}' 上的 {0}='{1}' 屬性。

# XmlDropAttributeValue
source: '{0}' attribute on items of type '{1}' is not supported in this version of the .Net Framework. Ignoring {0}='{2}' attribute.
cs: Atribut {0} u položek typu {1} není v této verzi rozhraní .NET Framework podporován. Atribut {0}={2} bude ignorován.
de: Das Attribut "{0}" für Elemente vom Typ "{1}" wird von dieser .NET Framework-Version nicht unterstützt. Das Attribut {0}="{2}" wird ignoriert.
es: Esta versión de .Net Framework no admite atributos "{0}" en elementos de tipo {1}". Se omite el atributo {0}="{2}".
fr: L'attribut '{0}' des éléments de type '{1}' n'est pas pris en charge dans cette version du .Net Framework. L'attribut {0}='{2}' sera ignoré.
it: L'attributo '{0}' su elementi di tipo '{1}' non è supportato in questa versione di .NET Framework. L'attributo {0}='{2}' verrà ignorato.
ja: 型が '{1}' の項目の '{0}' 属性は、このバージョンの .Net Framework ではサポートされていません。{0}='{2}' 属性を無視します。
ko: 형식이 '{1}'인 항목의 '{0}' 특성은 이 버전의 .NET Framework에서 지원되지 않습니다. {0}='{2}' 특성을 무시합니다.
pl: Atrybut „{0}” dla elementów typu „{1}” nie jest obsługiwany w tej wersji programu .Net Framework. Ignorowanie atrybutu {0}=„{2}”.
pt_br: Não há suporte para o atributo '{0}' nos itens de tipo '{1}' nesta versão do .NET Framework. Ignorando atributo {0}='{2}'.
ru: Атрибут "{0}" для элементов типа "{1}" в этой версии .Net Framework не поддерживается. Атрибут {0}="{2}" проигнорирован.
tr: '{1}' türü öğelerdeki '{0}' özniteliği bu .Net Framework sürümünde desteklenmiyor. {0}='{2}' özniteliği yoksayılıyor.
zh_hans: 此版本的 .Net Framework 中不支持“{1}”类型的项上的“{0}”特性。忽略 {0}='{2}' 特性。
zh_hant: 此版本的 .Net Framework 不支援在類型 '{1}' 的項目上出現 '{0}' 屬性。略過 {0}='{2}' 屬性。

# XmlDropDefaultAttribute
source: DefaultValue attribute on members of type {0} is not supported in this version of the .Net Framework.
cs: Atribut DefaultValue u členů typu {0} není v této verzi rozhraní .NET Framework podporován.
de: Das DefaultValue-Attribut für Member vom Typ {0} wird von dieser .NET Framework-Version nicht unterstützt.
es: El atributo DefaultValue de los miembros del tipo {0} no es compatible con esta versión de .Net Framework.
fr: L'attribut DefaultValue des membres de type {0} n'est pas pris en charge dans cette version du .Net Framework.
it: L'attributo DefaultValue su membri di tipo {0} non è supportato in questa versione di .NET Framework.
ja: このバージョンの .NET Framework では、型 {0} のメンバーでの DefaultValue 属性の使用はサポートされていません。
ko: 형식 {0}의 멤버에 대한 DefaultValue 특성은 이 버전의 .NET Framework에서 지원되지 않습니다.
pl: Atrybut DefaultValue dla składowych typu {0} nie jest obsługiwany w tej wersji programu .Net Framework.
pt_br: Não há suporte para o atributo DefaultValue em membros do tipo {0} nesta versão do .NET Framework.
ru: Атрибут DefaultValue для членов типа "{0}" в этой версии .Net Framework не поддерживается.
tr: {0} türü üyelerdeki DefaultValue özniteliği bu .Net Framework sürümünde desteklenmiyor.
zh_hans: 此版本的 .Net Framework 不支持 {0} 类型成员的 DefaultValue 特性。
zh_hant: 此版本的 .Net Framework 不支援類型為 {0} 之成員上的 DefaultValue 屬性。

# XmlDropNonPrimitiveAttributeValue
source: '{0}' attribute supported only for primitive types. Ignoring {0}='{1}' attribute.
cs: Atribut {0} je podporován pouze u primitivních typů. Atribut {0}={1} bude ignorován.
de: Das Attribut "{0}" wird nur für primitive Typen unterstützt. Das Attribut {0}="{1}" wird ignoriert.
es: El atributo "{0}" solo admite tipos primitivos. Se omite el atributo {0}= "{1}".
fr: Attribut '{0}' uniquement pris en charge pour les types primitifs. L'attribut {0}='{1}' sera ignoré.
it: L'attributo '{0}' è supportato soltanto per i tipi primitivi. L'attributo {0}='{1}' verrà ignorato.
ja: '{0}' 属性は、プリミティブ型でのみサポートされます。{0}='{1}' 属性を無視します。
ko: '{0}' 특성은 기본 형식에서만 지원됩니다. {0}='{1}' 특성을 무시합니다.
pl: Atrybut „{0}” jest obsługiwany tylko dla typów pierwotnych. Ignorowanie atrybutu {0}=„{1}”.
pt_br: Só há suporte para o atributo '{0}' em tipos primitivos. Ignorando atributo {0}='{1}'.
ru: Атрибут "{0}" поддерживается только для типов примитивов. Атрибут {0}="{1}" проигнорирован.
tr: '{0}' özniteliği yalnızca temel türlerde desteklenir. {0}='{1}' özniteliği yok sayılıyor.
zh_hans: 只有基元类型支持“{0}”特性。忽略 {0}='{1}' 特性。
zh_hant: '{0}' 屬性僅支援基本類型。略過 {0}='{1}' 屬性。

# XmlDuplicateAttributeName
source: The XML attribute '{0}' from namespace '{1}' is already present in the current scope. Use XML attributes to specify another XML name or namespace for the attribute.
cs: Atribut XML {0} z oboru názvů {1} již v aktuálním oboru existuje. Pomocí atributů XML zadejte pro atribut jiný název XML nebo jiný obor názvů.
de: Das XML-Attribut "{0}" aus dem Namespace "{1}" ist bereits im aktuellen Bereich vorhanden. Verwenden Sie XML-Attribute, um einen anderen XML-Namen oder -Namespace für das Attribut anzugeben.
es: El atributo XML "{0}" del espacio de nombres "{1}" ya está presente en el ámbito actual. Utilice atributos XML para especificar otro espacio de nombres o nombre XML para el atributo.
fr: L'attribut XML nommé '{0}' de l'espace de noms '{1}' est déjà présent dans la portée actuelle. Utilisez des attributs XML pour spécifier un autre nom ou espace de noms XML pour l'attribut.
it: L'attributo XML '{0}' dello spazio dei nomi '{1}' è già presente nell'ambito corrente. Usare gli attributi XML per specificare un altro nome XML o un altro spazio dei nomi per l'attributo.
ja: 名前空間 '{1}' の XML 属性 '{0}' は、現在のスコープに既に存在しています。XML 属性を使用して、この属性の代わりとなる別の XML 名または名前空間を指定してください。
ko: 네임스페이스 '{1}'의 XML 특성 '{0}'이(가) 현재 범위에 이미 있습니다. XML 특성을 사용하여 특성에 다른 XML 이름 또는 네임스페이스를 지정하세요.
pl: Atrybut XML „{0}” z przestrzeni nazw „{1}” występuje już w bieżącym zakresie. Użyj atrybutów XML do określenia innej nazwy XML lub innej przestrzeni nazw dla atrybutu.
pt_br: O atributo XML '{0}' do namespace '{1}' já está presente no escopo atual. Use atributos XML para especificar outro namespace ou nome XML para o atributo.
ru: Атрибут XML "{0}" из пространства имен "{1}" уже имеется в текущей области. Используйте атрибуты XML, чтобы задать другое имя или пространство имен XML для атрибута.
tr: '{1}' ad alanındaki '{0}' XML özniteliği geçerli kapsamda zaten var. Öznitelik için XML özniteliklerini kullanarak başka bir XML adı veya ad alanı belirtin.
zh_hans: 来自命名空间“{1}”的 XML 特性“{0}”已存在于当前范围内。请使用 XML 特性为该特性指定另一个 XML 名称或命名空间。
zh_hant: 來自命名空間 '{1}' 的 XML 屬性 '{0}' 已在目前的範圍中。請使用 XML 屬性指定另一個 XML 名稱或屬性的命名空間。

# XmlDuplicateElementInScope
source: The XML element named '{0}' from namespace '{1}' is already present in the current scope.
cs: Element XML s názvem {0} z oboru názvů {1} již v aktuálním oboru existuje.
de: Das XML-Element "{0}" aus dem Namespace "{1}" ist bereits im aktuellen Bereich vorhanden.
es: El elemento XML denominado "{0}" del espacio de nombres "{1}" ya se encuentra presente en el ámbito actual.
fr: L'élément XML nommé '{0}' de l'espace de noms '{1}' est déjà présent dans la portée actuelle.
it: L'elemento XML denominato '{0}' dello spazio dei nomi '{1}' è già presente nell'ambito corrente.
ja: 名前空間 '{1}' の '{0}' という名前の XML 要素は、現在のスコープに既に存在しています。
ko: 네임스페이스 '{1}'의 '{0}' XML 요소가 현재 범위에 이미 있습니다.
pl: Element XML o nazwie „{0}” z przestrzeni nazw „{1}” znajduje się już w bieżącym zakresie.
pt_br: O elemento XML chamado '{0}' do namespace '{1}' já existe no escopo atual.
ru: Элемент XML "{0}" из пространства имен "{1}" уже имеется в текущей области.
tr: '{1}' ad alanındaki '{0}' adlı XML öğesi geçerli kapsamda zaten var.
zh_hans: 来自命名空间“{1}”名为“{0}”的 XML 元素已存在于当前范围内。
zh_hant: 命名空間 '{1}' 名為 '{0}' 的 XML 元素已在目前的範圍中。

# XmlDuplicateElementInScope1
source: The XML element named '{0}' from namespace '{1}' is already present in the current scope. Elements with the same name in the same scope must have the same type.
cs: Element XML s názvem {0} z oboru názvů {1} již v aktuálním oboru existuje. Elementy se stejným názvem v rámci stejného oboru musí být stejného typu.
de: Das XML-Element "{0}" aus dem Namespace "{1}" ist bereits im aktuellen Bereich vorhanden. Elemente mit demselben Namen im selben Bereich müssen denselben Typ haben.
es: El elemento XML denominado "{0}" del espacio de nombres "{1}" ya está presente en el ámbito actual. Los elementos con el mismo nombre y en el mismo ámbito deben tener el mismo tipo.
fr: L'élément XML nommé '{0}' de l'espace de noms '{1}' est déjà présent dans la portée actuelle. Les éléments ayant le même nom dans la même portée doivent avoir le même type.
it: L'elemento XML denominato '{0}' dello spazio dei nomi '{1}' è già presente nell'ambito corrente. Gli elementi con lo stesso nome nello stesso ambito devono essere dello stesso tipo.
ja: 名前空間 '{1}' の '{0}' という名前の XML 要素は、カレント スコープに既に存在します。同じスコープの同じ名前の要素は、同じ型を持たなければなりません。
ko: 네임스페이스 '{1}'의 '{0}' XML 요소가 현재 범위에 이미 있습니다. 이름이 같고 같은 범위에 있는 요소들은 형식이 같아야 합니다.
pl: Element XML o nazwie „{0}” z przestrzeni nazw „{1}” znajduje się już w bieżącym zakresie. Elementy z jednego zakresu, które mają tę samą nazwę, muszą być tego samego typu.
pt_br: O elemento XML chamado '{0}' do namespace '{1}' já existe no escopo atual. Elementos com o mesmo nome no mesmo escopo devem ter o mesmo tipo.
ru: Элемент XML "{0}" из пространства имен "{1}" уже имеется в текущей области. В пределах одной области элементы с одинаковыми именами должны иметь один тип.
tr: '{1}' ad alanındaki '{0}' adlı XML öğesi geçerli kapsamda zaten var. Adları aynı olan ve aynı kapsamda bulunan öğelerin türleri aynı olmalıdır.
zh_hans: 来自命名空间“{1}”、名为“{0}”的 XML 元素已存在于当前作用域内。同一作用域内同名的元素必须是同一类型。
zh_hant: 目前的範圍中已有來自命名空間 '{1}' 名為 '{0}' 的 XML 元素。同一範圍中之同名元素的類型必須相同。

# XmlDuplicateElementName
source: The XML element '{0}' from namespace '{1}' is already present in the current scope. Use XML attributes to specify another XML name or namespace for the element.
cs: Element XML {0} z oboru názvů {1} již v aktuálním oboru existuje. Pomocí atributů XML zadejte pro element jiný název XML nebo jiný obor názvů.
de: Das XML-Element "{0}" aus dem Namespace "{1}" ist bereits im aktuellen Bereich vorhanden. Verwenden Sie XML-Attribute, um einen anderen XML-Namen oder -Namespace für das Element anzugeben.
es: El elemento XML "{0}" del espacio de nombres "{1}" ya está presente en el ámbito actual. Utilice atributos XML para especificar otro espacio de nombres o nombre XML para el elemento.
fr: L'élément XML nommé '{0}' de l'espace de noms '{1}' est déjà présent dans la portée actuelle. Utilisez les attributs XML pour spécifier un autre nom ou espace de noms XML pour l'élément.
it: L'elemento XML '{0}' dello spazio dei nomi '{1}' è già presente nell'ambito corrente. Usare gli attributi XML per specificare un altro spazio dei nomi o un altro nome XML per l'elemento.
ja: 名前空間 '{1}' の XML 要素 '{0}' は、現在のスコープに既に存在しています。XML 属性を使用して、この要素の代わりとなる別の XML 名または名前空間を指定してください。
ko: 네임스페이스 '{1}'의 XML 요소 '{0}'이(가) 현재 범위에 이미 있습니다. XML 특성을 사용하여 요소에 다른 XML 이름 또는 네임스페이스를 지정하세요.
pl: Element XML „{0}” z przestrzeni nazw „{1}” występuje już w bieżącym zakresie. Użyj atrybutów XML do określenia innej nazwy XML lub innej przestrzeni nazw dla elementu.
pt_br: O elemento XML '{0}' do namespace '{1}' já está presente no escopo atual. Use atributos XML para especificar outro namespace ou nome XML para o elemento.
ru: Элемент XML "{0}" из пространства имен "{1}" уже имеется в текущей области. Используйте атрибуты XML, чтобы задать другое имя или пространство имен XML для элемента.
tr: '{1}' ad alanındaki '{0}' adlı XML öğesi geçerli kapsamda zaten var. Öğe için başka bir XML adı veya ad alanı belirtmek üzere XML özniteliklerini kullanın.
zh_hans: 来自命名空间“{1}”的 XML 元素“{0}”已存在于当前范围内。请使用 XML 特性为该元素指定另一个 XML 名称或命名空间。
zh_hant: 來自命名空間 '{1}' 名稱為 '{0}' 的 XML 元素已經在目前的範圍中。請使用 XML 屬性為這個元素指定另一個 XML 名稱或命名空間。

# XmlDuplicateNamespace
source: The namespace, {0}, is a duplicate.
cs: Obor názvů {0} je duplicitní.
de: Der Namespace {0} ist ein Duplikat.
es: El espacio de nombres, {0}, está duplicado.
fr: L'espace de noms, {0}, est un doublon.
it: Lo spazio dei nomi {0} è duplicato.
ja: 名前空間 {0} は重複しています。
ko: 네임스페이스 {0}이(가) 중복되었습니다.
pl: Przestrzeń nazw {0} jest duplikatem.
pt_br: O namespace {0} é duplicado.
ru: Пространство имен, {0}, является копией.
tr: {0} ad alanı yineleniyor.
zh_hans: 命名空间 {0} 重复。
zh_hant: 命名空間 {0} 是重複的。

# XmlDuplicateNs
source: Illegal namespace declaration xmlns:{0}='{1}'. Namespace alias '{0}' already defined in the current scope.
cs: Neplatná deklarace oboru názvů xmlns:{0}={1}. Alias oboru názvů {0} je již definován v aktuálním oboru.
de: Unzulässige Namespacedeklaration xmlns:{0}="{1}". Der Namespacealias "{0}" wurde im aktuellen Bereich bereits definiert.
es: Declaración de espacio de nombres xmlns:{0}="{1}" no válida. El alias del espacio de nombres "{0}" ya está definido en el ámbito actual.
fr: Déclaration d'espace de noms non conforme xmlns:{0}='{1}'. Alias d'espace de noms '{0}' déjà défini dans la portée actuelle.
it: La dichiarazione di spazio dei nomi xmlns:{0}='{1}' non è consentita. L'alias dello spazio dei nomi '{0}' è già stato definito nell'ambito corrente.
ja: xmlns:{0}='{1}' は、名前空間宣言として無効です。名前空間のエイリアス '{0}' は、既に現在のスコープで定義されています。
ko: 네임스페이스 선언 xmlns:{0}='{1}'이(가) 잘못되었습니다. 네임스페이스 별칭 '{0}'이(가) 현재 범위에 이미 정의되어 있습니다.
pl: Nieprawidłowa deklaracja przestrzeni nazw: xmlns:{0}=„{1}”. Alias przestrzeni nazw „{0}” został już zdefiniowany w bieżącym zakresie.
pt_br: Declaração de namespace inválida xmlns:{0}='{1}'. Alias de namespace '{0}' já definido no escopo atual.
ru: Недопустимое объявление пространства имен xmlns:{0}="{1}". Псевдоним пространства имен "{0}" уже определен в текущей области.
tr: Geçersiz ad alanı bildirimi xmlns:{0}='{1}'. Ad alanı diğer adı '{0}' geçerli kapsamda zaten tanımlanmış.
zh_hans: 无效的命名空间声明 xmlns:{0}='{1}'。命名空间别名“{0}”在当前范围中已定义。
zh_hant: 命名空間宣告 xmlns:{0}='{1}' 非法。已在目前的範圍中定義命名空間別名 '{0}'。

# XmlDuplicateTypeName
source: A type with the name {0} has already been added in namespace {1}.
cs: Typ s názvem {0} již byl přidán do oboru názvů {1}.
de: Ein Typ mit dem Namen {0} wurde im Namespace {1} bereits hinzugefügt.
es: Ya se ha agregado un tipo denominado {0} al espacio de nombres {1}.
fr: Un type portant le nom {0} a déjà été ajouté dans l'espace de noms {1}.
it: Un tipo denominato {0} è già stato aggiunto allo spazio dei nomi {1}.
ja: {0} という名前の型は、名前空間 {1} に既に追加されています。
ko: 이름이 {0}인 형식이 네임스페이스 {1}에 이미 추가되었습니다.
pl: Typ o nazwie {0} został już dodany do przestrzeni nazw {1}.
pt_br: Um tipo chamado {0} já foi adicionado ao namespace {1}.
ru: Тип с именем {0} уже был добавлен в пространство имен {1}.
tr: {1} ad alanına {0} adlı bir tür zaten eklenmiş.
zh_hans: 已在命名空间 {1} 中添加了名为 {0} 的类型。
zh_hant: 名為 {0} 的類型已新增至命名空間 {1} 中。

# XmlElementHasNoName
source: This element has no name. Please review schema type '{0}' from namespace '{1}'.
cs: Tento element nemá název. Zkontrolujte prosím typ schématu {0} z oboru názvů {1}.
de: Das Element hat keinen Namen. Überprüfen Sie den Schematyp "{0}" aus dem Namespace "{1}".
es: Este elemento no tiene nombre. Revise el tipo de esquema "{0}" del espacio de nombres "{1}".
fr: Cet élément n'a pas de nom. Passez en revue le type de schéma '{0}' de l'espace de noms '{1}'.
it: Elemento senza nome. Esaminare il tipo di schema '{0}' dello spazio dei nomi '{1}'.
ja: この要素には名前がありません。名前空間 '{1}' のスキーマの型 '{0}' を確認してください。
ko: 이 요소에 이름이 없습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'을(를) 확인하세요.
pl: Ten element nie ma nazwy. Przejrzyj typ schematu „{0}” z przestrzeni nazw „{1}”.
pt_br: O elemento não tem nome. Examine o tipo de esquema '{0}' do namespace '{1}'.
ru: Этот элемент не имеет имени. Просмотрите тип схемы "{0}" из пространства имен "{1}".
tr: Bu öğenin adı yok. Lütfen '{1}' ad alanındaki '{0}' şema türünü gözden geçirin.
zh_hans: 此元素没有名称。请复查来自命名空间“{1}”的架构类型“{0}”。
zh_hant: 此元素沒有任何名稱。請檢閱命名空間 '{1}' 的結構描述類型 '{0}'。

# XmlElementImportedTwice
source: The element, {0}, from namespace, {1}, was imported in two different contexts: ({2}, {3}).
cs: Element {0} z oboru názvů {1} byl importován ve dvou různých kontextech: ({2}, {3})
de: Das Element {0} aus dem Namespace {1} wurde in zwei unterschiedlichen Kontexten importiert: ({2}, {3}).
es: El elemento {0} del espacio de nombres {1} se ha importado en dos contextos diferentes: ({2}, {3}).
fr: L'élément, {0}, de l'espace de noms, {1}, a été importé dans deux contextes différents : ({2}, {3}).
it: L'elemento {0} dello spazio dei nomi {1} è stato importato in due contesti diversi: {2}, {3}.
ja: 名前空間 {1} の要素 {0} が、異なる 2 つのコンテキスト ({2}, {3}) でインポートされました。
ko: 다음 두 컨텍스트에서 {1} 네임스페이스의 {0} 요소를 가져왔습니다. ({2}, {3}).
pl: Element {0} z przestrzeni nazw {1} został zaimportowany w dwóch różnych kontekstach: ({2}, {3}).
pt_br: O elemento, {0}, do namespace, {1}, foi importado em dois contextos diferentes: ({2}, {3}).
ru: Элемент "{0}" из пространства имен "{1}" импортирован в двух контекстах: ({2}, {3}).
tr: {1} ad alanındaki {0} öğesi iki farklı bağlamda içeri aktarıldı: ({2}, {3}).
zh_hans: 命名空间 {1} 中的元素 {0} 在两个不同的上下文: ({2}, {3})中被导入。
zh_hant: 命名空間 {1} 的元素 {0} 已匯入兩個不同的內容中: ({2}, {3})。

# XmlElementMissingType
source: Please review type declaration '{0}' from namespace '{1}': element '{2}' does not specify a type.
cs: Zkontrolujte prosím deklaraci typu {0} z oboru názvů {1}: element {2} neurčuje typ.
de: Überprüfen Sie die Typdeklaration "{0}" aus dem Namespace "{1}": Das Element "{2}" gibt keinen Typ an.
es: Revise la declaración de tipos "{0}" del espacio de nombres "{1}": el elemento "{2}" no especifica un tipo.
fr: Passez en revue la déclaration de type '{0}' de l'espace de noms '{1}' : l'élément '{2}' ne spécifie pas un type.
it: Esaminare la dichiarazione di tipo '{0}' dello spazio dei nomi '{1}': l'elemento '{2}' non specifica un tipo.
ja: 名前空間 '{1}' の型宣言 '{0}' を確認してください。要素 '{2}' の型が指定されていません。
ko: 네임스페이스 '{1}'에서 형식 선언 '{0}'을(를) 확인하세요. 요소 '{2}'에서 형식을 지정하지 않습니다.
pl: Przejrzyj deklarację typu „{0}” z przestrzeni nazw „{1}”: element „{2}” nie określa typu.
pt_br: Examine a declaração de tipo '{0}' do namespace '{1}': elemento '{2}' não especifica um tipo.
ru: Просмотрите объявление типа "{0}" из пространства имен "{1}": элемент "{2}" не задает тип.
tr: Lütfen '{1}' ad alanındaki '{0}' tür bildirimini gözden geçirin: '{2}' öğesi bir tür belirtmiyor.
zh_hans: 请复查来自命名空间“{1}”的类型声明“{0}”: 元素“{2}”不指定类型。
zh_hant: 請檢閱來自命名空間 '{1}' 中的型別宣告 '{0}': 元素 '{2}' 沒有指定類型。

# XmlElementNameMismatch
source: This element was named '{0}' from namespace '{1}' but should have been named '{2}' from namespace '{3}'.
cs: Pro tento element byl použit název {0} z oboru názvů {1}, ale měl být použit název {2} z oboru názvů {3}.
de: Das Element wurde als "{0}" aus dem Namespace "{1}" benannt, sollte aber als "{2}" aus dem Namespace "{3}" benannt werden.
es: Este elemento se denominó "{0}" a partir del espacio de nombres "{1}" pero debía denominarse "{2}" a partir del espacio de nombres "{3}".
fr: Cet élément a été nommé '{0}' à partir de l'espace de noms '{1}' mais aurait dû être nommé '{2}' à partir de l'espace de noms '{3}'.
it: Questo elemento è stato denominato '{0}' dallo spazio dei nomi '{1}', ma avrebbe dovuto essere denominato '{2}' dallo spazio dei nomi '{3}'.
ja: 要素は名前空間 '{1}' の名前 '{0}' と指定されましたが、名前空間 '{3}' の '{2}' として指定しなければなりません。
ko: 이 요소의 이름이 '{1}' 네임스페이스에서 '{0}'(으)로 지정되었지만 '{3}' 네임스페이스에서 '{2}'(으)로 지정되어야 합니다.
pl: Ten element miał nazwę „{0}” z przestrzeni nazw „{1}”, ale powinien mieć nazwę „{2}” z przestrzeni nazw „{3}”.
pt_br: Este elemento era chamado '{0}' no namespace '{1}', mas deveria se chamar '{2}' no namespace '{3}'.
ru: Элемент получил имя "{0}" из пространства имен "{1}", а должен был получить имя "{2}" из пространства имен "{3}".
tr: Öğe, '{1}' ad alanındaki '{0}' olarak adlandırılmış, oysa '{3}' ad alanındaki '{2}' olarak adlandırılmalıydı.
zh_hans: 此元素被命名为命名空间“{1}”中的“{0}”，但应被命名为命名空间“{3}”中的“{2}”。
zh_hant: 名為 '{0}' 的這個元素來自命名空間 '{1}'，但它的名稱必須是 '{2}' 而且來自命名空間 '{3}'。
