Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_ExpectExternalIdOrEntityValue
source: Expecting an external identifier or an entity value.
cs: Je očekáván externí identifikátor nebo hodnota entity.
de: Es wird ein externer Bezeichner oder ein Entitätswert erwartet.
es: Se esperaba un identificador externo o un valor de entidad.
fr: Identificateur externe ou valeur d'entité attendu.
it: È previsto un identificatore esterno o un valore di entità.
ja: 外部識別子またはエンティティ値を指定してください。
ko: 외부 식별자 또는 엔터티 값이 필요합니다.
pl: Oczekiwano zewnętrznego identyfikatora lub wartości jednostki.
pt_br: Esperando um identificador externo ou um valor de entidade.
ru: Ожидается внешний идентификатор или значение сущности.
tr: Dış tanımlayıcı veya varlık değeri bekleniyor.
zh_hans: 应为外部标识符或实体值。
zh_hant: 應為外部識別碼或實體值。

# Xml_ExpectExternalOrClose
source: Expecting external ID, '[' or '>'.
cs: Je očekáván externí identifikátor ID, znak [ nebo znak >.
de: Eine externe ID, "[" oder ">" wird erwartet.
es: Se esperaba un id. externo, "[" o ">".
fr: ID externe attendu, '[' ou '>'.
it: È previsto l'ID esterno, '[' o '>'.
ja: 外部 ID '[' または '>' が必要です。
ko: 외부 ID '[' 또는 '>'가 필요합니다.
pl: Oczekiwano zewnętrznego identyfikatora albo znaku „[” lub „>”.
pt_br: Esperando ID externa, '[' ou '>'.
ru: Ожидается внешний ID, "[" или ">".
tr: Dış kimlik bekleniyor: '[' veya '>'.
zh_hans: 应为外部 ID、"[" 或 ">"。
zh_hant: 應為是外部識別碼、'[' 或 '>'。

# Xml_ExpectExternalOrPublicId
source: Expecting a system identifier or a public identifier.
cs: Je očekáván systémový nebo veřejný identifikátor.
de: Ein Systembezeichner oder ein öffentlicher Bezeichner wird erwartet.
es: Se esperaba un identificador de sistema o un identificador público.
fr: Identificateur système ou public attendu.
it: È previsto un identificatore di sistema o pubblico.
ja: システム識別子またはパブリック識別子を指定してください。
ko: 시스템 식별자 또는 공용 식별자가 필요합니다.
pl: Oczekiwano identyfikatora systemowego lub identyfikatora publicznego.
pt_br: Esperando um identificador do sistema ou um identificador público.
ru: Ожидается системный идентификатор или общий идентификатор.
tr: Sistem tanımlayıcısı veya genel tanımlayıcı bekleniyor.
zh_hans: 应为系统标识符或公共标识符。
zh_hant: 應為系統識別碼或公用識別碼。

# Xml_ExpectIgnoreOrInclude
source: Conditional sections must specify the keyword 'IGNORE' or 'INCLUDE'.
cs: Podmíněné oddíly musí používat klíčové slovo IGNORE nebo INCLUDE.
de: Bedingungsabschnitte müssen das Schlüsselwort "IGNORE" oder "INCLUDE" angeben.
es: Las secciones condicionales deben especificar la palabra clave "IGNORE" o "INCLUDE".
fr: Les sections conditionnelles doivent spécifier le mot clé 'IGNORE' ou 'INCLUDE'.
it: Le sezioni condizionali devono specificare la parola chiave 'IGNORE' o 'INCLUDE'.
ja: 条件付セクションは、キーワード 'IGNORE' または 'INCLUDE' を指定しなければなりません。
ko: 조건 섹션에 'IGNORE' 또는 'INCLUDE' 키워드를 지정해야 합니다.
pl: Sekcje warunkowe muszą określać słowo kluczowe „IGNORE” lub „INCLUDE”.
pt_br: As seções condicionais devem especificar a palavra-chave 'IGNORE' ou 'INCLUDE'.
ru: Условные разделы должны содержать ключевое слово IGNORE или INCLUDE.
tr: Koşullu bölümler 'IGNORE' veya 'INCLUDE' anahtar sözcüğünü belirtmelidir.
zh_hans: 条件部分必需指定关键字 "IGNORE" 或 "INCLUDE"。
zh_hant: 條件式區段必須指定關鍵字 'IGNORE' 或 'INCLUDE'。

# Xml_ExpectNoWhitespace
source: White space not allowed before '?', '*', or '+'.
cs: Prázdné znaky nejsou povoleny před znakem ?, * nebo +.
de: Vor "?", "*" und "+" ist kein Leerraum zulässig.
es: No se permiten espacios en blanco delante de "?", "*" o "+".
fr: Espace blanc non autorisé avant les caractères '?', '*' ou '+'.
it: Non sono consentiti spazi vuoti prima di '?', '*' o '+'.
ja: '?'、'*'、および '+' の前にスペースを置くことはできません。
ko: 공백은 '?', '*' 또는 '+' 앞에 사용할 수 없습니다.
pl: Przed znakami „?”, „*” i „+” nie można wstawiać białych znaków.
pt_br: Não é permitido espaço em branco antes de '?', '*' ou '+'.
ru: Пробел перед "?", "*" или "+" запрещен.
tr: '?', '*' veya '+' öncesinde boşluğa izin verilmez.
zh_hans: "?"、"*"、或 "+" 之前不允许有空格。
zh_hant: 不允許在 '?'、'*'、或 '+' 前使用空白。

# Xml_ExpectOp
source: Expecting '?', '*', or '+'.
cs: Je očekáván znak ?, * nebo +.
de: "?", "*", oder "+" wird erwartet.
es: Se esperaba "?", "*", o "+".
fr: '?', '*' ou '+' attendu.
it: È previsto '?', '*' o '+'.
ja: '?'、'*'、または '+' を指定してください。
ko: '?', '*' 또는 '+'가 필요합니다.
pl: Oczekiwano znaku „?”, „*” lub „+”.
pt_br: Esperando '?', '*' ou '+'.
ru: Ожидается "?", "*", или "+".
tr: '?', '*', veya '+' bekleniyor.
zh_hans: 应为 "?"、"*" 或 "+"。
zh_hant: 應為 '?'、'*' 或 '+'。

# Xml_ExpectPcData
source: Expecting 'PCDATA'.
cs: Očekává se parametr PCDATA.
de: "PCDATA" wird erwartet.
es: Se esperaba "PCDATA".
fr: En attente de 'PCDATA'.
it: È previsto 'PCDATA'.
ja: 'PCDATA' が必要です。
ko: 'PCDATA'가 필요합니다.
pl: Oczekiwano elementu „PCDATA”.
pt_br: Esperando 'PCDATA'.
ru: Ожидание PCDATA.
tr: 'PCDATA' bekleniyor.
zh_hans: 应为 "PCDATA"。
zh_hant: 需要 'PCDATA'。

# Xml_ExpectSubOrClose
source: Expecting an internal subset or the end of the DOCTYPE declaration.
cs: Je očekávána vnitřní podmnožina nebo konec deklarace DOCTYPE.
de: Eine interne Teilmenge oder das Ende der DOCTYPE-Deklaration wird erwartet.
es: Se esperaba un subconjunto interno o el final de la declaración DOCTYPE.
fr: Sous-ensemble interne ou fin de la déclaration DOCTYPE attendu.
it: È previsto un sottoinsieme interno o la fine della dichiarazione DOCTYPE.
ja: 内部サブセットまたは DOCTYPE 宣言の終わりが必要です。
ko: 내부 하위 집합 또는 DOCTYPE 선언의 끝이 필요합니다.
pl: Oczekiwano wewnętrznego podzbioru lub końca deklaracji DOCTYPE.
pt_br: Esperando um subconjunto interno ou o fim da declaração DOCTYPE.
ru: Ожидается внутреннее подмножество или завершение объявления DOCTYPE.
tr: Bir iç küme veya DOCTYPE bildiriminin sonu bekleniyor.
zh_hans: 应为内部子集或 DOCTYPE 声明的结尾。
zh_hant: 應為外部子集或 DOCTYPE 宣告的結尾。

# Xml_ExpectingWhiteSpace
source: '{0}' is an unexpected token. Expecting white space.
cs: {0} je neočekávaný token. Byl očekáván prázdný znak.
de: "{0}" ist ein unerwartetes Token. Erwartet wird ein Leerraum.
es: "{0}" es un token inesperado. Se esperaba un espacio en blanco.
fr: '{0}' est un jeton inattendu. Espace blanc attendu.
it: '{0}' è un token imprevisto. È previsto uno spazio.
ja: '{0}' は予期しないトークンです。有効なトークンはスペースです。
ko: '{0}'은(는) 예기치 않은 토큰입니다. 공백이 필요합니다.
pl: Element „{0}” to nieoczekiwany token. Oczekiwano białego znaku.
pt_br: '{0}' é um token inesperado. Esperava-se espaço em branco.
ru: "{0}" не является допустимым маркером. Ожидается пробел.
tr: '{0}' beklenmeyen bir belirteç. Boşluk bekleniyor.
zh_hans: “{0}”是一个意外标记。应为空格。
zh_hant: '{0}' 是非預期的語彙基元。應為空白。

# Xml_ExternalEntityInAttValue
source: External entity '{0}' reference cannot appear in the attribute value.
cs: Odkaz na externí entitu {0} nemůže být použit v hodnotě atributu.
de: Der externe Entitätsverweis "{0}" kann nicht im Attributwert verwendet werden.
es: La referencia a la entidad externa "{0}" no puede aparecer en el valor de atributo.
fr: La référence '{0}' de l'entité externe ne peut pas s'afficher dans la valeur de l'attribut.
it: Il riferimento all'entità esterna '{0}' non può essere incluso nel valore dell'attributo.
ja: 外部エンティティ '{0}' 参照を属性値に表示することはできません。
ko: 외부 엔터티 '{0}' 참조는 특성 값에 사용할 수 없습니다.
pl: Odwołanie do zewnętrznej jednostki „{0}” nie może pojawić się w wartości atrybutu.
pt_br: A referência de entidade externa '{0}' não pode aparecer no valor de atributo.
ru: Ссылка на внешнюю сущность "{0}" не может присутствовать в значении атрибута.
tr: '{0}' dış varlığı başvurusu öznitelik değerinde bulunamaz.
zh_hans: 外部实体“{0}”引用不能出现在特性值中。
zh_hant: 外部實體 '{0}' 參考不可出現在屬性值中。

# Xml_ExternalEntityInStandAloneDocument
source: Standalone document declaration must have a value of 'no' because an external entity '{0}' is referenced.
cs: Samostatná deklarace dokumentu musí mít hodnotu no, protože se odkazuje na externí entitu {0}.
de: Die eigenständige Dokumentdeklaration muss den Wert "no" haben, da auf die externe Entität "{0}" verwiesen wird.
es: La declaración independiente del documento debe tener un valor igual a "no" porque se hace referencia a una entidad externa "{0}".
fr: La déclaration de document autonome doit avoir la valeur 'no', car une entité externe '{0}' est référencée.
it: La dichiarazione di documento autonomo deve includere il valore 'no', perché viene fatto riferimento a un'entità esterna '{0}'.
ja: 外部のエンティティ '{0}' が参照されているため、スタンドアロン ドキュメント宣言に 'no' を記述する必要があります。
ko: 외부 엔터티 '{0}'이(가) 참조되기 때문에 독립형 문서 선언의 값은 'no'여야 합니다.
pl: Autonomiczna deklaracja dokumentu musi mieć wartość „no”, ponieważ istnieją odwołania do jednostki zewnętrznej „{0}”.
pt_br: A declaração de documento autônomo deve ter o valor 'no', pois há referência a uma entidade externa '{0}'.
ru: Изолированное объявление документа должно иметь значение no, поскольку имеется ссылка на внешнюю сущность "{0}".
tr: '{0}' dış varlığına başvurulduğundan tek başına belge bildiriminin değeri 'no' olmalı.
zh_hans: 独立文档声明必须有 "no" 值，因为引用了外部实体“{0}”。
zh_hant: 因為參考的是外部實體 '{0}'，所以獨立的文件宣告必須要有 'no' 值。

# Xml_FragmentId
source: Fragment identifier '{0}' cannot be part of the system identifier '{1}'.
cs: Identifikátor fragmentu {0} nemůže být částí systémového identifikátoru {1}.
de: Der Fragmentbezeichner "{0}" darf nicht Teil des Systembezeichners "{1}" sein.
es: El identificador de fragmento "{0}" no puede ser parte del identificador de sistema "{1}".
fr: L'identificateur de fragment '{0}' ne peut pas faire partie de l'identificateur du système '{1}'.
it: L'identificatore di frammento '{0}' non può far parte dell'identificatore di sistema '{1}'.
ja: フラグメント識別子 '{0}' をシステム識別子 '{1}' の一部にすることはできません。
ko: 조각 식별자 '{0}'은(는) 시스템 식별자 '{1}'의 일부일 수 없습니다.
pl: Identyfikator fragmentu „{0}” nie może być częścią identyfikatora systemowego „{1}”.
pt_br: O identificador do fragmento '{0}' não pode ser parte do identificador do sistema '{1}'.
ru: Идентификатор фрагмента "{0}" не может быть частью системного идентификатора "{1}".
tr: '{0}' parça tanımlayıcısı '{1}' sistem tanımlayıcısının parçası olamaz.
zh_hans: 片断标识符“{0}”不能是系统标识符“{1}”的一部分。
zh_hant: 片段識別碼 '{0}' 不可是系統識別碼 '{1}' 的一部分。

# Xml_IncompatibleConformanceLevel
source: Cannot change conformance checking to {0}. Make sure the ConformanceLevel in XmlReaderSettings is set to Auto for wrapping scenarios.
cs: Nelze změnit kontrolu souladu na možnost {0}. Ujistěte se, že výčet ConformanceLevel ve třídě XmlReaderSettings je pro scénáře obalování nastaven na možnost Auto.
de: Die Übereinstimmungsprüfung kann nicht in {0} geändert werden. Stellen Sie sicher, dass ConformanceLevel in XmlReaderSettings für Szenarien mit Umschließung auf "Auto" festgelegt ist.
es: No se puede cambiar la comprobación de conformidad a {0}. Asegúrese de que ConformanceLevel en XmlReaderSettings está establecido en Auto para el ajuste de escenarios.
fr: Impossible de remplacer la vérification de conformité par {0}. Vérifiez que le ConformanceLevel de XmlReaderSettings a la valeur Auto pour l'habillage des scénarios.
it: Non è possibile modificare il controllo di conformità in {0}. Assicurarsi che ConformanceLevel in XmlReaderSettings sia impostato su Auto per scenari di wrapping.
ja: 適合性テストの設定を {0} に変更することはできません。シナリオに合ったものとなるように、XmlReaderSettings の ConformanceLevel が Auto に設定されていることを確認してください。
ko: Cannot change 규칙 검사를 {0}(으)로 변경할 수 없습니다. 래핑 시나리오에 대해 XmlReaderSettings의 ConformanceLevel이 Auto로 설정되어 있는지 확인하세요.
pl: Nie można zmienić ustawienia sprawdzania zgodności na {0}. Sprawdź, czy ustawienie ConformanceLevel (w ramach ustawień XmlReaderSettings) ma dla scenariuszy zawijania wartość Auto.
pt_br: Não é possível alterar verificação de conformidade para {0}. Verifique se ConformanceLevel em XmlReaderSettings está definido como Auto para cenários de encapsulamento.
ru: Невозможно изменить проверку соответствия на {0}. Убедитесь, что ConformanceLevel в XmlReaderSettings имеет значение Auto для случаев заключения в оболочку.
tr: Uygunluk denetimi {0} olarak değiştirilemez. XmlReaderSettings'teki ConformanceLevel'ın kapsama senaryoları için Auto olarak ayarlandığından emin olun.
zh_hans: 无法将顺应性检查更改为 {0}。请确保 XmlReaderSettings 中的 ConformanceLevel 已为换行方案设置为 Auto。
zh_hant: 無法變更對 {0} 的相符檢查。請確定 XmlReaderSettings 中的 ConformanceLevel 已設定為 Auto 以包裝情節。

# Xml_IncompleteDtdContent
source: Incomplete DTD content.
cs: Neúplný obsah DTD
de: Unvollständiger DTD-Inhalt.
es: Contenido de DTD incompleto.
fr: Contenu DTD incomplet.
it: Contenuto di DTD incompleto.
ja: DTD のコンテンツが不完全です。
ko: DTD 콘텐츠가 완전하지 않습니다.
pl: Niekompletna zawartość DTD.
pt_br: Conteúdo de DTD incompleto.
ru: Неполное содержимое DTD.
tr: Eksik DTD içeriği.
zh_hans: DTD 内容不完整。
zh_hant: DTD 內容不完整。

# Xml_IncompleteEntity
source: Incomplete entity contents.
cs: Neúplný obsah entity
de: Unvollständiger Entitätsinhalt.
es: Contenido de la entidad incompleto.
fr: Contenu d'entité incomplet.
it: Contenuto dell'entità incompleto.
ja: エンティティのコンテンツが不完全です。
ko: 엔터티 콘텐츠가 완전하지 않습니다.
pl: Niekompletna zawartość jednostki.
pt_br: Conteúdo de entidade incompleto.
ru: Неполное содержимое сущности.
tr: Eksik varlık içeriği.
zh_hans: 不完整的实体内容。
zh_hant: 實體內容不完整。

# Xml_IndentCharsNotWhitespace
source: XmlWriterSettings.{0} can contain only valid XML white space characters when XmlWriterSettings.CheckCharacters and XmlWriterSettings.NewLineOnAttributes are true.
cs: Pokud vlastnosti XmlWriterSettings.CheckCharacters a XmlWriterSettings.NewLineOnAttributes mají hodnotu true, třída XmlWriterSettings.{0} může obsahovat pouze platné prázdné znaky XML.
de: XmlWriterSettings.{0} darf nur gültige XML-Leerraumzeichen enthalten, wenn XmlWriterSettings.CheckCharacters und XmlWriterSettings.NewLineOnAttributes auf "true" festgelegt sind.
es: XmlWriterSettings.{0} solo puede contener caracteres de espacio en blanco XML válidos cuando XmlWriterSettings.CheckCharacters y XmlWriterSettings.NewLineOnAttributes son true.
fr: XmlWriterSettings.{0} peut uniquement contenir des caractères d'espace blanc XML valides quand XmlWriterSettings.CheckCharacters et XmlWriterSettings.NewLineOnAttributes ont la valeur true.
it: XmlWriterSettings.{0} può contenere solo spazi vuoti XML validi quando XmlWriterSettings.CheckCharacters e XmlWriterSettings.NewLineOnAttributes sono true.
ja: XmlWriterSettings.CheckCharacters および XmlWriterSettings.NewLineOnAttributes が true の場合は、XmlWriterSettings.{0} には有効な XML 空白文字しか使用できません。
ko: XmlWriterSettings.CheckCharacters 및 XmlWriterSettings.NewLineOnAttributes가 true인 경우 XmlWriterSettings.{0}에는 유효한 XML 공백 문자만 포함될 수 있습니다.
pl: Ustawienia XmlWriterSettings.{0} mogą zawierać tylko prawidłowe białe znaki XML, jeśli atrybuty XmlWriterSettings.CheckCharacters i XmlWriterSettings.NewLineOnAttributes mają wartość true.
pt_br: XmlWriterSettings.{0} só poderá conter caracteres de espaço em branco XML válidos quando XmlWriterSettings.CheckCharacters e XmlWriterSettings.NewLineOnAttributes forem true.
ru: XmlWriterSettings.{0} может содержать только допустимые знаки пробела XML, если XmlWriterSettings.CheckCharacters и XmlWriterSettings.NewLineOnAttributes имеют значение true (истина).
tr: XmlWriterSettings.{0}, XmlWriterSettings.CheckCharacters ve XmlWriterSettings.NewLineOnAttributes true olduğunda, yalnızca geçerli XML boşluk karakterleri içerebilir.
zh_hans: XmlWriterSettings。如果 XmlWriterSettings.CheckCharacters 和 XmlWriterSettings.NewLineOnAttributes 为 true，则 {0} 只能包含有效的 XML 空格字符。
zh_hant: XmlWriterSettings。當 XmlWriterSettings.CheckCharacters 及 XmlWriterSettings.NewLineOnAttributes 為 True 時，{0} 僅可包含有效的 XML 空白字元。

# Xml_InternalError
source: An internal error has occurred.
cs: Došlo k vnitřní chybě.
de: Ein interner Fehler ist aufgetreten.
es: Error interno.
fr: Une erreur interne s'est produite.
it: Si è verificato un errore interno.
ja: 内部エラーが発生しました。
ko: 내부 오류가 발생했습니다.
pl: Wystąpił błąd wewnętrzny.
pt_br: Erro interno.
ru: Внутренняя ошибка.
tr: Bir iç hata oluştu.
zh_hans: 发生内部错误。
zh_hant: 發生內部錯誤。

# Xml_InvalidAttributeType
source: '{0}' is an invalid attribute type.
cs: {0} je neplatný typ atributu.
de: "{0}" ist ein ungültiger Attributtyp.
es: "{0}" es un tipo de atributo no válido.
fr: '{0}' est un type d'attribut non valide.
it: '{0}' è un tipo di attributo non valido.
ja: '{0}' は無効な属性の型です。
ko: '{0}'은(는) 잘못된 특성 형식입니다.
pl: Element „{0}” jest nieprawidłowym typem atrybutu.
pt_br: '{0}' é um tipo de atributo inválido.
ru: "{0}" не является допустимым типом атрибута.
tr: '{0}', geçersiz öznitelik türü.
zh_hans: “{0}”是无效的特性类型。
zh_hant: {0} 是無效的屬性類型。

# Xml_InvalidAttributeType1
source: Invalid attribute type.
cs: Neplatný typ atributu
de: Ungültiger Attributtyp.
es: Tipo de atributo no válido.
fr: Type d'attribut non valide.
it: Il tipo di attributo non è valido.
ja: 属性の型が無効です。
ko: 특성 형식이 잘못되었습니다.
pl: Nieprawidłowy typ atrybutu.
pt_br: Tipo de atributo inválido.
ru: Недопустимый тип атрибута.
tr: Öznitelik türü geçersiz.
zh_hans: 无效的特性类型。
zh_hant: 屬性類型無效。

# Xml_InvalidBase64Value
source: '{0}' is not a valid Base64 text sequence.
cs: {0} není platná posloupnost textu Base64.
de: "{0}" ist keine gültige Base64-Textsequenz.
es: "{0}" no es una secuencia de texto Base64 válida.
fr: '{0}' n'est pas une séquence de texte Base64 valide.
it: '{0}' non è una sequenza di testo Base64 valida.
ja: '{0}' は有効な Base64 テキスト シーケンスではありません。
ko: '{0}'은(는) 유효한 Base64 텍스트 시퀀스가 아닙니다.
pl: Element „{0}” nie jest prawidłową sekwencją tekstu Base64.
pt_br: '{0}' não é uma sequência de texto Base64 válida.
ru: "{0}" не является допустимой для Base64 текстовой последовательностью.
tr: '{0}', geçerli bir Base64 metin düzeni değil.
zh_hans: “{0}”不是有效的 Base64 文本序列。
zh_hant: '{0}' 不是有效的 Base64 文字序列。

# Xml_InvalidBinHexValue
source: '{0}' is not a valid BinHex text sequence.
cs: {0} není platná posloupnost textu BinHex.
de: "{0}" ist keine gültige BinHex-Textsequenz.
es: "{0}" no es una secuencia de texto BinHex válida.
fr: '{0}' n'est pas une séquence de texte BinHex valide.
it: '{0}' non è una sequenza di testo BinHex valida.
ja: '{0}' は有効な BinHex テキスト シーケンスではありません。
ko: '{0}'은(는) 유효한 BinHex 텍스트 시퀀스가 아닙니다.
pl: Element „{0}” nie jest prawidłową sekwencją tekstu BinHex.
pt_br: '{0}' não é uma sequência de texto BinHex válida.
ru: "{0}" не является допустимой для BinHex текстовой последовательностью.
tr: '{0}', geçerli bir BinHex metin düzeni değil.
zh_hans: “{0}”不是有效的 BinHex 文本序列。
zh_hant: '{0}' 不是有效的 BinHex 文字序列。

# Xml_InvalidBinHexValueOddCount
source: '{0}' is not a valid BinHex text sequence. The sequence must contain an even number of characters.
cs: {0} není platná posloupnost textu BinHex. Sekvence musí obsahovat sudý počet znaků.
de: "{0}" ist keine gültige BinHex-Textsequenz. Die Sequenz muss eine gerade Anzahl von Zeichen enthalten.
es: "{0}" no es una secuencia de texto BinHex válida. La secuencia debe contener un número par de caracteres.
fr: '{0}' n'est pas une séquence de texte BinHex valide. La séquence doit contenir un nombre pair de caractères.
it: '{0}' non è una sequenza di testo BinHex valida. La sequenza deve includere un numero pari di caratteri.
ja: '{0}' は、有効な BinHex テキスト シーケンスではありません。シーケンスの文字数は偶数個である必要があります。
ko: '{0}'은(는) 유효한 BinHex 텍스트 시퀀스가 아닙니다. 시퀀스에는 짝수 개의 문자가 포함되어야 합니다.
pl: Element „{0}” nie jest prawidłową sekwencją tekstu BinHex. Sekwencja musi składać się z parzystej liczby znaków.
pt_br: '{0}' não é uma sequência de texto BinHex válida. A sequência deve conter um número par de caracteres.
ru: "{0}" не является допустимой для BinHex текстовой последовательностью. Последовательность должна содержать четное число символов.
tr: '{0}', geçerli bir BinHex metin sıralaması değil. Sıralamanın çift sayıda karakter içermesi gerekir.
zh_hans: “{0}”不是有效的 BinHex 文本序列。序列必须包含偶数数目的字符串。
zh_hant: '{0}' 不是有效的 BinHex 文字序列。序列必須包含數量均等的字元。

# Xml_InvalidCDataChars
source: Cannot have ']]>' inside an XML CDATA block.
cs: Řetězec ]]> nemůže být uvnitř bloku CDATA kódu XML.
de: "]]>" darf sich nicht innerhalb eines XML-CDATA-Blocks befinden.
es: No puede tener "]]>" dentro de un bloque XML CDATA.
fr: Impossible d'avoir ']]>' dans un bloc XML CDATA.
it: All'interno di un blocco CDATA XML non può essere presente ']]>'.
ja: XML CDATA ブロック内部に ']]>' を含めることはできません。
ko: XML CDATA 블록 안에 ']]>' 기호를 포함할 수 없습니다.
pl: Wewnątrz bloku XML CDATA nie może znajdować się „]]>”.
pt_br: Não é possível haver ']]>' dentro de um bloco XML CDATA.
ru: "]]>" не может находиться внутри блока CDATA XML.
tr: XML CDATA bloğu içinde ']]>' bulunamaz.
zh_hans: XML CDATA 块中不能有“]]>”。
zh_hant: 在 XML CDATA 區塊內不可有 ']]>'。

# Xml_InvalidCharInThisEncoding
source: Invalid character in the given encoding.
cs: Neplatný znak v zadaném kódování
de: Ungültiges Zeichen in der angegebenen Codierung.
es: Carácter no válido en la codificación proporcionada.
fr: Il existe un caractère non valide dans l'encodage donné.
it: Carattere non valido nella codifica specificata.
ja: 指定されたエンコードに無効な文字があります。
ko: 지정한 인코딩에 잘못된 문자가 있습니다.
pl: Nieprawidłowy znak w danym kodowaniu.
pt_br: Caractere inválido na codificação fornecida.
ru: Недопустимый символ для указанной кодировки.
tr: Verilen kodlamada geçersiz karakter var.
zh_hans: 给定编码中的字符无效。
zh_hant: 指定編碼中的字元無效。

# Xml_InvalidCharacter
source: '{0}', hexadecimal value {1}, is an invalid character.
cs: Znak {0} (šestnáctková hodnota {1}) je neplatný.
de: "{0}", Hexadezimalwert {1}, ist ein ungültiges Zeichen.
es: "{0}", valor hexadecimal {1}, es un carácter no válido.
fr: '{0}', valeur hexadécimale {1}, est un caractère non valide.
it: Il carattere '{0}' con valore esadecimale {1} non è valido.
ja: '{0}' (16 進数値 {1}) は無効な文字です。
ko: '{0}', 16진수 값 {1}은(는) 잘못된 문자입니다.
pl: Element „{0}”, szesnastkowa wartość {1}, jest nieprawidłowym znakiem.
pt_br: '{0}', valor hexadecimal {1}, é um caractere inválido.
ru: "{0}", шестнадцатеричное значение {1}, является недопустимым символом.
tr: '{0}' (onaltılık değeri {1}), geçersiz bir karakter.
zh_hans: “{0}”(十六进制值 {1})是无效的字符。
zh_hant: 十六進位值為 {1} 的 '{0}' 是無效字元。

# Xml_InvalidCharsInIndent
source: XmlWriterSettings.{0} can contain only valid XML text content characters when XmlWriterSettings.CheckCharacters is true. {1}
cs: Pokud má vlastnost XmlWriterSettings.CheckCharacters hodnotu true, třída XmlWriterSettings.{0} může obsahovat pouze platné znaky obsahu textu XML. {1}
de: XmlWriterSettings.{0} darf nur gültige XML-Textinhaltszeichen enthalten, wenn XmlWriterSettings.CheckCharacters auf "true" festgelegt ist. {1}
es: XmlWriterSettings.{0} solo puede contener caracteres de texto XML válidos cuando XmlWriterSettings.CheckCharacters es true. {1}
fr: XmlWriterSettings.{0} peut uniquement contenir des caractères de contenu de texte XML valides quand XmlWriterSettings.CheckCharacters a la valeur true. {1}
it: XmlWriterSettings.{0} può contenere solo caratteri di contenuto testo XML validi quando XmlWriterSettings.CheckCharacters è true. {1}
ja: XmlWriterSettings.CheckCharacters が true の場合は、XmlWriterSettings.{0} には有効な XML テキスト コンテンツ文字しか使用できません。{1}
ko: XmlWriterSettings.CheckCharacters가 true인 경우 XmlWriterSettings.{0}에는 유효한 XML 텍스트 콘텐츠 문자만 포함될 수 있습니다. {1}
pl: Element XmlWriterSettings.{0} może zawierać tylko prawidłowe znaki zawartości tekstu XML, jeśli element XmlWriterSettings.CheckCharacters ma wartość true (prawda). {1}
pt_br: XmlWriterSettings.{0} só poderá conter caracteres de conteúdo de texto XML válidos quando XmlWriterSettings.CheckCharacters for true. {1}
ru: XmlWriterSettings.{0} может содержать только допустимое текстовое содержимое XML, если XmlWriterSettings.CheckCharacters имеет значение true (истина). {1}
tr: XmlWriterSettings.{0}, XmlWriterSettings.CheckCharacters true olduğunda yalnızca geçerli XML metin içeriği karakterleri içerebilir. {1}
zh_hans: XmlWriterSettings。如果 XmlWriterSettings.CheckCharacters 为 true，则 {0} 只能包含有效的 XML 文本内容字符。{1}
zh_hant: XmlWriterSettings。當 XmlWriterSettings.CheckCharacters 為 True 時，{0} 僅可包含 XML 文字內容字元。{1}
