Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_XmlPrefix
source: Prefix "xml" is reserved for use by XML and can be mapped only to namespace name "http://www.w3.org/XML/1998/namespace".
cs: Předpona xml je vyhrazena pro použití v kódu XML a lze ji mapovat pouze na název oboru názvů http://www.w3.org/XML/1998/namespace.
de: Das Präfix "xml" ist für XML reserviert und kann nur dem Namespacenamen "http://www.w3.org/XML/1998/namespace" zugeordnet werden.
es: El prefijo "xml" está reservado para su uso en XML y solo puede asignarse al nombre de espacio de nombres "http://www.w3.org/XML/1998/namespace".
fr: Le préfixe "xml" est réservé au langage XML. En outre, il peut être mappé uniquement au nom d'espace de noms "http://www.w3.org/XML/1998/namespace".
it: Il prefisso "xml" è riservato al linguaggio XML ed è possibile eseguirne il mapping solo al nome dello spazio dei nomi "http://www.w3.org/XML/1998/namespace".
ja: プレフィックス "xml" は XML 用に予約されています。また、これは "http://www.w3.org/XML/1998/namespace" 名前空間にしかマップできません。
ko: 접두사 "xml"은 XML에서 사용하도록 예약된 것이며 네임스페이스 이름 "http://www.w3.org/XML/1998/namespace"로만 매핑할 수 있습니다.
pl: Prefiks „xml” został zarezerwowany do użycia na potrzeby języka XML i można go mapować tylko na nazwę przestrzeni nazw „http://www.w3.org/XML/1998/namespace”.
pt_br: O prefixo "xml" é reservado para XML e só pode ser mapeado para o nome de namespace "http://www.w3.org/XML/1998/namespace".
ru: Префикс xml зарезервирован для использования XML и может быть сопоставлен только пространству имен "http://www.w3.org/XML/1998/namespace".
tr: "xml" öneki XML tarafından kullanılmak üzere ayrılmıştır ve yalnızca "http://www.w3.org/XML/1998/namespace" ad alanı adına eşlenebilir.
zh_hans: 前缀 "xml" 保留给 XML 使用，而且只能映射到命名空间名称 "http://www.w3.org/XML/1998/namespace"。
zh_hant: 前置詞 "xml" 已保留供 XML 使用，且僅可對應至命名空間 "http://www.w3.org/XML/1998/namespace"。

# Xml_XmlnsBelongsToReservedNs
source: The 'xmlns' attribute is bound to the reserved namespace 'http://www.w3.org/2000/xmlns/'.
cs: Atribut xmlns je vázán k vyhrazenému oboru názvů http://www.w3.org/2000/xmlns/.
de: Das Attribut "xmlns" ist an den reservierten Namespace "http://www.w3.org/2000/xmlns/" gebunden.
es: El atributo "xmlns" está enlazado a un espacio de nombres reservado "http://www.w3.org/2000/xmlns/".
fr: L'attribut 'xmlns' est lié à l'espace de noms réservé 'http://www.w3.org/2000/xmlns/'.
it: L'attributo 'xmlns' è associato allo spazio dei nomi riservato 'http://www.w3.org/2000/xmlns/'.
ja: 'xmlns' 属性は予約された名前空間 'http://www.w3.org/2000/xmlns/' にバインドされます。
ko: 'xmlns' 특성이 예약된 네임스페이스 'http://www.w3.org/2000/xmlns/'에 바인딩되어 있습니다.
pl: Atrybut „xmlns” jest związany z zarezerwowaną przestrzenią nazw „http://www.w3.org/2000/xmlns/”.
pt_br: O atributo 'xmlns' está associado ao namespace reservado 'http://www.w3.org/2000/xmlns/'.
ru: Атрибут xmlns привязан к зарезервированному пространству имен "http://www.w3.org/2000/xmlns/".
tr: 'xmlns' özniteliği ayrılmış 'http://www.w3.org/2000/xmlns/' ad alanına bağlı.
zh_hans: "xmlns" 特性被绑定到保留的命名空间 "http://www.w3.org/2000/xmlns/"。
zh_hant: 已將 'xmlns' 屬性繫結至保留的命名空間 'http://www.w3.org/2000/xmlns/'。

# Xml_XmlnsPrefix
source: Prefix "xmlns" is reserved for use by XML.
cs: Předpona xmlns je vyhrazena pro použití v kódu XML.
de: Das Präfix "xmlns" ist für XML reserviert.
es: El prefijo "xmlns" está reservado para su uso en XML.
fr: L'utilisation du préfixe "xmlns" est réservée à XML.
it: Il prefisso "xmlns" è riservato al linguaggio XML.
ja: プレフィックス "xmlns" は XML 用に予約されています。
ko: 접두사 "xmlns"는 XML에서 사용하도록 예약된 것입니다.
pl: Prefiks „xmlns” został zarezerwowany do użycia na potrzeby języka XML.
pt_br: O prefixo "xmlns" é reservado para XML.
ru: Префикс xmlns зарезервирован для использования XML.
tr: "xmlns" öneki XML tarafından kullanılmak üzere ayrılmıştır.
zh_hans: 前缀 "xmlns" 保留给 XML 使用。
zh_hant: 前置詞 "xmlns" 保留供 XML 使用。

# Xnr_ResolveEntity
source: The node is not an expandable 'EntityReference' node.
cs: Uzel není rozbalitelným uzlem EntityReference.
de: Der Knoten ist kein erweiterbarer EntityReference-Knoten.
es: El nodo no es un nodo de tipo "EntityReference" que se pueda expandir.
fr: Le nœud n'est pas un nœud 'EntityReference' qui peut être développé.
it: Il nodo non è un nodo 'EntityReference' espandibile.
ja: このノードは、展開可能な 'EntityReference' ノードではありません。
ko: 노드가 확장 가능한 'EntityReference' 노드가 아닙니다.
pl: Ten węzeł nie jest rozwijalnym węzłem „EntityReference”.
pt_br: O nó não é um nó 'EntityReference' expansível.
ru: Узел не является расширяемым узлом EntityReference.
tr: Düğüm, genişletilebilir 'EntityReference' düğümü değil.
zh_hans: 该节点不是可扩展的 "EntityReference" 节点。
zh_hant: 節點不是可展開的 'EntityReference' 節點。

# Xp_BadQueryObject
source: This is an invalid object. Only objects returned from Compile() can be passed as input.
cs: Toto je neplatný objekt. Jako vstup lze předat pouze objekty vrácené funkcí Compile().
de: Dies ist ein ungültiges Objekt. Nur Objekte, die von Compile() zurückgegeben werden, können als Eingabe übergeben werden.
es: Objeto no válido. solo los objetos devueltos de Compile() pueden pasar como entrada.
fr: Objet non valide. Seuls les objets retournés à partir de Compile() peuvent être passés en tant qu'entrée.
it: Questo oggetto non è valido. È possibile passare come input solo gli oggetti restituiti da Compile().
ja: これは無効なオブジェクトです。Compile() から返されたオブジェクトのみが input として渡されます。
ko: 개체가 잘못되었습니다. Compile()에서 반환된 개체만 입력으로 전달될 수 있습니다.
pl: To jest nieprawidłowy obiekt. Tylko obiekty zwrócone przez element Compile() mogą być przekazywane jako elementy wejściowe.
pt_br: Objeto inválido. Somente objetos retornados de Compile() podem ser passados como entrada.
ru: Не является допустимым объектом. В качестве входных данных могут передаваться только объекты, возвращаемые из Compile().
tr: Bu geçersiz bir nesne. Compile() tarafından döndürülen nesneler giriş olarak geçirilebilir.
zh_hans: 这是一个无效的对象。只有从 Compile()返回的对象才能作为输入值传递。
zh_hant: 出現無效的物件。只有從 Compile() 傳回的物件才可傳遞為輸入。

# Xp_CurrentNotAllowed
source: The 'current()' function cannot be used in a pattern.
cs: Funkci current() nelze používat ve vzoru.
de: Die Funktion "current()" kann in einem Muster nicht verwendet werden.
es: La función "current()" no se puede utilizar en un patrón.
fr: La fonction 'current()' ne peut pas être utilisée dans un modèle.
it: Non è possibile usare la funzione 'current()' in un criterio.
ja: 'current()' 関数をパターン内で使用することはできません。
ko: 'current()' 함수는 패턴으로 사용할 수 없습니다.
pl: Funkcja „current()” nie może być używana we wzorcu.
pt_br: A função 'current()' não pode ser usada em um padrão.
ru: Функция current() не может использоваться в шаблоне.
tr: 'current()' işlevi desende kullanılamaz.
zh_hans: “current()”函数不能在模式中使用。
zh_hant: 'current()' 函式無法用於模式。

# Xp_ExprExpected
source: '{0}' is an invalid expression.
cs: {0} je neplatný výraz.
de: "{0}" ist ein ungültiger Ausdruck.
es: "{0}" no es una expresión válida.
fr: '{0}' est une expression non valide.
it: '{0}' è un'espressione non valida.
ja: '{0}' は無効な式です。
ko: '{0}'은(는) 잘못된 식입니다.
pl: Element „{0}” jest nieprawidłowym wyrażeniem.
pt_br: '{0}' é uma expressão inválida.
ru: "{0}" является недопустимым выражением.
tr: '{0}', geçersiz bir ifade.
zh_hans: “{0}”是无效表达式。
zh_hant: '{0}' 是無效的運算式。

# Xp_FunctionFailed
source: Function '{0}()' has failed.
cs: Funkce {0}() selhala.
de: Fehler bei der Funktion "{0}()".
es: Error en la función "{0}()".
fr: Échec de la fonction '{0}()'.
it: La funzione '{0}()' non è riuscita.
ja: 関数 '{0}()' が失敗しました。
ko: '{0}()' 함수가 실패했습니다.
pl: Wystąpił błąd funkcji „{0}()”.
pt_br: Falha na função '{0}()'.
ru: Сбой функции "{0}()".
tr: '{0}()' işlevi başarısız oldu.
zh_hans: 函数“{0}()”失败。
zh_hant: 函式 '{0}()' 失敗。

# Xp_InvalidArgument
source: '{0}' function in '{1}' has an invalid argument. Possibly ')' is missing.
cs: Funkce {0} v {1} má neplatný argument. Pravděpodobně nebyl nalezen znak ).
de: Die Funktion "{0}" in "{1}" enthält ein ungültiges Argument. Möglicherweise fehlt ")".
es: La función "{0}" en "{1}" tiene un argumento no válido. Posiblemente falte ")".
fr: La fonction '{0}' dans '{1}' a un argument non valide. ')' est peut-être manquant.
it: La funzione '{0}' in '{1}' contiene un argomento non valido. Probabilmente manca ')'.
ja: '{1}' の '{0}' 関数の引数が無効です。')' が欠落している可能性があります。
ko: '{1}'에서 '{0}' 함수의 인수가 잘못되었습니다. ')'가 없습니다.
pl: Argument funkcji „{0}” w elemencie „{1}” jest nieprawidłowy. Prawdopodobnie brakuje znaku „)”.
pt_br: A função '{0}' em '{1}' tem um argumento inválido. É possível que ')' esteja faltando.
ru: Функция "{0}" в "{1}" содержит недопустимый аргумент. Возможно, не хватает ")".
tr: '{1}' içindeki '{0}' işlevinde geçersiz bir bağımsız değişken var. Büyük olasılıkla ')' eksik.
zh_hans: “{1}”中的“{0}”函数包含无效的参数。可能缺少 ")"。
zh_hant: '{1}' 中的函式 '{0}' 有無效的引數。可能遺漏 ')'。

# Xp_InvalidArgumentType
source: The argument to function '{0}' in '{1}' cannot be converted to a node-set.
cs: Argument funkce {0} v {1} nejde převést na sadu uzlů.
de: Das Argument für die Funktion "{0}" in "{1}" kann nicht in einen NodeSet konvertiert werden.
es: El argumento para la función "{0}" en "{1}" no se puede convertir en un conjunto de nodos.
fr: L'argument pour la fonction '{0}' dans '{1}' ne peut pas être converti en collection de nœuds.
it: Non è possibile convertire in un set di nodi l'argomento della funzione '{0}' in '{1}'.
ja: '{1}' の関数 '{0}' に対する引数をノードセットに変換することはできません。
ko: '{1}'의 함수 '{0}'에 대한 인수는 노드 집합으로 변환할 수 없습니다.
pl: Nie można przekonwertować argumentu funkcji „{0}” w elemencie „{1}” na zestaw węzłów.
pt_br: O argumento para a função '{0}' em '{1}' não pode ser convertido em um conjunto de nós.
ru: Невозможно преобразовать аргумент функции "{0}" в "{1}" в NodeSet.
tr: '{1}' içindeki '{0}' işlevinin bağımsız değişkeni düğüm kümesine dönüştürülemez.
zh_hans: 无法将“{1}”中函数“{0}”的参数转换为节点集。
zh_hant: '{1}' 中函式 '{0}' 的引數無法轉換為節點集。

# Xp_InvalidKeyPattern
source: '{0}' is an invalid key pattern. It either contains a variable reference or 'key()' function.
cs: {0} je neplatný vzor klíče. Obsahuje buď odkaz na proměnnou, nebo funkci key().
de: "{0}" ist ein ungültiges Schlüsselmuster. Es enthält einen Variablenverweis oder eine key()-Funktion.
es: "{0}" es un patrón de clave no válido. Contiene una referencia de variable o una función "key()".
fr: '{0}' est un modèle de clé non valide. Il contient soit une référence de variable, soit une fonction 'key()'.
it: Il criterio di chiave '{0}' non è valido. Contiene un riferimento a una variabile o una funzione 'key()'.
ja: '{0}' は無効なキー パターンです。変数参照または 'key()' 関数が含まれています。
ko: '{0}'은(는) 잘못된 키 패턴입니다. 변수 참조 또는 'key()' 함수가 포함되어 있습니다.
pl: Element „{0}” jest nieprawidłowym wzorcem klucza. Zawiera on albo odwołanie do zmiennej, albo funkcję „key()”.
pt_br: '{0}' é um padrão de chave inválido. Ele tem uma referência variável ou uma função 'key()'.
ru: {0}" является недопустимым шаблоном ключа, поскольку содержит переменную ссылку или функцию key().
tr: {0}, geçersiz bir anahtar deseni. Değişken başvuru veya 'key()' işlevi içeriyor.
zh_hans: “{0}”是无效的键模式。它要么包含变量引用，要么包含“key()”函数。
zh_hant: '{0}' 是無效的索引鍵模式。其包含變數參考或 'key()' 函式。

# Xp_InvalidName
source: '{0}' has an invalid qualified name.
cs: {0} má neplatný kvalifikovaný název.
de: "{0}" hat einen ungültigen qualifizierten Namen.
es: "{0}" tiene un nombre completo no válido.
fr: '{0}' a un nom qualifié non valide.
it: Il nome completo di '{0}' non è valido.
ja: '{0}' の限定名が無効です。
ko: '{0}'의 정규화된 이름이 잘못되었습니다.
pl: Element „{0}” ma nieprawidłową nazwę kwalifikowaną.
pt_br: '{0}' tem um nome qualificado inválido.
ru: "{0}" имеет недопустимое полное имя.
tr: '{0}', geçersiz bir nitelenmiş ada sahip.
zh_hans: “{0}”具有无效的限定名。
zh_hant: '{0}' 的限定名稱無效。

# Xp_InvalidNumArgs
source: Function '{0}' in '{1}' has an invalid number of arguments.
cs: Funkce {0} v {1} má neplatný počet argumentů.
de: Die Funktion "{0}" in "{1}" hat eine ungültige Anzahl von Argumenten.
es: La función "{0}" en "{1}" tiene un número de argumentos no válido.
fr: La fonction '{0}' dans '{1}' a un nombre d'arguments non valide.
it: Il numero di argomenti della funzione '{0}' in '{1}' non è valido.
ja: '{1}' の関数 '{0}' に含まれている引数の数が無効です。
ko: '{1}'에서 '{0}' 함수의 인수 개수가 잘못되었습니다.
pl: Funkcja „{0}” w elemencie „{1}” ma nieprawidłową liczbę argumentów.
pt_br: Número inválido de argumentos na função '{0}' em '{1}'.
ru: Недопустимое число аргументов функции "{0}" в "{1}".
tr: '{1}' içindeki '{0}' işlevinde geçersiz sayıda bağımsız değişken var.
zh_hans: “{1}”中的函数“{0}”的参数数目无效。
zh_hant: '{1}' 中的函式 '{0}' 有無效的引數數目。

# Xp_InvalidPattern
source: '{0}' is an invalid XSLT pattern.
cs: {0} je neplatný vzor XSLT.
de: "{0}" ist ein ungültiges XSLT-Muster.
es: "{0}" es un patrón XSLT no válido.
fr: '{0}' est un modèle XSLT non valide.
it: '{0}' è un criterio XSLT non valido.
ja: '{0}' は無効な XSLT パターンです。
ko: '{0}'은(는) 잘못된 XSLT 패턴입니다.
pl: Element „{0}” jest nieprawidłowym wzorcem XSLT.
pt_br: '{0}' é um padrão XSLT inválido.
ru: "{0}" не является допустимым шаблоном XSLT.
tr: '{0}', geçersiz bir XSLT deseni.
zh_hans: “{0}”是无效的 XSLT 模式。
zh_hant: '{0}' 是無效的 XSLT 模式。

# Xp_InvalidToken
source: '{0}' has an invalid token.
cs: {0} obsahuje neplatný token.
de: "{0}" ist ein ungültiges Token.
es: "{0}" tiene un token no válido.
fr: '{0}' a un jeton non valide.
it: '{0}' contiene un token non valido.
ja: '{0}' のトークンが無効です。
ko: '{0}'의 토큰이 잘못되었습니다.
pl: Element „{0}” ma nieprawidłowy token.
pt_br: '{0}' tem um token inválido.
ru: "{0}" имеет недопустимый маркер.
tr: '{0}', geçersiz bir belirtece sahip.
zh_hans: “{0}”具有无效的标记。
zh_hant: '{0}' 有無效的語彙基元。

# Xp_NoContext
source: Namespace Manager or XsltContext needed. This query has a prefix, variable, or user-defined function.
cs: Je vyžadován obor názvů Manager nebo XsltContext. Tento dotaz obsahuje předponu, proměnnou nebo funkci definovanou uživatelem.
de: Der Namespace-Manager oder XsltContext ist erforderlich. Diese Abfrage enthält ein Präfix, eine Variable oder eine benutzerdefinierte Funktion.
es: Es necesario el administrador de espacios de nombres o XsltContext. Esta consulta tiene un prefijo, una variable o una función definida por el usuario.
fr: Le gestionnaire d'espaces de noms ou XsltContext est obligatoire. Cette requête a un préfixe, une variable ou une fonction définie par l'utilisateur.
it: È necessario il gestore dello spazio dei nomi o XsltContext. Questa query contiene un prefisso, una variabile o una funzione definita dall'utente.
ja: 名前空間マネージャーまたは XsltContext が必要です。このクエリには、プレフィックス、変数、またはユーザー定義の関数があります。
ko: 네임스페이스 관리자 또는 XsltContext가 필요합니다. 이 쿼리에는 접두사, 변수 또는 사용자 정의 함수가 있습니다.
pl: Niezbędny jest menedżer przestrzeni nazw lub element XsltContext. To zapytanie zawiera prefiks, zmienną lub funkcję zdefiniowaną przez użytkownika.
pt_br: Gerenciador de Namespace ou XsltContext exigido. Esta consulta tem prefixo, variável ou função definida pelo usuário.
ru: Требуется диспетчер пространств имен или XsltContext. Этот запрос содержит префикс, переменную или определенную пользователем функцию.
tr: Namespace Manager veya XsltContext gerekli. Bu sorguda önek, değişken veya kullanıcı tanımlı işlev var.
zh_hans: 需要命名空间管理器或 XsltContext。此查询具有前缀、变量或用户定义的函数。
zh_hant: 需要命名空間管理員或 XsltContext。此查詢含有前置詞、變數，或是使用者定義的函式。

# Xp_NodeSetExpected
source: Expression must evaluate to a node-set.
cs: Výraz musí být vyhodnocen jako sada uzlů.
de: Der Ausdruck muss zu einem Knotensatz ausgewertet werden.
es: La expresión se debe evaluar en un conjunto de nodos.
fr: L'expression doit être évaluée pour donner une collection de nœuds.
it: L'espressione deve restituire un set di nodi.
ja: 式はノードセットに対して評価する必要があります。
ko: 식은 노드 집합이 되어야 합니다.
pl: Wyrażenie musi zwrócić zestaw węzłów.
pt_br: A expressão deve ser avaliada para um conjunto de nós.
ru: Результатом выражения должен быть NodeSet.
tr: İfade bir düğüm kümesi sonucu vermeli.
zh_hans: 表达式的计算结果必须为节点集。
zh_hant: 運算式必須得出節點集。

# Xp_NotSupported
source: The XPath query '{0}' is not supported.
cs: Dotaz XPath {0} není podporován.
de: Die XPath-Abfrage "{0}" wird nicht unterstützt.
es: La consulta XPath "{0}" no es compatible.
fr: La requête XPath '{0}' n'est pas prise en charge.
it: La query XPath '{0}' non è supportata.
ja: XPath クエリ '{0}' はサポートされていません。
ko: XPath 쿼리 '{0}'이(가) 지원되지 않습니다.
pl: Zapytanie XPath „{0}” jest nieobsługiwane.
pt_br: Não há suporte para a consulta XPath '{0}'.
ru: Запрос XPath "{0}" не поддерживается.
tr: '{0}' XPath sorgusu desteklenmiyor.
zh_hans: 不支持 XPath 查询“{0}”。
zh_hant: 不支援 XPath 查詢 '{0}'。

# Xp_QueryTooComplex
source: The xpath query is too complex.
cs: Dotaz XPath je příliš složitý.
de: Die XPath-Abfrage ist zu komplex.
es: La consulta de xpath es demasiado compleja.
fr: La requête xpath est trop complexe.
it: La query xpath è troppo complessa.
ja: XPath クエリが複雑すぎます。
ko: Xpath 쿼리가 너무 복잡합니다.
pl: Zapytanie XPath jest zbyt złożone.
pt_br: A consulta XPath é muito complexa.
ru: Запрос xpath является слишком сложным.
tr: Xpath sorgusu çok karmaşık.
zh_hans: Xpath 查询过于复杂。
zh_hant: Xpath 查詢太過複雜。

# Xp_UnclosedString
source: This is an unclosed string.
cs: Toto je neuzavřený řetězec.
de: Dies ist eine nicht geschlossene Zeichenfolge.
es: Esta es una cadena sin cerrar.
fr: Chaîne non fermée.
it: Questa è una stringa non risolta.
ja: 閉じていない文字列です。
ko: 문자열이 닫히지 않았습니다.
pl: Jest to niezamknięty ciąg.
pt_br: Cadeia de caracteres não fechada.
ru: Является незавершенной строкой.
tr: Bu kapatılmamış bir dize.
zh_hans: 这是一个未闭合的字符串。
zh_hant: 這是未封閉的字串。

# Xp_UndefFunc
source: The function '{0}()' is undefined.
cs: Funkce {0}() je nedefinovaná.
de: Die Funktion "{0}()" ist nicht definiert.
es: Función "{0}()" no definida.
fr: La fonction '{0}()' n'est pas définie.
it: La funzione '{0}()' non è definita.
ja: 関数 '{0}()' は定義されていません。
ko: 함수 '{0}()'이(가) 정의되지 않았습니다.
pl: Niezdefiniowana funkcja „{0}()”.
pt_br: A função '{0}()' não está definida.
ru: Функция "{0}()" не определена.
tr: '{0}()' işlevi tanımlı değil.
zh_hans: 函数“{0}()”未定义。
zh_hant: 未定義函式 '{0}()'。

# Xp_UndefVar
source: The variable '{0}' is undefined.
cs: Proměnná {0} je nedefinovaná.
de: Die Variable "{0}" ist nicht definiert.
es: Variable "{0}" no definida.
fr: La variable '{0}' n'est pas définie.
it: La variabile '{0}' non è definita.
ja: 変数 '{0}' は定義されていません。
ko: 변수 '{0}'이(가) 정의되지 않았습니다.
pl: Niezdefiniowana zmienna „{0}”.
pt_br: A variável '{0}()' não está definida.
ru: Переменная "{0}" не определена.
tr: '{0}' değişkeni tanımlı değil.
zh_hans: 变量“{0}”未定义。
zh_hant: 未定義變數 '{0}'。

# Xp_UndefinedXsltContext
source: XsltContext is needed for this query because of an unknown function.
cs: Pro tento dotaz je vzhledem k neznámé funkci vyžadován kontext XsltContext.
de: XsltContext ist aufgrund einer unbekannten Funktion für diese Abfrage erforderlich.
es: Se necesita XsltContext para esta consulta porque hay una función desconocida.
fr: XsltContext est nécessaire pour cette requête en raison d'une fonction inconnue.
it: Per questa query è necessario XsltContext a causa di una funzione sconosciuta.
ja: 不明な関数があるため、このクエリには XsltContext が必要です。
ko: 알 수 없는 함수 때문에 이 쿼리에 XsltContext가 필요합니다.
pl: Z powodu nieznanej funkcji dla tego zapytania jest wymagany element XsltContext.
pt_br: Esta consulta necessita de XsltContext devido a uma função desconhecida.
ru: Из-за присутствия неизвестной функции для этого запроса требуется XsltContext.
tr: Bilinmeyen bir işlev dolayısıyla bu sorgu için XsltContext gerekli.
zh_hans: 由于存在未知的函数，此查询需要 XsltContext。
zh_hant: 這個查詢需要 XsltContext，因為函式未知。

# Xpn_BadPosition
source: Operation is not valid due to the current position of the navigator.
cs: Operace je vzhledem k aktuální pozici navigátoru neplatná.
de: Der Vorgang ist aufgrund der aktuellen Position des Navigators ungültig.
es: La operación no es válida debido a la posición actual del explorador.
fr: L'opération est non valide en raison de la position actuelle du navigateur.
it: L'operazione non è valida a causa della posizione corrente dello strumento di spostamento.
ja: ナビゲーターの現在の位置に問題があるため、この操作は無効です。
ko: 탐색 창의 현재 상태로 인해 작업이 유효하지 않습니다.
pl: Operacja jest nieprawidłowa z powodu bieżącej pozycji nawigatora.
pt_br: A operação é inválida devido à posição atual do navegador.
ru: Операция является недопустимой из-за текущей позиции навигатора.
tr: Gezginin şu andaki konumu nedeniyle işlem geçerli değil.
zh_hans: 由于导航器的当前位置，操作无效。
zh_hant: 因為目前瀏覽器位置的問題，作業無效。

# Xpn_MissingParent
source: The current position of the navigator is missing a valid parent.
cs: Na aktuální pozici navigátoru chybí platná nadřazená položka.
de: Der aktuellen Position des Navigators fehlt ein gültiges übergeordnetes Element.
es: La posición actual del explorador no incluye un elemento primario válido.
fr: Un parent valide est manquant pour la position actuelle du navigateur.
it: Nella posizione corrente dello strumento di spostamento manca un elemento padre valido.
ja: ナビゲーターの現在の位置に、有効な親がありません。
ko: 탐색 창의 현재 위치에 유효한 부모가 없습니다.
pl: W bieżącej pozycji nawigatora brak prawidłowego elementu nadrzędnego.
pt_br: Falta um pai válido na posição atual do navegador.
ru: Текущая позиция навигатора не имеет действительного предка.
tr: Gezginin şu andaki konumunda geçerli bir üst öğe eksik.
zh_hans: 导航器的当前位置缺少有效的父对象。
zh_hant: 目前的瀏覽器位置遺失有效的父項。

# Xpn_NoContent
source: No content generated as the result of the operation.
cs: Výsledkem této operace nebylo generování žádného obsahu.
de: Als Ergebnis des Vorgangs wurde kein Inhalt generiert.
es: No se ha generado ningún contenido como resultado de la operación.
fr: L'opération n'a généré aucun contenu.
it: Non è stato generato alcun contenuto come risultato dell'operazione.
ja: 操作の結果、コンテンツは何も生成されませんでした。
ko: 작업의 결과로 콘텐츠가 생성되지 않았습니다.
pl: W wyniku operacji nie wygenerowano żadnej zawartości.
pt_br: Nenhum conteúdo gerado como resultado da operação.
ru: В результате выполнения операции содержимое создано не было.
tr: İşlemin sonucunda içerik oluşturulmadı.
zh_hans: 运算结果没有生成任何内容。
zh_hant: 沒有產生為作業結果的內容。
