Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_ConformanceLevelFragment
source: Make sure that the ConformanceLevel setting is set to ConformanceLevel.Fragment or ConformanceLevel.Auto if you want to write an XML fragment.
cs: Pokud chcete zapisovat fragment XML, ujistěte se, že nastavení ConformanceLevel je nakonfigurováno na možnost ConformanceLevel.Fragment nebo ConformanceLevel.Auto.
de: Wenn Sie ein XML-Fragment schreiben möchten, muss die ConformanceLevel-Einstellung auf ConformanceLevel.Fragment oder ConformanceLevel.Auto festgelegt werden.
es: Asegúrese de la que configuración de ConformanceLevel está definido como ConformanceLevel.Fragment o ConformanceLevel.Auto si desea escribir un fragmento XML.
fr: Vérifiez que le paramètre ConformanceLevel a la valeur ConformanceLevel.Fragment ou ConformanceLevel.Auto pour écrire un fragment XML.
it: Assicurarsi che ConformanceLevel sia impostato su ConformanceLevel.Fragment o ConformanceLevel.Auto se si vuole scrivere un frammento XML.
ja: XML フラグメントを書き込む場合は、ConformanceLevel の設定が ConformanceLevel.Fragment または ConformanceLevel.Auto になっていることを確認してください。
ko: XML 조각을 쓰려면 ConformanceLevel 설정을 ConformanceLevel.Fragment 또는 ConformanceLevel.Auto로 설정해야 합니다.
pl: Jeśli chcesz zapisać fragment XML, sprawdź, czy ustawienie ConformanceLevel ma wartość ConformanceLevel.Fragment lub ConformanceLevel.Auto.
pt_br: Verifique se a configuração ConformanceLevel foi definida como ConformanceLevel.Fragment ou ConformanceLevel.Auto se desejar gravar um fragmento XML.
ru: Чтобы иметь возможность записать фрагмент XML, ConformanceLevel должен иметь значение ConformanceLevel.Fragment или ConformanceLevel.Auto.
tr: XML parçası yazmak istiyorsanız, ConformanceLevel ayarının ConformanceLevel.Fragment veya ConformanceLevel.Auto olarak ayarlandığından emin olun.
zh_hans: 如果要编写 XML 片断，请确保 ConformanceLevel 设置已设置为 ConformanceLevel.Fragment 或 ConformanceLevel.Auto。
zh_hant: 若想撰寫 XML 片段，請確認 ConformanceLevel 設定是設定為 ConformanceLevel.Fragment 或 ConformanceLevel.Auto。

# Xml_DefaultException
source: An XML error has occurred.
cs: Došlo k chybě XML.
de: Ein XML-Fehler ist aufgetreten.
es: Error XML.
fr: Une erreur XML s'est produite.
it: Si è verificato un errore XML.
ja: XML エラーが発生しました。
ko: XML 오류가 발생했습니다.
pl: Wystąpił błąd XML.
pt_br: Ocorreu um erro XML.
ru: Возникла ошибка XML.
tr: XML hatası oluştu.
zh_hans: 发生 XML 错误。
zh_hant: 發生 XML 錯誤。

# Xml_DoubleBaseUri
source: BaseUri must be specified either as an argument of XmlReader.Create or on the XmlParserContext. If it is specified on both, it must be the same base URI.
cs: Musí být zadán identifikátor BaseUri, a to buď jako argument metody XmlReader.Create, nebo pro třídu XmlParserContext. Pokud je zadán u obou, musí se jednat o stejný základní identifikátor URI.
de: BaseUri muss als Argument von XmlReader.Create oder für XmlParserContext angegeben werden. Wird er in beiden Fällen angegeben, muss es sich um denselben Basis-URI handeln.
es: BaseUri se debe especificar como argumento de XmlReader.Create o en XmlParserContext. Si está especificado en ambos, debe ser el mismo identificador URI base.
fr: BaseUri doit être spécifié comme argument de XmlReader.Create ou de XmlParserContext. En cas de spécification sur les deux, l'URI de base doit être identique.
it: È necessario specificare BaseUri come argomento di XmlReader.Create o nell'elemento XmlParserContext. Se viene specificato in entrambi, deve essere lo stesso URI di base.
ja: BaseUri には、XmlReader.Create の引数または XmlParserContext のどちらかを指定する必要があります。両方が指定された場合は、同じベース URI を持つことになります。
ko: BaseUri는 XmlReader.Create의 인수로서 지정하거나 XmlParserContext에서 지정해야 합니다. 둘 다 지정한 경우에는 기본 URI가 같아야 합니다.
pl: Podstawowy identyfikator BaseUri musi być albo argumentem elementu XmlReader.Create, albo elementu XmlParserContext. Jeśli jest to argument dla obu tych elementów, musi być to jeden podstawowy identyfikator URI.
pt_br: BaseUri deve ser especificado como um argumento de XmlReader.Create ou no XmlParserContext. Se for especificado em ambos, deverá ser o mesmo URI base.
ru: Необходимо указать BaseUri в качестве аргумента XmlReader.Create или для XmlParserContext. В случае указания в обоих местах URI должен быть одним и тем же.
tr: BaseUri, XmlReader.Create bağımsız değişkeni olarak veya XmlParserContext üzerinde belirtilmelidir. Her ikisinde de belirtilirse, aynı base URI olmalıdır.
zh_hans: BaseUri 必须指定为 XmlReader.Create 的参数或在 XmlParserContext 上指定。如果两种情况均指定，必须指定相同的基 URI。
zh_hant: BaseUri 必須指定為 XmlReader.Create 的引數或指定於 XmlParserContext 上。若同時指定兩者，則必須在相同的基底 URI 上。

# Xml_DtdAfterRootElement
source: DTD must be defined before the document root element.
cs: Deklarace DTD musí být definována před kořenovým elementem dokumentu.
de: Die DTD muss vor dem Stammelement des Dokuments definiert werden.
es: La DTD debe definirse antes que el elemento raíz del documento.
fr: Vous devez définir le DTD avant l'élément racine du document.
it: La DTD deve essere definita prima dell'elemento radice del documento.
ja: DTD はドキュメントのルート要素の前に定義される必要があります。
ko: DTD는 문서 루트 요소보다 먼저 정의해야 합니다.
pl: Przed głównym elementem dokumentu należy zdefiniować element DTD.
pt_br: O DTD deve ser definido antes do elemento de diretório base.
ru: DTD должен быть определен до корневого элемента документа.
tr: DTD, belge kök öğesinden önce tanımlanmalı.
zh_hans: DTD 必须在文档根元素之前进行定义。
zh_hant: 必須在文件根項目之前定義 DTD。

# Xml_DtdAlreadyWritten
source: The DTD has already been written out.
cs: Deklarace DTD již byla zapsána.
de: Die DTD wurde bereits geschrieben.
es: Ya se ha escrito la DTD.
fr: Le DTD a déjà été écrit.
it: La DTD è già stata scritta.
ja: DTD は既に書き出されています。
ko: DTD가 이미 기록되었습니다.
pl: Element DTD został już zapisany.
pt_br: O DTD já foi gravado.
ru: DTD уже считан.
tr: DTD önceden yazılmış.
zh_hans: DTD 已写出。
zh_hant: DTD 已寫出。

# Xml_DtdIsProhibited
source: DTD is prohibited in this XML document.
cs: Deklarace DTD je v tomto dokumentu XML zakázána.
de: Die DTD ist in diesem XML-Dokument nicht zulässig.
es: DTD prohibida en este documento XML.
fr: DTD interdit dans ce document XML.
it: La DTD non è consentita in questo documento XML.
ja: DTD の使用はこの XML ドキュメントでは禁止されています。
ko: 이 XML 문서에서는 DTD를 사용할 수 없습니다.
pl: W tym dokumencie XML nie można używać elementu DTD.
pt_br: O DTD é proibido neste documento XML.
ru: DTD запрещен в этом документе XML.
tr: Bu XML belgesinde DTD'ye izin verilmiyor.
zh_hans: 此 XML 文档中禁用 DTD。
zh_hant: 此 XML 文件中禁止使用 DTD。

# Xml_DtdIsProhibitedEx
source: For security reasons DTD is prohibited in this XML document. To enable DTD processing set the DtdProcessing property on XmlReaderSettings to Parse and pass the settings into XmlReader.Create method.
cs: Z bezpečnostních důvodů je deklarace DTD v tomto dokumentu XML zakázána. Chcete-li povolit zpracování deklarace DTD, nastavte vlastnost DtdProcessing u třídy XmlReaderSettings na hodnotu Parse a nastavení předejte metodě XmlReader.Create.
de: DTD ist in diesem XML-Dokument aus Sicherheitsgründen nicht zulässig. Zum Aktivieren der DTD-Verarbeitung müssen Sie die DtdProcessing-Eigenschaft für XmlReaderSettings auf "Parse" festlegen und die Einstellungen an die XmlReader.Create-Methode übergeben.
es: Por razones de seguridad, la DTD está prohibida en este documento XML. Para habilitar el procesamiento de la DTD, establezca la propiedad DtdProcessing de XmlReaderSettings en Parse y pase la configuración al método XmlReader.Create.
fr: Pour des raisons de sécurité, le DTD est interdit dans ce document XML. Pour activer le traitement DTD, affectez à la propriété DtdProcessing de XmlReaderSettings la valeur Parse et passez les paramètres à la méthode XmlReader.Create.
it: Per motivi di sicurezza la DTD non è consentita in questo documento XML. Per abilitare l'elaborazione DTD, impostare la proprietà DtdProcessing in XmlReaderSettings su Parse e passare le impostazioni nel metodo XmlReader.Create.
ja: セキュリティ上の理由から、DTD はこの XML ドキュメントでは使用できません。DTD 処理を有効にするには、XmlReaderSettings の DtdProcessing プロパティを Parse に設定し、XmlReader.Create メソッドにその設定を渡してください。
ko: 보안상의 이유로 이 XML 문서에서는 DTD를 사용할 수 없습니다. DTD 처리를 사용하려면 XmlReaderSettings의 DtdProcessing 속성을 Parse로 설정하고 해당 설정을 XmlReader.Create 메서드로 전달하세요.
pl: Ze względów bezpieczeństwa w tym dokumencie XML nie można używać elementu DTD. Aby włączyć przetwarzanie elementu DTD, w elemencie XmlReaderSettings dla właściwości DtdProcessing ustaw wartość Parse, a następnie przekaż tę wartość do metody XmlReader.Create.
pt_br: Por motivo de segurança, o DTD é proibido neste documento XML. Para habilitar o processamento do DTD, defina a propriedade DtdProcessing em XmlReaderSettings como Parse e passe as configurações para o método XmlReader.Create.
ru: По соображениям безопасности использование DTD в данном XML-документе запрещено. Чтобы включить обработку DTD, установите свойство DtdProcessing в разделе XmlReaderSettings в значение Parse и передайте методу XmlReader.Create.
tr: Güvenlik açısından bu XML belgesinde DTD'ye izin verilmiyor. DTD işlemeyi etkinleştirmek için, XmlReaderSettings üzerinde DtdProcessing özelliğini Parse değerine ayarlayın ve ayarı XmlReader.Create metoduna geçirin.
zh_hans: 出于安全原因，此 XML 文档中禁止了 DTD。若要启用 DTD 处理，请将 XmlReaderSettings 上的 DtdProcessing 属性设置为 Parse，并将设置传递到 XmlReader.Create 方法中。
zh_hant: 為安全起見，在此 XML 文件中禁止使用 DTD。若要啟用 DTD 處理，請將 XmlReaderSettings 上的 DtdProcessing 屬性設定為 [剖析]，並將設定傳遞至 XmlReader.Create 方法。

# Xml_DtdNotAllowedInFragment
source: DTD is not allowed in XML fragments.
cs: Deklarace DTD není ve fragmentech XML povolena.
de: Die DTD ist in XML-Fragmenten nicht zulässig.
es: No se admite la DTD en fragmentos XML.
fr: DTD non autorisé dans les fragments XML.
it: Nella DTD non sono consentiti frammenti XML.
ja: XML フラグメントで DTD を使用することはできません。
ko: DTD는 XML 조각에서 사용할 수 없습니다.
pl: Fragmenty XML nie mogą zawierać elementów DTD.
pt_br: O DTD não é permitido em fragmentos XML.
ru: DTD запрещен во фрагментах XML.
tr: XML parçalarında DTD'ye izin verilmez.
zh_hans: XML 片断不允许 DTD。
zh_hant: XML 片段中不允許 DTD。

# Xml_DupAttributeName
source: '{0}' is a duplicate attribute name.
cs: Název {0} je duplicitní název atributu.
de: "{0}" ist ein doppelter Attributname.
es: "{0}" es un nombre de atributo duplicado.
fr: '{0}' est un nom d'attribut dupliqué.
it: '{0}' è un nome di attributo duplicato.
ja: '{0}' は重複する属性名です。
ko: '{0}'은(는) 중복 특성 이름입니다.
pl: Element „{0}” jest zduplikowaną nazwą atrybutu.
pt_br: '{0}' é um nome de atributo duplicado.
ru: "{0}" является повторяющимся именем атрибута.
tr: '{0}', yinelenen bir öznitelik adı.
zh_hans: “{0}”是重复的特性名称。
zh_hant: '{0}' 是重複的屬性名稱。

# Xml_DupXmlDecl
source: Cannot write XML declaration. WriteStartDocument method has already written it.
cs: Nelze zapsat deklaraci XML. Metoda WriteStartDocument ji již zapsala.
de: Die XML-Deklaration kann nicht geschrieben werden. Sie wurde bereits von der WriteStartDocument-Methode geschrieben.
es: No se puede escribir la declaración XML, ya se ha escrito por el método WriteStartDocument.
fr: Impossible d'écrire la déclaration XML. La méthode WriteStartDocument l'a déjà écrite.
it: Non è possibile scrivere la dichiarazione XML. È già stata scritta dal metodo WriteStartDocument.
ja: XML 宣言を書き込めません。WriteStartDocument メソッドによって既に書き込まれています。
ko: XML 선언을 쓸 수 없습니다. WriteStartDocument 메서드에서 이미 기록했습니다.
pl: Nie można zapisać deklaracji XML. Została ona już zapisana przy użyciu metody WriteStartDocument.
pt_br: Não é possível gravar declaração XML. O método WriteStartDocument já a gravou.
ru: Не удалось записать объявление XML. Оно уже записано методом WriteStartDocument.
tr: XML bildirimi yazılamıyor. WriteStartDocument metodu tarafından önceden yazılmış.
zh_hans: 无法写入 XML 声明。WriteStartDocument 方法已写入了该声明。
zh_hant: 無法寫入 XML 宣告。WriteStartDocument 方法已寫入 XML 宣告。

# Xml_ElementNotFound
source: Element '{0}' was not found.
cs: Element {0} nebyl nalezen.
de: Das Element "{0}" wurde nicht gefunden.
es: No se puede encontrar el elemento "{0}".
fr: L'élément '{0}' est introuvable.
it: L'elemento '{0}' non è stato trovato.
ja: 要素 '{0}' が見つかりませんでした。
ko: 요소 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć elementu „{0}”.
pt_br: Elemento '{0}' não encontrado.
ru: Элемент "{0}" не найден.
tr: '{0}' öğesi bulunamadı.
zh_hans: 找不到元素“{0}”。
zh_hant: 找不到元素 '{0}'。

# Xml_ElementNotFoundNs
source: Element '{0}' with namespace name '{1}' was not found.
cs: Element {0} s názvem oboru názvů {1} nebyl nalezen.
de: Das Element "{0}" mit dem Namespacenamen "{1}" wurde nicht gefunden.
es: No se puede encontrar el elemento "{0}" con nombre de espacio de nombres "{1}".
fr: L'élément '{0}' doté du nom d'espace de noms '{1}' est introuvable.
it: L'elemento '{0}' con il nome dello spazio dei nomi '{1}' non è stato trovato.
ja: 名前空間の名前が '{1}' の要素 '{0}' が見つかりませんでした。
ko: 네임스페이스 이름이 '{1}'인 요소 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można odnaleźć elementu „{0}” z nazwą przestrzeni nazw „{1}”.
pt_br: Elemento '{0}' com nome de namespace '{1}' não encontrado.
ru: Элемент "{0}" с пространством имен "{1}" не найден.
tr: '{1}' ad alanı adına sahip '{0}' öğesi bulunamadı.
zh_hans: 找不到命名空间名称为“{1}”的元素“{0}”。
zh_hant: 找不到命名空間名稱 '{1}' 的元素 '{0}'。

# Xml_EmptyLocalName
source: The empty string '' is not a valid local name.
cs: Prázdný řetězec '' nepředstavuje platný místní název.
de: Die leere Zeichenfolge "" ist kein gültiger lokaler Name.
es: La cadena vacía "" no es un nombre local válido.
fr: La chaîne vide '' n'est pas un nom local valide.
it: La stringa vuota '' non è un nome locale valido.
ja: 空文字列 '' は有効なローカル名ではありません。
ko: 빈 문자열 ''은 유효한 로컬 이름이 아닙니다.
pl: Pusty ciąg '' nie jest prawidłową nazwą lokalną.
pt_br: A cadeia de caracteres vazia '' não é um nome local válido.
ru: Пустая строка "" не является допустимым локальным именем.
tr: Boş dize '' geçerli bir yerel ad değil.
zh_hans: 空字符串 '' 不是有效的本地名称。
zh_hant: 空字串 '' 不是有效的本機名稱。

# Xml_EmptyName
source: The empty string '' is not a valid name.
cs: Prázdný řetězec '' nepředstavuje platný název.
de: Die leere Zeichenfolge "" ist kein gültiger Name.
es: La cadena vacía "" no es un nombre válido.
fr: La chaîne vide '' n'est pas un nom valide.
it: La stringa vuota '' non è un nome valido.
ja: 空文字列 '' は有効な名前ではありません。
ko: 빈 문자열 ''는 유효한 이름이 아닙니다.
pl: Pusty ciąg '' nie jest prawidłową nazwą.
pt_br: A cadeia de caracteres vazia '' não é um nome válido.
ru: Пустая строка "" не является допустимым именем.
tr: Boş dize '' geçerli bir ad değil.
zh_hans: 空字符串 '' 不是有效名称。
zh_hant: 空字串 '' 不是有效的名稱。

# Xml_EmptyUrl
source: The URL cannot be empty.
cs: Adresa URL nesmí být prázdná.
de: Die URL darf nicht leer sein.
es: La URL no puede estar vacía.
fr: L'URL ne peut pas être vide.
it: L'URL non può essere vuoto.
ja: URL を空にすることはできません。
ko: URL을 비워 둘 수 없습니다.
pl: Adres URL nie może być pusty.
pt_br: A URL não pode estar vazia.
ru: URL-адрес не может быть пустым.
tr: URL boş olamaz.
zh_hans: URL 不能为空。
zh_hant: URL 不能是空白的。

# Xml_EncodingSwitchAfterResetState
source: '{0}' is an invalid value for the 'encoding' attribute. The encoding cannot be switched after a call to ResetState.
cs: Pro atribut encoding je {0} neplatná hodnota. Po zavolání metody ResetState nejde kódování přepnout.
de: "{0}" ist ein ungültiger Wert für das encoding-Attribut. Nach einem Aufruf von ResetState kann die Codierung nicht umgeschaltet werden.
es: "{0}" es un valor no válido para el atributo "encoding". La codificación no se puede cambiar después de una llamada a ResetState.
fr: '{0}' est une valeur non valide pour l'attribut 'encoding'. Impossible de changer l'encodage après un appel de ResetState.
it: '{0}' non è un valore valido per l'attributo 'encoding'. Non è possibile ripristinare la codifica dopo una chiamata a ResetState.
ja: '{0}' は 'encoding' 属性の値としては無効です。ResetState が呼び出された後にエンコードを変更することはできません。
ko: '{0}'은(는) 'encoding' 특성에 유효한 값이 아닙니다. ResetState를 호출한 다음에는 인코딩을 전환할 수 없습니다.
pl: Element „{0}” to nieprawidłowa wartość atrybutu „encoding”. Po wywołaniu elementu ResetState nie można zmienić kodowania.
pt_br: '{0}' é um valor inválido para o atributo 'encoding'. A Codificação não pode ser mudada após uma chamada para ResetState.
ru: "{0}" является недопустимым значением для атрибута encoding. Нельзя изменить кодирование после вызова ResetState.
tr: '{0}', 'encoding' özniteliği için geçersiz değer. Kodlama, ResetState çağrısı yapıldıktan sonra değiştirilemez.
zh_hans: “{0}”不是 "encoding" 特性的有效值。调用 ResetState 之后，不能切换编码。
zh_hant: '{0}' 對 'encoding' 屬性是無效值。在呼叫 ResetState 之後，即無法切換編碼。

# Xml_EntityHandling
source: Expected EntityHandling.ExpandEntities or EntityHandling.ExpandCharEntities.
cs: Byl očekáván element EntityHandling.ExpandEntities nebo EntityHandling.ExpandCharEntities.
de: EntityHandling.ExpandEntities oder EntityHandling.ExpandCharEntities wurde erwartet.
es: Se esperaba EntityHandling.ExpandEntities o EntityHandling.ExpandCharEntities.
fr: EntityHandling.ExpandEntities ou EntityHandling.ExpandCharEntities attendu.
it: È previsto EntityHandling.ExpandEntities o EntityHandling.ExpandCharEntities.
ja: EntityHandling.ExpandEntities または EntityHandling.ExpandCharEntities が必要です。
ko: EntityHandling.ExpandEntities 또는 EntityHandling.ExpandCharEntities가 필요합니다.
pl: Oczekiwano elementu EntityHandling.ExpandEntities lub EntityHandling.ExpandCharEntities.
pt_br: Era esperado EntityHandling.ExpandEntities ou EntityHandling.ExpandCharEntities.
ru: Ожидалось EntityHandling.ExpandEntities или EntityHandling.ExpandCharEntities.
tr: EntityHandling.ExpandEntities veya EntityHandling.ExpandCharEntities bekleniyor.
zh_hans: 应为 EntityHandling.ExpandEntities 或 EntityHandling.ExpandCharEntities。
zh_hant: 應要有 EntityHandling.ExpandEntities 或 EntityHandling.ExpandCharEntities。

# Xml_EntityRefNesting
source: Entity replacement text must nest properly within markup declarations.
cs: Náhradní text entity musí být správně vnořen uvnitř deklarací značek.
de: Der Entitätsersetzungstext muss innerhalb der Markupdeklarationen richtig geschachtelt sein.
es: El texto para reemplazar la entidad del parámetro debe anidarse correctamente con las declaraciones de marcado.
fr: Le texte de remplacement de l'entité doit être imbriqué correctement dans les déclarations de balisage.
it: Il testo di sostituzione dell'entità deve essere annidato correttamente nelle dichiarazioni dei markup.
ja: エンティティ置換テキストは、マークアップ宣言内で正しく入れ子にしなければなりません。
ko: 엔터티 대체 텍스트는 태그 선언 내에서 올바르게 중첩시켜야 합니다.
pl: Tekst zastępczy jednostki należy poprawnie zagnieździć w obrębie deklaracji znaczników.
pt_br: O texto de substituição da entidade deve ser aninhado adequadamente em declarações de marcação.
ru: Текст, подставляемый вместо сущности, должен быть надлежащим образом вложен в объявления разметки.
tr: Varlık değiştirme metninin, işaretleme bildirimlerinde düzgün bir şekilde iç içe olması sağlanmalıdır.
zh_hans: 实体替换文本必须在标记声明中正确嵌套。
zh_hant: 必須在標記宣告中適當地巢狀化實體替換文字。

# Xml_EnumerationRequired
source: Enumeration data type required.
cs: Je požadován výčtový datový typ.
de: Der Enumerationsdatentyp ist erforderlich.
es: Se requiere tipo de datos de enumeración.
fr: Type de données énumération obligatoire.
it: È richiesto il tipo di dati dell'enumerazione.
ja: 列挙データ型が必要です。
ko: 열거형 데이터 형식이 필요합니다.
pl: Wymagany wyliczeniowy typ danych.
pt_br: Tipo de dados de enumeração necessário.
ru: Требуется перечисляемый тип данных.
tr: Sabit listesi veri türü gerekiyor.
zh_hans: 需要枚举数据类型。
zh_hant: 需要有列舉資料類型。

# Xml_ErrorFilePosition
source: An error occurred at {0}, ({1}, {2}).
cs: Na pozici {0}, ({1}, {2}) došlo k chybě.
de: Bei {0}, ({1}, {2}) ist ein Fehler aufgetreten.
es: Se ha producido un error en {0}, ({1}, {2}).
fr: Une erreur s'est produite au niveau de {0}, ({1}, {2}).
it: Si è verificato un errore alla posizione {0} ({1}, {2}).
ja: {0} ({1}, {2}) でエラーが発生しました。
ko: {0}, ({1}, {2})에서 오류가 발생했습니다.
pl: Wystąpił błąd w lokalizacji {0}, ({1}, {2}).
pt_br: Erro em {0}, ({1}, {2}).
ru: Произошла ошибка в {0}, ({1}, {2}).
tr: Hata oluştu: {0}, ({1}, {2}).
zh_hans: {0} ({1}, {2}) 处出现错误。
zh_hant: {0}, ({1},{2}) 發生錯誤。

# Xml_ErrorOpeningExternalDtd
source: An error has occurred while opening external DTD '{0}': {1}
cs: Došlo k chybě při otevírání externí deklarace DTD {0}: {1}
de: Beim Öffnen der externen DTD "{0}" ist ein Fehler aufgetreten: {1}.
es: Error al abrir la DTD externa "{0}": {1}
fr: Une erreur s'est produite durant l'ouverture du DTD externe '{0}' : {1}
it: Si è verificato un errore durante l'apertura della DTD esterna '{0}': {1}
ja: 外部 DTD '{0}' を開くときにエラーが発生しました。{1}
ko: 외부 DTD '{0}'을(를) 여는 동안 오류가 발생했습니다: {1}
pl: Wystąpił błąd podczas otwierania zewnętrznego elementu DTD „{0}”: {1}
pt_br: Erro ao abrir DTD externo '{0}': {1}
ru: Ошибка при попытке открыть внешний DTD "{0}": {1}
tr: Dış DTD '{0}' açılırken hata oluştu: {1}
zh_hans: 打开外部 DTD“{0}”: {1} 时发生一处错误。
zh_hant: 開啟外部 DTD '{0}' 時發生錯誤: {1}

# Xml_ErrorOpeningExternalEntity
source: An error has occurred while opening external entity '{0}': {1}
cs: Došlo k chybě při otevírání externí entity {0}: {1}
de: Beim Öffnen der externen Entität "{0}" ist ein Fehler aufgetreten: {1}.
es: Error al abrir la entidad externa "{0}": {1}
fr: Une erreur s'est produite durant l'ouverture de l'entité externe '{0}' : {1}
it: Si è verificato un errore durante l'apertura dell'entità esterna '{0}': {1}
ja: 外部エンティティ '{0}' を開くときにエラーが発生しました。{1}
ko: 외부 엔터티 '{0}'을(를) 여는 동안 오류가 발생했습니다: {1}
pl: Wystąpił błąd podczas otwierania zewnętrznej jednostki „{0}”: {1}
pt_br: Erro ao abrir entidade externa '{0}': {1}
ru: Ошибка при попытке открыть внешнюю сущность "{0}": {1}
tr: Dış varlık '{0}' açılırken hata oluştu: {1}
zh_hans: 打开外部实体“{0}”时发生错误: {1}。
zh_hant: 開啟外部實體 '{0}' 時發生錯誤: {1}

# Xml_ErrorParsingEntityName
source: An error occurred while parsing EntityName.
cs: Při parsování atributu EntityName došlo k chybě.
de: Beim Analysieren von EntityName ist ein Fehler aufgetreten.
es: Error al analizar EntityName.
fr: Une erreur s'est produite durant l'analyse de EntityName.
it: Si è verificato un errore durante l'analisi di EntityName.
ja: EntityName を解析中にエラーが発生しました。
ko: EntityName을 구문 분석하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas analizowania elementu EntityName.
pt_br: Erro durante a análise de EntityName.
ru: Ошибка при разборе EntityName.
tr: EntityName ayrıştırılırken hata oluştu.
zh_hans: 分析 EntityName 时出错。
zh_hant: 剖析 EntityName 時發生錯誤。

# Xml_ErrorPosition
source: Line {0}, position {1}.
cs: Řádek {0}, pozice {1}
de: Zeile {0}, Position {1}.
es: Línea {0}, posición {1}.
fr: Ligne {0}, position {1}.
it: Riga {0}, posizione {1}.
ja: 行 {0}、位置 {1} です。
ko: 줄 {0}, 위치 {1}.
pl: Wiersz {0}, pozycja {1}.
pt_br: Linha {0}, posição {1}.
ru: Строка {0}, позиция {1}.
tr: Satır {0}, konum {1}.
zh_hans: 行 {0}，位置 {1}。
zh_hant: 行 {0}，位置 {1}。

# Xml_ExpectAttType
source: Expecting an attribute type.
cs: Byl očekáván typ atributu.
de: Es wird ein Attributtyp erwartet.
es: Se esperaba un tipo de atributo.
fr: Un type d'attribut est attendu.
it: È previsto un tipo di attributo.
ja: 属性の型を指定してください。
ko: 특성 형식이 필요합니다.
pl: Oczekiwano typu atrybutu.
pt_br: Esperando um tipo de atributo.
ru: Ожидается тип атрибута.
tr: Öznitelik türü bekleniyor.
zh_hans: 应为特性类型。
zh_hant: 應為屬性類型。

# Xml_ExpectDtdMarkup
source: Expected DTD markup was not found.
cs: Očekávaná deklarace značek DTD nebyla nalezena.
de: Das erwartete DTD-Markup wurde nicht gefunden.
es: No se puede encontrar el marcado DTD esperado.
fr: Balisage DTD attendu introuvable.
it: Il markup DTD previsto non è stato trovato.
ja: 必要な DTD マークアップが見つかりませんでした。
ko: DTD 태그가 있어야 하는데 찾을 수 없습니다.
pl: Nie można odnaleźć oczekiwanego znacznika DTD.
pt_br: Marcação DTD esperada não encontrada.
ru: Не найдена ожидавшаяся разметка DTD.
tr: Beklenen DTD işaretlemesi bulunamadı.
zh_hans: 未找到所需的 DTD 标记。
zh_hant: 找不到應要有的 DTD 標記。
