Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlCannotReconcileAttributeAccessor
source: The global XML attribute '{0}' from namespace '{1}' references distinct types {2} and {3}. Use XML attributes to specify another XML name or namespace for the attribute or types.
cs: Globální atribut XML {0} z oboru názvů {1} používá odkazy na různé typy {2} a {3}. Pomocí atributů XML zadejte jiný název XML nebo obor názvů pro atribut nebo typy.
de: Das globale XML-Attribut "{0}" aus dem Namespace "{1}" verweist auf die eindeutigen Typen {2} und {3}. Verwenden Sie XML-Attribute, um einen anderen XML-Namen oder -Namespace für die Attribute oder Typen anzugeben.
es: El atributo XML global "{0}" del espacio de nombres "{1}" hace referencia a tipos {2} y {3} distintos. Utilice atributos XML para especificar otro espacio de nombres o nombre XML para el atributo o los tipos.
fr: L'attribut XML global '{0}' de l'espace de noms '{1}' référence des types distincts : {2} et {3}. Utilisez des attributs XML afin d'indiquer un autre espace de noms ou nom XML pour cet attribut ou ces types.
it: L'attributo XML globale '{0}' appartenente allo spazio dei nomi '{1}' fa riferimento ai tipi distinti {2} e {3}. Usare gli attributi XML per specificare un altro nome XML o uno spazio dei nomi per l'attributo o i tipi.
ja: 名前空間 '{1}' のグローバル XML 属性 '{0}' が、明示型である {2} および {3} を参照しています。XML 属性を使用して、この属性または型の代わりとなる別の XML 名または名前空間を指定してください。
ko: 네임스페이스 '{1}'의 전역 XML 특성 '{0}'은(는) 고유한 형식 {2}과(와) {3}을(를) 참조합니다. XML 특성을 사용하여 특성이나 형식에 다른 XML 이름이나 네임스페이스를 지정하세요.
pl: Globalny atrybut XML „{0}” z przestrzeni nazw „{1}” odwołuje się do odrębnych typów {2} i {3}. Określ inną nazwę lub przestrzeń nazw XML dla atrybutu lub typów przy użyciu atrybutów XML.
pt_br: O atributo XML global '{0}' do namespace '{1}' faz referência aos tipos distintos {2} e {3}. Use atributos XML para especificar outro nome ou namespace XML para o atributo ou para os tipos.
ru: Глобальный атрибут XML "{0}" из пространства имен "{1}" ссылается на отдельные типы {2} и {3}. Используйте атрибуты XML, чтобы задать другое имя или пространство имен XML для атрибута или типов.
tr: '{1}' ad alanındaki '{0}' global XML özniteliği farklı {2} ve {3} türlerine başvuruyor. Öğe veya türler için başka bir XML adı veya ad alanı belirtmek üzere XML özniteliklerini kullanın.
zh_hans: 来自命名空间“{1}”的全局 XML 特性“{0}”引用了类型完全不同的 {2} 和 {3}。请使用 XML 特性为特性或类型指定另一个 XML 名称或命名空间。
zh_hant: 命名空間 '{1}' 的全域 XML 屬性 '{0}'，參考了相異的類型 {2} 與 {3}。請使用 XML 屬性來為屬性或類型指定其他 XML 名稱或命名空間。

# XmlChoiceIdDuplicate
source: Enum values in the XmlChoiceIdentifier '{0}' have to be unique. Value '{1}' already present.
cs: Výčtové hodnoty XmlChoiceIdentifier {0} musí být jedinečné. Hodnota {1} již existuje.
de: Enumerationswerte im XmlChoiceIdentifier "{0}" müssen eindeutig sein. Der Wert "{1}" ist bereits vorhanden.
es: Los valores de enumeración de XmlChoiceIdentifier "{0}" tienen que ser únicos. El valor "{1}" ya se encuentra presente.
fr: Les valeurs Enum de XmlChoiceIdentifier '{0}' doivent être uniques. La valeur '{1}' est déjà présente.
it: I valori di enumerazione in XmlChoiceIdentifier '{0}' devono essere univoci. Il valore '{1}' è già presente.
ja: XmlChoiceIdentifier '{0}' の列挙値は一意でなければなりません。値 '{1}' は既に存在します。
ko: XmlChoiceIdentifier '{0}'의 Enum 값은 고유해야 합니다. 값 '{1}'이(가) 이미 있습니다.
pl: Wartości wyliczenia w elemencie XmlChoiceIdentifier „{0}” muszą być unikatowe. Wartość „{1}” już istnieje.
pt_br: Os valores de enumeração no XmlChoiceIdentifier '{0}' precisam ser exclusivos. O valor '{1}' já está presente.
ru: Значения перечисления в XmlChoiceIdentifier "{0}" должны быть уникальными. Значение "{1}" уже присутствует.
tr: XmlChoiceIdentifier '{0}' içindeki sabit listesi değerlerinin benzersiz olması gerekir. '{1}' değeri zaten var.
zh_hans: XmlChoiceIdentifier“{0}”中的枚举值必须是唯一的。值“{1}”已存在。
zh_hant: XmlChoiceIdentifier '{0}' 中的列舉值必須是唯一的，但已有值 '{1}'。

# XmlChoiceIdentiferAmbiguous
source: Ambiguous choice identifier. There are several members named '{0}'.
cs: Dvojznačný identifikátor volby. Existuje několik členů s názvem {0}.
de: Mehrdeutiger Auswahlbezeichner. Es sind mehrere Member mit dem Namen "{0}" vorhanden.
es: Identificador de opción ambiguo. Hay varios miembros denominados "{0}".
fr: Identificateur de choix ambigu. Plusieurs membres nommés '{0}' existent.
it: L'identificatore choice è ambiguo. Sono presenti diversi membri denominati '{0}'.
ja: Choice 識別子があいまいです。'{0}' という名前のメンバーが複数あります。
ko: 모호한 choice ID입니다. 이름이 '{0}'인 멤버가 여러 개 있습니다.
pl: Niejednoznaczny identyfikator wyboru. Istnieje kilka składowych o nazwie „{0}”.
pt_br: Identificador de opção ambíguo. Há vários membros chamados '{0}'.
ru: Неоднозначный идентификатор выбора. Существует несколько членов с именем "{0}".
tr: Belirsiz seçim tanımlayıcısı: '{0}' adlı birçok üye var.
zh_hans: 选择标识符不明确。有多个名为“{0}”的成员。
zh_hant: 模稜兩可的選擇識別碼。有多個名為 '{0}' 的成員。

# XmlChoiceIdentiferMemberMissing
source: Missing '{0}' member needed for serialization of choice '{1}'.
cs: Chybí člen {0} potřebný k serializaci volby {1}.
de: Der für die Serialisierung der Auswahl "{1}" erforderliche Member "{0}" fehlt.
es: Falta el miembro "{0}" necesario para la serialización de la opción "{1}".
fr: Membre '{0}' manquant pour la sérialisation de choix '{1}'.
it: Manca il membro '{0}', necessario per la serializzazione di choice '{1}'.
ja: '{0}' メンバーが見つかりませんが、Choice '{1}' のシリアル化に必要です
ko: choice '{1}'의 serialization에 필요한 '{0}' 멤버가 없습니다.
pl: Brak składowej „{0}” wymaganej do serializacji wyboru „{1}”.
pt_br: Falta membro '{0}' necessário para a serialização da opção '{1}'.
ru: Отсутствует член "{0}", требуемый для сериализации выбора "{1}".
tr: '{1}' seçiminin serileştirilmesi için eksik olan '{0}' üyesi gerekli.
zh_hans: 缺少对选择“{1}”进行序列化所必需的“{0}”成员。
zh_hant: 遺漏序列化選擇 '{1}' 所需的 '{0}' 成員。

# XmlChoiceIdentiferMissing
source: You need to add {0} to the '{1}' member.
cs: Ke členu {1} je nutné přidat identifikátor {0}.
de: Sie müssen {0} dem Member "{1}" hinzufügen.
es: Necesita agregar {0} al miembro "{1}".
fr: Vous devez ajouter {0} au membre '{1}'.
it: È necessario aggiungere {0} al membro '{1}'.
ja: {0} を '{1}' メンバーに追加する必要があります。
ko: '{1}' 멤버에 {0}을(를) 추가해야 합니다.
pl: Należy dodać element {0} do składowej „{1}”.
pt_br: É necessário adicionar {0} ao membro '{1}'.
ru: Требуется добавить {0} в член "{1}".
tr: '{1}' üyesine {0} eklemeniz gerekli.
zh_hans: 需要将 {0} 添加到“{1}”成员。
zh_hant: 您必須將 {0} 新增至 '{1}' 成員中。

# XmlChoiceIdentifierArrayType
source: Type of choice identifier '{0}' is inconsistent with type of '{1}'. Please use array of {2}.
cs: Typ identifikátoru volby {0} je nekonzistentní s typem {1}. Použijte prosím pole typu {2}.
de: Der Typ des Auswahlbezeichners "{0}" ist inkonsistent mit dem Typ von "{1}". Verwenden Sie das Array {2}.
es: El tipo de identificador de opción "{0}" no concuerda con el tipo "{1}". Utilice la matriz de {2}.
fr: Le type de l'identificateur de choix '{0}' n'est pas cohérent avec le type de '{1}'. Utilisez le tableau de {2}.
it: Il tipo dell'identificatore choice '{0}' non è coerente con il tipo di '{1}'. Usare una matrice di {2}.
ja: Choice 識別子の型 '{0}' は、型 '{1}' と一貫性がありません。配列 {2} を使用してください。
ko: choice ID '{0}'의 형식이 '{1}'의 형식과 일치하지 않습니다. {2}의 배열을 사용하세요.
pl: Typ identyfikatora wyboru „{0}” jest niezgodny z typem „{1}”. Użyj tablicy elementów {2}.
pt_br: O tipo do identificador de opção '{0}' é inconsistente com o tipo de '{1}'. Use a matriz de {2}.
ru: Тип идентификатора выбора "{0}" не совместим с типом "{1}". Используйте массив из {2}.
tr: '{0}' seçim tanımlayıcısı '{1}' türü ile tutarlı değil. Lütfen {2} dizisi kullanın.
zh_hans: 选择标识符“{0}”的类型与“{1}”的类型不一致。请使用 {2} 的数组。
zh_hant: 選擇識別碼 '{0}' 的類型與 '{1}' 的類型不一致。請使用 {2} 的陣列。

# XmlChoiceIdentifierMismatch
source: Value '{0}' of the choice identifier '{1}' does not match element '{2}' from namespace '{3}'.
cs: Hodnota {0} identifikátoru volby {1} neodpovídá elementu {2} z oboru názvů {3}.
de: Der Wert "{0}" des Auswahlbezeichners "{1}" stimmt nicht mit dem Element "{2}" aus dem Namespace "{3}" überein.
es: El valor "{0}" del identificador de opción "{1}" no coincide con el elemento "{2}" del espacio de nombres "{3}".
fr: La valeur '{0}' de l'identificateur de choix '{1}' ne correspond pas à l'élément '{2}' de l'espace de noms '{3}'.
it: Il valore '{0}' dell'identificatore choice '{1}' non corrisponde all'elemento '{2}' dello spazio dei nomi '{3}'.
ja: 識別子 '{1}' の値 '{0}' は名前空間 '{3}' の要素 '{2}' と一致しません。
ko: choice ID '{1}'의 값 '{0}'이(가) 네임스페이스 '{3}'의 요소 '{2}'과(와) 일치하지 않습니다.
pl: Wartość „{0}” identyfikatora wyboru „{1}” jest niezgodna z elementem „{2}” z przestrzeni nazw „{3}”.
pt_br: O valor '{0}' do identificador de opção '{1}' não corresponde ao elemento '{2}' do namespace '{3}'.
ru: Значение "{0}" идентификатора выбора "{1}" не соответствует элементу "{2}" из пространства имен "{3}".
tr: '{1}' seçim tanımlayıcısının '{0}' değeri '{3}' ad alanındaki '{2}' öğesiyle eşleşmiyor.
zh_hans: 选择标识符“{1}”的值“{0}”与命名空间“{3}”中的元素“{2}”不匹配。
zh_hant: 選擇識別碼 '{1}' 的值 '{0}' 與來自命名空間 '{3}' 的元素 '{2}' 不符。

# XmlChoiceIdentifierType
source: Type of choice identifier '{0}' is inconsistent with type of '{1}'. Please use {2}.
cs: Typ identifikátoru volby {0} je nekonzistentní s typem {1}. Použijte prosím {2}.
de: Der Typ des Auswahlbezeichners "{0}" ist inkonsistent mit dem Typ von "{1}". Verwenden Sie {2}.
es: El tipo del identificador de opción "{0}" no concuerda con el tipo "{1}". Utilice {2}.
fr: Le type de l'identificateur de choix '{0}' n'est pas cohérent avec le type de '{1}'. Utilisez {2}.
it: Il tipo dell'identificatore choice '{0}' non è coerente con il tipo di '{1}'. Usare {2}.
ja: Choice 識別子'{0}' の型が '{1}' の型と一致しません。{2} を使用してください。
ko: choice ID '{0}'의 형식이 '{1}'의 형식과 일치하지 않습니다. {2}을(를) 사용하세요.
pl: Typ identyfikatora wyboru „{0}” jest niezgodny z typem „{1}”. Użyj elementu {2}.
pt_br: O tipo do identificador de opção '{0}' é inconsistente com o tipo '{1}'. Use {2}.
ru: Тип идентификатора выбора "{0}" не совместим с типом "{1}". Используйте {2}.
tr: '{0}' seçim tanımlayıcısı '{1}' türü ile tutarlı değil. Lütfen {2} kullanın.
zh_hans: 选择标识符“{0}”的类型与“{1}”的类型不一致。请使用 {2}。
zh_hant: 選擇識別碼 '{0}' 的類型與 '{1}' 的類型不一致。請使用 {2}。

# XmlChoiceIdentifierTypeEnum
source: Choice identifier '{0}' must be an enum.
cs: Identifikátor volby {0} musí být výčtového typu.
de: Der Auswahlbezeichner "{0}" muss eine Enumeration sein.
es: El identificador de opción "{0}" debe ser una enumeración.
fr: L'identificateur de choix '{0}' doit être un enum.
it: L'identificatore di selezione '{0}' deve essere un'enumerazione.
ja: Choice 識別子 '{0}' は列挙型でなければなりません。
ko: choice ID '{0}'은(는) 열거형이어야 합니다.
pl: Identyfikator wyboru „{0}” musi być wyliczeniem.
pt_br: O identificador de opção '{0}' deve ser uma enumeração.
ru: Идентификатор выбора "{0}" должен быть перечислением.
tr: '{0}' seçim tanımlayıcısı bir sabit listesi olmalıdır.
zh_hans: 选择标识符“{0}”必须是一个枚举。
zh_hant: 選擇識別碼 '{0}' 必須是列舉。

# XmlChoiceMismatchChoiceException
source: Value of {0} mismatches the type of {1}; you need to set it to {2}.
cs: Hodnota {0} neodpovídá typu {1}. Je nutné ji nastavit na hodnotu {2}.
de: Der Wert von "{0}" stimmt nicht mit dem Typ von "{1}" überein. Sie müssen den Wert auf {2} festlegen.
es: El valor de {0} no coincide con el tipo de {1}; necesita establecerlo en {2}.
fr: La valeur de {0} est incompatible avec le type de {1}, sa valeur doit être égale à {2}.
it: Il valore di {0} non corrisponde al tipo di {1}. È necessario impostarlo su {2}.
ja: {0} の値が {1} の型と一致しません。{2} に設定してください。
ko: {0}의 값이 {1}의 형식과 일치하지 않으므로 값을 {2}(으)로 설정해야 합니다.
pl: Wartość {0} nie pasuje do typu {1}; należy ustawić ją na {2}.
pt_br: O valor de {0} é incompatível com o tipo de {1}; é necessário defini-lo como {2}.
ru: Значение {0} не соответствует типу {1}. Ему требуется присвоить значение {2}.
tr: {0} değeri {1} türüyle uyuşmuyor; {2} olarak ayarlamanız gerek.
zh_hans: {0} 的值与 {1} 的类型不匹配；需要将其设置为 {2}。
zh_hant: {0} 的值與 {1} 的類型不符; 您必須將它設定為 {2}。

# XmlChoiceMissingAnyValue
source: Type {0} is missing enumeration value '##any:' corresponding to XmlAnyElementAttribute.
cs: V typu {0} chybí hodnota výčtu ##any: odpovídající atributu XmlAnyElementAttribute.
de: Im Typ {0} fehlt der Enumerationswert "##any:", der XmlAnyElementAttribute entspricht.
es: Al tipo {0} le falta el valor de enumeración "##any:" que corresponde a XmlAnyElementAttribute.
fr: La valeur d'énumération '##any:' correspondant à XmlAnyElementAttribute manque au type {0}.
it: Nel tipo {0} manca il valore di enumerazione '##any:' corrispondente a XmlAnyElementAttribute.
ja: 型 {0} に XmlAnyElementAttribute に対応する列挙値 '##any:' がありません。
ko: 형식 {0}에 XmlAnyElementAttribute에 해당하는 열거형 값 '##any:'가 없습니다.
pl: Dla typu {0} brakuje wartości wyliczenia „##any:” odpowiadającej elementowi XmlAnyElementAttribute.
pt_br: O tipo {0} não tem o valor de enumeração '##any:' correspondente ao XmlAnyElementAttribute.
ru: В типе {0} отсутствует значение перечисления "##any:", соответствующее XmlAnyElementAttribute.
tr: {0} türünde, XmlAnyElementAttribute'e karşılık gelen '##any:' sabit listesi değeri eksik.
zh_hans: 类型 {0} 缺少对应于 XmlAnyElementAttribute 的枚举值“##any:”。
zh_hant: 類型 {0} 遺漏對應到 XmlAnyElementAttribute 的列舉值 '##any:'。

# XmlChoiceMissingValue
source: Type {0} is missing enumeration value '{1}' for element '{2}' from namespace '{3}'.
cs: Typ {0} neobsahuje hodnotu výčtu {1} pro element {2} z oboru názvů {3}.
de: Im Typ "{0}" fehlt der Enumerationswert "{1}" für das Element "{2}" aus dem Namespace "{3}".
es: Al tipo {0} le falta el valor de enumeración "{1}" para el elemento "{2}" del espacio de nombres "{3}".
fr: La valeur d'énumération '{1}' pour l'élément '{2}' de l'espace de noms '{3}' manque au type {0}.
it: Nel tipo {0} manca il valore di enumerazione '{1}' per l'elemento '{2}' dello spazio dei nomi '{3}'.
ja: 型 {0} には、名前空間 '{3}' の要素 '{2}' に対する列挙値 '{1}' がありません。
ko: 형식 {0}에 네임스페이스 '{3}'의 요소 '{2}'에 대한 열거형 값 '{1}'이(가) 없습니다.
pl: W typie {0} brak wartości wyliczenia „{1}” dla elementu „{2}” z przestrzeni nazw „{3}”.
pt_br: O tipo {0} não tem o valor de enumeração '{1}' para o elemento '{2}' do namespace '{3}'.
ru: В типе {0} отсутствует значение перечисления "{1}" для элемента "{2}" из пространства имен "{3}".
tr: '{0}' türünün '{3}' ad alanındaki '{2}' öğesi için '{1}' sabit listesi değeri eksik.
zh_hans: 命名空间“{3}”中元素“{2}”的类型 {0} 缺少枚举值“{1}”。
zh_hant: 類型 {0} 遺漏來自命名空間 '{3}' 的元素 '{2}' 的列舉值 '{1}'。

# XmlCircularDerivation
source: Circular reference in derivation of IXmlSerializable type '{0}'.
cs: Cyklický odkaz v odvození typu rozhraní IXmlSerializable {0}
de: Zirkelbezug in der Ableitung vom IXmlSerializable-Typ "{0}".
es: Referencia circular en derivación de tipo IXmlSerializable "{0}".
fr: Référence circulaire en dérivation du type IXmlSerializable '{0}'.
it: Riferimento circolare nella derivazione del tipo IXmlSerializable '{0}'.
ja: IXmlSerializable 型 '{0}' の派生に循環参照があります。
ko: IXmlSerializable 형식 '{0}'의 파생에 순환 참조가 있습니다.
pl: Odwołanie cykliczne podczas wyprowadzania typu IXmlSerializable: „{0}”.
pt_br: Referência circular em derivação de IXmlSerializable tipo '{0}'.
ru: Циклическая ссылка при получении производного IXmlSerializable типа "{0}".
tr: IXmlSerializable '{0}' türü türetmede döngüsel başvuru.
zh_hans: IXmlSerializable 类型“{0}”的派生中存在循环引用。
zh_hant: IXmlSerializable 類型 '{0}' 之衍生中的循環參考。

# XmlCircularGroupReference
source: Group '{0}' from targetNamespace='{1}' has invalid definition: Circular group reference.
cs: Skupina {0} z oboru názvů targetNamespace={1} má neplatnou definici: cyklický odkaz na skupinu
de: Die Definition der Gruppe "{0}" aus dem targetNamespace="{1}" ist ungültig: zirkulärer Gruppenverweis.
es: El grupo "{0}" de targetNamespace="{1}" tiene una definición no válida: referencia circular a grupos.
fr: La définition du groupe '{0}' de targetNamespace='{1}' est non valide : référence de groupe circulaire.
it: La definizione del gruppo '{0}' di targetNamespace='{1}' non è valida: riferimento circolare al gruppo.
ja: targetNamespace='{1}' のグループ '{0}' に無効な定義があります。グループの循環参照があります。
ko: targetNamespace='{1}'의 그룹 '{0}'에 잘못된 정의인 순환 그룹 참조가 있습니다.
pl: Grupa „{0}” z przestrzeni nazw targetNamespace=„{1}” ma nieprawidłową definicję: cykliczne odwołanie do grupy.
pt_br: O grupo '{0}' de targetNamespace='{1}' tem definição inválida: referência circular de grupo.
ru: Группа "{0}" из targetNamespace="{1}" имеет недопустимое определение. Циклическая ссылка на группу.
tr: targetNamespace='{1}' alanındaki '{0}' grubunda geçersiz tanım var: Döngüsel grup başvurusu.
zh_hans: 来自 targetNamespace='{1}' 的组“{0}”具有无效定义: 循环组引用。
zh_hant: 來自 targetNamespace='{1}' 的群組 {0}'，有無效的定義: 循環群組參考。

# XmlCircularReference
source: A circular reference was detected while serializing an object of type {0}.
cs: Při serializaci objektu typu {0} byl zjištěn cyklický odkaz.
de: Beim Serialisieren eines Objekts vom Typ {0} wurde ein Zirkelbezug gefunden.
es: Se detectó una referencia circular al serializar un objeto de tipo {0}.
fr: Référence circulaire détectée durant la sérialisation d'un objet de type {0}.
it: È stato rilevato un riferimento circolare durante la serializzazione di un oggetto di tipo {0}.
ja: {0} 型のオブジェクトのシリアル化を実行中に循環参照が見つかりました。
ko: {0} 형식의 개체를 직렬화하는 동안 순환 참조를 발견했습니다.
pl: Wykryto odwołanie cykliczne podczas serializowania obiektu typu {0}.
pt_br: Foi detectada uma referência circular durante a serialização de um objeto do tipo {0}.
ru: При сериализации объекта типа {0} обнаружена циклическая ссылка.
tr: {0} türündeki bir nesne serileştirilirken bir döngüsel başvuru algılandı.
zh_hans: 序列化类型 {0} 的对象时检测到循环引用。
zh_hant: 為類型 {0} 的物件進行序列化時，偵測到循環參考。

# XmlCircularReference2
source: A circular type reference was detected in anonymous type '{0}'. Please change '{0}' to be a named type by setting {1}={2} in the type definition.
cs: Byl zjištěn cyklický odkaz na typ v anonymním typu {0}. Změňte prosím {0} na pojmenovaný typ nastavením {1}={2} v definici typu.
de: Im anonymen Typ "{0}" wurde ein zirkulärer Typverweis gefunden. Ändern Sie "{0}" in einen benannten Typ, indem Sie {1}={2} in der Typdefinition festlegen.
es: Se ha detectado una referencia de tipo circular en el tipo anónimo "{0}". Cambie "{0}" a un tipo con nombre estableciendo {1}={2} en la definición de tipo.
fr: Une référence de type circulaire a été détectée dans le type anonyme '{0}'. Dans la définition de type, changez '{0}' en type nommé en définissant {1}={2}.
it: È stato rilevato un riferimento di tipo circolare nel tipo anonimo '{0}'. Modificare il tipo '{0}' in un tipo denominato impostando {1}={2} nella definizione del tipo.
ja: 循環型の参照が無名型 '{0}' から検出されました。型定義で {1}={2} を設定することで、'{0}' を名前付きの型になるように変更してください。
ko: 무명 형식 '{0}'에 순환 형식 참조가 있습니다. 형식 정의에서 {1}={2}을(를) 설정하여 '{0}'을(를) 명명된 형식으로 변경하세요.
pl: W obrębie typu anonimowego „{0}” wykryto cykliczne odwołanie do typu. Zmień typ „{0}” na typ nazwany, ustawiając wartość {1}={2} w definicji typu.
pt_br: Detectada uma referência circular de tipo no tipo anônimo '{0}'. Altere '{0}' para um tipo nomeado configurando {1}={2} na definição do tipo.
ru: В анонимном типе "{0}" обнаружена циклическая ссылка на тип. Измените тип "{0}" на именованный тип; установите {1}={2} в определении типа.
tr: '{0}' anonim türünde döngüsel türde bir başvuru algılandı. Lütfen tür tanımında {1}={2} ayarını gerçekleştirerek '{0}' tanımını adlandırılmış tür olacak şekilde değiştirin.
zh_hans: 在匿名类型“{0}”中检测到循环型引用。请通过设置 {1}={2} 将类型定义“{0}”更改为命名的类型。
zh_hant: 在匿名類型 '{0}' 中偵測到循環類型參考。請在類型定義中設定 {1}={2}，將 '{0}' 變更為命名的類型。

# XmlCircularTypeReference
source: Type '{0}' from targetNamespace='{1}' has invalid definition: Circular type reference.
cs: Typ {0} z oboru názvů targetNamespace={1} má neplatnou definici: Cyklický odkaz na typ
de: Die Definition des Typs "{0}" aus targetNamespace="{1}" ist ungültig: zirkulärer Typverweis.
es: El tipo "{0}" de targetNamespace="{1}" tiene una definición no válida: referencia circular del tipo.
fr: La définition du type '{0}' de targetNamespace='{1}' est non valide : référence de type circulaire.
it: La definizione del tipo '{0}' di targetNamespace='{1}' non è valida: riferimento circolare al tipo.
ja: targetNamespace='{1}' の型 '{0}' に無効な定義があります。型の循環参照があります。
ko: targetNamespace='{1}'의 형식 '{0}'에 잘못된 정의인 순환 형식 참조가 있습니다.
pl: Typ „{0}” z przestrzeni nazw targetNamespace=„{1}” ma nieprawidłową definicję: cykliczne odwołanie do typu.
pt_br: O tipo '{0}' de targetNamespace='{1}' tem definição inválida: referência circular de tipo.
ru: Тип "{0}" из targetNamespace="{1}" имеет недопустимое определение. Циклическая ссылка на тип.
tr: targetNamespace='{1}' alanındaki '{0}' türünde geçersiz tanım var: Döngüsel tür başvurusu.
zh_hans: 来自 targetNamespace='{1}' 的类型“{0}”具有无效定义: 循环类型引用。
zh_hant: 來自 targetNamespace='{1}' 的類型 {0}' 有無效的定義: 循環群組參考。

# XmlCodegenWarningDetails
source: CODEGEN Warning: {0}
cs: CODEGEN – upozornění: {0}
de: CODEGEN-Warnung: {0}
es: Advertencia CODEGEN: {0}
fr: Avertissement CODEGEN : {0}
it: Avviso CODEGEN: {0}
ja: CODEGEN の警告: {0}
ko: CODEGEN 경고: {0}
pl: Ostrzeżenie CODEGEN: {0}
pt_br: Aviso de CODEGEN: {0}
ru: Предупреждение CODEGEN: {0}
tr: CODEGEN Uyarısı: {0}
zh_hans: CODEGEN 警告: {0}
zh_hant: CODEGEN 警告: {0}

# XmlCompilerError
source: Unable to generate a temporary class (result={0}).
cs: Nelze vytvořit dočasnou třídu (výsledek: {0}).
de: Eine temporäre Klasse kann nicht generiert werden (result={0}).
es: No se puede generar una clase temporal (result={0}).
fr: Impossible de générer une classe temporaire (result={0}).
it: Non è possibile generare una classe temporanea (risultato={0}).
ja: 一時クラスを生成できません (result={0})。
ko: 임시 클래스를 생성할 수 없습니다(result={0}).
pl: Nie można wygenerować tymczasowej klasy (wynik={0}).
pt_br: Não é possível gerar uma classe temporária (resultado={0}).
ru: Невозможно создать временный класс (результат={0}).
tr: Geçici sınıf oluşturulamıyor (sonuç={0}).
zh_hans: 无法生成临时类(result={0})。
zh_hant: 無法產生暫存類別 (result={0})。

# XmlConfigurationDuplicateExtension
source: Duplicate extension name. schemaImporterExtension with name '{0}' already been added.
cs: Duplicitní název rozšíření. Třída schemaImporterExtension s názvem {0} již byla přidána.
de: Doppelter Erweiterungsname. Die schemaImporterExtension mit dem Namen "{0}" wurde bereits hinzugefügt.
es: Nombre de extensión duplicado. Ya se ha agregado schemaImporterExtension con el nombre "{0}".
fr: Nom d'extension en double. Le paramètre schemaImporterExtension '{0}' a déjà été ajouté.
it: Il nome di estensione è duplicato. L'elemento schemaImporterExtension denominato '{0}' è stato già aggiunto.
ja: 重複する拡張機能の名前です。'{0}' という名前の schemaImporterExtension は既に追加されています。
ko: 확장 이름이 중복됩니다. 이름이 '{0}'인 schemaImporterExtension이 이미 추가되었습니다.
pl: Zduplikowana nazwa rozszerzenia. Element schemaImporterExtension o nazwie „{0}” został już dodany.
pt_br: Nome de extensão duplicado. O schemaImporterExtension com o nome '{0}' já foi adicionado.
ru: Повторяющееся имя расширения. schemaImporterExtension с именем "{0}" уже добавлено.
tr: Yinelenen uzantı adı. '{0}' adındaki schemaImporterExtension zaten eklenmiş.
zh_hans: 重复的扩展名。已添加名称为“{0}”的 schemaImporterExtension。
zh_hant: 延伸模組名稱重複。已新增包含名稱 '{0}' 的 schemaImporterExtension。
