Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlEmptyArrayType
source: SOAP-ENC:arrayType was empty at {0}.
cs: Typ SOAP-ENC:arrayType je prázdný v {0}.
de: SOAP-ENC:arrayType bei {0} war leer.
es: SOAP-ENC:arrayType vacío en {0}.
fr: SOAP-ENC:arrayType était vide à {0}.
it: L'elemento SOAP-ENC:arrayType è vuoto alla posizione {0}.
ja: SOAP-ENC:arrayType は {0} で空でした。
ko: SOAP-ENC:arrayType이 {0}에서 비어 있습니다.
pl: Element SOAP-ENC:arrayType był pusty w {0}.
pt_br: SOAP-ENC:arrayType estava vazio em {0}.
ru: SOAP-ENC:arrayType в {0} был пуст.
tr: SOAP-ENC:arrayType, {0} konumunda boştu.
zh_hans: SOAP-ENC:arrayType 在 {0} 处为空。
zh_hant: 位於 {0} 的 SOAP-ENC:arrayType 是空的。

# XmlExtensionComment
source: This type definition was generated by {0} schema importer extension.
cs: Tato definice typu byla vygenerována rozšířením programu pro import schématu {0}.
de: Diese Typdefinition wurde von der Schemaimporterweiterung {0} generiert.
es: La extensión de importador de esquema {0} ha generado esta definición de tipo.
fr: Cette définition de type a été générée par l'extension d'importation de schéma {0}.
it: Questa definizione di tipo è stata generata dall'estensione dell'utilità di importazione dello schema {0}.
ja: この型定義は、{0} スキーマ インポーター拡張機能によって生成されました。
ko: 이 형식 정의는 {0} 스키마 가져오기 확장에 의해 생성되었습니다.
pl: Ta definicja typu została wygenerowana przy użyciu rozszerzenia importera schematów {0}.
pt_br: A definição deste tipo foi gerada pela extensão do importador do esquema {0}.
ru: Это объявление типа было создано расширением программы импорта схем {0}.
tr: Bu tür tanımı {0} şema içeri aktarma uzantısı tarafından oluşturuldu.
zh_hans: 此类型定义由 {0} 架构导入程序扩展生成。
zh_hant: 此類型定義係由 {0} 結構描述匯入工具延伸模組所產生。

# XmlExtensionDuplicateDefinition
source: Schema importer extension {0} generated duplicate type definitions: {1}.
cs: Rozšíření programu pro import schématu {0} vygenerovalo duplicitní definice typu: {1}
de: Die Schemaimporterweiterung {0} hat doppelte Typdefinitionen generiert: {1}.
es: La extensión del importador de esquemas {0} ha generado definiciones de tipos duplicadas: {1}.
fr: L'extension d'importation de schéma {0} a généré des définitions de type en double : {1}.
it: L'utilità di importazione dello schema {0} ha generato definizioni di tipo duplicate: {1}.
ja: スキーマ インポーターの拡張機能 {0} が重複する型定義 {1} を生成しました。
ko: 스키마 가져오기 확장 {0}에서 중복 형식 정의를 생성했습니다. {1}
pl: Rozszerzenie importera schematów {0} wygenerowało zduplikowane definicje typów: {1}.
pt_br: A extensão do importador do esquema {0} gerou definições de tipo duplicadas: {1}.
ru: Расширение программы импорта схем {0} создало повторяющиеся определения типов: {1}.
tr: Şema içeri aktarıcı uzantısı {0} yinelenen tür tanımları oluşturdu: {1}.
zh_hans: 架构导入程序扩展 {0} 生成了重复的类型定义: {1}。
zh_hant: 結構描述匯入工具延伸模組 {0} 產生了重複的類型定義: {1}。

# XmlFieldReflectionError
source: There was an error reflecting field '{0}'.
cs: Při reflexi pole {0} došlo k chybě.
de: Fehler beim Reflektieren von Feld "{0}".
es: Error al reflejar el campo "{0}".
fr: Une erreur s'est produite durant la réflexion du champ '{0}'.
it: Si è verificato un errore durante la reflection del campo '{0}'.
ja: フィールド '{0}' の反映でエラーが発生しました。
ko: '{0}' 필드를 반영하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd w czasie wykonywania odbicia pola „{0}”.
pt_br: Erro ao refletir o campo '{0}'.
ru: Возникла ошибка при отражении поля "{0}".
tr: '{0}' alanı yansıtılırken hata oluştu.
zh_hans: 反射字段“{0}”时出错。
zh_hant: 反映欄位 '{0}' 時發生錯誤。

# XmlGenError
source: There was an error generating the XML document.
cs: Při generování dokumentu XML došlo k chybě.
de: Fehler beim Generieren des XML-Dokuments.
es: Error al generar el documento XML.
fr: Erreur durant la génération du document XML.
it: Si è verificato un errore durante la generazione del documento XML.
ja: XML ドキュメントの生成でエラーが発生しました。
ko: XML 문서를 생성하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas generowania dokumentu XML.
pt_br: Erro ao gerar o documento XML.
ru: Ошибка при создании документа XML.
tr: XML belgesi oluşturulurken bir hata oluştu.
zh_hans: 生成 XML 文档时出错。
zh_hant: 產生 XML 文件時發生錯誤。

# XmlGetSchemaEmptyTypeName
source: {0}.{1}() must return a valid type name.
cs: {0}.{1}() musí vrátit platný název typu.
de: {0}.{1}() muss einen gültigen Typnamen zurückgeben.
es: {0}.{1}() debe devolver un nombre de tipo válido.
fr: {0}.{1}() doit retourner un nom de type valide.
it: {0}.{1}() deve restituire un nome di tipo valido.
ja: {0}.{1}() から有効な型名が返される必要があります。
ko: {0}.{1}()은(는) 적합한 형식 이름을 반환해야 합니다.
pl: Funkcja {0}.{1}() musi zwrócić poprawną nazwę typu.
pt_br: {0}.{1}() deve retornar um nome de tipo válido.
ru: {0}.{1}() должен возвращать действительное имя типа.
tr: {0}.{1}() geçerli bir tür adı döndürmelidir.
zh_hans: {0}.{1}() 必须返回有效的类型名。
zh_hant: {0}.{1}() 必須傳回有效的類型名稱。

# XmlGetSchemaInclude
source: Multiple schemas with targetNamespace='{0}' returned by {1}.{2}(). Please use only the main (parent) schema, and add the others to the schema Includes.
cs: Metoda {1}.{2}() vrátila více schémat s oborem názvů targetNamespace={0}. Používejte pouze hlavní (nadřazené) schéma a ostatní přidejte do schématu Includes.
de: Von {1}.{2}() wurden mehrere Schemas mit targetNamespace="{0}" zurückgegeben. Verwenden Sie nur ein Hauptschema (übergeordnetes Schema), und fügen Sie die anderen Schemas den Schema-Includes hinzu.
es: {1}.{2}() ha devuelto varios esquemas con targetNamespace="{0}". Utilice solo el esquema principal (primario) y agregue los restantes al esquema Includes.
fr: Plusieurs schémas dotés de targetNamespace='{0}' ont été retournés par {1}.{2}(). N'utilisez que le schéma (parent) principal, puis ajoutez les autres au schéma Includes.
it: {1}.{2}() ha restituito più schemi con targetNamespace='{0}'. Usare solo lo schema principale (padre) e aggiungere gli altri allo schema Includes.
ja: {1}.{2}() から targetNamespace='{0}' のスキーマが複数返されました。主要な (親の) スキーマのみを使用して、残りのスキーマは Includes スキーマに追加してください。
ko: {1}.{2}()에서 반환한 targetNamespace='{0}'인 스키마가 여러 개입니다. 주(부모) 스키마만 사용하고 다른 스키마는 스키마 포함에 추가하세요.
pl: Funkcja {1}.{2}() zwróciła wiele schematów z nazwą targetNamespace=„{0}”. Użyj tylko schematu głównego (nadrzędnego) i dodaj inne elementy do właściwości Includes schematu.
pt_br: Vários esquemas com targetNamespace='{0}' retornados por {1}.{2}(). Use apenas o esquema principal (pai) e adicione os outros ao esquema Includes.
ru: {1}.{2}() возвратил несколько схем с targetNamespace="{0}". Используйте только главную (родительскую) схему, а остальные добавьте в Includes для схемы.
tr: {1}.{2}() tarafından targetNamespace='{0}' olan birden çok şema döndürüldü. Lütfen yalnızca ana (üst) şemayı kullanın ve diğerlerini Includes şemasına ekleyin.
zh_hans: {1}.{2}() 返回了多个 targetNamespace='{0}' 的架构。请仅使用主(父)架构，并将其他添加到架构 Includes 中。
zh_hant: {1}.{2}() 已傳回包含 targetNamespace='{0}' 的多個結構描述。請只使用主 (父) 結構描述，並新增其他結構描述 Includes。

# XmlGetSchemaMethodMissing
source: You must implement public static {0}({1}) method on {2}.
cs: Je nutné implementovat metodu public static {0}({1}) pro {2}.
de: Sie müssen die öffentliche static-Methode {0}({1}) für {2} implementieren.
es: Debe implementar el método {0}({1}) estático público en {2}.
fr: Vous devez implémenter la méthode publique statique {0}({1}) dans {2}.
it: È necessario implementare il metodo pubblico statico {0}({1}) in {2}.
ja: {2} にパブリック静的 {0}({1}) メソッドを実装する必要があります。
ko: {2}에 public static {0}({1}) 메서드를 구현해야 합니다.
pl: W lokalizacji {2} musisz zaimplementować metodę public static {0}({1}).
pt_br: Implemente o método {0}({1}) estático público em {2}.
ru: Требуется реализация публичного статического метода {0}({1}) для {2}.
tr: {2} üzerinde public static {0}({1}) metodunu uygulamalısınız.
zh_hans: 必须在 {2} 上实现 public static {0}({1}) 方法。
zh_hant: 您必須在 {2} 上實作 public static {0}({1}) 方法。

# XmlGetSchemaMethodName
source: '{0}' is an invalid language identifier.
cs: {0} je neplatný identifikátor jazyka.
de: "{0}" ist ein ungültiger Sprachbezeichner.
es: "{0}" es un identificador de lenguaje no válido.
fr: '{0}' est un identificateur de langue non valide.
it: '{0}' non è un identificatore lingua valido.
ja: '{0}' は無効な言語識別子です。
ko: '{0}'은(는) 잘못된 언어 식별자입니다.
pl: Wartość „{0}” nie jest prawidłowym identyfikatorem języka.
pt_br: '{0}' é um identificador de idioma inválido.
ru: "{0}" не является допустимым идентификатором языка.
tr: '{0}', geçersiz bir dil tanımlayıcısı.
zh_hans: “{0}”是无效的语言标识符。
zh_hant: '{0}' 是無效的語言識別碼。

# XmlGetSchemaMethodReturnType
source: Method {0}.{1}() specified by {2} has invalid signature: return type must be compatible with {3}.
cs: Metoda {0}.{1}(), kterou určuje {2}, má neplatnou signaturu: Návratový typ musí být kompatibilní s {3}.
de: Die von {2} angegebene Methode {0}.{1}() hat eine ungültige Signatur: Der Rückgabetyp muss mit {3} kompatibel sein.
es: El método {0}.{1}() especificado por {2} tiene una signatura no válida: el tipo de valor devuelto debe ser compatible con {3}.
fr: La méthode {0}.{1}() spécifiée par {2} a une signature non valide : le type de retour doit être compatible avec {3}.
it: La firma del metodo {0}.{1}() specificato da {2} non è valida: il tipo restituito deve essere compatibile con {3}.
ja: {2} が指定しているメソッド {0}.{1}() はシグネチャが無効です。戻り値の型は {3} と互換性がある必要があります。
ko: {2}에서 지정한 메서드 {0}.{1}()에 잘못된 시그니처가 있습니다. 반환 형식은 {3}과(와) 호환되어야 합니다.
pl: Metoda {0}.{1}() określona przy użyciu elementu {2} ma nieprawidłowy podpis: zwracany typ musi być zgodny z typem {3}.
pt_br: A assinatura do método {0}.{1}() especificado por {2} é inválida: o tipo de retorno deve ser compatível com {3}.
ru: Метод {0}.{1}(), указанный {2}, имеет недопустимую сигнатуру: возвращаемый тип должен быть совместим с {3}.
tr: {2} tarafından belirtilen {0}.{1}() metodunun imzası geçersiz: Dönüş türü {3} ile uyumlu olmalıdır.
zh_hans: 由 {2} 指定的方法 {0}.{1}() 具有无效的签名: 返回类型必须与 {3} 兼容。
zh_hant: 由 {2} 所指定的方法 {0}.{1}() 有無效的簽章: 傳回型別必須與 {3} 相容。

# XmlGetSchemaTypeMissing
source: {0}.{1}() must return a valid type name. Type '{2}' cannot be found in the targetNamespace='{3}'.
cs: Metoda {0}.{1}() musí vrátit platný název typu. Typ {2} nelze v oboru názvů targetNamespace={3} najít.
de: {0}.{1}() muss einen gültigen Typnamen zurückgeben. Der Typ "{2}" wurde in targetNamespace="{3}" nicht gefunden.
es: {0}.{1}() debe devolver un nombre de tipo válido. No se puede encontrar el tipo "{2}" en targetNamespace="{3}".
fr: {0}.{1}() doit retourner un nom de type valide. Le type '{2}' est introuvable dans targetNamespace='{3}'.
it: {0}.{1}() deve restituire un nome di tipo valido. Il tipo '{2}' non è stato trovato nell'elemento targetNamespace='{3}'.
ja: {0}.{1}() から有効な型名が返される必要があります。型 '{2}' が targetNamespace='{3}' にありません。
ko: {0}.{1}()은(는) 적합한 형식 이름을 반환해야 합니다. 형식 '{2}'은(는) targetNamespace='{3}'에서 찾을 수 없습니다.
pl: Funkcja {0}.{1}() musi zwrócić prawidłową nazwę typu. Nie można odnaleźć typu „{2}” w przestrzeni nazw targetNamespace=„{3}”.
pt_br: {0}.{1}() deve retornar um nome de tipo válido. Não é possível encontrar o tipo '{2}' no targetNamespace='{3}'.
ru: {0}.{1}() должен возвращать действительное имя типа. Не удается найти тип "{2}" в targetNamespace="{3}".
tr: {0}.{1}() geçerli tür adı döndürmelidir. targetNamespace='{3}' içinde '{2}' bulunamıyor.
zh_hans: {0}.{1}() 必须返回有效的类型名称。在 targetNamespace='{3}' 中找不到类型“{2}”。
zh_hant: {0}.{1}() 必須傳回有效的類型名稱。在 targetNamespace='{3}' 中找不到類型 '{2}'。

# XmlHiddenMember
source: Member {0}.{1} of type {2} hides base class member {3}.{4} of type {5}. Use XmlElementAttribute or XmlAttributeAttribute to specify a new name.
cs: Člen {0}.{1} typu {2} skrývá člena základní třídy {3}.{4} typu {5}. K určení nového názvu použijte atribut XmlElementAttribute nebo XmlAttributeAttribute.
de: Der Member {0}.{1} vom Typ {2} blendet den Basisklassenmember {3}.{4} vom Typ {5} aus. Verwenden Sie XmlElementAttribute oder XmlAttributeAttribute, um einen neuen Namen anzugeben.
es: El miembro {0}.{1} de tipo {2} oculta al miembro de clase base {3}.{4} de tipo {5}. Utilice XmlElementAttribute o XmlAttributeAttribute para especificar un nombre nuevo.
fr: Le membre {0}.{1} de type {2} masque le membre de la classe de base {3}.{4} de type {5}. Utilisez XmlElementAttribute ou XmlAttributeAttribute pour spécifier un nouveau nom.
it: Il membro {0}.{1} di tipo {2} nasconde il membro della classe di base {3}.{4} di tipo {5}. Per specificare un nuovo nome, usare XmlElementAttribute o XmlAttributeAttribute.
ja: 型 {2} のメンバー {0}.{1} は、型 {5} の基本クラスのメンバー {3}.{4} を隠します。XmlElementAttribute または XmlAttributeAttribute を使って新しい名前を指定してください。
ko: {2} 형식의 멤버 {0}.{1}은(는) {5} 형식의 기본 클래스 멤버 {3}.{4}을(를) 숨깁니다. XmlElementAttribute 또는 XmlAttributeAttribute를 사용하여 새 이름을 지정하세요.
pl: Składowa {0}.{1} typu {2} ukrywa składową klasy bazowej {3}.{4} typu {5}. Użyj elementu XmlElementAttribute lub XmlAttributeAttribute w celu określenia nowej nazwy.
pt_br: O membro {0}.{1} do tipo {2} oculta o membro da classe base {3}.{4} do tipo {5}. Use XmlElementAttribute ou XmlAttributeAttribute para especificar um novo nome.
ru: Член {0}.{1} типа {2} скрывает член базового класса {3}.{4} типа {5}. Для задания нового имени используйте XmlElementAttribute или XmlAttributeAttribute.
tr: {2} türündeki {0}.{1} üyesi {5} türündeki {3}.{4} temel sınıf üyesini gizliyor. Yeni bir ad belirtmek için XmlElementAttribute veya XmlAttributeAttribute kullanın.
zh_hans: 类型 {2} 的成员 {0}.{1} 隐藏类型 {5} 的基类成员 {3}.{4}。使用 XmlElementAttribute 或 XmlAttributeAttribute 指定一个新名称。
zh_hant: 類型 {2} 的成員 {0}.{1} 會隱藏類型為 {5} 的基底類別成員 {3}.{4}。請使用 XmlElementAttribute 或 XmlAttributeAttribute 指定一個新的名稱。

# XmlIdentityAccessDenied
source: Access to the temp directory is denied. Identity '{0}' under which XmlSerializer is running does not have sufficient permission to access the temp directory. CodeDom will use the user account the process is using to do the compilation, so if the user doesn�t have access to system temp directory, you will not be able to compile. Use Path.GetTempPath() API to find out the temp directory location.
cs: Přístup k dočasnému adresáři je zamítnutý. Identita {0}, pod kterou běží objekt XmlSerializer, nemá dostatečná oprávnění pro přístup k dočasnému adresáři. Objekt CodeDom bude používat uživatelský účet, který proces používá, ke kompilaci. Pokud tedy uživatel nemá přístup k dočasnému adresáři systému, nebude možné provést kompilaci. Umístění dočasného adresáře najdete pomocí rozhraní API metody Path.GetTempPath().
de: Der Zugriff auf das temporäre Verzeichnis wird verweigert. Die Identität "{0}", unter der XmlSerializer ausgeführt wird, verfügt nicht über ausreichende Berechtigungen für den Zugriff auf das temporäre Verzeichnis. CodeDom verwendet das Benutzerkonto, über das der Prozess die Kompilierung durchführt. Wenn der Benutzer keinen Zugriff auf das temporäre Systemverzeichnis hat, können Sie die Kompilierung daher nicht ausführen. Ermitteln Sie den Speicherort des temporären Verzeichnisses mithilfe der Path.GetTempPath()-API.
es: Acceso denegado al directorio temporal. La identidad "{0}" bajo la que se ejecuta XmlSerializer no dispone del permiso apropiado para tener acceso al directorio temporal. CodeDom utilizará la cuenta de usuario usada por el proceso para realizar la compilación. Si el usuario no tiene acceso al directorio temporal del sistema, no podrá compilar. Use la API Path.GetTempPath() para obtener la ubicación del directorio temporal.
fr: Accès au répertoire temporaire refusé. L'identité '{0}' sous laquelle XmlSerializer est exécuté dispose d'une autorisation insuffisante pour pouvoir accéder à ce répertoire temporaire. CodeDom utilisera le compte d'utilisateur que le processus emploie pour la compilation. Ainsi, si l'utilisateur n'a pas accès au répertoire temporaire du système, vous ne pourrez pas effectuer de compilation. Utilisez l'API Path.GetTempPath() pour déterminer l'emplacement du répertoire temporaire.
it: L'accesso alla directory temp è stato negato. Le autorizzazioni dell'identità '{0}' con cui viene eseguito XmlSerializer non sono sufficienti per accedere a tale directory. CodeDom userà l'account utente usato dal processo per eseguire la compilazione, quindi se l'utente non ha accesso alla directory temp, non sarà possibile eseguire la compilazione. Usare l'API Path.GetTempPath() per individuare il percorso della directory temp.
ja: TEMP ディレクトリへのアクセスが拒否されました。XmlSerializer を実行している ID '{0}' に、TEMP ディレクトリへのアクセスに必要なアクセス許可がありません。CodeDom では、プロセスが使用しているユーザー アカウントがコンパイルに使用されるため、ユーザーがシステム TEMP ディレクトリへのアクセス権を持っていない場合、コンパイルはできません。TEMP ディレクトリの場所を見つけるには、Path.GetTempPath() API を使用してください。
ko: 임시 디렉터리에 대한 액세스가 거부되었습니다. XmlSerializer가 실행되는 ID '{0}'에 권한이 부족하여 임시 디렉터리에 액세스할 수 없습니다. CodeDOM은 프로세스가 컴파일을 수행하는 데 사용하고 있는 사용자 계정을 사용하므로 사용자에게 시스템 임시 디렉터리에 대한 액세스 권한이 없으면 컴파일할 수 없습니다. Path.GetTempPath() API를 사용하여 임시 디렉터리 위치를 확인하세요.
pl: Odmowa dostępu do katalogu tymczasowego. Uprawnienia tożsamości „{0}”, w ramach której uruchomiono element XmlSerializer, nie są wystarczające do uzyskiwania dostępu do katalogu tymczasowego. Kompilacja zostanie przeprowadzona przez obiekt CodeDom przy użyciu konta użytkownika, które jest wykorzystywane w tym procesie. Jeśli natomiast użytkownik nie ma dostępu do systemowego katalogu tymczasowego, kompilacja będzie niemożliwa. W celu zidentyfikowania lokalizacji katalogu tymczasowego skorzystaj z interfejsu API Path.GetTempPath().
pt_br: Acesso negado ao diretório temporário. A identidade '{0}' com a qual XmlSerializer está sendo executado não tem permissão suficiente para acessar o diretório temporário. O CodeDom usará a conta do usuário que o processo está usando para fazer a compilação, portanto, se o usuário não tiver acesso ao diretório temporário do sistema, você não poderá compilar. Use a API Path.GetTempPath() para descobrir a localização do diretório temporário.
ru: Доступ к временному каталогу запрещен. Идентификатор "{0}", с которым работает XmlSerializer, не дает достаточных прав для доступа к временному каталогу. CodeDom будет использовать учетные данные пользователя, используемые процессом для компиляции, поэтому, если пользователь не имеет доступа к системному временному каталогу, компиляция будет невозможна. Используйте API Path.GetTempPath(), чтобы определить местоположение временного каталога.
tr: Temp dizinine erişim engellendi. XmlSerializer'ı çalıştıran '{0}' kimliğinin temp dizinine erişmek için yeterli izni yok. CodeDom, derlemeyi yapmak için işlemin kullandığı kullanıcı hesabını kullanacağından, kullanıcı sistemin temp dizinine erişemiyorsa derleme yapamazsınız. Temp dizininin konumunu bulmak için Path.GetTempPath() API'sini kullanın.
zh_hans: 拒绝访问临时目录。以其运行 XmlSerializer 的身份“{0}”没有足够的权限访问临时目录。CodeDom 将使用此进程用于进行编译的用户帐户，因此如果用户对系统临时目录没有访问权限，则将无法编译。使用 Path.GetTempPath() API 可找到临时目录位置。
zh_hant: 存取暫存目錄遭拒。執行 XmlSerializer 使用的身分識別 '{0}' 沒有足夠的權限可存取暫存目錄。CodeDom 將會使用此處理序使用的使用者帳戶來執行編譯，所以若使用者無法存取系統暫存目錄，即無法進行編譯。請使用 Path.GetTempPath() API 來尋找暫存目錄位置。

# XmlIllegalAnyElement
source: Cannot serialize member of type {0}: XmlAnyElement can only be used with classes of type XmlNode or a type deriving from XmlNode.
cs: Nelze serializovat člen typu {0}: Atribut XmlAnyElement lze použít pouze pro třídy typu XmlNode nebo typu, který je od typu XmlNode odvozen.
de: Der Member vom Typ "{0}" kann nicht serialisiert werden: XmlAnyElement kann nur mit Klassen vom Typ XmlNode oder einem von XmlNode abgeleiteten Typ verwendet werden.
es: No se pueden serializar miembros del tipo {0}: solo se puede utilizar XmlAnyElement con clases del tipo XmlNode o un tipo que derive de XmlNode.
fr: Impossible de sérialiser un membre du type {0} : XmlAnyElement ne peut être utilisé qu'avec des classes de type XmlNode ou un type dérivant de XmlNode.
it: Non è possibile serializzare il membro di tipo {0}: XmlAnyElement può essere usato solo con classi di tipo XmlNode o di un tipo derivato da XmlNode.
ja: 型 {0} のメンバーはシリアル化できません。XmlAnyElement は XmlNode 型または XmlNode から派生した型のクラスでのみ使用できます。
ko: {0} 형식의 멤버를 직렬화할 수 없습니다. XmlAnyElement는 XmlNode 형식 또는 XmlNode에서 파생된 형식의 클래스에서만 사용할 수 있습니다.
pl: Nie można serializować składowej typu {0}. Element XmlAnyElement może być używany tylko z klasami typu XmlNode albo z typem pochodnym względem typu XmlNode.
pt_br: Não é possível serializar o membro do tipo {0}: XmlAnyElement só pode ser usado com classes do tipo XmlNode ou um tipo derivado de XmlNode.
ru: Невозможно сериализовать член типа {0}: XmlAnyElement может использоваться только с классами типа XmlNode или производного от XmlNode типа.
tr: {0} türündeki üye serileştirilemiyor: XmlAnyElement yalnızca XmlNode türü sınıflarla veya XmlNode'dan türetilen bir türle birlikte kullanılabilir.
zh_hans: 无法序列化类型 {0} 的成员: XmlAnyElement 只可与 XmlNode 类型或从 XmlNode 派生的类型的类一起使用。
zh_hant: 無法將類型 {0} 的成員序列化: XmlAnyElement 只可和類型 XmlNode 的類別或衍生自 XmlNode 的類型搭配使用。

# XmlIllegalArrayArrayAttribute
source: XmlArray and XmlArrayItem cannot be used in conjunction with XmlAttribute, XmlAnyAttribute, XmlElement, XmlText, or XmlAnyElement.
cs: Atributy XmlArray a XmlArrayItem nelze použít současně s atributy XmlAttribute, XmlAnyAttribute, XmlElement, XmlText a XmlAnyElement.
de: XmlArray und XmlArrayItem können nicht zusammen mit XmlAttribute, XmlAnyAttribute, XmlElement, XmlText oder XmlAnyElement verwendet werden.
es: No se puede utilizar XmlArray y XmlArrayItem junto con XmlAttribute, XmlAnyAttribute, XmlElement, XmlText o XmlAnyElement.
fr: XmlArray et XmlArrayItem ne peuvent pas être utilisés avec XmlAttribute, XmlAnyAttribute, XmlElement, XmlText ou XmlAnyElement.
it: Non è possibile usare XmlArray e XmlArrayItem insieme a XmlAttribute, XmlAnyAttribute, XmlElement, XmlText o XmlAnyElement.
ja: XmlArray および XmlArrayItem を XmlAttribute、XmlAnyAttribute、XmlElement、XmlText または XmlAnyElement との組み合わせで使うことはできません。
ko: XmlArray와 XmlArrayItem은 XmlAttribute, XmlAnyAttribute, XmlElement, XmlText 또는 XmlAnyElement와 함께 사용할 수 없습니다.
pl: Elementy XmlArray i XmlArrayItem nie mogą być używane w połączeniu z elementami XmlAttribute, XmlAnyAttribute, XmlElement, XmlText lub XmlAnyElement.
pt_br: XmlArray e XmlArrayItem não podem ser usados juntamente com XmlAttribute, XmlAnyAttribute, XmlElement, XmlText ou XmlAnyElement.
ru: Невозможно использовать XmlArray и XmlArrayItem совместно с XmlAttribute, XmlAnyAttribute, XmlElement, XmlText и XmlAnyElement.
tr: XmlArray ve XmlArrayItem, XmlAttribute, XmlAnyAttribute, XmlElement, XmlText, veya XmlAnyElement ile birlikte kullanılamaz.
zh_hans: XmlArray 和 XmlArrayItem 不能与 XmlAttribute、XmlAnyAttribute、XmlElement、XmlText 或 XmlAnyElement 一起使用。
zh_hant: XmlArray 和 XmlArrayItem 不可以和 XmlAttribute、XmlAnyAttribute、XmlElement、XmlText 或 XmlAnyElement 結合使用。
