Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlSerializableAttributes
source: Only XmlRoot attribute may be specified for the type {0}. Please use {1} to specify schema type.
cs: Pouze atribut XmlRoot může být zadán pro typ {0}. K zadání typu schématu prosím použijte {1}.
de: Nur das XmlRoot-Attribut kann für den Typ {0} angegeben werden. Verwenden Sie {1}, um den Schematyp anzugeben.
es: Solo se puede especificar el atributo XmlRoot para el tipo {0}. Utilice {1} para especificar el tipo de esquema.
fr: Seul l'attribut XmlRoot peut être spécifié pour le type {0}. Utilisez {1} pour indiquer le type de schéma.
it: Per il tipo {0} è possibile specificare solo l'attributo XmlRoot. Usare {1} per specificare il tipo di schema.
ja: 型 {0} に指定できるのは、XmlRoot 属性のみです。スキーマの型を指定するには {1} を使用してください。
ko: 형식 {0}에 대해서는 XmlRoot 특성만 지정할 수 있습니다. {1}을(를) 사용하여 스키마 형식을 지정하세요.
pl: Dla typu {0} można określić tylko atrybut XmlRoot. W celu określenia typu schematu użyj elementu {1}.
pt_br: Somente o atributo XmlRoot pode ser especificado para o tipo {0}. Use {1} para especificar o tipo de esquema.
ru: Для типа {0} может быть указан только атрибут XmlRoot. Используйте {1} для указания типа схемы.
tr: {0} türü için yalnızca XmlRoot özniteliği belirtilebilir. Lütfen şema türü belirtmek için {1} kullanın.
zh_hans: 对于类型 {0}，只能指定 XmlRoot 特性。请使用 {1} 指定架构类型。
zh_hant: 只可為類型 {0} 指定 XmlRoot 屬性。請使用 {1} 來指定結構描述類型。

# XmlSerializableBadDerivation
source: Type '{0}' from namespace '{1}' declared as derivation of type '{2}' from namespace '{3}, but corresponding CLR types are not compatible. Cannot convert type '{4}' to '{5}'.
cs: Typ {0} z oboru názvů {1} byl deklarován jako odvození z typu {2} z oboru názvů {3}, ale odpovídající typy CLR nejsou kompatibilní. Nelze převést typ {4} na typ {5}.
de: Der Typ "{0}" aus dem Namespace "{1}" wurde als Ableitung des Typs "{2}" aus dem Namespace "{3}" deklariert, zugehörige CLR-Typen sind jedoch nicht kompatibel. Der Typ "{4}" kann nicht in "{5}" konvertiert werden.
es: El tipo "{0}" del espacio de nombres "{1}" se ha declarado como derivación del tipo "{2}" del espacio de nombres "{3}, pero los tipos CLR correspondientes no son compatibles. No se puede convertir el tipo "{4}" a "{5}".
fr: Le type '{0}' de l'espace de noms '{1}' a été déclaré en tant que dérivation du type '{2}' de l'espace de noms '{3}, mais les types CLR correspondants ne sont pas compatibles. Impossible de convertir le type '{4}' en '{5}'.
it: Il tipo '{0}' dello spazio dei nomi '{1}' è dichiarato come derivazione del tipo '{2}' dello spazio dei nomi '{3}', ma i tipi CLR corrispondenti non sono compatibili. Non è possibile convertire il tipo '{4}' in '{5}'.
ja: 名前空間 '{1}' の型 '{0}' は、名前空間 '{3}' の型 '{2}' の派生として宣言されていますが、対応する CLR 型には互換性がありません。型 '{4}' は '{5}' に変換できません。
ko: 네임스페이스 '{1}'의 형식 '{0}'은(는) 네임스페이스 '{3}의 형식 '{2}'에 대한 파생으로 선언되었지만 해당 CLR 형식이 호환되지 않습니다. 형식 '{4}'을(를) '{5}'(으)로 변환할 수 없습니다.
pl: Typ „{0}” z przestrzeni nazw „{1}” został zadeklarowany jako pochodny typu „{2}” z przestrzeni nazw „{3}”, ale odpowiednie typy CLR nie są zgodne. Nie można przekonwertować typu „{4}” na „{5}”.
pt_br: Tipo '{0}' do namespace '{1}' declarado como derivação do tipo '{2}' do namespace '{3}, mas os tipos CLR correspondentes não são compatíveis. Não é possível converter tipo '{4}' em '{5}'.
ru: Тип "{0}" из пространства имен "{1}" объявлен как производный от типа "{2}" из пространства имен "{3}, однако соответствующие типы CLR несовместимы. Невозможно привести тип "{4}" к "{5}".
tr: '{1}' ad alanındaki '{0}' türü '{3} ad alanındaki '{2}' türünden türetilmiş olarak bildirildi, ancak karşılık gelen CLR türleri uyumlu değil. '{4}' türü '{5}' türüne dönüştürülemiyor.
zh_hans: 来自命名空间“{1}”的类型“{0}”声明为来自命名空间“{3}”的类型“{2}”的派生，但相应的 CLR 类型不兼容。无法将类型“{4}”转换为“{5}”。
zh_hant: 命名空間 '{1}' 的類型 '{0}' 已宣告為命名空間 '{3}' 類型 '{2}' 的衍生項，但相對應的 CLR 類型不相容。無法將類型 '{4}' 轉換為 '{5}'。

# XmlSerializableMergeItem
source: Cannot merge schemas with targetNamespace='{0}'. Several mismatched declarations were found: {1}
cs: Nelze sloučit schémata s oborem názvů targetNamespace={0}. Bylo nalezeno několik neshodných deklarací: {1}
de: Schemas mit targetNamespace="{0}" können nicht zusammengeführt werden. Mehrere nicht übereinstimmende Deklarationen wurden gefunden: {1}.
es: No se pueden combinar esquemas con targetNamespace="{0}". Varias declaraciones no coinciden: {1}
fr: Impossible de fusionner les schémas dotés de targetNamespace='{0}'. Plusieurs déclarations incompatibles ont été détectées : {1}
it: Non è possibile unire gli schemi con targetNamespace='{0}'. Sono state trovate diverse dichiarazioni non corrispondenti: {1}
ja: スキーマを targetNamespace='{0}' にマージできません。一致しない宣言がいくつか見つかりました。{1}
ko: targetNamespace='{0}'인 스키마를 병합할 수 없습니다. 일치하지 않는 여러 선언을 찾았습니다: {1}
pl: Nie można scalać schematów, dla których targetNamespace=„{0}”. Znaleziono kilka niezgodnych deklaracji: {1}.
pt_br: Não é possível mesclar esquemas com targetNamespace='{0}'. Foram encontradas diversas declarações com erros de correspondência. {1}
ru: Невозможно объединить схемы с targetNamespace="{0}". Найдено несколько несогласованных объявлений: {1}
tr: targetNamespace='{0}' olan şemalar birleştirilemiyor. Uyuşmayan birkaç bildirim bulundu: {1}
zh_hans: 无法与 targetNamespace='{0}' 合并架构。发现多个不匹配的定义: {1}
zh_hant: 無法將結構描述與 targetNamespace='{0}' 合併。發生某些宣告不相符的問題: {1}

# XmlSerializableMissingClrType
source: Type '{0}' from namespace '{1}' does not have corresponding IXmlSerializable type. Please consider adding {2} to '{3}'.
cs: Typ {0} z oboru názvů {1} nemá odpovídající typ rozhraní IXmlSerializable. Zvažte prosím možnost přidat {2} do {3}.
de: Der Typ "{0}" aus dem Namespace "{1}" verfügt über keinen entsprechenden IXmlSerializable-Typ. Fügen Sie {2} ggf. zu "{3}" hinzu.
es: El tipo "{0}" del espacio de nombres "{1}" no tiene el tipo IXmlSerializable correspondiente. Considere la posibilidad de agregar {2} a "{3}".
fr: Le type '{0}' de l'espace de noms '{1}' n'a pas le type IXmlSerializable correspondant. Pensez à ajouter {2} à '{3}'.
it: Il tipo '{0}' dello spazio dei nomi '{1}' non include il tipo IXmlSerializable corrispondente. Provare ad aggiungere {2} a '{3}'.
ja: 名前空間 '{1}' の型 '{0}' には、対応する IXmlSerializable 型がありません。{2} を '{3}' に追加してください。
ko: 네임스페이스 '{1}'의 형식 '{0}'에 해당 IXmlSerializable 형식이 없습니다. '{3}'에 {2}을(를) 추가하세요.
pl: Typ „{0}” z przestrzeni nazw „{1}” nie ma odpowiedniego typu IXmlSerializable. Rozważ dodanie elementu {2} do elementu „{3}”.
pt_br: O tipo '{0}' do namespace '{1}' não tem o tipo IXmlSerializable correspondente. Considere adicionar {2} a '{3}'.
ru: Тип "{0}" из пространства имен "{1}" не имеет соответствующего типа IXmlSerializable. Попробуйте добавить {2} в "{3}".
tr: '{1}' ad alanındaki '{0}' türünün, karşılık gelen IXmlSerializable türü yok. Lütfen '{3}' içine {2} ekleyin.
zh_hans: 来自命名空间“{1}”的类型“{0}”没有相应的 IXmlSerializable 类型。请考虑将 {2} 添加到“{3}”中。
zh_hant: 命名空間 '{1}' 的類型 '{0}' 沒有相同的 IXmlSerializable 類型。請考慮新增 {2} 至 '{3}'。

# XmlSerializableNameMissing1
source: Schema Id is missing. The schema returned from {0}.GetSchema() must have an Id.
cs: Identifikátor schématu nebyl nalezen. Schéma vrácené funkcí {0}.GetSchema() musí mít identifikátor.
de: Die Schema-ID fehlt. Das von {0}.GetSchema() zurückgegebene Schema muss eine ID haben.
es: Falta el identificador de esquema. El esquema devuelto por {0}.GetSchema() debe tener un identificador.
fr: L'ID de schéma est manquant. Le schéma retourné à partir de {0}.GetSchema() doit avoir un ID.
it: Manca l'ID schema. Lo schema restituito da {0}.GetSchema() deve contenere un ID.
ja: スキーマ ID がありません。{0}.GetSchema() から返されたスキーマには ID が必要です。
ko: 스키마 ID가 없습니다. {0}.GetSchema()에서 반환된 스키마에는 ID가 있어야 합니다.
pl: Brak identyfikatora schematu. Schemat zwrócony z {0}.GetSchema() musi mieć identyfikator.
pt_br: ID de esquema inexistente. O esquema retornado de {0}.GetSchema() deve ter uma ID.
ru: Отсутствует идентификатор схемы. Возвращаемая из {0}.GetSchema() схема должна иметь идентификатор.
tr: Şema kimliği eksik. {0}.GetSchema() tarafından döndürülen şemanın bir kimliği olması gerekir.
zh_hans: 缺少架构 ID。从 {0}.GetSchema()返回的架构必须具有 ID。
zh_hant: 遺漏了結構描述識別碼。從 {0}.GetSchema() 所傳回的結構描述必須要有識別碼。

# XmlSerializableRootDupName
source: Cannot reconcile schema for '{0}'. Please use [XmlRoot] attribute to change default name or namespace of the top-level element to avoid duplicate element declarations: element name='{1}' namespace='{2}'.
cs: Nelze sloučit schéma pro {0}. Pomocí atributu [XmlRoot] změňte výchozí název nebo obor názvů elementu na nejvyšší úrovni tak, abyste zabránili duplicitním deklaracím elementů: název elementu={1}, obor názvů={2}
de: Das Schema für "{0}" kann nicht abgestimmt werden. Verwenden Sie das [XmlRoot]-Attribut zum Ändern des Standardnamens oder Namespaces des Elements auf oberster Ebene, um doppelte Elementdeklarationen zu vermeiden: Elementname="{1}", Namespace="{2}".
es: No se puede conciliar el esquema para "{0}". Utilice el atributo [XmlRoot] para cambiar el nombre predeterminado o espacio de nombres de los elementos de nivel superior para evitar declaraciones de elemento duplicadas: nombre de elemento="{1}" espacio de nombres="{2}".
fr: Impossible de rapprocher le schéma de '{0}'. Utilisez l'attribut [XmlRoot] pour changer le nom ou l'espace de noms par défaut de l'élément de niveau supérieur pour éviter les déclarations d'élément en double : nom d'élément='{1}' espace de noms='{2}'.
it: Non è possibile risolvere le differenze dello schema per '{0}'. Usare l'attributo [XmlRoot] per modificare il nome o lo spazio dei nomi predefinito dell'elemento di primo livello per evitare dichiarazioni di elemento duplicate: nome elemento='{1}' spazio dei nomi='{2}'.
ja: '{0}' のスキーマを調整できません。element name='{1}' namespace='{2}' のように要素が重複して宣言されないようにするには、[XmlRoot] 属性を使用してトップレベルにある要素の既定の名前および名前空間を変更してください。
ko: '{0}'에 대한 스키마를 조정할 수 없습니다. [XmlRoot] 특성을 사용하여 요소 선언이 중복되지 않도록 최상위 요소의 기본 이름 또는 네임스페이스를 변경하세요. 요소 이름='{1}' 네임스페이스='{2}'.
pl: Nie można uzgodnić schematu dla elementu „{0}”. Użyj atrybutu [XmlRoot], aby zmienić domyślną nazwę lub przestrzeń nazw w celu uniknięcia deklaracji zduplikowanych elementów: nazwa elementu = „{1}”, przestrzeń nazw = „{2}”.
pt_br: Não é possível reconciliar o esquema de '{0}'. Use o atributo [XmlRoot] para alterar o nome ou o namespace padrão do elemento de nível superior a fim de evitar declarações de elementos duplicadas: nome do elemento = '{1}', namespace = '{2}'.
ru: Невозможно согласовать схему для "{0}". Используйте атрибут [XmlRoot] для изменения стандартного имени или пространства имен для элемента верхнего уровня, чтобы избежать повторного объявления элемента: имя элемента="{1}" пространство имен="{2}".
tr: Şema '{0}' için uzlaştırılamıyor.Lütfen yinelenen öğe bildirimlerinden kaçınmak için en üst düzey öğenin varsayılan adını veya ad alanını değiştirmek üzere [XmlRoot] özniteliğini kullanın: öğe adı='{1}' ad alanı='{2}'.
zh_hans: 无法为“{0}”协调架构。请使用 [XmlRoot] 特性更改顶级元素的默认名称或命名空间，以避免出现重复的元素声明: element name='{1}' namespace='{2}'。
zh_hant: 無法協調 '{0}' 的結構描述。請使用 [XmlRoot] 屬性來變更預設名稱或最上層元素的命名空間，以避免元素宣告重複: 元素名稱='{1}' 命名空間='{2}'。

# XmlSerializableSchemaError
source: Schema type information provided by {0} is invalid: {1}
cs: Informace o typu schématu zadané v rámci {0} jsou neplatné: {1}
de: Die von {0} bereitgestellten Schematypinformationen sind ungültig: {1}.
es: La información de tipo de esquema proporcionada por {0} no es válida: {1}
fr: Les informations de type de schéma fournies par {0} sont non valides : {1}
it: Le informazioni del tipo di schema fornite da {0} non sono valide: {1}
ja: {0} から提供されたスキーマの型情報が無効です。{1}
ko: {0}에서 제공한 스키마 형식 정보가 잘못되었습니다: {1}
pl: Informacje o typie schematu udostępnione przez element {0} są nieprawidłowe: {1}.
pt_br: As informações de tipo de esquema fornecidas por {0} são inválidas: {1}
ru: Данные о типе схемы, предоставленные {0}, недействительны: {1}
tr: {0} tarafından sağlanan şema türü bilgisi geçersiz: {1}
zh_hans: 由 {0} 提供的架构类型信息无效: {1}
zh_hant: {0} 所提供的結構描述類型資訊無效: {1}

# XmlSerializeError
source: There is an error in the XML document.
cs: Dokument XML obsahuje chybu.
de: Fehler im XML-Dokument.
es: Error en el documento XML.
fr: Il existe une erreur dans le document XML.
it: Il documento XML contiene un errore.
ja: XML ドキュメントでエラーが発生しました。
ko: XML 문서에 오류가 있습니다.
pl: Dokument XML zawiera błąd.
pt_br: Erro no documento XML.
ru: В документе XML присутствует ошибка.
tr: XML belgesinde bir hata var.
zh_hans: XML 文档中有错误。
zh_hant: XML 文件中有錯誤。

# XmlSerializeErrorDetails
source: There is an error in XML document ({0}, {1}).
cs: Dokument XML obsahuje chybu ({0}, {1}).
de: Fehler im XML-Dokument ({0}, {1}).
es: Error en el documento XML ({0}, {1}).
fr: Il existe une erreur dans le document XML ({0}, {1}).
it: Il documento XML contiene un errore ({0}, {1}).
ja: XML ドキュメント ({0},{1}) でエラーが発生しました。
ko: XML 문서({0}, {1})에 오류가 있습니다.
pl: Dokument XML zawiera błąd ({0}, {1}).
pt_br: Erro no documento XML ({0}, {1}).
ru: В документе XML ({0}, {1}) присутствует ошибка.
tr: XML belgesinde bir hata var ({0}, {1}).
zh_hans: XML 文档({0}, {1})中有错误。
zh_hant: XML 文件 ({0}, {1}) 中有錯誤。

# XmlSerializerAccessDenied
source: Access to the temp directory is denied. The process under which XmlSerializer is running does not have sufficient permission to access the temp directory. CodeDom will use the user account the process is using to do the compilation, so if the user doesn�t have access to system temp directory, you will not be able to compile. Use Path.GetTempPath() API to find out the temp directory location.
cs: Přístup k dočasnému adresáři je zamítnutý. Proces, v rámci kterého objekt XmlSerializer běží, nemá dostatečná oprávnění pro přístup k dočasnému adresáři. Objekt CodeDom bude používat uživatelský účet, který proces používá, ke kompilaci. Pokud tedy uživatel nemá přístup k dočasnému adresáři systému, nebude možné provádět kompilaci. Umístění dočasného adresáře najdete pomocí rozhraní API metody Path.GetTempPath().
de: Der Zugriff auf das temporäre Verzeichnis wird verweigert. Der Prozess, unter dem XmlSerializer ausgeführt wird, verfügt nicht über ausreichende Berechtigungen für den Zugriff auf das temporäre Verzeichnis. CodeDom verwendet das Benutzerkonto, über das der Prozess die Kompilierung durchführt. Wenn der Benutzer keinen Zugriff auf das temporäre Systemverzeichnis hat, können Sie die Kompilierung daher nicht ausführen. Ermitteln Sie den Speicherort des temporären Verzeichnisses mithilfe von Path.GetTempPath() API.
es: Acceso denegado al directorio temporal. El proceso bajo el que se ejecuta XmlSerializer no dispone del permiso apropiado para tener acceso al directorio temporal. CodeDom utilizará la cuenta de usuario usada por el proceso para realizar la compilación. Si el usuario no tiene acceso al directorio temporal del sistema, no podrá compilar. Use la API Path.GetTempPath() para obtener la ubicación del directorio temporal.
fr: Accès au répertoire temporaire refusé. Le processus sous lequel XmlSerializer est exécuté dispose d'une autorisation insuffisante pour pouvoir accéder à ce répertoire temporaire. CodeDom utilisera le compte d'utilisateur que le processus emploie pour la compilation. Ainsi, si l'utilisateur n'a pas accès au répertoire temporaire du système, vous ne pourrez pas effectuer de compilation. Utilisez l'API Path.GetTempPath() pour déterminer l'emplacement du répertoire temporaire.
it: L'accesso alla directory temp è stato negato. Il processo con cui viene eseguito XmlSerializer non ha autorizzazioni sufficienti per accedere a tale directory. CodeDom userà l'account utente usato dal processo per eseguire la compilazione, pertanto se l'utente non ha accesso alla directory temp, non sarà possibile eseguire la compilazione. Usare l'API Path.GetTempPath() per individuare il percorso della directory temp.
ja: TEMP ディレクトリへのアクセスが拒否されました。XmlSerializer を実行しているプロセスに、TEMP ディレクトリへのアクセスに必要なアクセス許可がありません。CodeDom では、プロセスが使用しているユーザー アカウントがコンパイルに使用されるため、ユーザーが TEMP ディレクトリへのアクセス権を持っていない場合、コンパイルはできません。TEMP ディレクトリの場所を見つけるには、Path.GetTempPath() API を使用してください。
ko: 임시 디렉터리에 대한 액세스가 거부되었습니다. XmlSerializer가 실행되는 프로세스에 권한이 부족하여 임시 디렉터리에 액세스할 수 없습니다. CodeDOM은 프로세스가 컴파일을 수행하는 데 사용하고 있는 사용자 계정을 사용하므로 사용자에게 시스템 임시 디렉터리에 대한 액세스 권한이 없으면 컴파일할 수 없습니다. Path.GetTempPath() API를 사용하여 임시 디렉터리 위치를 확인하세요.
pl: Odmowa dostępu do katalogu tymczasowego. Uprawnienia procesu, w ramach którego uruchomiono element XmlSerializer, nie są wystarczające do uzyskiwania dostępu do katalogu tymczasowego. Kompilacja zostanie przeprowadzona przez obiekt CodeDom przy użyciu konta użytkownika, które jest wykorzystywane w tym procesie. Jeśli natomiast użytkownik nie ma dostępu do systemowego katalogu tymczasowego, kompilacja będzie niemożliwa. W celu zidentyfikowania lokalizacji katalogu tymczasowego skorzystaj z interfejsu API Path.GetTempPath().
pt_br: Acesso negado ao diretório temporário. O processo no qual XmlSerializer está sendo executado não tem permissão suficiente para acessar o diretório temporário. O CodeDom usará a conta do usuário que o processo está usando. Portanto, se o usuário não tiver acesso ao diretório temporário do sistema, você não poderá compilar. Use a API Path.GetTempPath() para descobrir a localização do diretório temporário.
ru: Доступ к временному каталогу запрещен. Процесс, в котором работает XmlSerializer, не имеет достаточных прав для доступа к временному каталогу. CodeDom будет использовать учетные данные пользователя, используемые процессом для компиляции, поэтому, если пользователь не имеет доступа к системному временному каталогу, компиляция будет невозможна. Используйте API Path.GetTempPath(), чтобы определить местоположение временного каталога.
tr: Temp dizinine erişim engellendi. XmlSerializer'ı çalıştıran işlemin temp dizinine erişmek için yeterli izni yok. CodeDom, derlemeyi yapmak için işlemin kullandığı kullanıcı hesabını kullanacağından, kullanıcı sistemin temp dizinine erişemiyorsa derleme yapamazsınız. Temp dizininin konumunu bulmak için Path.GetTempPath() API'sini kullanın.
zh_hans: 拒绝访问临时目录。以其运行 XmlSerializer 的进程没有足够的权限访问临时目录。CodeDom 将使用此进程用于进行编译的用户帐户，因此如果用户对系统临时目录没有访问权限，则将无法编译。使用 Path.GetTempPath() API 可找到临时目录位置。
zh_hant: 存取暫存目錄遭拒。執行 XmlSerializer 的處理序沒有足夠的權限可存取暫存目錄。CodeDom 將會使用此處理序使用的使用者帳戶來執行編譯，所以若使用者無法存取系統暫存目錄，即無法進行編譯。請使用 Path.GetTempPath() API 來尋找暫存目錄位置。

# XmlSerializerCompileFailed
source: Cannot load dynamically generated serialization assembly. In some hosting environments assembly load functionality is restricted, consider using pre-generated serializer. Please see inner exception for more information.
cs: Nelze načíst dynamicky generované sestavení serializace. V některých hostitelských prostředích je funkce načítání sestavení omezena. Zvažte možnost použít předem vygenerovaný serializátor. Další informace získáte v informacích o vnitřní výjimce.
de: Die dynamisch generierte Serialisierungsassembly kann nicht geladen werden. Die Funktionalität zum Laden von Assemblys ist in einigen Hostumgebungen eingeschränkt. Verwenden Sie daher ggf. das vorab generierte Serialisierungsmodul. Weitere Informationen finden Sie in der inneren Ausnahme.
es: No se puede cargar el ensamblado de serialización generado dinámicamente. En algunos entornos de hospedaje, la funcionalidad de carga de ensamblados está restringida; considere la posibilidad de usar un serializador previamente generado. Vea la excepción interna para obtener más información.
fr: Impossible de charger l'assembly de sérialisation généré de manière dynamique. Dans certains environnements hôtes, la fonctionnalité de chargement d'assembly est limitée. Utilisez un sérialiseur prégénéré. Pour plus d'informations, consultez l'exception interne.
it: Non è possibile caricare l'assembly di serializzazione generato dinamicamente. In alcuni ambienti host la funzionalità di caricamento dell'assembly presenta restrizioni. Provare a usare il serializzatore pregenerato. Per altre informazioni, vedere l'eccezione interna.
ja: 動的に生成されたシリアル化アセンブリを読み込めません。一部のホスティング環境ではアセンブリの読み込み機能が制限されています。事前生成されたシリアライザーを使用できないかどうかを検討してください。詳細については、内部例外を参照してください。
ko: 동적으로 생성된 serialization 어셈블리를 로드할 수 없습니다. 일부 호스팅 환경에서는 어셈블리 로드 기능이 제한되므로 미리 생성된 직렬 변환기를 사용해야 합니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Nie można załadować wygenerowanego dynamicznie zestawu serializacji. W niektórych środowiskach obsługi funkcja ładowania zestawu jest ograniczona. Należy więc wziąć pod uwagę wstępnie wygenerowanego serializatora. Więcej informacji na ten temat można znaleźć w opisie wyjątku wewnętrznego.
pt_br: Não é possível carregar o assembly de serialização gerado dinamicamente. Em alguns ambientes de hospedagem, a funcionalidade de carregamento de assembly é restrita. Considere usar o serializador pré-gerado. Consulte a exceção interna para obter mais informações.
ru: Не удается загрузить динамически созданную сборку сериализации. В некоторых окружениях размещения загрузка сборок ограничена; попробуйте использовать предварительный сериализатор. Дополнительные сведения см. во внутреннем исключении.
tr: Dinamik olarak oluşturulan serileştirme bütünleştirilmiş kodunu yükleyemezsiniz. Bazı barındırma ortamlarında bütünleştirilmiş kod yükleme işlevi kısıtlanmıştır, önceden oluşturulan serileştiriciyi kullanmayı deneyin. Lütfen daha fazla bilgi için iç özel duruma bakın.
zh_hans: 无法加载动态生成的序列化程序集。在某些限制程序集加载功能的宿主环境中，请考虑使用预生成的序列化器。有关更多信息，请参见内部异常。
zh_hant: 無法載入動態產生的序列化組件。在一些裝載環境組件載入功能受限，請考慮使用預先產生的序列化程式。請參閱內部例外狀況以取得更多資訊。

# XmlSerializerExpired
source: Pre-generated assembly '{0}' CodeBase='{1}' has expired.
cs: Platnost předem vygenerovaného sestavení {0} CodeBase={1} vypršela.
de: Die vorab generierte Assembly "{0}", CodeBase="{1}" ist abgelaufen.
es: El elemento CodeBase="{1}" del ensamblado "{0}" generado previamente ha expirado.
fr: L'assembly prégénéré '{0}' CodeBase='{1}' a expiré.
it: L'assembly pregenerato '{0}' CodeBase='{1}' è scaduto.
ja: 事前に生成されていたアセンブリ '{0}' コードベース='{1}' が有効ではなくなりました。
ko: 미리 생성된 어셈블리 '{0}' CodeBase='{1}'이(가) 만료되었습니다.
pl: Ważność wstępnie wygenerowanego zestawu „{0}” (CodeBase=„{1}”) wygasła.
pt_br: O assembly pré-gerado '{0}' com CodeBase='{1}' expirou.
ru: Истек срок действия для предварительной сборки "{0}" и CodeBase (базы кода) "{1}".
tr: Önceden oluşturulan bütünleştirilmiş kod '{0}' CodeBase='{1}' süresi dolmuş.
zh_hans: 预生成的程序集“{0}”CodeBase='{1}' 已过期。
zh_hant: 預先產生的組件 '{0}' CodeBase='{1}' 已過期。

# XmlSerializerExpiredDetails
source: Pre-generated serializer '{0}' has expired. You need to re-generate serializer for '{1}'.
cs: Platnost předem vygenerovaného serializátoru {0} vypršela. Je potřeba serializátor vygenerovat znovu pro {1}.
de: Das vorab generierte Serialisierungsmodul "{0}" ist abgelaufen. Sie müssen das Serialisierungsmodul für "{1}" erneut generieren.
es: El serializador pregenerado "{0}" ha expirado. Debe volver a generar el serializador para "{1}".
fr: Le sérialiseur prégénéré '{0}' a expiré. Vous devez regénérer le sérialiseur de '{1}'.
it: Il serializzatore pregenerato '{0}' è scaduto. È necessario rigenerare il serializzatore per '{1}'.
ja: 事前生成されたシリアライザー '{0}' の有効期限が切れました。'{1}' のシリアライザーを再度生成する必要があります。
ko: 미리 생성된 직렬 변환기 '{0}'이(가) 만료되었습니다. '{1}'에 대한 직렬 변환기를 다시 생성해야 합니다.
pl: Ważność wstępnie wygenerowanego serializatora „{0}” wygasła. Musisz ponownie wygenerować serializator dla elementu „{1}”.
pt_br: O serializador pré-gerado '{0}' expirou. Você deve gerar novamente o serializador para '{1}'.
ru: Срок действия предварительного сериализатора "{0}" истек. Нужно повторно создать сериализатор для "{1}".
tr: Önceden oluşturulan '{0}' serileştiricisinin süresi dolmuş. '{1}' için serileştiriciyi yeniden oluşturmanız gerekir.
zh_hans: 预生成的程序集“{0}”已过期。需要为“{1}”重新生成序列化程序。
zh_hant: 預先產生序列化程式 '{0}' 已過期。您需要重新產生 '{1}' 的序列化程式。
