Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_ElementFromGroupBase1
source: The derived element {0} at ({1}, {2}) is not a valid restriction of the base sequence particle at ({3}, {4}) according to Elt:All/Choice/Sequence -- RecurseAsIfGroup.
cs: Odvozený element {0} na pozici ({1}, {2}) není platné omezení základní částice sequence na pozici ({3}, {4}) podle Elt:All/Choice/Sequence -- RecurseAsIfGroup.
de: Das abgeleitete Element {0} bei ({1},{2}) ist gemäß Elt:All/Choice/Sequence -- RecurseAsIfGroup keine gültige Einschränkung des Basispartikels "sequence" bei ({3}, {4}).
es: El elemento derivado {0} en ({1},{2}) no es una restricción válida de la partícula sequence base en ({3}, {4}) según Elt:All/Choice/Sequence -- RecurseAsIfGroup.
fr: L'élément dérivé {0} sur ({1}, {2}) n'est pas une restriction valide de la particule Sequence de base sur ({3}, {4}), selon Elt:All/Choice/Sequence -- RecurseAsIfGroup.
it: L'elemento derivato {0} alla posizione ({1},{2}) non è una restrizione valida della particella sequence di base alla posizione ({3}, {4}) in base alla regola Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ja: Elt:All/Choice/Sequence -- RecurseAsIfGroup により、({1}, {2}) にある派生型の要素 {0} は、({3}, {4}) にある基本型の sequence パーティクルの有効な制限とは認められません。
ko: ({1}, {2})에 있는 파생 요소 {0}은(는) Elt:All/Choice/Sequence -- RecurseAsIfGroup에 따라 ({3}, {4})에 있는 기본 sequence 파티클의 유효한 제한이 아닙니다.
pl: Element pochodny {0} w lokalizacji ({1}, {2}) nie jest prawidłowym ograniczeniem podstawowej cząstki sequence w lokalizacji ({3}, {4}) zgodnie z następującą regułą: Elt:All/Choice/Sequence -- RecurseAsIfGroup.
pt_br: O elemento derivado {0} em ({1}, {2}) não é uma restrição válida da partícula base sequence em ({3}, {4}) de acordo com Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ru: Производный элемент {0} в ({1}, {2}) не является действительным ограничением для базовой части sequence в ({3}, {4}) в соответствии с Elt:All/Choice/Sequence — RecurseAsIfGroup.
tr: ({1}, {2}) konumundaki {0} türetilen öğesi, Elt:All/Choice/Sequence -- RecurseAsIfGroup kuralına göre ({3}, {4}) konumundaki temel sequence parçacığının geçerli bir kısıtlaması değil.
zh_hans: 根据 Elt:All/Choice/Sequence -- RecurseAsIfGroup，位于({1}, {2})的派生元素 {0} 不是位于({3}, {4})的基本 sequence 粒子的有效限制。
zh_hant: 根據 Elt:All/Choice/Sequence – RecurseAsIfGroup，({1}, {2}) 中的衍生元素 {0} 不是 ({3}, {4}) 中基底序列物件的有效限制。

# Sch_ElementFromGroupBase2
source: The derived element {0} at ({1}, {2}) is not a valid restriction of the base choice particle at ({3}, {4}) according to Elt:All/Choice/Sequence -- RecurseAsIfGroup.
cs: Odvozený element {0} na pozici ({1}, {2}) není platné omezení základní částice choice na pozici ({3}, {4}) podle Elt:All/Choice/Sequence -- RecurseAsIfGroup.
de: Das abgeleitete Element {0} bei ({1},{2}) ist gemäß Elt:All/Choice/Sequence -- RecurseAsIfGroup keine gültige Einschränkung des Basispartikels "choice" bei ({3}, {4}).
es: El elemento derivado {0} en ({1},{2}) no es una restricción válida de la partícula choice base en ({3}, {4}) según Elt:All/Choice/Sequence -- RecurseAsIfGroup.
fr: L'élément dérivé {0} sur ({1}, {2}) n'est pas une restriction valide de la particule Choice de base sur ({3}, {4}), selon Elt:All/Choice/Sequence -- RecurseAsIfGroup.
it: L'elemento derivato {0} alla posizione ({1},{2}) non è una restrizione valida della particella choice di base alla posizione ({3}, {4}) in base alla regola Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ja: Elt:All/Choice/Sequence -- RecurseAsIfGroup により、({1}, {2}) にある派生型の要素 {0} は、({3}, {4}) にある基本型の choice パーティクルの有効な制限とは認められません。
ko: ({1}, {2})에 있는 파생 요소 {0}은(는) Elt:All/Choice/Sequence -- RecurseAsIfGroup에 따라 ({3}, {4})에 있는 기본 choice 파티클의 유효한 제한이 아닙니다.
pl: Element pochodny {0} w lokalizacji ({1}, {2}) nie jest prawidłowym ograniczeniem podstawowej cząstki choice w lokalizacji ({3}, {4}) zgodnie z następującą regułą: Elt:All/Choice/Sequence -- RecurseAsIfGroup.
pt_br: O elemento derivado {0} em ({1}, {2}) não é uma restrição válida da partícula base choice em ({3}, {4}) de acordo com Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ru: Производный элемент {0} в ({1}, {2}) не является действительным ограничением для базовой части choice в ({3}, {4}) в соответствии с Elt:All/Choice/Sequence — RecurseAsIfGroup.
tr: ({1}, {2}) konumundaki {0} türetilen öğesi, Elt:All/Choice/Sequence -- RecurseAsIfGroup kuralına göre ({3}, {4}) konumundaki temel choice parçacığının geçerli bir kısıtlaması değil.
zh_hans: 根据 Elt:All/Choice/Sequence -- RecurseAsIfGroup，位于({1}, {2})的派生元素 {0} 不是位于({3}, {4})的基本 choice 粒子的有效限制。
zh_hant: 根據 Elt:All/Choice/Sequence – RecurseAsIfGroup，({1}, {2}) 中的衍生元素 {0} 不是 ({3}, {4}) 中基底 Choice 物件的有效限制。

# Sch_ElementFromGroupBase3
source: The derived element {0} at ({1}, {2}) is not a valid restriction of the base all particle at ({3}, {4}) according to Elt:All/Choice/Sequence -- RecurseAsIfGroup.
cs: Odvozený element {0} na pozici ({1}, {2}) není platné omezení základní částice all na pozici ({3}, {4}) podle Elt:All/Choice/Sequence -- RecurseAsIfGroup.
de: Das abgeleitete Element {0} bei ({1},{2}) ist gemäß Elt:All/Choice/Sequence -- RecurseAsIfGroup keine gültige Einschränkung des Basispartikels "all" bei ({3}, {4}).
es: El elemento derivado {0} en ({1},{2}) no es una restricción válida de la partícula all base en ({3}, {4}) según Elt:All/Choice/Sequence -- RecurseAsIfGroup.
fr: L'élément dérivé {0} sur ({1}, {2}) n'est pas une restriction valide de la particule All de base sur ({3}, {4}), selon Elt:All/Choice/Sequence -- RecurseAsIfGroup.
it: L'elemento derivato {0} alla posizione ({1},{2}) non è una restrizione valida della particella all di base alla posizione ({3}, {4}) in base alla regola Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ja: Elt:All/Choice/Sequence -- RecurseAsIfGroup により、({1}, {2}) にある派生型の要素 {0} は、({3}, {4}) にある基本型の all パーティクルの有効な制限とは認められません。
ko: ({1}, {2})에 있는 파생 요소 {0}은(는) Elt:All/Choice/Sequence -- RecurseAsIfGroup에 따라 ({3}, {4})에 있는 기본 all 파티클의 유효한 제한이 아닙니다.
pl: Element pochodny {0} w lokalizacji ({1}, {2}) nie jest prawidłowym ograniczeniem podstawowej cząstki all w lokalizacji ({3}, {4}) zgodnie z następującą regułą: Elt:All/Choice/Sequence -- RecurseAsIfGroup.
pt_br: O elemento derivado {0} em ({1}, {2}) não é uma restrição válida da partícula base all em ({3}, {4}) de acordo com Elt:All/Choice/Sequence -- RecurseAsIfGroup.
ru: Производный элемент {0} в ({1}, {2}) не является действительным ограничением для базовой части all в ({3}, {4}) в соответствии с Elt:All/Choice/Sequence — RecurseAsIfGroup.
tr: ({1}, {2}) konumundaki {0} türetilen öğesi Elt:All/Choice/Sequence -- RecurseAsIfGroup kuralına göre ({3}, {4}) konumundaki temel all parçacığının geçerli bir kısıtlaması değil.
zh_hans: 根据 Elt:All/Choice/Sequence -- RecurseAsIfGroup，位于({1}, {2})的派生元素 {0} 不是位于({3}, {4})的基本 all 粒子的有效限制。
zh_hant: 根據 Elt:All/Choice/Sequence – RecurseAsIfGroup，({1}, {2}) 中的衍生元素 {0} 不是 ({3}, {4}) 中基底 All 物件的有效限制。

# Sch_ElementInMixedWithFixed
source: Although the '{0}' element's content type is mixed, it cannot have element children, because it has a fixed value constraint in the schema.
cs: Přestože obsah elementu {0} je smíšeného typu, nemůže mít podřízené elementy, protože má ve schématu omezení pevnou hodnotu.
de: Obwohl "Mixed" der Inhaltstyp des Elements "{0}" ist, darf es keine untergeordneten Elemente enthalten, da es eine Einschränkung des festen Werts im Schema aufweist.
es: Aunque el tipo de contenido del elemento "{0}" es mixto, no puede contener un elemento secundario, porque incluye una restricción de valor fijo en el esquema.
fr: Même si le type de contenu de l'élément '{0}' est mixte, il ne peut pas avoir d'éléments enfants, car la valeur de contrainte du schéma est fixe.
it: Anche se il tipo di contenuto dell'elemento '{0}' è misto, non può includere elementi figlio perché nello schema include un vincolo di valore fisso.
ja: '{0}' 要素のコンテンツ型は混合ですが、スキーマに固定値の制約があるため、子要素を持つことはできません。
ko: '{0}' 요소의 콘텐츠 형식은 혼합이지만 스키마에 고정 값 제약 조건이 있기 때문에 요소 자식을 가질 수 없습니다.
pl: Mimo że typ zawartości elementu „{0}” jest mieszany, nie może on zawierać elementów podrzędnych, ponieważ jego schemat zawiera ograniczenie wartości ustalonej.
pt_br: Embora seja misto, o tipo de conteúdo do elemento '{0}' não pode ter filhos do elemento, pois tem ele uma restrição de valor fixo no esquema.
ru: Несмотря на то что элемент "{0}" имеет содержимое смешанного типа, он не может иметь потомки-элементы, поскольку в схеме присутствует ограничение на фиксированное значение.
tr: '{0}' öğesinin içerik türü karışık olsa da, şemada sabit bir değer kısıtlaması olduğundan alt öğesi olamaz.
zh_hans: 尽管“{0}”元素的内容类型为混合型，但因为它在架构中有固定值约束，所以不能有元素子级。
zh_hant: 雖然 '{0}' 元素的內容類型是混合類型，但因為其結構描述中含有固定值的條件約束，所以無法擁有元素子系。

# Sch_ElementMissing
source: There is a missing element.
cs: Element nebyl nalezen.
de: Ein Element fehlt.
es: Falta un elemento.
fr: Il manque un élément.
it: Manca un elemento.
ja: 見つからない要素があります。
ko: 요소가 없습니다.
pl: Brak elementu.
pt_br: Um elemento está ausente.
ru: Отсутствующий элемент.
tr: Bir öğe eksik.
zh_hans: 缺少某个元素。
zh_hant: 有遺漏的元素。

# Sch_ElementNameAndNamespace
source: '{0}' in namespace '{1}'
cs: {0} v oboru názvů {1}
de: "{0}" im Namespace "{1}"
es: "{0}" en espacio de nombres "{1}"
fr: '{0}' dans l'espace de noms '{1}'
it: '{0}' nello spazio dei nomi '{1}'
ja: 名前空間 '{1}' の '{0}'
ko: 네임스페이스 '{1}'의 '{0}'
pl: Element „{0}” w przestrzeni nazw „{1}”
pt_br: '{0}' no namespace '{1}'
ru: "{0}" в пространстве имен "{1}"
tr: '{1}' ad alanında '{0}'
zh_hans: 命名空间“{1}”中的“{0}”
zh_hant: 命名空間 '{1}' 中的 '{0}'

# Sch_ElementNameRef
source: For element declaration, either the name or the ref attribute must be present.
cs: Pro deklaraci elementu musí být přítomen atribut name, nebo ref.
de: Für die Elementdeklaration muss entweder das name- oder das ref-Attribut vorhanden sein.
es: Para la declaración de elemento, tiene que tener presentes los atributos name o ref.
fr: Pour la déclaration d'élément, l'attribut name ou l'attribut ref doit être présent.
it: Nell'elemento dichiarato deve essere l'attributo ref o name.
ja: 要素の宣言では、name または ref 属性のいずれかが存在しなければなりません。
ko: 요소 선언에는 name 또는 ref 특성이 있어야 합니다.
pl: Dla deklaracji elementu musi być obecna albo nazwa, albo atrybut odwołania.
pt_br: Para declaração do elemento, o atributo name ou ref deve estar presente.
ru: Для объявления элемента следует указать имя или атрибут ref.
tr: Öğe bildirimi için name veya ref özniteliği bulunmalıdır.
zh_hans: 对于元素声明，name 或 ref 特性中必须有一个存在。
zh_hant: 元素宣告必須要有 name 或 ref 屬性。

# Sch_ElementNotAllowed
source: Element is not allowed when the content is empty or textOnly.
cs: Pokud má obsah hodnotu empty nebo je typu textOnly, element není povolen.
de: Element ist nicht zulässig, wenn der Inhalt "empty" oder "textOnly" ist.
es: No está permitido el elemento cuando el contenido está vacío o es textOnly.
fr: L'élément n'est pas autorisé quand le contenu est empty ou textOnly.
it: L'elemento non è consentito quando il contenuto è empty o textOnly.
ja: コンテンツが empty または textOnly のときは、要素を使用できません。
ko: 콘텐츠가 empty 또는 textOnly인 경우 요소를 사용할 수 없습니다.
pl: Element jest niedozwolony, gdy zawartość jest pusta (empty) lub textOnly.
pt_br: O elemento não é permitido quando o conteúdo estiver vazio ou for textOnly.
ru: Элемент не разрешен, когда содержимое — empty или textOnly.
tr: İçerik empty veya textOnly olduğunda öğeye izin verilmez.
zh_hans: 当内容为空或 textOnly 时，不允许使用元素。
zh_hant: 當內容為 empty 或 textOnly 時，不可有元素。

# Sch_ElementRef
source: When the ref attribute is present, the type attribute and complexType, simpleType, key, keyref, and unique elements cannot be present.
cs: Je-li obsažen atribut ref, nesmí být uveden atribut type a elementy complexType, simpleType, key, keyref a unique.
de: Wenn das ref-Attribut vorhanden ist, dürfen das type-Attribut und die complexType-, simpleType-, key-, keyref- und unique-Elemente nicht vorhanden sein.
es: Cuando el atributo ref está presente, el atributo type y elementos complexType, simpleType, key, keyref y unique no pueden estar presentes.
fr: Quand l'attribut ref est présent, l'attribut type et les éléments complexType, simpleType, key, keyref et unique ne peuvent pas être présents.
it: Quando è presente l'attributo ref, l'attributo type e gli elementi complexType, simpleType, key, keyref e unique non sono consentiti.
ja: ref 属性が存在するときは、type 属性および complexType、simpleType、key、keyref および unique 要素を指定することはできません。
ko: ref 특성이 있는 경우 type 특성 및 complexType, simpleType, key, keyref, unique 요소를 지정할 수 없습니다.
pl: Gdy obecny jest atrybut odwołania (ref), nie mogą być obecne elementy unikatowe oraz atrybut typu i complexType, simpleType, key, keyref.
pt_br: Quando o atributo ref estiver presente, o atributo type e os elementos complexType, simpleType, key, keyref e unique não poderão estar presentes.
ru: При наличии атрибута ref атрибут type, а также элементы complexType, simpleType, key, keyref и unique задаваться не могут.
tr: ref özniteliği olduğunda tür özniteliği ve complexType, simpleType, key, keyref ve unique öğeleri olamaz.
zh_hans: 当存在 ref 特性时，type 特性和 complexType、simpleType、key、keyref 以及 unique 元素都不能存在。
zh_hant: 當有 ref 屬性時，就不能有 type 屬性以及 complexType、simpleType、key、keyref 和 unique 元素。

# Sch_ElementTypeCollision
source: Elements with the same name and in the same scope must have the same type.
cs: Elementy se stejným názvem a ve stejném oboru musí být stejného typu.
de: Elemente, die denselben Namen haben und sich im selben Bereich befinden, müssen vom selben Typ sein.
es: Los elementos con el mismo nombre en el mismo ámbito deben tener el mismo tipo.
fr: Les éléments ayant le même nom et se trouvant dans la même portée doivent avoir le même type.
it: Gli elementi con lo stesso nome e appartenenti allo stesso ambito devono avere lo stesso tipo.
ja: 同一のスコープ内では、同じ名前の要素は同じ型でなければなりません。
ko: 이름이 같으며 같은 범위에 있는 요소들은 형식이 같아야 합니다.
pl: Elementy o tej samej nazwie i w tym samym zakresie muszą mieć ten sam typ.
pt_br: Elementos com o mesmo nome e no mesmo escopo devem ter o mesmo tipo.
ru: В пределах одной области элементы с одинаковыми именами должны иметь один тип.
tr: Aynı bağlamda ve aynı ada sahip olan öğeler aynı türe sahip olmalıdır.
zh_hans: 同名且在相同范围内的多个元素必须具有相同的类型。
zh_hant: 在相同的範圍中，同名的元素必須要有相同的類型。

# Sch_ElementValueDataType
source: The '{0}' element has an invalid value according to its data type.
cs: Hodnota elementu {0} je vzhledem k jeho datovému typu neplatná.
de: Der Wert des Elements "{0}" ist gemäß seinem Datentyp ungültig.
es: El elemento "{0}" tiene un valor no válido según su tipo de datos.
fr: L'élément '{0}' a une valeur non valide selon son type de données.
it: L'elemento '{0}' contiene un valore non valido in base al relativo tipo di dati.
ja: このデータ型では無効な値が '{0}' 要素に含まれています。
ko: '{0}' 요소 값의 데이터 형식이 잘못되었습니다.
pl: Element „{0}” ma nieprawidłową wartość przy uwzględnieniu jego typu danych.
pt_br: O valor do elemento '{0}' é inválido de acordo com seu tipo de dados.
ru: Элемент "{0}" имеет значение, недопустимое с точки зрения его типа данных.
tr: '{0}' öğesi kendi veri türüne göre geçersiz bir değere sahip.
zh_hans: 根据其数据类型，“{0}”元素的值无效。
zh_hant: 根據{0}' 元素的資料類型，其數值無效。

# Sch_ElementValueDataTypeDetailed
source: The '{0}' element is invalid - The value '{1}' is invalid according to its datatype '{2}' - {3}
cs: Element {0} je neplatný. Hodnota {1} je neplatná vzhledem k jejímu datovému typu {2} – {3}
de: Das Element "{0}" ist ungültig. Der Wert "{1}" ist gemäß seinem Datentyp "{2}" ungültig – {3}.
es: El elemento "{0}" no es válido. El valor "{1}" no es válido según su tipo de datos "{2}" - {3}
fr: L'élément '{0}' est non valide - La valeur '{1}' est non valide selon son type de données '{2}' - {3}
it: L'elemento '{0}' non è valido. Il valore '{1}' non è valido in base al relativo tipo di dati '{2}' - {3}
ja: '{0}' 要素は無効です。値 '{1}' はデータ型 '{2}' に対して無効です。{3}
ko: '{0}' 요소가 잘못되었습니다. 값 '{1}'의 데이터 형식 '{2}'이(가) 잘못되었습니다. {3}
pl: Element „{0}” jest nieprawidłowy. Wartość „{1}” jest nieprawidłowa przy uwzględnieniu jego typu danych „{2}” — {3}.
pt_br: O elemento '{0}' é inválido – O valor '{1}' é inválido de acordo com seu tipo de dados '{2}' – {3}
ru: Элемент "{0}" недействителен: значение "{1}" недействительно с точки зрения его типа данных "{2}" — {3}
tr: '{0}' öğesi geçersiz. '{1}' değeri, sahip olduğu '{2}' veri türüne göre geçersiz - {3}
zh_hans: “{0}”元素无效 - 根据其数据类型“{2}”，值“{1}”无效 - {3}
zh_hant: '{0}' 元素無效 – 根據其資料類型 '{2}'，數值 '{1}' 無效 - {3}

# Sch_EmptyAttributeValue
source: The attribute value cannot be empty.
cs: Hodnota atributu nemůže být prázdná.
de: Der Attributwert darf nicht leer sein.
es: El valor de atributo no puede estar vacío.
fr: La valeur de l'attribut ne peut pas être vide.
it: Il valore dell'attributo non può essere vuoto.
ja: 属性値を空にすることはできません。
ko: 특성 값은 비워 둘 수 없습니다.
pl: Wartość atrybutu nie może być pusta.
pt_br: O valor do atributo não pode estar vazio.
ru: Значение атрибута не может быть пустым.
tr: Öznitelik değeri boş olamaz.
zh_hans: 特性值不能为空。
zh_hant: 屬性值不可為空白。

# Sch_EmptyChoice
source: Empty choice cannot be satisfied if 'minOccurs' is not equal to 0.
cs: Prázdnou volbu nelze splnit, pokud se hodnota minOccurs nerovná 0.
de: Eine leere Auswahl kann nicht durchgeführt werden, wenn "minOccurs" ungleich 0 ist.
es: Debe seleccionar una opción si el elemento "minOccurs" no es igual a 0.
fr: Le choix empty est impossible si 'minOccurs' n'est pas égal à 0.
it: Se il valore di 'minOccurs' è diverso da 0, il valore di 'choice' non può essere vuoto.
ja: 'minOccurs' が 0 でない限り、空の choice は無効です。
ko: 'minOccurs'가 0이 아닌 경우 choice는 비워 둘 수 없습니다.
pl: Pusty wybór jest niemożliwy, jeśli element „minOccurs” nie jest równy 0.
pt_br: A opção vazia não será satisfatória se 'minOccurs' não for igual a 0.
ru: Пустой элемент choice не может быть реализован, если minOccurs не равно 0.
tr: 'minOccurs' değeri 0'a eşit değilse boş seçim kullanılamaz.
zh_hans: 如果 "minOccurs" 不等于 0，则无法满足空选择。
zh_hant: 在 'minOccurs' 不等於 0 的情況下，選擇不可為空白。

# Sch_EmptyXPath
source: The XPath for selector or field cannot be empty.
cs: Výraz XPath pro selektor nebo pro pole nesmí být prázdný.
de: Der XPath für die Auswahl oder das Feld darf nicht leer sein.
es: La expresión XPath del selector o campo no puede estar vacía.
fr: XPath pour selector ou field ne peut pas être vide.
it: L'XPath di un selettore o di un campo non può essere vuoto.
ja: セレクター、またはフィールドの XPath は空白にできません。
ko: 선택기 또는 필드의 XPath는 비워 둘 수 없습니다.
pl: Element XPath dla selektora lub pola nie może być pusty.
pt_br: O XPath para seletor ou campo não pode estar vazio.
ru: XPath для селектора или поля не может быть пустым.
tr: Seçici veya alan için XPath boş olamaz.
zh_hans: 选择器或字段的 XPath 不能为空。
zh_hant: 選取器或欄位的 XPath 不可為空白。

# Sch_EnumFinished
source: Enumeration has already finished.
cs: Výčet již byl dokončen.
de: Die Enumeration wurde bereits beendet.
es: Ya ha terminado la enumeración.
fr: Énumération terminée.
it: L'enumerazione è già terminata.
ja: 列挙は既に完了しています。
ko: 열거가 이미 완료되었습니다.
pl: Wyliczanie zostało już zakończone.
pt_br: A enumeração já foi concluída.
ru: Перечисление уже завершено.
tr: Sabit listesi oluşturma işlemi zaten tamamlandı.
zh_hans: 枚举已完成。
zh_hant: 已完成列舉。

# Sch_EnumNotStarted
source: Enumeration has not started. Call MoveNext.
cs: Výčet nebyl zahájen. Zavolejte metodu MoveNext.
de: Die Enumeration wurde nicht gestartet. Rufen Sie "MoveNext" auf.
es: No se ha iniciado la enumeración. Llame a MoveNext.
fr: L'énumération n'a pas démarré. Appelez MoveNext.
it: L'enumerazione non è stata avviata. Chiamare MoveNext.
ja: 列挙は開始していません。MoveNext を呼び出してください。
ko: 열거가 시작되지 않았습니다. MoveNext를 호출하세요.
pl: Wyliczanie nie zostało uruchomione. Wywołaj element MoveNext.
pt_br: Enumeração não iniciada. Chame MoveNext.
ru: Перечисление не начато. Вызовите MoveNext.
tr: Sabit listesi oluşturma işlemi başlatılmadı. MoveNext çağrısı yapın.
zh_hans: 枚举尚未开始。请调用 MoveNext。
zh_hant: 尚未開始列舉。呼叫 MoveNext。

# Sch_EnumerationConstraintFailed
source: The Enumeration constraint failed.
cs: Omezení Enumeration nebylo úspěšné.
de: Fehler bei der Enumeration-Einschränkung.
es: Error en la restricción de Enumeration.
fr: Échec de la contrainte Enumeration.
it: Il vincolo Enumeration non è riuscito.
ja: 列挙型制約に失敗しました。
ko: Enumeration 제약 조건이 실패했습니다.
pl: Błąd ograniczenia Enumeration.
pt_br: Falha na restrição Enumeration.
ru: Сбой ограничения перечисления.
tr: Sabit Listesi kısıtlaması başarısız oldu.
zh_hans: 枚举约束失败。
zh_hant: Enumeration 條件約束失敗。

# Sch_EnumerationFacetInvalid
source: The Enumeration constraining facet is invalid - {0}
cs: Omezující vlastnost Enumeration je neplatná – {0}.
de: Ungültiges Enumerations-Einschränkungsfacet: {0}
es: La faceta de restricción de Enumeration no es válida - {0}
fr: La facette de contrainte Enumeration est non valide : {0}.
it: Il facet vincolante Enumeration non è valido - {0}
ja: Enumeration 制約ファセットが無効です。{0}
ko: Enumeration 제약 패싯이 잘못되었습니다. {0}
pl: Element Enumeration ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições Enumeration é inválida – {0}
ru: Недопустимый ограничивающий аспект перечисления — {0}.
tr: Sabit Listesi kısıtlama modeli geçersiz - {0}
zh_hans: 枚举约束方面无效 - {0}
zh_hant: Enumeration 條件約束 Facet 無效 - {0}

# Sch_EnumerationFacetProhibited
source: The Enumeration constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost Enumeration je pro element {0} zakázána.
de: Das Enumeration-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de Enumeration prohibida para "{0}".
fr: La facette de contrainte Enumeration est interdite pour '{0}'.
it: Il facet vincolante Enumeration non è consentito per '{0}'.
ja: Enumeration 制約ファセットは '{0}' で使用できません。
ko: Enumeration 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element Enumeration ograniczający aspekt jest zabroniony dla elementu „{0}”.
pt_br: A faceta de restrições Enumeration é proibida para '{0}'.
ru: Ограничивающий аспект перечисления запрещен для "{0}".
tr: '{0}' için Sabit Listesi kısıtlama modeli kullanılamaz.
zh_hans: 枚举约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 Enumeration 條件約束 Facet。

# Sch_EnumerationValue
source: '{0}' is not in the enumeration list.
cs: Hodnota {0} není v seznamu výčtu.
de: "{0}" ist nicht in der Enumerationsliste enthalten.
es: "{0}" no está en la lista de enumeración.
fr: '{0}' ne se trouve pas dans la liste d'énumération.
it: '{0}' non è presente nell'elenco di enumerazione.
ja: '{0}' は、列挙一覧にありません。
ko: '{0}'이(가) 열거형 목록에 없습니다.
pl: Brak elementu „{0}” na liście wyliczenia.
pt_br: '{0}' não está na lista de enumerações.
ru: "{0}" не является списком перечисления.
tr: '{0}', sabit listesi içinde değil.
zh_hans: “{0}”不在枚举列表中。
zh_hant: '{0}' 不在列舉清單中。

# Sch_FacetBaseFixed
source: Values that are declared as {fixed} in a base type can not be changed in a derived type.
cs: Hodnoty deklarované jako {fixed} v základním typu nelze změnit v odvozeném typu.
de: Werte, die in einem Basistyp als {fixed} deklariert sind, können nicht in einen abgeleiteten Typ geändert werden.
es: Los valores declarados como {fixed} en un tipo base no se pueden cambiar a tipo derivado.
fr: Les valeurs déclarées comme {fixed} dans un type de base ne peuvent pas être changées en un type dérivé.
it: I valori dichiarati come {fixed} in un tipo di base non possono essere modificati in un tipo derivato.
ja: 基本データ型の {fixed} として宣言されている値を派生型の値に変更することはできません。
ko: 기본 형식의 {fixed}로 선언된 값은 파생 형식으로 변경할 수 없습니다.
pl: Wartości zadeklarowanych jako {fixed} w typie podstawowym nie można zmienić w typie pochodnym.
pt_br: Valores declarados como {fixed} em um tipo base não podem ser alterados para um tipo derivado.
ru: Значения, объявленные как {fixed} в базовом типе, нельзя изменить в производном типе.
tr: Temel türde {fixed} olarak belirtilen değerler, türetilen türde değiştirilemez.
zh_hans: 基类型中声明为 {fixed} 的值不能在派生类型中更改。
zh_hant: 在基底類型中宣告為 {fixed} 的數值無法在衍生類型中變更。
