Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_UndeclaredEntity
source: Reference to undeclared entity '{0}'.
cs: Odkaz na nedeklarovanou entitu {0}
de: Verweis auf die nicht deklarierte Entität "{0}".
es: Referencia a una entidad no declarada "{0}".
fr: Référence à une entité non déclarée, '{0}'.
it: Riferimento all'entità non dichiarata '{0}'.
ja: 宣言されていないエンティティ '{0}' への参照です。
ko: 선언되지 않은 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej jednostki „{0}”.
pt_br: Referência à entidade não declarada, '{0}'.
ru: Ссылка на необъявленную сущность "{0}".
tr: Bildirilmemiş '{0}' varlığına başvuru.
zh_hans: 引用了未声明的实体“{0}”。
zh_hant: 參考未宣告的實體 '{0}'。

# Xml_UndeclaredParEntity
source: Reference to undeclared parameter entity '{0}'.
cs: Odkaz na nedeklarovanou entitu parametru {0}
de: Verweis auf die nicht deklarierte Parameterentität "{0}".
es: Referencia a la entidad del parámetro sin declarar "{0}".
fr: Référence à une entité de paramètre non déclarée, '{0}'.
it: Riferimento all'entità parametro non dichiarata '{0}'.
ja: 宣言されていないパラメーター エンティティ '{0}' への参照です。
ko: 선언되지 않은 매개 변수 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej jednostki parametru „{0}”.
pt_br: Referência a uma entidade de parâmetro não declarada, '{0}'.
ru: Ссылка на необъявленную сущность параметра "{0}".
tr: Bildirilmemiş '{0}' parametre varlığına başvuru.
zh_hans: 引用了未声明的参数实体“{0}”。
zh_hant: 參考未宣告的參數實體 '{0}'。

# Xml_UndefNamespace
source: The '{0}' namespace is not defined.
cs: Obor názvů {0} není definován.
de: Der {0}-Namespace ist nicht definiert.
es: El espacio de nombres "{0}" no está definido.
fr: L'espace de noms '{0}' n'est pas défini.
it: Lo spazio dei nomi '{0}' non è definito.
ja: '{0}' 名前空間は定義されていません。
ko: '{0}' 네임스페이스가 정의되지 않았습니다.
pl: Przestrzeń nazw „{0}” nie została zdefiniowana.
pt_br: O namespace '{0}' não está definido.
ru: Пространство имен "{0}" не определено.
tr: '{0}' ad alanı tanımlı değil.
zh_hans: 未定义“{0}”命名空间。
zh_hant: 未定義 '{0}' 命名空間。

# Xml_UndefPrefix
source: An undefined prefix is in use.
cs: Je použita nedefinovaná předpona.
de: Es wird ein nicht definiertes Präfix verwendet.
es: Prefijo sin definir en uso.
fr: Préfixe non défini en cours d'utilisation.
it: Un prefisso in uso non è definito.
ja: 未定義のプレフィックスが使用されています。
ko: 정의되지 않은 접두사가 사용 중입니다.
pl: Używany jest niezdefiniowany prefiks.
pt_br: Um prefixo indefinido está em uso.
ru: Используется неопределенный префикс.
tr: Tanımlanmamış bir önek kullanılıyor.
zh_hans: 使用了未定义的前缀。
zh_hant: 使用了未經定義的前置詞。

# Xml_UnexpectedCDataEnd
source: ']]>' is not expected.
cs: Řetězec ]]> není očekáván.
de: "]]>" wird nicht erwartet.
es: "]]>" no se esperaba.
fr: ']]>' inattendu.
it: ']]>' non è previsto.
ja: ']]>' は必要ありません。
ko: ']]>'는 사용할 수 없습니다.
pl: Nieoczekiwane znaki „]]>”.
pt_br: ]]> não é esperado.
ru: ]]> не предусмотрено.
tr: "]]>" beklenmiyor.
zh_hans: 意外的“]]>”。
zh_hant: 不應出現 ']]>'。

# Xml_UnexpectedEOF
source: Unexpected end of file while parsing {0} has occurred.
cs: Při parsování {0} byl zjištěn neočekávaný konec souboru.
de: Unerwartetes Dateiende bei der Syntaxanalyse von {0}.
es: Fin inesperado de archivo al analizar {0}.
fr: Fin de l'analyse de fichier inattendue {0}.
it: Fine del file imprevista durante l'analisi di {0}.
ja: {0} の解析中に、予期しないファイルの終わりが検出されました。
ko: {0}을(를) 구문 분석하는 동안 예기치 않은 파일의 끝이 발견되었습니다.
pl: Podczas analizowania elementu {0} nastąpił nieoczekiwany koniec pliku.
pt_br: Fim inesperado da análise de arquivo {0}.
ru: Непредусмотренный конец файла при разборе {0}.
tr: {0} ayrıştırılırken beklenmeyen bir dosya sonu oluştu.
zh_hans: 分析 {0} 时，出现意外的文件结尾。
zh_hant: 當剖析檔案 {0} 時出現未預期的結尾。

# Xml_UnexpectedEOF1
source: Unexpected end of file has occurred.
cs: Byl zjištěn neočekávaný konec souboru.
de: Ein unerwartetes Dateiende ist aufgetreten.
es: Fin inesperado de archivo.
fr: Fin de fichier inattendue.
it: Fine del file imprevista.
ja: 予期しないファイルの終わりが検出されました。
ko: 예기치 않은 파일의 끝이 발견되었습니다.
pl: Nastąpił nieoczekiwany koniec pliku.
pt_br: Fim de arquivo inesperado.
ru: Непредусмотренный конец файла.
tr: Beklenmeyen bir dosya sonu oluştu.
zh_hans: 出现意外的文件结尾。
zh_hant: 檔案出現未預期的結尾。

# Xml_UnexpectedEOFInElementContent
source: Unexpected end of file has occurred. The following elements are not closed: {0}
cs: Byl zjištěn neočekávaný konec souboru. Následující elementy nejsou uzavřeny: {0}
de: Unerwartetes Dateiende. Die folgenden Elemente wurden nicht geschlossen: {0}.
es: Fin inesperado de archivo. Los siguientes elementos no están cerrados: {0}
fr: Fin de fichier inattendue. Les éléments suivants ne sont pas fermés : {0}
it: Fine del file imprevista. Gli elementi seguenti non sono chiusi: {0}
ja: 予期しないファイルの終わりが検出されました。次の要素が閉じられていません。{0}
ko: 예기치 않은 파일의 끝이 발견되었습니다. 다음 요소가 닫혀 있지 않습니다. {0}
pl: Nastąpił nieoczekiwany koniec pliku. Następujące elementy nie zostały zamknięte: {0}.
pt_br: Fim de arquivo inesperado. Os seguintes elementos não estão fechados: {0}
ru: Непредусмотренный конец файла. Не закрыты следующие элементы: {0}
tr: Beklenmeyen bir dosya sonu oluştu. Aşağıdaki öğeler kapatılmadı: {0}
zh_hans: 出现意外的文件结尾。以下元素未封闭: {0}
zh_hant: 檔案出現未預期的結尾。下列的元素未關閉: {0}

# Xml_UnexpectedEndTag
source: Unexpected end tag.
cs: Neočekávaná koncová značka
de: Unerwartetes Endtag.
es: Etiqueta final inesperada.
fr: Balise de fin inattendue.
it: Tag di fine imprevisto.
ja: 予期しない終了タグです。
ko: 예기치 않은 끝 태그입니다.
pl: Nieoczekiwany tag końcowy.
pt_br: Tag de fim inesperada.
ru: Непредусмотренный закрывающий тег.
tr: Beklenmeyen bitiş etiketi.
zh_hans: 意外的结束标记。
zh_hant: 未預期的結束標籤。

# Xml_UnexpectedNodeInSimpleContent
source: Unexpected node type {0}. {1} method can only be called on elements with simple or empty content.
cs: Neočekávaný typ uzlu {0}. Metodu {1} lze volat pouze u elementů s jednoduchým nebo prázdným obsahem.
de: Unerwarteter Knotentyp {0}. Die {1}-Methode kann nur für Elemente mit einfachem oder leerem Inhalt aufgerufen werden.
es: Tipo de nodo {0} inesperado. El método {1} solo se puede llamar en elementos con contenido simple o vacío.
fr: Type de nœud inattendu {0}. La méthode {1} ne peut être appelée que pour des éléments au contenu simple ou vide.
it: Tipo di nodo {0} imprevisto. Il metodo {1} può essere chiamato solo su elementi con contenuto semplice o vuoto.
ja: 予期しないノード型 {0} です。{1} メソッドは、要素がシンプル コンテンツ、または空のコンテンツの場合にのみ呼び出すことができます。
ko: 예기치 않은 노드 형식 {0}입니다. {1} 메서드는 단순 콘텐츠 요소 또는 콘텐츠가 비어 있는 요소에서만 호출할 수 있습니다.
pl: Nieoczekiwany typ węzła: {0}. Metodę {1} można wywoływać tylko w przypadku elementów z zawartością prostą lub bez zawartości.
pt_br: Tipo de nó inesperado {0}. O método {1} só pode ser chamado em elementos com conteúdo simples ou vazio.
ru: Непредусмотренный тип узла {0}. Метод {1} может быть вызван только для элементов с простым или пустым содержимым.
tr: Beklenmeyen düğüm türü: {0}. {1} metodu, yalnızca basit veya boş içeriğe sahip öğelerde çağrılabilir.
zh_hans: 意外的节点类型 {0}。只能在简单内容或空内容上调用 {1} 方法。
zh_hant: 未預期的節點類型 {0}。{1} 方法僅能由具有簡單或空白的內容元素呼叫。

# Xml_UnexpectedNodeType
source: Unexpected XmlNodeType: '{0}'.
cs: Neočekávaný výčet XmlNodeType: {0}
de: Unerwarteter XmlNodeType: "{0}".
es: XmlNodeType inesperado: "{0}".
fr: XmlNodeType inattendu : '{0}'.
it: XmlNodeType imprevisto: '{0}'.
ja: 予期しない XmlNodeType '{0}' です。
ko: 예기치 않은 XmlNodeType: '{0}'.
pl: Nieoczekiwany typ XmlNodeType: „{0}”.
pt_br: XmlNodeType inesperado: '{0}'.
ru: Непредусмотренный тип XmlNodeType: "{0}".
tr: Beklenmeyen XmlNodeType: '{0}'.
zh_hans: 意外 XmlNodeType:“{0}”。
zh_hant: 未預期的 XmlNodeType: '{0}'。

# Xml_UnexpectedToken
source: This is an unexpected token. The expected token is '{0}'.
cs: Toto je neočekávaný token. Byl očekáván token {0}.
de: Dies ist ein unerwartetes Token. Erwartet wurde das Token "{0}".
es: Token inesperado. Se esperaba "{0}".
fr: Jeton inattendu. Le jeton attendu est '{0}'.
it: Token imprevisto. Il token previsto è '{0}'.
ja: これは予期しないトークンです。予期していたトークンは '{0}' です。
ko: 예기치 않은 토큰입니다. 필요한 토큰은 '{0}'입니다.
pl: Nieoczekiwany token. Oczekiwany token to „{0}”.
pt_br: Este token é inesperado. O token esperado é '{0}'.
ru: Непредусмотренный маркер. Ожидается маркер "{0}".
tr: Bu beklenmeyen bir belirteç. Beklenen belirteç: '{0}'.
zh_hans: 这是意外的标记。标记应为“{0}”。
zh_hant: 此為未預期的語彙基元。'{0}' 是預期的語彙基元。

# Xml_UnexpectedTokenEx
source: '{0}' is an unexpected token. The expected token is '{1}'.
cs: {0} je neočekávaný token. Byl očekáván token {1}.
de: "{0}" ist ein unerwartetes Token. Erwartet wurde das Token "{1}".
es: "{0}" es un token inesperado. Se esperaba "{1}".
fr: '{0}' est un jeton inattendu. Le jeton attendu est '{1}'.
it: '{0}' è un token imprevisto. Il token previsto è '{1}'.
ja: '{0}' は予期しないトークンです。予期していたトークンは '{1}' です。
ko: '{0}'은(는) 예기치 않은 토큰입니다. 필요한 토큰은 '{1}'입니다.
pl: Element „{0}” to nieoczekiwany token. Oczekiwany token to „{1}”.
pt_br: '{0}' é um token inesperado. O token esperado é '{1}'.
ru: "{0}" не является допустимым маркером. Ожидается маркер "{1}".
tr: '{0}' beklenmeyen bir belirteç. Beklenen belirteç: '{1}'.
zh_hans: “{0}”是意外的标记。标记应为“{1}”。
zh_hant: '{0}' 是未預期的語彙基元。應為語彙基元 '{1}'。

# Xml_UnexpectedTokens2
source: '{0}' is an unexpected token. The expected token is '{1}' or '{2}'.
cs: {0} je neočekávaný token. Byl očekáván token {1} nebo {2}.
de: "{0}" ist ein unerwartetes Token. Das erwartete Token ist "{1}" oder "{2}".
es: "{0}" es un token inesperado. Se esperaba "{1}" o "{2}".
fr: '{0}' est un jeton inattendu. Le jeton attendu est '{1}' ou '{2}'.
it: '{0}' è un token imprevisto. Il token previsto è '{1}' o '{2}'.
ja: '{0}' は予期されていないトークンです。予期されているトークンは '{1}' または '{2}' です。
ko: '{0}'은(는) 예기치 않은 토큰입니다. 필요한 토큰은 '{1}' 또는 '{2}'입니다.
pl: Element „{0}” to nieoczekiwany token. Oczekiwany token to „{1}” lub „{2}”.
pt_br: '{0}' é um token inesperado. O token esperado é '{1}' ou '{2}'.
ru: "{0}" не является допустимым маркером. Ожидается маркер "{1}" или "{2}".
tr: '{0}' beklenmeyen bir belirteç. Beklenen belirteç: '{1}' veya '{2}'.
zh_hans: “{0}”是意外的标记。预期标记为“{1}”或“{2}”。
zh_hant: '{0}' 是非預期的語彙基元。語彙基元應為 '{1}' 或 '{2}'。

# Xml_UnknownEncoding
source: System does not support '{0}' encoding.
cs: Systém nepodporuje kódování {0}.
de: Das System unterstützt keine {0}-Codierung.
es: El sistema no es compatible con codificación "{0}".
fr: Le système ne prend pas en charge l'encodage '{0}'.
it: Il sistema non supporta la codifica '{0}'.
ja: このシステムでは、'{0}' エンコードをサポートしていません。
ko: 시스템에서 '{0}' 인코딩을 지원하지 않습니다.
pl: System nie obsługuje kodowania „{0}”.
pt_br: O sistema não dá suporte para codificação '{0}'.
ru: Система не поддерживает кодирование "{0}".
tr: Sistem '{0}' kodlamasını desteklemiyor.
zh_hans: 系统不支持“{0}”编码。
zh_hant: 系統不支援 '{0}' 編碼。

# Xml_UnknownNs
source: '{0}' is an undeclared prefix.
cs: {0} je nedeklarovaná předpona.
de: "{0}" ist ein nicht deklariertes Präfix.
es: "{0}" es un prefijo no declarado.
fr: '{0}' est un préfixe non déclaré.
it: '{0}' è un prefisso non dichiarato.
ja: '{0}' は宣言されていないプレフィックスです。
ko: '{0}'은(는) 선언되지 않은 접두사입니다.
pl: Element „{0}” jest niezadeklarowanym prefiksem.
pt_br: '{0}' é um prefixo não declarado.
ru: Префикс "{0}" необъявленный.
tr: '{0}', bildirilmemiş bir önek.
zh_hans: “{0}”是未声明的前缀。
zh_hant: '{0}' 是未宣告的前置詞。

# Xml_UnparsedEntity
source: The '{0}' entity is not an unparsed entity.
cs: Entita {0} není neparsovaná entita.
de: Die {0}-Entität ist keine nicht analysierte Entität.
es: La entidad "{0}" no es una entidad sin analizar.
fr: L'entité '{0}' n'est pas une entité non analysée.
it: L'entità '{0}' non è un entità non analizzata.
ja: '{0}' エンティティは未解析のエンティティではありません。
ko: '{0}' 엔터티는 구문 분석되지 않은 엔터티가 아닙니다.
pl: Jednostka „{0}” nie jest jednostką nieanalizowaną.
pt_br: A entidade '{0}' não é uma entidade não analisada.
ru: Сущность "{0}" не является неразобранной сущностью.
tr: '{0}' varlığı ayrıştırılmamış bir varlık.
zh_hans: “{0}”实体不是未分析的实体。
zh_hant: '{0}' 實體是未剖析的實體。

# Xml_UnparsedEntityRef
source: Reference to unparsed entity '{0}'.
cs: Odkaz na neparsovanou entitu {0}
de: Verweis auf die nicht analysierte Entität "{0}".
es: Referencia a una entidad sin analizar "{0}".
fr: Référence à une entité non analysée, '{0}'.
it: Riferimento all'entità non analizzata '{0}'.
ja: 解析されていないエンティティ '{0}' への参照です。
ko: 구문 분석되지 않은 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieanalizowanej jednostki „{0}”.
pt_br: Referência a entidade não analisada, '{0}'.
ru: Ссылка на неразобранную сущность "{0}".
tr: Ayrıştırılmamış '{0}' varlığına başvuru.
zh_hans: 引用了未分析的实体“{0}”。
zh_hant: 參考未剖析的實體 '{0}'。

# Xml_UnsupportedClass
source: Object type is not supported.
cs: Typ objektu není podporován.
de: Der Objekttyp wird nicht unterstützt.
es: Este tipo de objeto no es compatible.
fr: Ce type d'objet n'est pas pris en charge.
it: Il tipo di oggetto non è supportato.
ja: オブジェクト型はサポートされていません。
ko: 지원되지 않는 개체 형식입니다.
pl: Typ obiektu nie jest obsługiwany.
pt_br: Não há suporte para este tipo de objeto.
ru: Тип объекта не поддерживается.
tr: Nesne türü desteklenmiyor.
zh_hans: 不支持对象类型。
zh_hant: 不支援物件類型。

# Xml_UntrustedCodeSettingResolver
source: XmlResolver can be set only by fully trusted code.
cs: Objekt XmlResolver lze nastavit pouze prostřednictvím plně důvěryhodného kódu.
de: XmlResolver kann nur durch voll vertrauenswürdigen Code angegeben werden.
es: XmlResolver solo se puede establecer mediante códigos de plena confianza.
fr: XmlResolver ne peut être défini que par du code entièrement fiable.
it: XmlResolver può essere impostato solo con codice completamente attendibile.
ja: XmlResolver は、完全に信頼されたコードでのみ設定することができます。
ko: XmlResolver는 완전히 신뢰할 수 있는 코드에서만 설정할 수 있습니다.
pl: Element XmlResolver może zostać ustawiony tylko przy użyciu w pełni zaufanego kodu.
pt_br: O XmlResolver só pode ser definido por código totalmente confiável.
ru: XmlResolver может задаваться только кодом, имеющим полное доверие.
tr: XmlResolver, yalnızca tam olarak güvenilen kod tarafından ayarlanabilir.
zh_hans: XmlResolver 只能由完全受信任的代码来设置。
zh_hant: XmlResolver 只能由完全信任的程式碼設定。

# Xml_WhitespaceHandling
source: Expected WhitespaceHandling.None, or WhitespaceHandling.All, or WhitespaceHandling.Significant.
cs: Očekáváno: WhitespaceHandling.None, WhitespaceHandling.All nebo WhitespaceHandling.Significant
de: Erwartet wurde WhitespaceHandling.None, WhitespaceHandling.All oder WhitespaceHandling.Significant.
es: Se esperaba WhitespaceHandling.None, WhitespaceHandling.All o WhitespaceHandling.Significant.
fr: WhitespaceHandling.None, WhitespaceHandling.All ou WhitespaceHandling.Significant attendu.
it: È previsto WhitespaceHandling.None, WhitespaceHandling.All o WhitespaceHandling.Significant.
ja: WhitespaceHandling.None、WhitespaceHandling.All、または WhitespaceHandling.Significant が必要です。
ko: WhitespaceHandling.None, WhitespaceHandling.All 또는 WhitespaceHandling.Significant가 필요합니다.
pl: Oczekiwano elementu WhitespaceHandling.None, WhitespaceHandling.All lub WhitespaceHandling.Significant.
pt_br: Eram esperados WhitespaceHandling.None ou WhitespaceHandling.All ou WhitespaceHandling.Significant.
ru: Ожидалось WhitespaceHandling.None, WhitespaceHandling.All или WhitespaceHandling.Significant.
tr: WhitespaceHandling.None veya WhitespaceHandling.All ya da WhitespaceHandling.Significant bekleniyor.
zh_hans: 应为 WhitespaceHandling.None、WhitespaceHandling.All 或 WhitespaceHandling.Significant。
zh_hant: 應為 WhitespaceHandling.None、WhitespaceHandling.All 或 WhitespaceHandling.Significant。

# Xml_WriterAsyncNotSetException
source: Set XmlWriterSettings.Async to true if you want to use Async Methods.
cs: Pokud chcete používat asynchronní metody, nastavte vlastnost XmlWriterSettings.Async na hodnotu true.
de: Legen Sie XmlWriterSettings.Async auf "true" fest, wenn Sie asynchrone Methoden verwenden möchten.
es: Establezca XmlWriterSettings.Async en true si desea usar métodos asincrónicos.
fr: Attribuez à XmlWriterSettings.Async la valeur true si vous souhaitez utiliser des méthodes asynchrones.
it: Per usare i metodi asincroni, impostare XmlWriterSettings.Async su true.
ja: 非同期メソッドを使用する場合、XmlWriterSettings.Async を True に設定します。
ko: 비동기 메서드를 사용하려면 XmlWriterSettings.Async를 true로 설정하세요.
pl: Ustaw dla właściwości XmlWriterSettings.Async wartość True, jeśli chcesz używać metod asynchronicznych.
pt_br: Defina XmlWriterSettings.Async como true se desejar usar Métodos Assíncronos.
ru: Задайте для параметра XmlWriterSettings.Async значение true, чтобы использовать асинхронные методы.
tr: Async Metotlarını kullanmak istiyorsanız XmlWriterSettings.Async değerini true olarak ayarlayın.
zh_hans: 如果你想使用 Async 方法，请将 XmlWriterSettings.Async 设置为 True。
zh_hant: 若要使用 Async 方法，請將 XmlWriterSettings.Async 設為 true。

# Xml_WrongToken
source: Token {0} in state {1} would result in an invalid XML document.
cs: Token {0} ve stavu {1} by způsobil neplatnost dokumentu XML.
de: Ein Token {0} im Zustand {1} würde zu einem ungültigen XML-Dokument führen.
es: El token {0} en el estado {1} daría lugar a un documento XML no válido.
fr: Le jeton {0} dans l'état {1} va générer un document XML non valide.
it: Con il token {0} nello stato {1} si ottiene un documento XML non valido.
ja: 状態 {1} のトークン {0} は XML ドキュメントを無効にする可能性があります。
ko: 상태 {1}의 토큰 {0}은(는) XML 문서를 사용할 수 없게 할 수 있습니다.
pl: Token {0} w stanie {1} dałby w wyniku nieprawidłowy dokument XML.
pt_br: O token {0} no estado {1} resultaria em um documento XML inválido.
ru: Маркер {0} в состоянии {1} вызовет получение недопустимого документа XML.
tr: {1} durumundaki {0} belirteci geçersiz bir XML belgesi oluşmasına neden olur.
zh_hans: 处于状态 {1} 的标记 {0} 将导致无效的 XML 文档。
zh_hant: 狀態 {1} 的語彙基元 {0} 導致無效的 XML 文件。

# Xml_XapResolverCannotOpenUri
source: Cannot open '{0}'. The Uri parameter must be a relative path pointing to content inside the Silverlight application's XAP package. If you need to load content from an arbitrary Uri, please see the documentation on Loading XML content using WebClient/HttpWebRequest.
cs: Nelze otevřít objekt {0}. Parametr Uri musí být relativní cesta odkazující na obsah v balíčku XAP aplikace architektury Silverlight. Pokud potřebujete načíst obsah z libovolného identifikátoru URI, nahlédněte do dokumentace o načítání obsahu XML pomocí WebClient/HttpWebRequest.
de: "{0}" kann nicht geöffnet werden. Der Uri-Parameter muss ein relativer Pfad sein, der auf den Inhalt im XAP-Paket der Silverlight-Anwendung verweist. Wenn Sie Inhalte von einem beliebigen URI laden möchten, lesen Sie die Dokumentation zum Laden von XML-Inhalten mit WebClient/HttpWebRequest.
es: No se puede abrir "{0}". El parámetro Uri debe ser una ruta de acceso relativa que apunte al contenido del paquete XAP de la aplicación Silverlight. Si necesita cargar contenido desde un Uri arbitrario, consulte la documentación referente a la carga de contenido XML mediante WebClient o HttpWebRequest.
fr: Impossible d'ouvrir '{0}'. Le paramètre Uri doit être un chemin relatif qui pointe vers le contenu du package XAP de l'application Silverlight. Si vous devez charger du contenu à partir d'un Uri arbitraire, consultez la documentation sur le chargement de contenu XML à l'aide de WebClient/HttpWebRequest.
it: Non è possibile aprire '{0}'. Il parametro URI deve essere un percorso relativo che punta al contenuto del pacchetto XAP dell'applicazione Silverlight. Se è necessario caricare contenuti da un URI arbitrario, vedere la documentazione relativa al caricamento di contenuto XML con WebClient/HttpWebRequest.
ja: '{0}' を開くことができません。Uri パラメーターは、Silverlight アプリケーションの XAP パッケージ内のコンテンツを指す相対パスである必要があります。任意の Uri からコンテンツを読み込む必要がある場合は、WebClient/HttpWebRequest を使用した XML コンテンツの読み込みに関するドキュメントを参照してください。
ko: '{0}'을(를) 열 수 없습니다. Uri 매개 변수 값이 Silverlight 애플리케이션의 XAP 패키지에 포함된 내용을 가리키는 상대 경로여야 합니다. 임의 Uri에서 내용을 로드해야 하는 경우 WebClient/HttpWebRequest를 사용하여 XML 내용을 로드하는 방법에 대한 설명서를 참조하세요.
pl: Nie można otworzyć elementu „{0}”. Parametr Uri musi być ścieżką względną wskazującą zawartość pakietu XAP aplikacji Silverlight. Jeśli istnieje konieczność załadowania zawartości z elementu o innym identyfikatorze URI, należy się zapoznać z dokumentacją ładowania zawartości XML przy użyciu elementu WebClient/HttpWebRequest.
pt_br: Não é possível abrir '{0}'. O parâmetro URI deve ser um caminho relativo que aponte para o conteúdo dentro do pacote XAP do aplicativo Silverlight. Se for necessário carregar conteúdo de um URI arbitrário, consulte a documentação sobre como carregar conteúdo XML usando WebClient/HttpWebRequest.
ru: Не удалось открыть "{0}". Параметр Uri должен быть относительным путем, указывающим на содержимое внутри пакета XAP приложения Silverlight. Если необходимо загрузить содержимое из произвольного Uri, см. документацию по загрузке XML-содержимого посредством WebClient/HttpWebRequest.
tr: '{0}' açılamıyor. Uri parametresi, Silverlight uygulamasının XAP paketindeki içeriği gösteren göreli bir yol olmalıdır. İsteğe bağlı bir Uri'den içerik yüklemeniz gerekiyorsa, lütfen WebClient/HttpWebRequest kullanarak XML içeriği yükleme konulu belgelere bakın.
zh_hans: 无法打开“{0}”。Uri 参数必须是一个相对路径，指向 Silverlight 应用程序的 XAP 包中的内容。如果需要从任意 Uri 加载内容，请参见有关使用 WebClient/HttpWebRequest 加载 XML 内容的文档。
zh_hant: 無法開啟 '{0}'。Uri 參數必須是指向 Silverlight 應用程式的 XAP 套件內部內容的相對路徑。若需要從任一 Uri 載入內容，請參閱使用 WebClient/HttpWebRequest 載入 XML 內容的文件。

# Xml_XmlDeclNotFirst
source: Unexpected XML declaration. The XML declaration must be the first node in the document, and no white space characters are allowed to appear before it.
cs: Neočekávaná deklarace XML. Deklarace XML musí být prvním uzlem v dokumentu. Před ní nejsou povoleny žádné prázdné znaky.
de: Unerwartete XML-Deklaration. Die XML-Deklaration muss der erste Knoten im Dokument sein. Davor sind keine Leerraumzeichen zulässig.
es: Declaración XML inesperada. La declaración XML debe ser el primer nodo del documento y no pueden aparecer espacios en blanco delante.
fr: Déclaration XML inattendue. La déclaration XML doit être le premier nœud du document et aucun espace blanc ne doit être placé avant.
it: Dichiarazione XML imprevista. La dichiarazione XML deve essere il primo nodo nel documento e non deve essere preceduta da spazi vuoti.
ja: 予期しない XML 宣言です。XML 宣言は、ドキュメントの先頭ノードに記述する必要があります。また、この宣言文の前に空白を置くことはできません。
ko: 예기치 않은 XML 선언입니다. XML 선언은 문서에서 첫 번째 노드여야 하며 선언 앞에 공백 문자가 올 수 없습니다.
pl: Nieoczekiwana deklaracja XML. Deklaracja XML musi być pierwszym węzłem dokumentu. Nie mogą znajdować się przed nią żadne białe znaki.
pt_br: Declaração XML inesperada. A declaração XML deve ser o primeiro nó no documento e não pode conter caracteres de espaço em branco antes dela.
ru: Непредусмотренное объявление XML. Объявление XML должно быть первым узлом в документе, использование пробелов перед ним не допускается.
tr: Beklenmeyen XML bildirimi. XML bildirimi belgedeki ilk düğüm olmalıdır ve öncesinde boşluk karakterlerinin bulunmasına izin verilmez.
zh_hans: 意外的 XML 声明。XML 声明必须是文档中的第一个节点并且在它之前不允许出现空格字符。
zh_hant: 這不是預期的 XML 宣告。XML 宣告必須在文件的第一個節點，且不允許在其前方出現空白字元。
