Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xslt_IncompatibleCompiledStylesheetVersion
source: Executing a stylesheet that was compiled using a later version of the framework is not supported. Stylesheet Version: {0}. Current Framework Version: {1}.
cs: Spuštění šablony stylů, která byla zkompilována pomocí novější verze rozhraní, není podporováno. Verze šablony stylů: {0}. Aktuální verze rozhraní: {1}
de: Die Ausführung eines Stylesheets, das mit einer neuen Framework-Version kompiliert wurde, wird nicht unterstützt. Stylesheet-Version: {0}. Aktuelle Framework-Version: {1}.
es: No se admite la ejecución de una hoja de estilos compilada con una versión posterior de la plataforma. Versión de la hoja de estilos: {0}. Versión actual de la plataforma: {1}.
fr: L'exécution d'une feuille de style compilée à l'aide d'une ancienne version du framework n'est pas prise en charge. Version de la feuille de style : {0}. Version actuelle du framework : {1}.
it: L'esecuzione di un foglio di stile compilato con una versione successiva del framework non è supportata. Versione del foglio di stile: {0}. Versione corrente del framework: {1}.
ja: 新しいバージョンのフレームワークを使用してコンパイルしたスタイルシートの実行はサポートされていません。スタイルシートのバージョン: {0}。現在のフレームワークのバージョン: {1}。
ko: 상위 버전의 프레임워크를 사용하여 컴파일한 스타일시트는 실행할 수 없습니다. 스타일시트 버전: {0}. 현재 프레임워크 버전: {1}.
pl: Wykonywanie zawartości arkusza stylów skompilowanego przy użyciu nowszej wersji platformy nie jest obsługiwane. Wersja arkusza stylów: {0}. Bieżąca wersja platformy: {1}.
pt_br: A execução de uma folha de estilos que foi compilada usando uma versão posterior da estrutura não tem suporte. Versão da Folha de Estilos: {0}. Versão Atual da Estrutura: {1}.
ru: Применение таблицы стилей, скомпилированной с помощью более поздней версии платформы, не поддерживается. Версия таблицы стилей: {0}. Текущая версия платформы: {1}.
tr: Framework'ün önceki bir sürümüyle derlenen bir stil sayfasının çalıştırılması desteklenmiyor. Stil Sayfası Sürümü: {0}. Geçerli Framework Sürümü: {1}.
zh_hans: 不支持执行使用更高版本 Framework 编译的样式表。样式表版本: {0}。当前 Framework 版本: {1}。
zh_hant: 不支援執行使用較新版本 Framework 編譯的樣式表。樣式表版本: {0}。目前的 Framework 版本: {1}。

# Xslt_NoStylesheetLoaded
source: No stylesheet was loaded.
cs: Nebyla načtena žádná šablona stylů.
de: Es wurde kein Stylesheet geladen.
es: No hay ninguna hoja de estilos cargada.
fr: Aucune feuille de style n'a été chargée.
it: Non sono stati caricati fogli di stile.
ja: スタイルシートが読み込まれていません。
ko: 스타일시트가 로드되지 않았습니다.
pl: Nie załadowano arkuszy stylów.
pt_br: Nenhuma folha de estilos foi carregada.
ru: Не загружены таблицы стилей.
tr: Hiç stil sayfası yüklenmedi.
zh_hans: 未加载任何样式表。
zh_hant: 未載入任何樣式表。

# Xslt_NotCompiledStylesheet
source: Type '{0}' is not a compiled stylesheet class.
cs: Typ {0} není kompilovaná třída šablony stylů.
de: Der Typ "{0}" ist keine kompilierte Stylesheetklasse.
es: El tipo "{0}" no es una clase de hoja de estilos compilada.
fr: Le type '{0}' n'est pas une classe de feuille de style compilée.
it: Il tipo '{0}' non è una classe foglio di stile compilata.
ja: 型 '{0}' はコンパイル済みのスタイルシート クラスではありません。
ko: 형식 '{0}'은(는) 컴파일된 스타일시트 클래스가 아닙니다.
pl: Typ „{0}” nie jest klasą skompilowanego arkusza stylów.
pt_br: O tipo '{0}' não é uma classe de folha de estilos compilada.
ru: Тип "{0}" не является скомпилированным классом таблицы стилей.
tr: '{0}' türü, derlenmiş bir stil sayfası sınıfı değil.
zh_hans: 类型“{0}”经过编译的样式表类。
zh_hant: 類型 '{0}' 不是編譯的樣式表類別。
