Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_MaxLengthConstraintFailed
source: The actual length is greater than the MaxLength value.
cs: Skutečná délka je větší než hodnota MaxLength.
de: Die tatsächliche Länge ist größer als der MaxLength-Wert.
es: La longitud real es mayor que el valor de MaxLength.
fr: La longueur réelle est supérieure à la valeur de MaxLength.
it: La lunghezza effettiva è maggiore del valore di MaxLength.
ja: 実際の値が MaxLength 値を超えています。
ko: 실제 길이가 MaxLength 값보다 큽니다.
pl: Rzeczywista długość jest większa niż wartość MaxLength.
pt_br: O comprimento real é maior que o valor de MaxLength.
ru: Фактическая длина больше значения MaxLength.
tr: Gerçek uzunluk MaxLength değerinden büyük.
zh_hans: 实际长度大于 MaxLength 值。
zh_hant: 實際長度大於 MaxLength 的值。

# Sch_MaxLengthFacetInvalid
source: The MaxLength constraining facet is invalid - {0}
cs: Omezující vlastnost MaxLength je neplatná – {0}
de: Ungültiges MaxLength-Einschränkungsfacet – {0}
es: Faceta de restricción de MaxLength no válida - {0}
fr: La facette de contrainte MaxLength est non valide : {0}
it: Il facet vincolante MaxLength non è valido - {0}
ja: MaxLength 制約ファセットが無効です。{0}
ko: MaxLength 제약 패싯이 잘못되었습니다. {0}
pl: Element MaxLength ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MaxLength é inválida – {0}
ru: Недопустимый ограничивающий аспект MaxLength — {0}
tr: MaxLength kısıtlama modeli geçersiz - {0}
zh_hans: MaxLength 约束方面无效 - {0}
zh_hant: MaxLength 條件約束 Facet 無效 - {0}

# Sch_MaxLengthFacetProhibited
source: The MaxLength constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MaxLength je pro {0} zakázána.
de: Das MaxLength-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MaxLength prohibida para "{0}".
fr: La facette de contrainte MaxLength est interdite pour '{0}'.
it: Il facet vincolante MaxLength non è consentito per '{0}'.
ja: MaxLength 制約ファセットは '{0}' で使用できません。
ko: MaxLength 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MaxLength ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições MaxLength é proibida para '{0}'.
ru: Ограничивающий аспект MaxLength запрещен для "{0}".
tr: '{0}' için MaxLength kısıtlama modeli kullanılamaz.
zh_hans: MaxLength 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MaxLength 條件約束 Facet。

# Sch_MaxLengthGtBaseMaxLength
source: It is an error if 'maxLength' is among the members of {facets} of {base type definition} and {value} is greater than the {value} of the parent 'maxLength'.
cs: Pokud vlastnost maxLength patří mezi členy {facets} typu {base type definition} a hodnota {value} je větší než hodnota {value} nadřazené vlastnosti maxLength, jedná se o chybu.
de: Wenn "maxLength" ein Member von {facets} der {base type definition} und {value} größer als der {value} der übergeordneten "maxLength" ist, tritt ein Fehler auf.
es: Es incorrecto que "maxLength" se encuentre entre los miembros de {facets} de {base type definition} y que {value} sea mayor que {value} de "maxLength" primario.
fr: 'maxLength' ne doit pas faire partie des membres des {facets} de la {base type definition} et la {value} ne doit pas être supérieure à la {value} du 'maxLength' parent.
it: Se 'maxLength' è incluso nei membri di {facets} di {base type definition}, il valore {value} non deve essere maggiore di quello dell'elemento 'maxLength' padre.
ja: 'maxLength' が {base type definition} の {facets} のメンバーの中にあり、{value} が親 'maxLength' の {value} よりも大きい場合は、エラーです。
ko: 'maxLength'가 {base type definition}의 {facets} 멤버 중 하나인 경우 {value}가 부모 'maxLength'의 {value}보다 크면 오류가 발생합니다.
pl: Jeśli element „maxLength” należy do składowych aspektów {facets} dla definicji {base type definition}, a wartość {value} jest większa niż wartość {value} nadrzędnego elementu „maxLength”, występuje błąd.
pt_br: Erro se 'maxLength' estiver entre os membros de {facets} de {base type definition} e se {value} for maior que {value} do 'maxLength' pai.
ru: Является ошибкой то, что maxLength указан среди членов {facets} для {base type definition}, а {value} больше, чем {value} родительского maxLength.
tr: 'maxLength'in {base type definition} tanımının {facets} taraflarının üyeleri arasında olması ve {value} değerinin üst 'maxLength'in {value} değerinden büyük olması hatadır.
zh_hans: 如果 "maxLength" 是 {base type definition} 的 {facets} 的成员，并且 {value} 大于父级 "maxLength" 的 {value}，则是错误的。
zh_hant: 若 'maxLength' 是在 {base type definition} 內 {facets} 的成員之中，且 {value} 大於父 'maxLength' 的 {value}，即為錯誤。

# Sch_MaxMinLengthBaseLength
source: It is an error for both 'length' and either 'minLength' or 'maxLength' to be members of {facets}, unless they are specified in different derivation steps. In which case the following must be true: the {value} of 'minLength' <= the {value} of 'length' <= the {value} of 'maxLength'.
cs: Pokud je jak atribut length, tak atribut minLength nebo maxLength členem {facets}, jedná se o chybu. O chybu by se nejednalo v případě, že by byly zadány v různých krocích odvození. V takovém případě musí platit následující: hodnota {value} atributu minLength <= hodnota {value} atributu length <= hodnota {value} atributu maxLength.
de: Ein Fehler tritt auf, wenn sowohl "length" als auch "minLength" oder "maxLength" Member von {facets} sind, es sei denn, sie werden in verschiedenen Ableitungsschritten angegeben. In diesem Fall muss Folgendes zutreffen: {value} von "minLength" <= {value} von "length" <= {value} von "maxLength".
es: Es incorrecto que tanto "length" como "minLength" o "maxLength" sean miembros de {facets}, salvo que se especifiquen en pasos de derivación diferentes. En este caso debe ser true: {value} de "minLength" <= {value} de "length" <= {value} de "maxLength".
fr: 'length' et 'minLength' ou 'maxLength' ne doivent pas être membres des {facets}, sauf s'ils ont été spécifiés à diverses étapes de la dérivation. Dans ce cas, l'expression suivante doit être vraie : {value} de 'minLength' <= {value} de length <= {value} de 'maxLength'.
it: 'length' e 'minLength' o 'maxLength' non possono essere contemporaneamente membri di {facets}, a meno che non vengano specificati in passaggi di derivazione diversi. In questo caso è necessario che le condizioni seguenti siano vere: {value} di 'minLength' <= {value} di 'length' <= {value} di 'maxLength'.
ja: 'minLength' または 'maxLength' のどちらか一方と 'length' とを同時に {facets} のメンバーにすることはできません。ただし、これらが異なる派生ステップに指定されており、かつ 'length' の {value} が 'minLength' の {value} 以上、'maxLength' の {value} 以下という条件を満たしている場合は可能です。
ko: 'length'와 'minLength' 또는 'maxLength'를 다른 파생 단계에서 지정하지 않는 경우 이러한 요소들이 {facets}의 멤버가 되면 오류가 발생합니다. 이런 경우에는 'minLength'의 {value} <= 'length'의 {value} <= 'maxLength'의 {value}가 true가 되어야 합니다.
pl: Jeśli element „length” oraz element „minLength” lub element „maxLength” są składowymi aspektów {facets}, występuje błąd, chyba że zostały one określone w obrębie różnych kroków wyprowadzania. W takiej sytuacji następująca zależność musi być prawdziwa: wartość {value} elementu „minLength” <= wartość {value} elementu „length” <= wartość {value} elementu „maxLength”.
pt_br: Erro se 'length' e 'minLength' ou 'maxLength' forem membros de {facets}, a não ser que eles sejam especificados em diferentes etapas de derivação. Nesse caso, o seguinte deve ser true: {value} de 'minLength' <= {value} de 'length' <= {value} de 'maxLength'.
ru: Length и minLength или maxLength не могут одновременно быть членами {facets}, кроме случая, когда они были определены на разных этапах получения производных значений. При этом должно выполняться следующее условие: {value} для minLength <= {value} для length <= {value} для maxLength.
tr: Farklı türetme adımlarında belirtilmedikleri sürece hem 'length' hem de 'minLength' veya 'maxLength' uzunluklarının {facets} taraflarının üyesi olması hatadır. Her durumda aşağıdakiler doğru olmalıdır: 'minLength' {value} değeri <= 'length' {value} değeri <= 'maxLength' {value} değeri.
zh_hans: "length" 和 "minLength" 或 "maxLength" 之一同时作为 {facets} 的成员是错误的，除非是在不同的派生步骤中指定。后一种情况下，必须满足以下条件: "minLength" 的 {value} <= "length" 的 {value} <= "maxLength" 的 {value}。
zh_hant: 'length' 或是 'minLength' 與 'maxLength'to be members 中之一的這兩者若為 {facets} 成員，即為錯誤，除非在不同的衍生步驟中指定了他們。在此情況下，下列必須為 True:'minLength' 的 {value} <= 'length' 的 {value} <= 'maxLength' 的 {value}。

# Sch_MaxOccursInvalid
source: The maxOccurs attribute must have a value of 1 or *.
cs: Atribut maxOccurs musí mít hodnotu 1 nebo *.
de: Der Wert des maxOccurs-Attributs muss 1 oder * sein.
es: El atributo maxOccurs debe tener un valor de 1 o *.
fr: L'attribut maxOccurs doit avoir la valeur 1 ou *.
it: Il valore dell'attributo maxOccurs deve essere 1 o *.
ja: maxOccurs 属性には値 1 または * を指定しなければなりません。
ko: maxOccurs 특성 값은 1 또는 *여야 합니다.
pl: Atrybut maxOccurs musi mieć wartość 1 lub *.
pt_br: O atributo maxOccurs deve ter valor 1 ou *.
ru: Атрибут maxOccurs должен иметь значение 1 или *.
tr: maxOccurs özniteliğinin değeri 1 veya * olmalıdır.
zh_hans: maxOccurs 特性必须具有值 1 或 *。
zh_hant: maxOccurs 屬性必須有屬於 1 或 * 的值。

# Sch_MaxOccursInvalidXsd
source: The value for the 'maxOccurs' attribute must be xsd:nonNegativeInteger or 'unbounded'.
cs: Hodnota atributu maxOccurs musí být xsd:nonNegativeInteger nebo unbounded.
de: Der Wert für das maxOccurs-Attribut muss "xsd:nonNegativeInteger" oder "unbounded" sein.
es: El valor del atributo "maxOccurs" debe ser xsd:nonNegativeInteger o "unbounded".
fr: La valeur pour l'attribut 'maxOccurs' doit être xsd:nonNegativeInteger ou 'unbounded'.
it: Il valore dell'attributo 'maxOccurs' deve essere xsd:nonNegativeInteger o 'unbounded'.
ja: 属性 'maxOccurs' の値は xsd:nonNegativeInteger または 'unbounded' でなければなりません。
ko: 'maxOccurs' 특성의 값은 xsd:nonNegativeInteger 또는 'unbounded'여야 합니다.
pl: Wartością atrybutu „maxOccurs” musi być xsd:nonNegativeInteger lub „unbounded”.
pt_br: O valor do atributo 'maxOccurs' deve ser xsd:nonNegativeInteger ou 'unbounded'.
ru: Значение атрибута maxOccurs должно быть xsd:nonNegativeInteger или unbounded.
tr: 'maxOccurs' özniteliğinin değeri xsd:nonNegativeInteger veya 'unbounded' olmalıdır.
zh_hans: "maxOccurs" 特性的值必须为 xsd:nonNegativeInteger 或 "unbounded"。
zh_hant: 'maxOccurs' 的屬性值必須為 xsd:nonNegativeInteger 或 'unbounded'。

# Sch_MinExclusiveConstraintFailed
source: The MinExclusive constraint failed.
cs: Omezení MinExclusive nebylo úspěšné.
de: Fehler bei MinExclusive-Einschränkung.
es: Error de restricción de MinExclusive.
fr: Échec de la contrainte MinExclusive.
it: Il vincolo MinExclusive non è riuscito.
ja: MinExclusive 制約が失敗しました。
ko: MinExclusive 제약 조건이 실패했습니다.
pl: Błąd ograniczenia MinExclusive.
pt_br: Falha na restrição MinExclusive.
ru: Сбой ограничения MinExclusive.
tr: MinExclusive kısıtlaması başarısız oldu.
zh_hans: MinExclusive 约束失败。
zh_hant: MinExclusive 條件約束失敗。

# Sch_MinExclusiveFacetInvalid
source: The MinExclusive constraining facet is invalid - {0}
cs: Omezující vlastnost MinExclusive je neplatná – {0}
de: Ungültiges MinExclusive-Einschränkungsfacet – {0}
es: Faceta de restricción de MinExclusive no válida - {0}
fr: La facette de contrainte MinExclusive est non valide : {0}
it: Il facet vincolante MinExclusive non è valido - {0}
ja: MinExclusive 制約ファセットが無効です。{0}
ko: MinExclusive 제약 패싯이 잘못되었습니다. {0}
pl: Element MinExclusive ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições MinExclusive é inválida – {0}
ru: Недопустимый ограничивающий аспект MinExclusive — {0}
tr: MinExclusive kısıtlama modeli geçersiz - {0}
zh_hans: MinExclusive 约束方面无效 - {0}
zh_hant: MinExclusive 條件約束 Facet 無效 - {0}

# Sch_MinExclusiveFacetProhibited
source: The MinExclusive constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost MinExclusive je pro {0} zakázána.
de: Das MinExclusive-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de MinExclusive prohibida para "{0}".
fr: La facette de contrainte MinExclusive est interdite pour '{0}'.
it: Il facet vincolante MinExclusive non è consentito per '{0}'.
ja: MinExclusive 制約ファセットは '{0}' で使用できません。
ko: MinExclusive 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element MinExclusive ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições MinExclusive é proibida para '{0}'.
ru: Ограничивающий аспект MinExclusive запрещен для "{0}".
tr: '{0}' için MinExclusive kısıtlama modeli kullanılamaz.
zh_hans: MinExclusive 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 MinExclusive 條件約束 Facet。

# Sch_MinExclusiveGtMaxExclusive
source: The value specified for 'minExclusive' cannot be greater than the value specified for 'maxExclusive' for the same data type.
cs: Hodnota zadaná pro omezení minExclusive nesmí být větší než hodnota zadaná pro omezení maxExclusive pro stejný datový typ.
de: Der für "minExclusive" angegebene Wert darf nicht größer sein als der für "maxExclusive" angegebene Wert für denselben Datentyp.
es: El valor especificado para "minExclusive" no puede ser mayor que el valor especificado para "maxExclusive" para el mismo tipo de datos.
fr: La valeur spécifiée pour 'minExclusive' ne doit pas être supérieure à la valeur spécifiée pour 'maxExclusive' pour le même type de données.
it: Il valore specificato per 'minExclusive' non può essere maggiore di quello specificato per 'maxExclusive' per lo stesso tipo di dati.
ja: データ型が同じ場合、'minExclusive' に指定された値を、'maxExclusive' に指定された値より大きくすることはできません。
ko: 'minExclusive'에 지정된 값은 동일한 데이터 형식의 'maxExclusive'에 지정된 값보다 클 수 없습니다.
pl: W obrębie jednego typu danych wartość określona dla elementu „minExclusive” nie może być większa niż wartość określona dla elementu „maxExclusive”.
pt_br: O valor especificado para 'minExclusive' não pode ser maior que o valor especificado para 'maxExclusive' para o mesmo tipo de dados.
ru: Значение minExclusive не может быть больше значения maxExclusive, заданного для того же типа данных.
tr: Aynı veri türünde, 'minExclusive' için belirtilen değer 'maxExclusive' için belirtilen değerden büyük olamaz.
zh_hans: 为 "minExclusive" 指定的值不能大于为同一数据类型的 "maxExclusive" 指定的值。
zh_hant: 在相同資料類型中，'minExclusive' 的指定值不可以大於 'maxExclusive' 的指定值。

# Sch_MinExclusiveGtMaxInclusive
source: The value specified for 'minExclusive' cannot be greater than the value specified for 'maxInclusive' for the same data type.
cs: Hodnota zadaná pro omezení minExclusive nesmí být větší než hodnota zadaná pro omezení maxInclusive pro stejný datový typ.
de: Der für "minExclusive" angegebene Wert darf nicht größer sein als der für "maxInclusive" angegebene Wert für denselben Datentyp.
es: El valor especificado para "minExclusive" no puede ser superior al valor especificado para "maxInclusive" para el mismo tipo de datos.
fr: La valeur spécifiée pour 'minExclusive' ne doit pas être supérieure à la valeur spécifiée pour 'maxInclusive' pour le même type de données.
it: Il valore specificato per 'minExclusive' non può essere maggiore di quello specificato per 'maxInclusive' per lo stesso tipo di dati.
ja: データ型が同じ場合、'minExclusive' に指定された値を、'maxInclusive' に指定された値より大きくすることはできません。
ko: 'minExclusive'에 지정된 값은 동일한 데이터 형식의 'maxInclusive'에 지정된 값보다 클 수 없습니다.
pl: W obrębie jednego typu danych wartość określona dla elementu „minExclusive” nie może być większa niż wartość określona dla elementu „maxInclusive”.
pt_br: O valor especificado para 'minExclusive' não pode ser maior que o valor especificado para 'maxInclusive' para o mesmo tipo de dados.
ru: Значение minExclusive не может быть больше значения maxInclusive, заданного для того же типа данных.
tr: Aynı veri türünde, 'minExclusive' için belirtilen değer 'maxInclusive' için belirtilen değerden büyük olamaz.
zh_hans: 为 "minExclusive" 指定的值不能大于为同一数据类型的 "maxInclusive" 指定的值。
zh_hant: 在相同資料類型中，'minExclusive' 的指定值不可以大於 'maxInclusive' 的指定值。

# Sch_MinExclusiveMismatch
source: It is an error if the derived 'minExclusive' facet value is less than the parent 'minExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minExclusive menší než hodnota nadřazené omezující vlastnosti minExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minExclusive" kleiner ist als der übergeordnete Wert des Facets "minExclusive", tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minExclusive" derivado sea menor que el valor de faceta "minExclusive" primario.
fr: La valeur de la facette du 'minExclusive' dérivé ne doit pas être inférieure à la valeur de la facette du 'minExclusive' parent.
it: Il valore del facet derivato 'minExclusive' non può essere minore del valore del facet 'minExclusive' padre.
ja: 派生した 'minExclusive' ファセットの値が親の 'minExclusive' ファセットの値未満である場合はエラーです。
ko: 파생된 'minExclusive' 패싯 값이 부모 'minExclusive' 패싯 값보다 작으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minExclusive” jest mniejsza niż nadrzędna wartość aspektu „minExclusive”, występuje błąd.
pt_br: Erro se o valor de faceta 'minExclusive' derivada for menor que o valor da faceta 'minExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minExclusive меньше значения родительского аспекта minExclusive.
tr: Türetilen 'minExclusive' modeli değerinin üst 'minExclusive' modeli değerinden küçük olması hatadır.
zh_hans: 如果派生的 "minExclusive" 方面值小于父级 "minExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minExclusive' Facet 值小於父 'minExclusive' Facet 的值，即為錯誤。

# Sch_MinExlIncMismatch
source: It is an error if the derived 'minExclusive' facet value is less than or equal to the parent 'minInclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minExclusive menší nebo rovna hodnotě nadřazené omezující vlastnosti minInclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minExclusive" kleiner oder gleich dem übergeordneten Wert des Facets "minInclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minExclusive" derivado sea menor o igual que el valor de faceta "minInclusive" primario.
fr: La valeur de la facette du 'minExclusive' dérivé ne doit pas être inférieure ou égale à la valeur de la facette du 'minInclusive' parent.
it: Il valore del facet derivato 'minExclusive' non può essere minore del valore del facet 'minInclusive' padre.
ja: 派生した 'minExclusive' ファセットの値が親の 'minInclusive' ファセットの値以下である場合はエラーです。
ko: 파생된 'minExclusive' 패싯 값이 부모 'minInclusive' 패싯 값보다 작거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minExclusive” jest mniejsza lub równa nadrzędnej wartości aspektu „minInclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'minExclusive' derivada for menor ou igual ao valor da faceta 'minInclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minExclusive меньше или равно значению родительского аспекта minInclusive.
tr: Türetilen 'minExclusive' modeli değerinin üst 'minInclusive' modeli değerinden küçük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "minExclusive" 方面值小于或等于父级 "minInclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minExclusive' Facet 值小於或等於父 'minInclusive' Facet 的值，即為錯誤。

# Sch_MinExlMaxExlMismatch
source: It is an error if the derived 'minExclusive' facet value is greater than or equal to the parent 'maxExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minExclusive větší nebo rovna hodnotě nadřazené omezující vlastnosti maxExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minExclusive" größer oder gleich dem übergeordneten Wert des Facets "maxExclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minExclusive" derivado sea mayor o igual que el valor de faceta "maxExclusive" primario.
fr: La valeur de la facette du 'minExclusive' dérivé ne doit pas être supérieure ou égale à la valeur de la facette du 'maxExclusive' parent.
it: Il valore del facet derivato 'minExclusive' non può essere maggiore o uguale al valore del facet 'maxExclusive' padre.
ja: 派生型の 'minExclusive' ファセットの値が、親の 'maxExclusive' ファセットの値以上の場合はエラーです。
ko: 파생된 'minExclusive' 패싯 값이 부모 'maxExclusive' 패싯 값보다 크거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minExclusive” jest większa lub równa nadrzędnej wartości aspektu „maxExclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'minExclusive' derivada for maior ou igual ao valor da faceta 'maxExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minExclusive больше или равно значению родительского аспекта maxExclusive.
tr: Türetilen 'minExclusive' modeli değerinin üst 'maxExclusive' modeli değerinden büyük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "minExclusive" 方面值大于或等于父级 "maxExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minExclusive' Facet 值大於或等於父 'maxExclusive' Facet 的值，即為錯誤。

# Sch_MinGtMax
source: minOccurs value cannot be greater than maxOccurs value.
cs: Hodnota minOccurs nemůže být větší než hodnota maxOccurs.
de: Der minOccurs-Wert darf nicht größer sein als der maxOccurs-Wert.
es: El valor de minOccurs no puede ser mayor que el valor de maxOccurs.
fr: La valeur minOccurs ne doit pas être supérieure à la valeur maxOccurs.
it: Il valore di minOccurs non può essere maggiore di quello di maxOccurs.
ja: minOccurs 値は maxOccurs 値より大きくなれません。
ko: minOccurs 값은 maxOccurs 값보다 클 수 없습니다.
pl: Wartość elementu minOccurs nie może być większa niż wartość elementu maxOccurs.
pt_br: O valor de minOccurs não pode ser maior que o valor de maxOccurs.
ru: Значение minOccurs не может быть больше значения maxOccurs.
tr: minOccurs değeri maxOccurs değerinden büyük olamaz.
zh_hans: minOccurs 值不能大于 maxOccurs 值。
zh_hant: minOccurs 的值不可以大於 maxOccurs 的值。

# Sch_MinIncExlMismatch
source: It is an error if the derived 'minInclusive' facet value is less than or equal to the parent 'minExclusive' facet value.
cs: Pokud je odvozená hodnota omezující vlastnosti minInclusive menší nebo rovna hodnotě nadřazené omezující vlastnosti minExclusive, jedná se o chybu.
de: Wenn der abgeleitete Wert des Facets "minInclusive" kleiner oder gleich dem übergeordneten Wert des Facets "minExclusive" ist, tritt ein Fehler auf.
es: Es incorrecto que el valor de faceta "minInclusive" derivado sea menor o igual que el valor de faceta "minExclusive" primario.
fr: La valeur de la facette du 'minInclusive' dérivé ne doit pas être inférieure ou égale à la valeur de la facette du 'minExclusive' parent.
it: Il valore del facet derivato 'minInclusive' non può essere minore o uguale al valore del facet 'minExclusive' padre.
ja: 派生型の 'minInclusive' ファセットの値が、親の 'minExclusive' ファセットの値以下の場合は、エラーです。
ko: 파생된 'minInclusive' 패싯 값이 부모 'minExclusive' 패싯 값보다 작거나 같으면 오류가 발생합니다.
pl: Jeśli pochodna wartość aspektu „minInclusive” jest mniejsza lub równa nadrzędnej wartości aspektu „minExclusive”, występuje błąd.
pt_br: Erro se o valor da faceta 'minInclusive' derivada for menor ou igual ao valor da faceta 'minExclusive' pai.
ru: Является ошибкой то, что значение производного аспекта minInclusive меньше или равно значению родительского аспекта minExclusive.
tr: Türetilen 'minInclusive' modeli değerinin üst 'minExclusive' modeli değerinden küçük veya bu değere eşit olması hatadır.
zh_hans: 如果派生的 "minInclusive" 方面值小于或等于父级 "minExclusive" 方面值，则是错误的。
zh_hant: 若衍生的 'minInclusive' Facet 值小於或等於父 'minExclusive' Facet 的值，即為錯誤。
