Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_InvalidElementContentExpectingComplex
source: The element {0} has invalid child element {1}. List of possible elements expected: {2}. {3}
cs: Element {0} obsahuje neplatný podřízený element {1}. Seznam možných očekávaných elementů: {2}. {3}
de: Das Element {0} enthält ein ungültiges untergeordnetes Element {1}. Erwartet wurde die Liste der möglichen Elemente: {2}. {3}
es: El elemento {0} tiene un elemento secundario {1} no válido. Lista esperada de elementos posibles: {2}. {3}
fr: L'élément {0} a un élément enfant non valide {1}. Liste d'éléments possibles attendus : {2}. {3}
it: L'elemento {0} contiene un elemento figlio non valido {1}. Elenco dei possibili elementi previsti: {2}. {3}
ja: 要素 {0} に無効な子要素 {1} があります。要素が含まれる一覧には {2} を指定してください。{3}
ko: {0} 요소에 잘못된 자식 요소 {1}이(가) 있습니다. 필요한 요소 목록: {2}. {3}
pl: Element {0} ma nieprawidłowy element podrzędny {1}. Lista oczekiwanych możliwych elementów: {2}. {3}
pt_br: O elemento {0} apresenta elemento filho {1} inválido. Lista de possíveis elementos esperados: {2}. {3}
ru: Элемент {0} имеет недопустимый дочерний элемент {1}. Список ожидаемых элементов: {2}. {3}
tr: {0} öğesi geçersiz {1} alt öğesine sahip. Beklenen olası öğeler listesi: {2}. {3}
zh_hans: 元素 {0} 的子元素 {1} 无效。应使用的元素如下: {2}。{3}
zh_hant: 元素 {0} 含有無效的子項目 {1}。可能元素的清單應為: {2}。{3}

# Sch_InvalidElementDefaultValue
source: The default value '{0}' of element '{1}' is invalid according to the type specified by xsi:type.
cs: Výchozí hodnota {0} elementu {1} je vzhledem k typu zadanému atributem xsi:type neplatná.
de: Der Standardwert "{0}" des Elements "{1}" ist gemäß dem von xsi:type angegebenen Typ ungültig.
es: El valor predeterminado "{0}" del elemento "{1}" no es válido según el tipo especificado por xsi:type.
fr: La valeur par défaut '{0}' de l'élément '{1}' est non valide, selon le type spécifié par xsi:type.
it: Il valore predefinito '{0}' dell'elemento '{1}' non è valido in base al tipo specificato da xsi:type.
ja: 要素 '{1}' の既定値 '{0}' は、xsi:type により指定されている型に対して無効です。
ko: 요소 '{1}'의 기본값 '{0}'은(는) xsi:type에서 지정한 형식에 따라 잘못되었습니다.
pl: Domyślna wartość „{0}” elementu „{1}” jest nieprawidłowa przy uwzględnieniu typu określonego za pomocą elementu xsi:type.
pt_br: O valor padrão '{0}' do elemento '{1}' é inválido de acordo com o tipo especificado por xsi:type.
ru: Стандартное значение "{0}" элемента "{1}" недействительно в соответствии с типом, который определен xsi:type.
tr: '{1}' öğesinin varsayılan '{0}' değeri, xsi:type tarafından belirtilen türe göre geçersiz.
zh_hans: 根据 xsi:type 指定的类型，元素“{1}”的默认值“{0}”无效。
zh_hant: 根據 xsi:type 所指定的類型，元素 '{1}' 的預設值 '{0}' 無效。

# Sch_InvalidElementFinalValue
source: The values 'substitution', 'list', and 'union' are invalid for the final attribute on element.
cs: Hodnoty substitution, list a union jsou pro atribut final elementu neplatné.
de: Die Werte "substitution", "list" und "union" sind für das final-Attribut im Element ungültig.
es: Los valores "substitution", "list" y "union" no son válidos para el atributo final del elemento.
fr: Les valeurs 'substitution', 'list' et 'union' sont non valides pour l'attribut final de l'élément.
it: I valori 'substitution', 'list' e 'union' non sono validi per l'attributo final nell'elemento.
ja: 要素の最後の属性に対し、値 'substitution'、'list'、および 'union' は無効です。
ko: 'substitution', 'list' 및 'union' 값은 요소의 final 특성에 사용할 수 없습니다.
pl: Wartości „substitution”, „list” lub „union” są nieprawidłowe dla atrybutu końcowego elementu.
pt_br: Os valores 'substitution', 'list' e 'union' são inválidos para o atributo final no elemento.
ru: Значения substitution, list и union для атрибута final элемента недопустимы.
tr: 'substitution', 'list' ve 'union' değerleri öğe üzerindeki final özniteliği için geçersiz.
zh_hans: 值 "substitution"、"list" 和 "union" 对于元素上的 final 特性无效。
zh_hant: 若是元素上的 final 屬性，'substitution'、'list' 與 'union' 均為無效值。

# Sch_InvalidElementInEmpty
source: The element cannot contain child element. Content model is empty.
cs: Element nemůže obsahovat podřízený element. Model obsahu je prázdný.
de: Das Element darf kein untergeordnetes Element enthalten. Das Inhaltsmodell ist leer.
es: El elemento no puede contener elementos secundarios. El modelo de contenido está vacío.
fr: L'élément ne peut pas contenir un élément enfant. Le modèle de contenu est vide.
it: Il modello di contenuto è vuoto. L'elemento non può contenere l'elemento figlio.
ja: 要素に子要素を含めることはできません。コンテンツ モデルが空です。
ko: 요소는 자식 요소를 포함할 수 없습니다. 콘텐츠 모델이 비어 있습니다.
pl: Element nie może zawierać elementu podrzędnego. Model zawartości jest pusty.
pt_br: O elemento não pode conter um elemento filho. Modelo de conteúdo vazio.
ru: Элемент не может содержать дочерних элементов. Модель содержимого пуста.
tr: Öğe alt öğe içeremez. İçerik modeli boş.
zh_hans: 元素不能包含子元素。内容模型为空。
zh_hant: 元素不可包含子項目。內容模型為空白。

# Sch_InvalidElementInEmptyEx
source: The element '{0}' cannot contain child element '{1}' because the parent element's content model is empty.
cs: Element {0} nemůže obsahovat podřízený element {1}, protože model obsahu nadřazeného elementu je prázdný.
de: Das Element "{0}" darf kein untergeordnetes Element "{1}" enthalten, da das Inhaltsmodell des übergeordneten Elements leer ist.
es: El elemento "{0}" no puede contener un elemento secundario "{1}" porque el modelo de contenido del elemento primario está vacío.
fr: L'élément '{0}' ne peut pas contenir un élément enfant '{1}', car le modèle de contenu de l'élément parent est vide.
it: L'elemento '{0}' non può contenere l'elemento figlio '{1}' perché il modello di contenuto dell'elemento padre è vuoto.
ja: 要素 '{0}' に子要素 '{1}' を含めることはできません。親要素のコンテンツ モデルが空であるためです。
ko: '{0}' 요소는 부모 요소의 콘텐츠 모델이 비어 있기 때문에 자식 요소 '{1}'을(를) 포함할 수 없습니다.
pl: Element „{0}” nie może zawierać elementu podrzędnego „{1}”, ponieważ model zawartości elementu nadrzędnego jest pusty.
pt_br: O elemento '{0}' não pode conter o elemento filho '{1}', pois o modelo de conteúdo do elemento pai está vazio.
ru: Элемент "{0}" не может содержать дочерний элемент "{1}", поскольку модель содержимого родительского элемента пуста.
tr: '{0}' öğesi, üst öğenin içerik modeli boş olduğu için '{1}' alt öğesini içeremez.
zh_hans: 元素“{0}”不能包含子元素“{1}”，因为父元素的内容模型为空。
zh_hant: 因為父元素的內容模型為空，所以元素 '{0}' 不可包含子項目 '{1}'。

# Sch_InvalidElementInTextOnly
source: The element cannot contain a child element. Content model is text only.
cs: Element nemůže obsahovat podřízený element. Model obsahu je pouze text.
de: Das Element darf kein untergeordnetes Element enthalten. Das Inhaltsmodell ist schreibgeschützt.
es: El elemento no puede contener elementos secundarios. El modelo de contenido es solo texto.
fr: L'élément ne peut pas contenir un élément enfant. Le modèle de contenu est de type texte uniquement.
it: Il modello di contenuto è di solo testo. L'elemento non può contenere un elemento figlio.
ja: 要素に子要素を含めることはできません。コンテンツ モデルはテキストのみです。
ko: 요소는 자식 요소를 포함할 수 없습니다. 콘텐츠 모델이 텍스트 전용입니다.
pl: Element nie może zawierać elementu podrzędnego. Model zawartości obsługuje tylko tekst.
pt_br: O elemento não pode conter um elemento filho. O modelo de conteúdo é somente texto.
ru: Элемент не может содержать дочерние элементы. Модель содержимого допускает только текст.
tr: Öğe alt öğe içeremez. İçerik modeli salt metin.
zh_hans: 元素不能包含子元素。内容模型为纯文本。
zh_hant: 元素不可包含子項目。內容模型為純文字。

# Sch_InvalidElementInTextOnlyEx
source: The element '{0}' cannot contain child element '{1}' because the parent element's content model is text only.
cs: Element {0} nemůže obsahovat podřízený element {1}, protože model obsahu nadřazeného elementu je typu pouze text.
de: Das Element "{0}" darf kein untergeordnetes Element "{1}" enthalten, da das Inhaltsmodell des übergeordneten Elements schreibgeschützt ist.
es: El elemento "{0}" no puede contener un elemento secundario "{1}" porque el modelo de contenido del elemento principal es solo texto.
fr: L'élément '{0}' ne peut pas contenir un élément enfant '{1}', car le modèle de contenu de l'élément parent est de type texte uniquement.
it: L'elemento '{0}' non può contenere l'elemento figlio '{1}' perché il modello di contenuto dell'elemento padre è di solo testo.
ja: 要素 '{0}' に子要素 '{1}' を含めることはできません。親要素のコンテンツ モデルがテキストのみであるためです。
ko: '{0}' 요소는 부모 요소의 콘텐츠 모델이 텍스트 전용이기 때문에 자식 요소 '{1}'을(를) 포함할 수 없습니다.
pl: Element „{0}” nie może zawierać elementu podrzędnego „{1}”, ponieważ model zawartości elementu nadrzędnego zawiera tylko tekst.
pt_br: O elemento '{0}' não pode conter o elemento filho '{1}', pois o modelo de conteúdo do elemento pai é somente texto.
ru: Элемент "{0}" не может содержать дочерний элемент "{1}", поскольку модель содержимого родительского элемента допускает только текст.
tr: '{0}' öğesi, üst öğenin içerik modeli salt metin olduğu için '{1}' alt öğesini içeremez.
zh_hans: 元素“{0}”不能包含子元素“{1}”，因为父元素的内容模型为纯文本。
zh_hant: 因為父元素的內容模型為純文字，所以元素 '{0}' 不可包含子項目 '{1}'。

# Sch_InvalidElementRef
source: If ref is present, all of <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block, and type must be absent.
cs: Je-li uveden parametr ref, nesmí být uveden žádný z atributů <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block a type.
de: Wenn "ref" vorhanden ist, dürfen weder <complexType>, <simpleType>, <key>, <keyref>, <unique>, "nillable", "default", "fixed", "form", "block" noch "type" vorhanden sein.
es: Si el atributo ref está presente, <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block y type no deben estar presentes.
fr: Si ref est présent, <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block et type doivent être absents.
it: Se è presente ref, non devono essere presenti <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block e type.
ja: ref が存在する場合、<complexType>、<simpleType>、<key>、<keyref>、<unique>、nillable、default、fixed、form、block および type のいずれも存在してはなりません。
ko: ref가 있는 경우 <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block 및 type은 모두 없어야 합니다.
pl: Jeśli obecne jest odwołanie (ref), wszystkie elementy <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block oraz type muszą być nieobecne.
pt_br: Se ref estiver presente, <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block e type deverão estar ausentes.
ru: Если присутствует ref, то следует исключить все <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block и type.
tr: ref varsa, <complexType>, <simpleType>, <key>, <keyref>, <unique>, nillable, default, fixed, form, block ve type'dan hiçbiri olmamalıdır.
zh_hans: 如果存在 ref，则 <complexType>、<simpleType>、<key>、<keyref>、<unique>、nillable、default、fixed、form、block 和 type 必须都不存在。
zh_hant: 若有 ref，就不可有 <complexType>, <simpleType>、<key>、<keyref>、<unique>、nillable、default、fixed、form、block 與 type。

# Sch_InvalidElementSubstitution
source: The element {0} cannot substitute for a local element {1} expected in that position.
cs: Element {0} nemůže nahradit místní element {1} očekávaný na této pozici.
de: Das Element {0} kann nicht das lokale Element {1} ersetzen, das an dieser Position erwartet wird.
es: El elemento {0} no puede sustituir a un elemento local {1} esperado en dicha posición.
fr: L'élément {0} ne peut pas remplacer un élément local {1} attendu à cette position.
it: L'elemento {0} non può sostituire un elemento locale {1} previsto in quella posizione.
ja: その位置で予期されている要素 {1} の代わりとして、要素 {0} を使用することはできません。
ko: 요소 {0}은(는) 해당 위치에 필요한 로컬 요소 {1}을(를) 대체할 수 없습니다.
pl: Element {0} nie może zastąpić elementu lokalnego {1} oczekiwanego w tej lokalizacji.
pt_br: O elemento {0} não pode substituir um elemento local {1} esperado nessa posição.
ru: Элемент {0} не может заменить локальный элемент {1}, который ожидается в этой позиции.
tr: {0} öğesi, bu konumda beklenen {1} yerel öğesinin yerine geçemez.
zh_hans: 元素 {0} 不能替代该位置应该出现的本地元素 {1}。
zh_hant: 因為該位置應為本機元素 {1}，所以無法替代元素 {0}。

# Sch_InvalidEndElementCall
source: It is invalid to call the 'ValidateEndElement' overload that takes in a 'typedValue' after 'ValidateText' or 'ValidateWhitespace' methods have been called.
cs: Není povoleno volat přetížení ValidateEndElement, při kterém je zpracován objekt typedValue pro elementy se složitým obsahem.
de: Die Überladung "ValidateEndElement", die nach dem Aufrufen der Methoden "ValidateText" oder "ValidateWhitespace" einen "typedValue" akzeptiert, darf nicht aufgerufen werden.
es: No se puede llamar a la sobrecarga "ValidateEndElement" que acepta "typedValue" después de haber llamado a los métodos "ValidateText" o "ValidateWhitespace".
fr: Impossible d'appeler la surcharge 'ValidateEndElement' qui accepte 'typedValue', une fois que la méthode 'ValidateText' ou 'ValidateWhitespace' a été appelée.
it: Non è possibile chiamare l'overload 'ValidateEndElement' che accetta un elemento 'typedValue' dopo che sono stati chiamati i metodi 'ValidateText' o 'ValidateWhitespace'.
ja: 'ValidateText' メソッドまたは 'ValidateWhitespace' メソッドが呼び出された後に、'typedValue' を取る 'ValidateEndElement' オーバーロードを呼び出すことは無効です。
ko: 'ValidateText' 또는 'ValidateWhitespace' 메서드를 호출한 다음에는 'typedValue'에서 사용되는 'ValidateEndElement' 오버로드를 호출할 수 없습니다.
pl: Po wywołaniu metody „ValidateText” lub „ValidateWhitespace” nie można wywoływać przeciążenia „ValidateEndElement” dotyczącego elementu „typedValue”.
pt_br: Será inválido chamar a sobrecarga 'ValidateEndElement' que recebe um 'typedValue' depois que os métodos 'ValidateText' ou 'ValidateWhitespace' forem chamados.
ru: Нельзя вызвать перегрузку ValidateEndElement, которому передается typedValue, после того как был вызван метод ValidateText или ValidateWhitespace.
tr: 'ValidateText' veya 'ValidateWhitespace' metotları çağrıldıktan sonra 'typedValue' içinde yer alan 'ValidateEndElement' aşırı yüklemesini çağırmak geçersizdir.
zh_hans: 调用 "ValidateText" 或 "ValidateWhitespace" 方法后，对接收 "typedValue" 的 "ValidateEndElement" 重载的调用无效。
zh_hant: 呼叫 'ValidateEndElement' 多載無效，會在呼叫 'ValidateText' 或 'ValidateWhitespace' 方法後留下 'typedValue'。

# Sch_InvalidEndElementCallTyped
source: It is invalid to call the 'ValidateEndElement' overload that takes in a 'typedValue' for elements with complex content.
cs: Pro elementy se složitým obsahem není povoleno volat přetížení ValidateEndElement, které přijímá objekt typedValue.
de: Die Überladung "ValidateEndElement", die einen "typedValue" für Elemente mit komplexem Inhalt akzeptiert, darf nicht aufgerufen werden.
es: No se puede llamar a la sobrecarga "ValidateEndElement" que acepta "typedValue" para elementos con contenido complejo.
fr: Impossible d'appeler la surcharge 'ValidateEndElement' qui accepte 'typedValue' pour les éléments au contenu complexe.
it: Non è possibile chiamare l'overload 'ValidateEndElement' che accetta un elemento 'typedValue' per gli elementi con contenuto complesso.
ja: コンテンツが複雑な要素に対して 'typedValue' を取る 'ValidateEndElement' オーバーロードを呼び出すことは無効です。
ko: 복합 콘텐츠가 있는 요소에 대해 'typedValue'에서 사용되는 'ValidateEndElement' 오버로드를 호출할 수 없습니다.
pl: Nie można wywoływać przeciążenia „ValidateEndElement” dotyczącego elementu „typedValue” dla elementów z zawartością złożoną.
pt_br: É inválido chamar a sobrecarga 'ValidateEndElement' que recebe um 'typedValue' para elementos com conteúdo complexo.
ru: Нельзя вызвать перегрузку ValidateEndElement, которому передается typedValue для элементов с составным содержимым.
tr: Karmaşık içerikli öğelere yönelik 'typedValue' içinde yer alan 'ValidateEndElement' aşırı yüklemesini çağırmak geçersizdir.
zh_hans: 对于包含复杂内容的元素，对接收 "typedValue" 的 "ValidateEndElement" 重载的调用无效。
zh_hant: 呼叫 'ValidateEndElement' 多載無效，會為附有複雜內容的元素留下 'typedValue'。

# Sch_InvalidEndElementMultiple
source: The call to the '{0}' method does not match a corresponding call to 'ValidateElement' method.
cs: Volání metody {0} neodpovídá příslušnému volání metody ValidateElement.
de: Der Aufruf der {0}-Methode stimmt nicht mit einem entsprechenden Aufruf der ValidateElement-Methode überein.
es: La llamada al método "{0}" no coincide con una llamada correspondiente al método "ValidateElement".
fr: L'appel de la méthode '{0}' ne coïncide pas avec l'appel correspondant de la méthode 'ValidateElement'.
it: La chiamata al metodo '{0}' non corrisponde a una chiamata al metodo 'ValidateElement'.
ja: '{0}' メソッドの呼び出しが、対応する 'ValidateElement' メソッドの呼び出しと一致しません。
ko: '{0}' 메서드 호출이 대응하는 'ValidateElement' 메서드 호출과 일치하지 않습니다.
pl: Wywołanie metody „{0}” nie pasuje do odpowiedniego wywołania metody „ValidateElement”.
pt_br: A chamada para o método '{0}' não coincide com uma chamada correspondente para o método 'ValidateElement'.
ru: Вызов метода "{0}" не согласуется с соответствующим вызовом метода ValidateElement.
tr: '{0}' metoduna yapılan çağrı ile 'ValidateElement' metoduna yapılan çağrı eşleşmiyor.
zh_hans: 对“{0}”方法的调用与对 "ValidateElement" 方法的相应调用不匹配。
zh_hant: 呼叫 '{0}' 方法與呼叫 'ValidateElement' 方法不相對應。

# Sch_InvalidEndValidation
source: The 'EndValidation' method cannot not be called when all the elements have not been validated. 'ValidateEndElement' calls corresponding to 'ValidateElement' calls might be missing.
cs: Metodu EndValidation nelze volat, pokud nebyly ověřeny všechny elementy. Je možné, že chybí volání metody ValidateEndElement odpovídající voláním metody ValidateElement.
de: Die EndValidation-Methode darf nicht aufgerufen werden, wenn noch nicht alle Elemente überprüft wurden. Aufrufe von "ValidateEndElement", die sich auf Aufrufe von "ValidateElement" beziehen, fehlen unter Umständen.
es: No se puede llamar al método "EndValidation" si no se han validado todos los elementos. Pueden faltar las llamadas "ValidateEndElement" correspondientes a las llamadas "ValidateElement".
fr: Impossible d'appeler la méthode 'EndValidation' tant que tous les éléments n'ont pas été validés. Les appels 'ValidateEndElement' correspondant aux appels 'ValidateElement' sont peut-être manquants.
it: Non è possibile chiamare il metodo 'EndValidation' se non sono stati convalidati tutti gli elementi. È possibile che manchino le chiamate 'ValidateEndElement' corrispondenti alle chiamate 'ValidateElement'.
ja: すべての要素の検証が完了する前に 'EndValidation' メソッドを呼び出すことはできません。'ValidateElement' 呼び出しに対応する 'ValidateEndElement' 呼び出しが失われている可能性があります。
ko: 일부 요소의 유효성을 검사하지 않으면 'EndValidation' 메서드를 호출할 수 없습니다. 'ValidateElement' 호출에 대응하는 'ValidateEndElement' 호출이 없을 수 있습니다.
pl: Jeśli nie dokonano weryfikacji wszystkich elementów, nie można wywołać metody „EndValidation”. Prawdopodobnie brakuje wywołań „ValidateEndElement” odpowiadających wywołaniom „ValidateElement”.
pt_br: Não é possível não chamar o método 'EndValidation' quando nem todos os elementos são validados. Chamadas 'ValidateEndElement' que correspondem a chamadas 'ValidateElement' podem estar ausentes.
ru: Нельзя вызвать метод EndValidation, если не были проверены все элементы. Возможно отсутствие вызовов ValidateEndElement, соответствующих вызовам ValidateElement.
tr: 'EndValidation' metodu, tüm öğeler doğrulanmadıysa çağrılamaz. 'ValidateElement' çağrılarına karşılık gelen 'ValidateEndElement' çağrıları eksik olabilir.
zh_hans: 尚未验证完所有元素时，不能调用 "EndValidation" 方法。可能会缺少与 "ValidateElement" 调用相对应的 "ValidateEndElement" 调用。
zh_hant: 尚未驗證所有元素之前，無法呼叫 'EndValidation' 方法。與 'ValidateElement' 呼叫相同之 'ValidateEndElement' 呼叫可能遺漏。

# Sch_InvalidExamplar
source: Cannot be nominated as the {substitution group affiliation} of any other declaration.
cs: Nelze nominovat jako atribut {substitution group affiliation} jakékoli jiné deklarace.
de: Kann nicht als {substitution group affiliation} einer anderen Deklaration nominiert werden.
es: No se puede designar como {substitution group affiliation} de ninguna otra declaración.
fr: Ne peut pas être nommé comme {substitution group affiliation} d'une autre déclaration.
it: Non può essere nominato come {substitution group affiliation} di qualsiasi altra dichiarazione.
ja: 他の宣言の {substitution group affiliation} の候補にすることはできません。
ko: 다른 선언의 {substitution group affiliation}으로 지정되지 않을 수 있습니다.
pl: Nie może być mianowany jako przynależność grupy podstawienia {substitution group affiliation} żadnej innej deklaracji.
pt_br: Não pode ser nomeado como {substitution group affiliation} de qualquer outra declaração.
ru: Не может быть назначен в качестве {substitution group affiliation} для любого другого объявления.
tr: Başka bir bildirimin {substitution group affiliation} öğesi olarak aday gösterilemez.
zh_hans: 不能被命名为任何其他声明的 {substitution group affiliation}。
zh_hant: 無法指定為任何其他宣告的 {substitution group affiliation}。

# Sch_InvalidFacet
source: The 'value' attribute must be present in facet.
cs: Omezující vlastnost musí obsahovat atribut value.
de: Das value-Attribut muss im Facet vorhanden sein.
es: El atributo "value" debe estar presente en la faceta.
fr: L'attribut 'value' doit être présent dans la facette.
it: L'attributo 'value' deve essere presente nel facet.
ja: ファセット内に 'value' 属性が存在しなければなりません。
ko: 'value' 특성이 패싯에 있어야 합니다.
pl: Atrybut „value” musi być obecny w aspekcie.
pt_br: O atributo 'value' deve estar presente na faceta.
ru: Аспект должен содержать атрибут value.
tr: Modelde 'value' özniteliği bulunmalıdır.
zh_hans: 方面中必须存在 "value" 特性。
zh_hant: Facet 中必須有 'value' 屬性。

# Sch_InvalidFacetPosition
source: Facet should go before 'attribute', 'attributeGroup', or 'anyAttribute'.
cs: Omezující vlastnost musí být uvedena před atributy attribute, attributeGroup nebo anyAttribute.
de: Das Facet muss "attribute", "attributeGroup" oder "anyAttribute" vorangestellt werden.
es: La faceta debe ir antes de "attribute", "attributeGroup" o "anyAttribute".
fr: La facette doit figurer avant 'attribute', 'attributeGroup' ou 'anyAttribute'.
it: Il facet deve precedere 'attribute', 'attributeGroup' o 'anyAttribute'.
ja: ファセットは、'attribute'、'attributeGroup' または 'anyAttribute' の前に置く必要があります。
ko: 패싯은 'attribute', 'attributeGroup' 또는 'anyAttribute' 앞에 있어야 합니다.
pl: Aspekt powinien znajdować się przed elementem „attribute”, „attributeGroup” lub „anyAttribute”.
pt_br: As faceta deve anteceder 'attribute', 'attributeGroup' ou 'anyAttribute'.
ru: Аспект должен указываться перед attribute, attributeGroup или anyAttribute.
tr: Model, 'attribute', 'attributeGroup' veya 'anyAttribute'tan önce gelmelidir.
zh_hans: 方面应在 "attribute"、"attributeGroup" 或 "anyAttribute" 之前。
zh_hant: Facet 應位於 'attribute'、'attributeGroup' 或 'anyAttribute' 之前。

# Sch_InvalidFinalDefaultValue
source: The value 'substitution' is invalid for the finalDefault attribute.
cs: Hodnota substitution je pro atribut finalDefault neplatná.
de: Der Wert "substitution" ist für das finalDefault-Attribut ungültig.
es: El valor "substitution" no es válido para el atributo finalDefault.
fr: La valeur 'substitution' est non valide pour l'attribut finalDefault.
it: Il valore 'substitution' non è valido per l'attributo finalDefault.
ja: finalDefault 属性に対して、値 'substitution' が無効です。
ko: 'substitution' 값은 finalDefault 특성에 사용할 수 없습니다.
pl: Wartość „substitution” jest nieprawidłowa dla atrybutu finalDefault.
pt_br: O valor 'substitution' é inválido para o atributo finalDefault.
ru: Значение substitution для атрибута finalDefault является недопустимым.
tr: 'substitution' değeri finalDefault özniteliği için geçersizdir.
zh_hans: 值 "substitution" 对于 finalDefault 特性无效。
zh_hant: 若是 finalDefault 屬性，'substitution' 為無效值。
