Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_FieldSimpleTypeExpected
source: The field '{0}' is expecting an element or attribute with simple type or simple content.
cs: Pole {0} očekává element nebo atribut s jednoduchým typem nebo obsahem.
de: Das Feld "{0}" erwartet ein Element oder Attribut mit einem einfachen Typ oder Inhalt.
es: El campo "{0}" espera un elemento o atributo con contenido o tipo simple.
fr: Le champ '{0}' attend un élément ou un attribut avec type simple ou contenu simple.
it: Nel campo '{0}' è previsto un elemento o un attributo con tipo o contenuto semplice.
ja: フィールド '{0}' は単純型か単純コンテンツを持つ要素、または属性が必要です。
ko: 단순 형식 또는 단순 콘텐츠를 사용한 요소 또는 특성이 '{0}' 필드에 있어야 합니다.
pl: Pole „{0}” oczekuje elementu lub atrybutu z typem prostym lub prostą zawartością.
pt_br: O campo '{0}' espera um elemento ou atributo com tipo simples ou conteúdo simples.
ru: Для поля "{0}" ожидается элемент или атрибут с простым типом или простым содержимым.
tr: '{0}' alanı, basit türü veya basit içeriği olan bir öğe veya öznitelik bekliyor.
zh_hans: 字段“{0}”需要具有简单类型或简单内容的元素或特性。
zh_hant: 欄位 '{0}' 中應要有具備簡單型別或簡單內容的元素或屬性。

# Sch_FieldSingleValueExpected
source: The field '{0}' is expecting at the most one value.
cs: Pole {0} očekává nejvýše jednu hodnotu.
de: Das Feld "{0}" erwartet mindestens einen Wert.
es: El campo "{0}" espera un valor como máximo.
fr: Le champ '{0}' attend tout au plus une valeur.
it: Nel campo '{0}' è previsto al massimo un valore.
ja: フィールド '{0}' には少なくとも 1 つの値が必要です。
ko: '{0}' 필드에 하나의 값만 있어야 합니다.
pl: Pole „{0}” oczekuje najwyżej jednej wartości.
pt_br: O campo '{0}' espera no máximo um valor.
ru: Для поля "{0}" ожидается не более одного значения.
tr: '{0}' alanı en çok bir değer bekliyor.
zh_hans: 字段“{0}”最多需要一个值。
zh_hant: 欄位 '{0}' 應最多只有一個值。

# Sch_FixedAttributeValue
source: The value of the '{0}' attribute does not equal its fixed value.
cs: Hodnota atributu {0} se nerovná jeho pevné hodnotě.
de: Der Wert des {0}-Attributs stimmt nicht mit seinem festen Wert überein.
es: El valor del atributo "{0}" no es igual que el valor fijo.
fr: La valeur de l'attribut '{0}' n'est pas égale à sa valeur fixe.
it: Il valore dell'attributo '{0}' non è uguale al relativo valore fisso.
ja: '{0}' 属性の値は、この属性の固定された値と一致しません。
ko: {0}' 특성의 값이 특성의 고정 값과 다릅니다.
pl: Wartość atrybutu „{0}” nie jest równa jego ustalonej wartości.
pt_br: O valor do atributo '{0}' não é igual ao seu valor fixo.
ru: Значение атрибута "{0}" не равно его фиксированному значению.
tr: '{0}' özniteliğinin değeri sabit değerine eşit değil.
zh_hans: “{0}”特性的值不等于其固定值。
zh_hant: '{0}' 屬性的值不等於其固定的值。

# Sch_FixedDefaultInRef
source: The default value constraint cannot be present on the '{0}' attribute reference if the fixed value constraint is present on the declaration.
cs: Omezení výchozí hodnoty nelze použít v rámci odkazu na atribut {0}, pokud bylo v deklaraci použito omezení pevné hodnoty.
de: Die Einschränkung des Standardwerts darf im Attributverweis "{0}" nicht vorhanden sein, wenn die Einschränkung des festen Werts in der Deklaration vorhanden ist.
es: La restricción de valor predeterminada no puede estar presente en la referencia de atributo "{0}" si la restricción de valor fija se encuentra en la declaración.
fr: La contrainte de valeur par défaut ne peut pas être présente sur la référence de l'attribut '{0}' si la contrainte de valeur fixe est présente dans la déclaration.
it: Il riferimento all'attributo '{0}' non può contenere il vincolo di valore predefinito se nella dichiarazione è presente un vincolo di valore fisso.
ja: 固定値の制約が宣言にある場合、既定値の制約が '{0}' 属性の参照に存在することはできません。
ko: 고정 값 제약 조건이 선언에 있는 경우에는 '{0}' 특성 참조에 기본값 제약 조건이 있을 수 없습니다.
pl: W odwołaniu do atrybutu „{0}” nie może występować ograniczenie wartości domyślnej, jeśli w deklaracji występuje ograniczenie wartości ustalonej.
pt_br: A restrição de valor padrão não poderá estar presente na referência de atributo '{0}' se a restrição de valor fixo estiver presente na declaração.
ru: Ссылка на атрибут "{0}" не может иметь ограничений на значение по умолчанию, если в объявлении присутствует ограничение на фиксированное значение.
tr: Bildirimde sabit değer kısıtlaması varsa, '{0}' öznitelik başvurusunda varsayılan değer kısıtlaması olamaz.
zh_hans: 如果在声明上存在固定值约束，则“{0}”特性引用上不能有默认值约束。
zh_hant: 若宣告中有固定值條件約束，'{0}' 屬性參考上就不可有預設條件約束。

# Sch_FixedElementValue
source: The value of the '{0}' element does not equal its fixed value.
cs: Hodnota elementu {0} se nerovná jeho pevné hodnotě.
de: Der Wert des {0}-Elements stimmt nicht mit seinem festen Wert überein.
es: El valor del elemento "{0}" no es igual que el valor fijo.
fr: La valeur de l'élément '{0}' n'est pas égale à sa valeur fixe.
it: Il valore dell'elemento '{0}' non è uguale al relativo valore fisso.
ja: '{0}' 要素の値はその固定値と同等ではありません。
ko: '{0}' 요소의 값이 해당 요소의 고정 값과 같지 않습니다.
pl: Wartość elementu „{0}” nie jest równa jego ustalonej wartości.
pt_br: O valor do elemento '{0}' não é igual ao seu valor fixo.
ru: Значение элемента "{0}" не равно его фиксированному значению.
tr: '{0}' öğesinin değeri sabit değerine eşit değil.
zh_hans: “{0}”元素的值不等于其固定值。
zh_hant: '{0}' 元素的值不等於其固定的值。

# Sch_FixedInRef
source: The fixed value constraint on the '{0}' attribute reference must match the fixed value constraint on the declaration.
cs: Omezení pevné hodnoty v rámci odkazu na atribut {0} musí odpovídat omezení pevné hodnoty použitému v deklaraci.
de: Die Einschränkung des festen Werts im Attributverweis "{0}" muss mit der Einschränkung des festen Werts in der Deklaration übereinstimmen.
es: La restricción de valor fija de la referencia de atributo "{0}" debe coincidir con la restricción de valor fija de la declaración.
fr: La contrainte de valeur fixe de la référence d'attribut '{0}' doit correspondre à la contrainte de valeur fixe de la déclaration.
it: Il vincolo di valore fisso nel riferimento all'attributo '{0}' deve corrispondere al vincolo di valore fisso nella dichiarazione.
ja: '{0}' 属性参照の固定値の制約は、宣言の固定値の制約と一致しなければなりません。
ko: '{0}' 특성 참조의 고정 값 제약 조건은 선언의 고정 값 제약 조건과 일치해야 합니다.
pl: Ograniczenie dla wartości ustalonej występujące w odwołaniu do atrybutu „{0}” musi być zgodne z ograniczeniem dla wartości ustalonej występującym w deklaracji.
pt_br: A restrição de valor fixo na referência de atributo '{0}' deve corresponder à restrição de valor fixo na declaração.
ru: Ограничение на фиксированное значение для ссылки на атрибут "{0}" должно соответствовать ограничению на фиксированное значение в объявлении.
tr: '{0}' öznitelik başvurusundaki sabit değer kısıtlamasının bildirimdeki sabit değer kısıtlamasıyla aynı olması gerekir.
zh_hans: “{0}”特性引用上的固定值约束必须与声明上的固定值约束匹配。
zh_hant: '{0}' 屬性參考上的固定值條件約束，必須與宣告上的固定值條件約束相符。

# Sch_ForbiddenAttribute
source: The '{0}' attribute cannot be present.
cs: Atribut {0} nelze použít.
de: Das {0}-Attribut darf nicht vorhanden sein.
es: El atributo "{0}" no puede estar presente.
fr: L'attribut '{0}' ne peut pas être présent.
it: L'attributo '{0}' non può essere presente.
ja: '{0}' 属性を設定することはできません。
ko: '{0}' 특성을 지정할 수 없습니다.
pl: Atrybut „{0}” nie może być obecny.
pt_br: O atributo '{0}' não pode estar presente.
ru: Атрибут "{0}" не может быть указан.
tr: '{0}' özniteliği bulunamaz.
zh_hans: “{0}”特性不能存在。
zh_hant: 不可出現 '{0}' 屬性。

# Sch_ForbiddenDerivedParticleForAll
source: 'Choice' or 'any' is forbidden as derived particle when the base particle is 'all'.
cs: V případě, že základní částice je all, hodnota choice nebo any je jako odvozená částice zakázána.
de: "Choice" oder "any" sind als abgeleitetes Partikel unzulässig, wenn das Basispartikel "all" ist.
es: No se puede utilizar "Choice" o "any" como partícula derivada cuando la partícula base es "all".
fr: La particule dérivée 'choice' ou 'any' est interdite quand la particule de base est 'all'.
it: Quando la particella di base è 'all', non è consentito usare 'choice' o 'any' come particelle derivate.
ja: 基本型のパーティクルが 'all' の場合は、派生型のパーティクルに 'Choice' と 'any' を使用することはできません。
ko: 기본 파티클이 'all'이면 'Choice' 또는 'any'를 파생 파티클로 사용할 수 없습니다.
pl: Jeśli cząstką podstawową jest element „all”, nie można używać elementów „Choice” i „any” jako cząstek pochodnych.
pt_br: 'Choice' ou 'any' é proibido como partícula derivada quando a partícula base é 'all'.
ru: Элементы choice или any недопустимы в качестве производной части, если базовая часть — all.
tr: Temel parçacık 'all' olduğunda, türetilen parçacık olarak 'Choice' veya 'any' kullanımına izin verilmez.
zh_hans: 基本粒子为 "all" 时，"choice" 或 "any" 不能用作派生粒子。
zh_hant: 當基底物件為 'all' 時，'Choice' 或 'any' 不可作為衍生物件。

# Sch_ForbiddenDerivedParticleForChoice
source: 'All' or 'any' is forbidden as derived particle when the base particle is 'choice'.
cs: Je-li základní částice choice, hodnota all nebo any je jako odvozená částice zakázána.
de: "All" oder "any" sind als abgeleitetes Partikel unzulässig, wenn das Basispartikel "choice" ist.
es: No se puede utilizar "All" o "any" como partícula derivada cuando la partícula base es "choice".
fr: La particule dérivée 'all' ou 'any' est interdite quand la particule de base est 'choice'.
it: Quando la particella di base è 'choice' non è consentito usare 'all' o 'any' come particelle derivate.
ja: 基本型のパーティクルが 'choice' の場合は、派生型のパーティクルに 'All' と 'any' を使用することはできません。
ko: 기본 파티클이 'choice'이면 'All' 또는 'any'를 파생 파티클로 사용할 수 없습니다.
pl: Jeśli cząstką podstawową jest element „choice”, nie można używać elementów „all” ani „any” jako cząstek pochodnych.
pt_br: 'All' ou 'any' é proibido como partícula derivada quando a partícula base é 'choice'.
ru: Элементы all или any недопустимы в качестве производной части, если базовая часть — choice.
tr: Temel parçacık 'choice' olduğunda, türetilen parçacık olarak 'All' veya 'any' kullanımına izin verilmez.
zh_hans: 基本粒子为 "choice" 时，"all" 或 "any" 不能用作派生粒子。
zh_hant: 當基底物件是 'choice' 時，'All' 或 'any' 不可為衍生物件。

# Sch_ForbiddenDerivedParticleForElem
source: Only 'element' is valid as derived particle when the base particle is 'element'.
cs: V případě, že základní částice je element, je jako odvozená částice povolena pouze možnost element.
de: Nur "element" ist als abgeleitetes Partikel gültig, wenn das Basispartikel "element" ist.
es: Solo "element" es válido como partícula derivada cuando la partícula base es "element".
fr: Seule la particule dérivée 'element' est valide quand la particule de base est 'element'.
it: Quando la particella di base è 'element', l'unica particella derivata valida è 'element'.
ja: 基本型のパーティクルが 'element' の場合、派生型のパーティクルに使用できるのは 'element' のみです。
ko: 기본 파티클이 'element'이면 'element'만 파생 파티클로 유효합니다.
pl: Jeśli cząstką podstawową jest element „element”, jako cząstki pochodnej można używać tylko elementu „element”.
pt_br: Apenas 'element' é válido como partícula derivada quando a partícula base é 'element'.
ru: Только element может быть производной частью, если базовая часть — element.
tr: Temel parçacık 'element' olduğunda, türetilen parçacık olarak yalnızca 'element' geçerlidir.
zh_hans: 基本粒子为 "element" 时，只有 "element" 可作为有效的派生粒子。
zh_hant: 當基底物件是 'element' 時，只有 'element' 可作為衍生物件。

# Sch_ForbiddenDerivedParticleForSeq
source: 'All', 'any', and 'choice' are forbidden as derived particles when the base particle is 'sequence'.
cs: Je-li základní částice sequence, hodnota all, any a choice je jako odvozená částice zakázána.
de: "All", "any" und "choice" sind als abgeleitete Partikel unzulässig, wenn das Basispartikel "sequence" ist.
es: No se pueden utilizar "All", "any" y "choice" como partículas derivadas cuando la partícula base es "sequence".
fr: Les particules dérivées 'all', 'any' et 'choice' sont interdites quand la particule de base est 'sequence'.
it: Quando la particella di base è 'sequence', non è consentito usare 'all', 'any' o 'choice' particelle derivate.
ja: 基本型のパーティクルが 'sequence' の場合は、派生型のパーティクルに 'All'、'any' および 'choice' を使用することはできません。
ko: 기본 파티클이 'sequence'이면 'All', 'any' 또는 'choice'를 파생 파티클로 사용할 수 없습니다.
pl: Jeśli cząstką podstawową jest element „sequence”, jako cząstek pochodnych nie można używać elementów „all”, „any” i „choice”.
pt_br: 'All', 'any' e 'choice' são proibidos como partículas derivadas quando a partícula base é 'sequence'.
ru: Элементы all, any и choice недопустимы в качестве производной части, если базовая часть — sequence.
tr: Temel parçacık 'sequence' olduğunda, türetilen parçacık olarak 'All', 'any' ve 'choice' kullanımına izin verilmez.
zh_hans: 基本粒子为 "sequence" 时，"all"、"any" 和 "choice" 不能用作派生粒子。
zh_hant: 當基底物件是 'sequence' 時，禁止 'All'、'any' 以及 'choice' 作為衍生物件。

# Sch_FractionDigitsConstraintFailed
source: The FractionDigits constraint failed.
cs: Omezení FractionDigits nebylo úspěšné.
de: Fehler bei der FractionDigits-Einschränkung.
es: Error en la restricción FractionDigits.
fr: Échec de la contrainte FractionDigits.
it: Il vincolo FractionDigits non è riuscito.
ja: FractionDigits 制約が失敗しました。
ko: FractionDigits 제약 조건이 실패했습니다.
pl: Błąd ograniczenia FractionDigits.
pt_br: Falha na restrição FractionDigits.
ru: Сбой ограничения FractionDigits.
tr: FractionDigits kısıtlaması başarısız oldu.
zh_hans: FractionDigits 约束失败。
zh_hant: FractionDigits 條件約束失敗。

# Sch_FractionDigitsFacetInvalid
source: The FractionDigits constraining facet is invalid - {0}
cs: Omezující vlastnost FractionDigits je neplatná – {0}
de: Ungültiges FractionDigits-Einschränkungsfacet: {0}
es: La faceta de restricción de FractionDigits no es válida - {0}
fr: La facette de contrainte FractionDigits est non valide : {0}
it: Il facet vincolante FractionDigits non è valido - {0}
ja: FractionDigits 制約ファセットが無効です。{0}
ko: FractionDigits 제약 패싯이 잘못되었습니다. {0}
pl: Element FractionDigits ograniczający aspekt jest nieprawidłowy — {0}.
pt_br: A faceta de restrições FractionDigits é inválida – {0}
ru: Недопустимый ограничивающий аспект FractionDigits — {0}
tr: FractionDigits kısıtlama modeli geçersiz - {0}
zh_hans: FractionDigits 约束方面无效 - {0}
zh_hant: FractionDigits 條件約束 Facet 無效 - {0}

# Sch_FractionDigitsFacetProhibited
source: The FractionDigits constraining facet is prohibited for '{0}'.
cs: Omezující vlastnost FractionDigits je pro element {0} zakázána.
de: Das FractionDigits-Einschränkungsfacet ist unzulässig für "{0}".
es: Faceta de restricción de FractionDigits prohibida para "{0}".
fr: La facette de contrainte FractionDigits est interdite pour '{0}'.
it: Il facet vincolante FractionDigits non è consentito per '{0}'.
ja: FractionDigits 制約ファセットは '{0}' に使用できません。
ko: FractionDigits 제약 패싯을 '{0}'에 사용할 수 없습니다.
pl: Element FractionDigits ograniczający aspekt jest zabroniony dla „{0}”.
pt_br: A faceta de restrições FractionDigits é proibida para '{0}'.
ru: Ограничивающий аспект FractionDigits запрещен для "{0}".
tr: '{0}' için FractionDigits kısıtlama modeli kullanılamaz.
zh_hans: FractionDigits 约束方面对“{0}”是禁止的。
zh_hant: '{0}' 禁止使用 FractionDigits 條件約束 Facet。

# Sch_FractionDigitsGtTotalDigits
source: FractionDigits is greater than TotalDigits.
cs: Hodnota FractionDigits je větší než hodnota TotalDigits.
de: FractionDigits ist größer als TotalDigits.
es: FractionDigits es mayor que TotalDigits.
fr: FractionDigits est supérieur à TotalDigits.
it: Il valore di FractionDigits è maggiore di quello di TotalDigits.
ja: FractionDigits は TotalDigits より大きい値です。
ko: FractionDigits가 TotalDigits보다 큽니다.
pl: Element FractionDigits jest większy niż element TotalDigits.
pt_br: FractionDigits é maior do que TotalDigits.
ru: Значение FractionDigits больше значения TotalDigits.
tr: FractionDigits, TotalDigits'den büyük.
zh_hans: FractionDigits 大于 TotalDigits。
zh_hant: FractionDigits 大於 TotalDigits。

# Sch_FractionDigitsNotOnDecimal
source: FractionDigits should be equal to 0 on types other then decimal.
cs: Atribut FractionDigits by měl být u jiných než desítkových typů roven 0.
de: FractionDigits muss für Typen, die nicht dezimal sind, 0 sein.
es: FractionDigits debe ser igual a 0 en tipos que no sean decimales.
fr: FractionDigits doit être égal à 0 avec des types autres que décimaux.
it: Per i tipi diversi da decimal, il valore di FractionDigits deve essere uguale a 0.
ja: FractionDigits は、decimal 以外の型では 0 でなければなりません。
ko: 10진수 이외의 형식에서 FractionDigits는 0과 같아야 합니다.
pl: Element FractionDigits powinien być równy 0 dla typów innych niż typ decimal.
pt_br: FractionDigits deve ser igual a 0 em tipos diferentes de decimal.
ru: Для всех типов, кроме типов десятичных чисел, аспект FractionDigits должен быть равен 0.
tr: FractionDigits, ondalık dışındaki türler için 0 olmalıdır.
zh_hans: 对于 decimal 以外的类型，FractionDigits 应等于 0。
zh_hant: 除了十進位外，類型上的 FractionDigits 應等於 0。

# Sch_GroupBaseFromAny1
source: Every member of the derived group particle must be a valid restriction of the base wildcard, NSRecurseCheckCardinality Rule 1.
cs: Každý člen částice odvozené skupiny musí představovat platné omezení základního zástupného znaku, NSRecurseCheckCardinality Rule 1.
de: Jeder Member des abgeleiteten Gruppenpartikels muss eine gültige Einschränkung des Basisplatzhalters sein, NSRecurseCheckCardinality-Regel 1.
es: Todos los miembros de la partícula de grupo derivada deben ser una restricción válida del comodín base, NSRecurseCheckCardinality Rule 1.
fr: Tous les membres de la particule de groupe dérivée doivent constituer une restriction valide du caractère générique de base, NSRecurseCheckCardinality Rule 1.
it: Ogni membro della particella del gruppo derivato deve essere una restrizione valida del carattere jolly di base (regola 1 di NSRecurseCheckCardinality).
ja: 派生型のグループ パーティクルのメンバーはすべて、基本型のワイルドカードの有効な制限である必要があります (NSRecurseCheckCardinality 規則 1)。
ko: 파생 그룹 파티클의 모든 멤버는 기본 와일드카드 NSRecurseCheckCardinality Rule 1의 유효한 제한이어야 합니다.
pl: Każda składowa pochodnej cząstki grupy musi być prawidłowym ograniczeniem podstawowego symbolu wieloznacznego (NSRecurseCheckCardinality: reguła 1).
pt_br: Todos os membros da partícula de grupo derivada devem ser uma restrição válida do curinga base, NSRecurseCheckCardinality Rule 1.
ru: Каждый член производной части группы должен быть действительным ограничением базового подстановочного знака, NSRecurseCheckCardinality Rule 1.
tr: Türetilen grup parçacığının her üyesi temel joker parçacığın geçerli bir kısıtlaması olmalı, NSRecurseCheckCardinality Kural 1.
zh_hans: 根据 NSRecurseCheckCardinality 规则 1，派生组粒子中的每一个成员都必须是基本通配符的有效限制。
zh_hant: 衍生群組物件的每個成員，都必須是基底萬用字元的有效限制，NSRecurseCheckCardinality Rule 1。

# Sch_GroupBaseFromAny2
source: The derived particle's occurrence range at ({0}, {1}) is not a valid restriction of the base wildcard's occurrence range at ({2}, {3}), NSRecurseCheckCardinality Rule 2.
cs: Rozsah výskytů odvozené částice na pozici ({0}, {1}) není platné omezení základního rozsahu výskytů zástupného znaku na pozici ({2}, {3}), NSRecurseCheckCardinality Rule 2.
de: Der Vorkommensbereich des abgeleiteten Partikels bei ({0},{1}) ist keine gültige Einschränkung für den Vorkommensbereich des Basisplatzhalters bei ({2}, {3}), NSRecurseCheckCardinality-Regel 2.
es: El intervalo de aparición de la partícula derivada en ({0}, {1}) no es una restricción válida del intervalo de aparición del comodín base en ({2}, {3}), regla 2 de NSRecurseCheckCardinality.
fr: La plage d'occurrences de la particule dérivée sur ({0}, {1}) n'est pas une restriction valide de la plage d'occurrences du caractère générique de base sur ({2}, {3}), NSRecurseCheckCardinality Rule 2.
it: L'intervallo di occorrenza della particella derivata alla posizione ({0},{1}) non è una restrizione valida dell'intervallo di occorrenza del carattere jolly di base alla posizione ({2}, {3}) (regola 2 di NSRecurseCheckCardinality).
ja: 派生型のパーティクルの出現範囲 ({0}, {1}) は、基本型のワイルドカードの出現範囲 ({2}, {3}) の有効な制限ではありません (NSRecurseCheckCardinality 規則 2)。
ko: ({0}, {1})에서 파생 파티클의 발생 범위는 ({2}, {3})에서 기본 와일드카드의 발생 범위인 NSRecurseCheckCardinality Rule 2의 유효한 제한이 아닙니다.
pl: Zakres wystąpień cząstki pochodnej w lokalizacji ({0}, {1}) nie jest prawidłowym ograniczeniem zakresu wystąpień podstawowego symbolu wieloznacznego w lokalizacji ({2}, {3}) (NSRecurseCheckCardinality: reguła 2).
pt_br: O intervalo de ocorrência da partícula derivada em ({0}, {1}) não é uma restrição válida do intervalo de ocorrência do curinga base em ({2}, {3}), NSRecurseCheckCardinality Rule 2.
ru: Диапазон вхождения производной части в ({0}, {1}) не является действительным ограничением для диапазона вхождения базового подстановочного знака в ({2}, {3}), NSRecurseCheckCardinality Rule 2.
tr: Türetilen parçacığın ({0}, {1}) konumundaki yinelenme aralığı, temel joker parçacığın ({2}, {3}) konumundaki yinelenme aralığının geçerli bir kısıtlaması olmalı, NSRecurseCheckCardinality Kural 2.
zh_hans: 根据 NSRecurseCheckCardinality 规则 2，位于({0}, {1})的派生粒子的出现范围不是位于({2}, {3})的基本通配符出现范围的有效限制。
zh_hant: ({0}, {1}) 中的衍生物件發生範圍不是 ({2}, {3}) 中基底萬用字元發生範圍的有效限制，NSRecurseCheckCardinality Rule 2。

# Sch_GroupBaseRestNoMap
source: The derived particle cannot have more members than the base particle - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
cs: Odvozená částice nemůže mít více členů než základní částice – All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
de: Das abgeleitete Partikel darf nicht mehr Member als das Basispartikel aufweisen – All:All,Sequence:Sequence -- Recurse-Regel 2 / Choice:Choice -- RecurseLax.
es: La partícula derivada no puede tener más miembros que la partícula base - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
fr: La particule dérivée ne peut pas comporter plus de membres que la particule de base - All:All,Sequence:Sequence -- Recurse Rule 2/Choice:Choice -- RecurseLax.
it: La particella derivata non può contenere più membri della particella di base (regola 2 di All:All,Sequence:Sequence -- Recurse/Choice:Choice -- RecurseLax).
ja: 派生型のパーティクルは、基本型のパーティクルよりも多くのメンバーを持つことはできません。All:All,Sequence:Sequence -- Recurse 規則 2 または Choice:Choice -- RecurseLax
ko: 파생 파티클에는 기본 파티클 All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax보다 더 많은 멤버를 지정할 수 없습니다.
pl: Cząstka pochodna nie może mieć więcej składowych niż cząstka podstawowa (All:All,Sequence:Sequence — Recurse: reguła 2/Choice:Choice — RecurseLax).
pt_br: A partícula derivada não pode ter mais membros que a partícula base – All:All,Sequence:Sequence – Recurse Rule 2/Choice:Choice -- RecurseLax.
ru: Производная часть не может иметь больше членов, чем базовая часть — All:All,Sequence:Sequence — Recurse Rule 2/Choice:Choice — RecurseLax.
tr: Türetilen parçacığın temel parçacıktan daha fazla üyesi olamaz - All:All,Sequence:Sequence -- Recurse Kural 2 / Choice:Choice -- RecurseLax.
zh_hans: 根据 All:All,Sequence:Sequence -- Recurse 规则 2 / Choice:Choice -- RecurseLax，派生粒子不能比基本粒子拥有更多的成员数。
zh_hant: 衍生物件不可擁有比基底物件更多的成員 - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice – RecurseLax。
