Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlXmlnsInvalidType
source: Cannot use XmlNamespaceDeclarations attribute on member '{0}' of type {1}. This attribute is only valid on members of type {2}.
cs: Atribut XmlNamespaceDeclarations nelze použít pro člen {0} typu {1}. Tento atribut je platný pouze pro členy typu {2}.
de: Das XmlNamespaceDeclarations-Attribut kann nicht für den Member "{0}" vom Typ {1} verwendet werden. Das Attribut ist nur für Member vom Typ "{2}" gültig.
es: No se puede utilizar el atributo XmlNamespaceDeclarations en el miembro "{0}" de tipo {1}. Este atributo solo es válido en miembros de tipo {2}.
fr: Impossible d'utiliser l'attribut XmlNamespaceDeclarations sur le membre '{0}' de type {1}. Cet attribut est uniquement valide sur les membres de type {2}.
it: Non è possibile usare l'attributo XmlNamespaceDeclarations sul membro '{0}' di tipo {1}. L'attributo è valido solo per i membri di tipo {2}.
ja: XmlNamespaceDeclarations 属性を型 {1} のメンバー '{0}' に使用できません。この属性は {2} のメンバーに対してのみ有効です。
ko: {1} 형식의 '{0}' 멤버에는 XmlNamespaceDeclarations 특성을 사용할 수 없습니다. 이 특성은 {2} 형식의 멤버에만 사용할 수 있습니다.
pl: Nie można użyć atrybutu XmlNamespaceDeclarations na składowej „{0}” typu {1}. Ten atrybut jest prawidłowy tylko na składowych typu {2}.
pt_br: Não é possível usar o atributo XmlNamespaceDeclarations no membro '{0}' do tipo {1}. Esse atributo só é válido em membros do tipo {2}.
ru: Атрибут XmlNamespaceDeclarations не может быть использован для члена "{0}" типа {1}. Этот атрибут действителен только для членов с типом {2}.
tr: XmlNamespaceDeclarations özniteliği {1} türü '{0}' üyesinde kullanılamaz. Bu öznitelik yalnızca {2} türü üyeler için geçerlidir.
zh_hans: 无法对类型 {1} 的成员“{0}”使用 XmlNamespaceDeclarations 特性。该特性仅对类型 {2} 的成员有效。
zh_hant: 無法對類型 {1} 的成員 '{0}' 使用 XmlNamespaceDeclarations 屬性。此屬性只對類型 {2} 的成員有效。

# Xml_AsyncIsRunningException
source: An asynchronous operation is already in progress.
cs: Již probíhá jiná asynchronní operace.
de: Es wird bereits ein asynchroner Vorgang ausgeführt.
es: Ya hay una operación asincrónica en curso.
fr: Une opération asynchrone est déjà en cours.
it: Un'operazione asincrona è già in corso.
ja: 非同期操作は既に実行されています。
ko: 비동기 작업이 이미 진행 중입니다.
pl: Trwa już operacja asynchroniczna.
pt_br: Uma operação assíncrona já está em andamento.
ru: Асинхронная операция уже выполняется.
tr: Asenkron bir işlem zaten devam ediyor.
zh_hans: 异步操作已在进行中。
zh_hant: 非同步作業已在進行中。

# Xml_AttlistDuplEnumValue
source: '{0}' is a duplicate enumeration value.
cs: {0} je duplicitní hodnota výčtu.
de: "{0}" ist ein doppelter Enumerationswert.
es: "{0}" es un valor de enumeración duplicado.
fr: '{0}' est une valeur d'énumération dupliquée.
it: '{0}' è un valore di enumerazione duplicato.
ja: '{0}' は重複している列挙値です。
ko: '{0}'은(는) 중복 열거형 값입니다.
pl: Element „{0}” jest zduplikowaną wartością wyliczenia.
pt_br: '{0}' é um valor de enumeração duplicado.
ru: "{0}" является повторяющимся значением перечисления.
tr: '{0}' yinelenen bir sabit listesi değeri.
zh_hans: “{0}”是重复的枚举值。
zh_hant: '{0}' 是重複的列舉值。

# Xml_AttlistDuplNotationValue
source: '{0}' is a duplicate notation value.
cs: {0} je duplicitní hodnota notace.
de: "{0}" ist ein doppelter Notationswert.
es: "{0}" es un valor de notación duplicado.
fr: '{0}' est une valeur de notation dupliquée.
it: '{0}' è un valore di notazione duplicato.
ja: '{0}' は重複している表記値です。
ko: '{0}'은(는) 중복 표기법 값입니다.
pl: Element „{0}” jest zduplikowaną wartością notacji.
pt_br: '{0}' é um valor de notação duplicado.
ru: "{0}" является повторяющимся значением нотации.
tr: '{0}' yinelenen bir bildirim değeri.
zh_hans: “{0}”是重复的符号值。
zh_hant: '{0}' 是重複的標記法值。

# Xml_BadAttributeChar
source: '{0}', hexadecimal value {1}, is an invalid attribute character.
cs: Znak {0} (šestnáctková hodnota {1}) je neplatný znak atributu.
de: "{0}", Hexadezimalwert {1}, ist ein ungültiges Attributzeichen.
es: "{0}", valor hexadecimal {1}, es un carácter de atributo no válido.
fr: '{0}', la valeur hexadécimale {1}, est un caractère d'attribut non valide.
it: '{0}' con valore esadecimale {1} è un carattere di attributo non valido.
ja: '{0}' (16 進数値 {1}) は無効な属性文字です。
ko: '{0}', 16진수 값 {1}은(는) 잘못된 특성 문자입니다.
pl: Element „{0}”, wartość szesnastkowa {1}, jest nieprawidłowym znakiem atrybutu.
pt_br: '{0}', o valor hexadecimal {1}, é um caractere de atributo inválido.
ru: "{0}", шестнадцатеричное значение {1}, является недопустимым для атрибута символом.
tr: '{0}' (onaltılık değeri {1}), geçersiz bir öznitelik karakteri.
zh_hans: “{0}”(十六进制值 {1})是无效的特性字符。
zh_hant: 十六進位值為 {1} 的 '{0}' 是無效的屬性字元。

# Xml_BadDTDLocation
source: Unexpected DTD declaration.
cs: Neočekávaná deklarace DTD
de: Unerwartete DTD-Deklaration.
es: Declaración DTD inesperada.
fr: Déclaration DTD inattendue.
it: Dichiarazione DTD imprevista.
ja: 予期しない DTD 宣言です。
ko: 예기치 않은 DTD 선언입니다.
pl: Nieoczekiwana deklaracja DTD.
pt_br: Declaração DTD inesperada.
ru: Непредусмотренное объявление DTD.
tr: Beklenmeyen DTD bildirimi.
zh_hans: 意外的 DTD 声明。
zh_hant: 未預期的 DTD 宣告。

# Xml_BadDecimalEntity
source: Invalid syntax for a decimal numeric entity reference.
cs: Neplatná syntaxe pro odkaz na desítkovou číselnou entitu
de: Ungültige Syntax für einen dezimalen numerischen Entitätsverweis.
es: Sintaxis no válida para una referencia de entidad numérica decimal.
fr: Syntaxe non valide pour une référence d'entité numérique décimale.
it: La sintassi non è valida per un riferimento a un'entità numerica decimale.
ja: 10 進数のエンティティ参照には無効な構文です。
ko: 10진수 엔터티 참조 구문이 잘못되었습니다.
pl: Nieprawidłowa składnia dla dziesiętnego numerycznego odwołania do jednostki.
pt_br: Sintaxe inválida para uma referência de entidade numérica decimal.
ru: Недопустимый синтаксис ссылки на сущность десятичного числа.
tr: Ondalık sayısal varlık başvurusu için geçersiz sözdizimi.
zh_hans: 十进制数字实体引用的语法无效。
zh_hant: 對十進位數字實體參考而言無效的語法。

# Xml_BadHexEntity
source: Invalid syntax for a hexadecimal numeric entity reference.
cs: Neplatná syntaxe pro odkaz na šestnáctkovou číselnou entitu
de: Ungültige Syntax für einen hexadezimalen numerischen Entitätsverweis.
es: Sintaxis no válida para una referencia de entidad numérica hexadecimal.
fr: Syntaxe non valide pour une référence d'entité numérique hexadécimale.
it: La sintassi non è valida per un riferimento a un'entità numerica esadecimale.
ja: 16 進数のエンティティ参照には無効な構文です。
ko: 16진수 엔터티 참조 구문이 잘못되었습니다.
pl: Nieprawidłowa składnia dla szesnastkowego numerycznego odwołania do jednostki.
pt_br: Sintaxe inválida para uma referência de entidade numérica hexadecimal.
ru: Недопустимый синтаксис ссылки на сущность шестнадцатеричного числа.
tr: Onaltılık sayısal varlık başvurusu için geçersiz sözdizimi.
zh_hans: 十六进制数字实体引用的语法无效。
zh_hant: 對十六進位數字實體參考而言無效的語法。

# Xml_BadNameChar
source: The '{0}' character, hexadecimal value {1}, cannot be included in a name.
cs: Znak {0} (šestnáctková hodnota {1}) nelze použít v názvu.
de: Das "{0}"-Zeichen, Hexadezimalwert {1}, darf nicht in einem Namen enthalten sein.
es: El carácter "{0}", con valor hexadecimal {1}, no puede incluirse en un nombre.
fr: Le caractère '{0}', valeur hexadécimale {1}, ne peut pas être inclus dans un nom.
it: Non è possibile includere in un nome il carattere '{0}' con valore esadecimale {1}.
ja: '{0}' 文字、16 進数値 {1} を名前に含むことはできません。
ko: '{0}' 문자, 16진수 값 {1}을(를) 이름에 포함할 수 없습니다.
pl: Znak „{0}” o wartości szesnastkowej {1} nie może wchodzić w skład nazwy.
pt_br: O caractere '{0}', valor hexadecimal {1}, não pode ser incluído em um nome.
ru: Символ "{0}", шестнадцатеричное значение {1}, не может использоваться в именах.
tr: '{0}' karakteri (onaltılık değeri {1}) ada eklenemez.
zh_hans: 名称中不能包含“{0}”字符(十六进制值 {1})。
zh_hant: 十六進位值為 {1} 的 '{0}' 字元不可包含在名稱中。

# Xml_BadNameCharWithPos
source: The '{0}' character, hexadecimal value {1}, at position {2} within the name, cannot be included in a name.
cs: Název obsahuje na pozici {2} znak {0} s šestnáctkovou hodnotou {1}. Takový znak však názvy obsahovat nesmí.
de: Das "{0}"-Zeichen, Hexadezimalwert {1}, an Position {2} im Namen darf nicht in einem Namen enthalten sein.
es: El carácter "{0}", valor hexadecimal {1}, en la posición {2} dentro del nombre, no puede incluirse en un nombre.
fr: Le caractère '{0}', valeur hexadécimale {1}, à l'emplacement {2} du nom ne peut pas être inclus dans un nom.
it: Non è possibile includere in un nome il carattere '{0}' con valore esadecimale {1} alla posizione {2} all'interno del nome.
ja: 名前の {2} にある '{0}' 文字、16 進数値 {1} は、名前には使用できない値です。
ko: 이름 내의 위치 {2}에 있는 '{0}' 문자, 16진수 값 {1}은(는) 이름에 포함할 수 없습니다.
pl: W nazwie nie można uwzględnić znaku „{0}” (wartości szesnastkowej {1}), która znajduje się na pozycji {2}.
pt_br: O caractere '{0}', valor hexadecimal {1}, na posição {2} no nome, não pode ser incluído em um nome.
ru: Символ "{0}", шестнадцатеричное значение {1}, в позиции {2} внутри имени, не может использоваться в именах.
tr: Ad içinde {2} konumundaki '{0}' karakteri, {1} onaltılık değeri ada eklenemez.
zh_hans: 名称内位于 {2} 的“{0}”字符、十六进制值 {1} 不能包含在名称中。
zh_hant: 名稱中位置 {2} 處的十六進位值為 {1} 之 '{0}' 字元，不可包含在名稱中。

# Xml_BadNamespaceDecl
source: Invalid namespace declaration.
cs: Neplatná deklarace oboru názvů
de: Ungültige Namespacedeklaration.
es: Declaración de espacio de nombres no válida.
fr: Déclaration d'espace de noms non valide.
it: La dichiarazione di spazio dei nomi non è valida.
ja: 名前空間宣言が無効です。
ko: 네임스페이스 선언이 잘못되었습니다.
pl: Nieprawidłowa deklaracja przestrzeni nazw.
pt_br: Declaração de namespace inválida.
ru: Недопустимое объявление пространства имен.
tr: Ad alanı bildirimi geçersiz.
zh_hans: 无效的命名空间声明。
zh_hant: 命名空間宣告無效。

# Xml_BadStartNameChar
source: Name cannot begin with the '{0}' character, hexadecimal value {1}.
cs: Znak {0} (šestnáctková hodnota {1}) nelze použít jako první znak názvu.
de: Ein Name darf nicht mit dem Zeichen "{0}", Hexadezimalwert {1}, beginnen.
es: Un nombre no puede empezar con el carácter "{0}", valor hexadecimal {1}.
fr: Le caractère '{0}', valeur hexadécimale {1}, ne peut pas commencer un nom.
it: Un nome non può iniziare con il carattere '{0}' con valore esadecimale {1}.
ja: 名前の先頭に '{0}' (16 進数値 {1}) を使用することはできません。
ko: 이름은 '{0}' 문자, 16진수 값 {1}(으)로 시작할 수 없습니다.
pl: Nazwa nie może rozpoczynać się od znaku „{0}” ani wartości szesnastkowej {1}.
pt_br: Um nome não pode ser iniciado pelo caractere '{0}', valor hexadecimal {1}.
ru: Символ "{0}", шестнадцатеричное значение {1}, не может стоять в начале имени.
tr: Ad, onaltılık değeri {1} olan '{0}' karakteriyle başlayamaz.
zh_hans: 名称不能以“{0}”字符(十六进制值 {1})开头。
zh_hant: 名稱不可用 '{0}' 字元、十六進位值 {1} 作為開頭。

# Xml_CDATAEndInText
source: ']]>' is not allowed in character data.
cs: Znak ]]> není povolen ve znakových datech.
de: "]]>" ist in Zeichendaten nicht zulässig.
es: "]]>" no se permite en los datos de caracteres.
fr: ']]>' n'est pas autorisé dans les données caractères.
it: ']]>' non è consentito nei dati di tipo carattere.
ja: ']]>' は文字データでは使用できません。
ko: ']]>'는 문자 데이터에서 사용할 수 없습니다.
pl: Nie można używać znaków „]]>” w obrębie danych znakowych.
pt_br: ']]>' não é permitido em dados de caractere.
ru: "]]>" не допускается в символьных данных.
tr: Karakter verisinde ']]>' kullanılamaz.
zh_hans: 字符数据中不允许出现“]]>”。
zh_hant: 字元資料中不允許 ']]>'。

# Xml_CanNotBindToReservedNamespace
source: Cannot bind to the reserved namespace.
cs: Nelze vytvořit vazbu k vyhrazenému oboru názvů.
de: Die Bindung an den reservierten Namespace ist nicht möglich.
es: No se puede enlazar con un espacio de nombres reservado.
fr: Impossible d'effectuer une liaison avec l'espace de noms réservé.
it: Non è possibile eseguire il binding allo spazio dei nomi riservato.
ja: 予約された名前空間に連結できません。
ko: 예약된 네임스페이스에 바인딩할 수 없습니다.
pl: Nie można powiązać z zarezerwowaną przestrzenią nazw.
pt_br: Não é possível associar ao namespace reservado.
ru: Невозможно выполнить привязку к зарезервированному пространству имен.
tr: Ayrılmış ad alanına bağlanamaz.
zh_hans: 不能绑定到保留的命名空间。
zh_hant: 無法繫結至保留的命名空間。

# Xml_CannotResolveEntity
source: Cannot resolve entity reference '{0}'.
cs: Nelze přeložit odkaz na entitu {0}.
de: Der Entitätsverweis "{0}" kann nicht aufgelöst werden.
es: No se puede resolver la referencia de entidad "{0}".
fr: Impossible de résoudre la référence d'entité '{0}'.
it: Non è possibile risolvere il riferimento '{0}' all'entità.
ja: エンティティ参照 '{0}' を解決できません。
ko: 엔터티 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać odwołania do jednostki „{0}”.
pt_br: Não é possível resolver a referência de entidade '{0}'.
ru: Не удается разрешить ссылку на сущность "{0}".
tr: '{0}' varlık başvurusu çözümlenemiyor.
zh_hans: 无法解析实体引用“{0}”。
zh_hant: 無法解析實體參考 '{0}'。

# Xml_CannotResolveEntityDtdIgnored
source: Cannot resolve entity reference '{0}' because the DTD has been ignored. To enable DTD processing set the DtdProcessing property on XmlReaderSettings to Parse and pass the settings into XmlReader.Create method.
cs: Nelze přeložit odkaz na entitu {0}, protože DTD bylo ignorováno. Chcete-li povolit zpracování deklarace DTD, nastavte vlastnost DtdProcessing u třídy XmlReaderSettings na hodnotu Parse a nastavení předejte metodě XmlReader.Create.
de: Der Entitätsverweis "{0}" kann nicht aufgelöst werden, da DTD ignoriert wurde. Zum Aktivieren der DTD-Verarbeitung müssen Sie die DtdProcessing-Eigenschaft für XmlReaderSettings auf "Parse" festlegen und die Einstellungen an die XmlReader.Create-Methode übergeben.
es: No se puede resolver la referencia de entidad "{0}" porque se ha omitido la DTD. Para habilitar el procesamiento de la DTD, establezca la propiedad DtdProcessing de XmlReaderSettings en Parse y pase la configuración al método XmlReader.Create.
fr: Impossible de résoudre la référence d'entité '{0}', car le DTD a été ignoré. Pour activer le traitement DTD, affectez à la propriété DtdProcessing de XmlReaderSettings la valeur Parse et passez les paramètres à la méthode XmlReader.Create.
it: Non è possibile risolvere il riferimento '{0}' all'entità. La DTD è stata ignorata. Per abilitare l'elaborazione DTD, impostare la proprietà DtdProcessing in XmlReaderSettings su Parse e passare le impostazioni nel metodo XmlReader.Create.
ja: DTD が無視されたため、エンティティ参照 '{0}' を解決できません。DTD 処理を有効にするには、XmlReaderSettings の DtdProcessing プロパティを Parse に設定し、XmlReader.Create メソッドにその設定を渡してください。
ko: DTD가 무시되었으므로 엔터티 참조 '{0}'을(를) 확인할 수 없습니다. DTD 처리를 사용하려면 XmlReaderSettings의 DtdProcessing 속성을 Parse로 설정하고 이 설정을 XmlReader.Create 메서드로 전달하세요.
pl: Nie można rozpoznać odwołania do jednostki „{0}”, ponieważ element DTD został zignorowany. Aby umożliwić przetwarzanie elementu DTD, w elemencie XmlReaderSettings dla właściwości DtdProcessing ustaw wartość Parse, a następnie przekaż tę wartość do metody XmlReader.Create.
pt_br: Não é possível resolver a referência de entidade '{0}' porque o DTD foi ignorado. Para habilitar o processamento do DTD, defina a propriedade DtdProcessing em XmlReaderSettings como Parse e passe as configurações para o método XmlReader.Create.
ru: Не удается разрешить ссылку на сущность "{0}", поскольку обработка DTD пропущена. Чтобы включить обработку DTD, установите свойство DtdProcessing в разделе XmlReaderSettings в значение Parse и передайте методу XmlReader.Create.
tr: DTD yoksayıldığından '{0}' varlık başvurusu çözümlenemiyor. DTD işlemeyi etkinleştirmek için, XmlReaderSettings üzerinde DtdProcessing özelliğini Parse değerine ayarlayın ve ayarı XmlReader.Create metoduna geçirin.
zh_hans: 无法解析实体引用“{0}”，因为已忽略 DTD。若要启用 DTD 处理，请将 XmlReaderSettings 上的 DtdProcessing 属性设置为 Parse，并将设置传递到 XmlReader.Create 方法中。
zh_hant: 因為已略過 DTD，所以無法解析實體參考 '{0}'。若要啟用 DTD 程序，請將 XmlReaderSettings 上的 DtdProcessing 屬性設定為 [剖析]，並將設定傳遞至 XmlReader.Create 方法。

# Xml_CannotResolveExternalSubset
source: Cannot resolve external DTD subset - public ID = '{0}', system ID = '{1}'.
cs: Nelze rozpoznat externí podmnožinu DTD – veřejné ID = {0}, systémové ID = {1}
de: Die externe DTD-Teilmenge kann nicht aufgelöst werden – öffentliche ID = "{0}", System-ID = "{1}".
es: No se puede resolver el subconjunto DTD externo - id. público = "{0}", id del sistema = "{1}".
fr: Impossible de résoudre le sous-ensemble DTD externe - ID public = '{0}', ID système = '{1}'.
it: Non è possibile risolvere il sottoinsieme DTD esterno - ID pubblico = '{0}', ID sistema = '{1}'.
ja: 外部 DTD サブセットを解決できません。パブリック ID = '{0}'、システム ID = '{1}'。
ko: 외부 DTD 하위 집합을 확인할 수 없습니다. 공용 ID = '{0}', 시스템 ID = '{1}'.
pl: Nie można rozpoznać zewnętrznego podzestawu DTD: identyfikator publiczny = „{0}”, identyfikator systemowy = „{1}”.
pt_br: Não é possível resolver subconjunto DTD externo – ID pública = '{0}', ID do sistema = '{1}'.
ru: Не удается разрешить внешнее подмножество DTD, общий идентификатор = "{0}", системный идентификатор = "{1}".
tr: Dış DTD alt kümesi çözümlenemiyor - genel tanımlayıcı = '{0}', sistem tanımlayıcısı = '{1}'.
zh_hans: 无法解析外部 DTD 子集 - public ID = '{0}'，system ID = '{1}'。
zh_hant: 無法解析外部 DTD 子集 - 公用識別碼 = '{0}'，系統識別碼 = '{1}'。

# Xml_CannotResolveUrl
source: Cannot resolve '{0}'.
cs: Nejde přeložit {0}.
de: "{0}" kann nicht aufgelöst werden.
es: No se puede resolver "{0}".
fr: Impossible de résoudre '{0}'.
it: Non è possibile risolvere '{0}'.
ja: '{0}' を解決できません。
ko: '{0}'을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać elementu „{0}”.
pt_br: Não é possível resolver '{0}'.
ru: Невозможно разрешить "{0}".
tr: '{0}' çözümlenemiyor.
zh_hans: 无法解析“{0}”。
zh_hant: 無法解析 '{0}'。

# Xml_CannotStartDocumentOnFragment
source: WriteStartDocument cannot be called on writers created with ConformanceLevel.Fragment.
cs: Metodu WriteStartDocument nelze volat u zapisovačů vytvořených pomocí hodnoty ConformanceLevel.Fragment.
de: WriteStartDocument kann nicht für Writer aufgerufen werden, die mit ConformanceLevel.Fragment erstellt wurden.
es: No se puede llamar a WriteStartDocument en sistemas de escritura creados con ConformanceLevel.Fragment.
fr: WriteStartDocument ne peut pas être appelé sur les writers créés à l'aide de ConformanceLevel.Fragment.
it: Non è possibile chiamare WriteStartDocument su writer creati con ConformanceLevel.Fragment.
ja: WriteStartDocument は、ConformanceLevel.Fragment を設定して作成されたライターでは呼び出せません。
ko: WriteStartDocument는 ConformanceLevel.Fragment로 만든 기록기에서 호출할 수 없습니다.
pl: Nie można wywoływać elementu WriteStartDocument dla elementów służących do zapisywania, które utworzono za pomocą elementu ConformanceLevel.Fragment.
pt_br: WriteStartDocument não pode ser chamado em gravadores criados com ConformanceLevel.Fragment.
ru: WriteStartDocument не может быть вызван для модуля записи, созданного с помощью ConformanceLevel.Fragment.
tr: WriteStartDocument, ConformanceLevel.Fragment ile oluşturulan yazıcılarda çağrılamaz.
zh_hans: 无法在使用 ConformanceLevel.Fragment 创建的编写器上调用 WriteStartDocument。
zh_hant: 無法在以 ConformanceLevel.Fragment 建立的寫入器上呼叫 WriteStartDocument。

# Xml_CannotWriteXmlDecl
source: Cannot write XML declaration. XML declaration can be only at the beginning of the document.
cs: Nelze zapsat deklaraci XML. Deklarace XML může existovat pouze na začátku dokumentu.
de: Die XML-Deklaration kann nicht geschrieben werden. Die XML-Deklaration darf sich nur am Anfang des Dokuments befinden.
es: No se puede escribir la declaración XML. Una declaración XML solo puede aparecer al principio del documento.
fr: Impossible d'écrire la déclaration XML. La déclaration XML peut uniquement se trouver au début du document.
it: Non è possibile scrivere la dichiarazione XML. Questa può trovarsi solo all'inizio del documento.
ja: XML 宣言を書き込めません。XML 宣言はドキュメントの先頭にしか作成できません。
ko: XML 선언을 쓸 수 없습니다. XML은 문서의 시작 부분에서만 선언할 수 있습니다.
pl: Nie można zapisać deklaracji XML. Deklaracja XML może znajdować się tylko na początku dokumentu.
pt_br: Não é possível gravar declaração XML. A declaração XML só pode estar no início do documento.
ru: Не удалось записать объявление XML. Объявление XML может стоять только в начале документа.
tr: XML bildirimi yazılamıyor. XML bildirimi yalnızca belgenin başında olabilir.
zh_hans: 无法写入 XML 声明。XML 声明只能出现在文档的开头。
zh_hant: 無法寫入 XML 宣告。XML 僅可位於文件的開頭。

# Xml_CharEntityOverflow
source: Invalid value of a character entity reference.
cs: Neplatná hodnota reference znakové entity.
de: Ungültiger Wert für einen Zeichenentitätsverweis.
es: Valor no válido de una referencia a una entidad de caracteres.
fr: Valeur de référence d'entité de caractère non valide.
it: Valore non valido di un riferimento a entità carattere.
ja: 文字エンティティ参照の値が無効です。
ko: 문자 엔터티 참조의 값이 잘못되었습니다.
pl: Nieprawidłowa wartość odwołania do jednostki znaku.
pt_br: Valor inválido de uma referência de entidade de caracteres.
ru: Недопустимое значение ссылки на сущность символа.
tr: Geçersiz karakter varlık başvurusu değeri.
zh_hans: 字符实体引用的值无效。
zh_hant: 字元實體參考的值無效。

# Xml_Closed
source: The Writer is closed.
cs: Objekt Writer je uzavřen.
de: Der Writer ist geschlossen.
es: Sistema de escritura cerrado.
fr: Le Writer est fermé.
it: L'elemento Writer è chiuso.
ja: ライターは閉じています。
ko: 기록기가 닫혀 있습니다.
pl: Element Writer jest zamknięty.
pt_br: O Gravador está fechado.
ru: Модуль записи закрыт.
tr: Yazıcı kapalı.
zh_hans: 编写器已关闭。
zh_hant: Writer 已經關閉。

# Xml_ClosedOrError
source: The Writer is closed or in error state.
cs: Objekt Writer je uzavřen nebo v chybovém stavu.
de: Der Writer ist geschlossen oder weist einen Fehlerzustand auf.
es: Sistema de escritura cerrado o en estado de error.
fr: Le Writer est fermé ou à l'état d'erreur.
it: L'elemento Writer è chiuso o in stato di errore.
ja: ライターは閉じられているか、エラー状態にあります。
ko: 기록기가 닫혀 있거나 오류 상태입니다.
pl: Element Writer został zamknięty lub wystąpił związany z nim błąd.
pt_br: O Gravador está fechado ou em estado de erro.
ru: Модуль записи закрыт из-за ошибки.
tr: Yazıcı kapalı veya hata durumunda.
zh_hans: 编写器已关闭，或处于错误状态。
zh_hant: Writer 已關閉，或是處於錯誤狀態。

# Xml_ClosedOrErrorReader
source: The XmlReader is closed or in error state.
cs: Objekt XmlReader je uzavřen nebo v chybovém stavu.
de: Der XmlReader ist geschlossen oder weist einen Fehlerzustand auf.
es: XmlReader está cerrado o está en un estado de error.
fr: Le XmlReader est fermé ou à l'état d'erreur.
it: L'elemento XmlReader è chiuso o in stato di errore.
ja: XmlReader は閉じられているか、エラー状態にあります。
ko: XmlReader가 닫혀 있거나 오류 상태입니다.
pl: Element XmlReader jest zamknięty lub wystąpił w nim błąd.
pt_br: O XmlReader está fechado ou em estado de erro.
ru: XmlReader закрыт или находится в состоянии ошибки.
tr: XmlReader kapalı veya hatalı durumda.
zh_hans: XmlReader 已关闭，或处于错误状态。
zh_hant: XmlReader 已關閉，或是處於錯誤狀態。

# Xml_ColonInLocalName
source: '{0}' is an unqualified name and cannot contain the character ':'.
cs: {0} je nekvalifikovaný název a nemůže obsahovat znak dvojtečky (:).
de: "{0}" ist ein nicht qualifizierter Name und darf das Zeichen ":" nicht enthalten.
es: "{0}" no es un nombre completo y no puede contener el carácter ":".
fr: '{0}' est un nom non qualifié et ne peut pas contenir le caractère ':'.
it: '{0}' è un nome non qualificato e non può contenere il carattere ':'.
ja: '{0}' は非修飾名です。文字 ':' は使用できません。
ko: '{0}'은(는) 비정규화된 이름이며 문자 ':'을 포함할 수 없습니다.
pl: Element „{0}” jest nazwą niekwalifikowaną i nie może zawierać znaku „:”.
pt_br: '{0}' é um nome não qualificado e não pode conter o caractere ':'.
ru: "{0}" не является полным именем и не может содержать символы ":".
tr: '{0}', nitelenmemiş bir ad ve ':' karakterini içeremez.
zh_hans: “{0}”是非限定名称且不能包含字符 ":"。
zh_hant: {0} 是不合格的名稱，且不可以包含字元 ':'。
