Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlIllegalOverride
source: Error: Type '{0}' could not be imported because it redefines inherited member '{1}' with a different type. '{1}' is declared as type '{3}' on '{0}', but as type '{2}' on base class '{4}'.
cs: Chyba: Typ {0} nelze importovat, protože mění definici zděděného člena {1} na jiný typ. Typ {1} je v {0} deklarován jako typ {3}, ale v základní třídě {4} jako typ {2}.
de: Fehler: Der Typ "{0}" konnte nicht importiert werden, da der geerbte Member "{1}" mit einem anderen Typ neu definiert wird. "{1}" ist als Typ "{3}" in "{0}", aber als Typ "{2}" in der Basisklasse "{4}" deklariert.
es: Error: no se pudo importar el tipo "{0}" porque redefine el miembro heredado "{1}" con un tipo diferente. "{1}" se declara como tipo "{3}" en "{0}", pero como tipo "{2}" en la clase base "{4}".
fr: Erreur : le type '{0}' n'a pas pu être importé, car il redéfinit le membre hérité '{1}' avec un autre type. '{1}' est déclaré en tant que type '{3}' sur '{0}', mais en tant que type '{2}' sur la classe de base '{4}'.
it: Errore: non è stato possibile importare il tipo '{0}' perché ridefinisce il membro ereditato '{1}' con un tipo diverso. '{1}' è dichiarato come tipo '{3}' in '{0}', ma come tipo '{2}' nella classe di base '{4}'.
ja: エラー : 型 '{0}' は、異なる型の参照メンバー '{1}' を再定義するため、インポートできませんでした。'{1}' は型 '{3}' として '{0}' で宣言されていますが、基本クラス '{4}' では型 '{2}' として宣言されています。
ko: 오류: 형식 '{0}'은(는) 상속된 멤버 '{1}'을(를) 다른 형식으로 다시 정의하므로 가져올 수 없습니다. '{1}'은(는) '{0}'에서 '{3}' 형식으로 선언되지만 기본 클래스 '{4}'에서는 '{2}' 형식으로 선언됩니다.
pl: Błąd: typ „{0}” nie może zostać zaimportowany, ponieważ ponownie definiuje dziedziczoną składową „{1}” przy użyciu innego typu. Składowa „{1}” jest zadeklarowana jako typ „{3}” w typie „{0}”, ale jako typ „{2}” w klasie bazowej „{4}”.
pt_br: Erro: o tipo '{0}' não pôde ser importado porque ele redefine o membro herdado '{1}' como um tipo diferente. '{1}' é declarado como do tipo '{3}' em '{0}', mas como do tipo '{2}' na classe base '{4}'.
ru: Ошибка. Невозможно импортировать тип "{0}", так как он переопределяет унаследованный член "{1}" другим типом. "{1}" объявлен как тип "{3}" для "{0}", но как тип "{2}" для базового класса "{4}".
tr: Hata: Devralınan '{1}' üyesini farklı bir türle yeniden tanımladığından '{0}' türü içeri aktarılamadı. '{1}', '{0}' üzerinde '{3}' olarak tanımlı ancak '{4}' temel sınıfında '{2}' olarak tanımlı.
zh_hans: 错误: 无法导入类型“{0}”，因为它用不同的类型重定义继承的成员“{1}”。“{1}”在“{0}”上声明为类型“{3}”，但在基类“{4}”上声明为类型“{2}”。
zh_hant: 錯誤: 無法匯入類型 '{0}'，因為它會以不同的類型重新定義繼承的成員 '{1}'。'{1}' 在 '{0}' 上宣告為類型 '{3}'，但在基底類別 '{4}' 上宣告為類型 '{2}'。

# XmlIllegalSimpleContentExtension
source: Cannot serialize object of type '{0}'. Base type '{1}' has simpleContent and can only be extended by adding XmlAttribute elements. Please consider changing XmlText member of the base class to string array.
cs: Objekt typu {0} nelze serializovat. Základní typ {1} obsahuje simpleContent a lze jej rozšířit pouze přidáním elementů XmlAttribute. Zvažte možnost změnit člen XmlText základní třídy na pole řetězců.
de: Das Objekt vom Typ "{0}" kann nicht serialisiert werden. Der Basistyp "{1}" enthält simpleContent und kann nur durch Hinzufügen von XmlAttribute-Elementen erweitert werden. Ändern Sie den XmlText-Member der Basisklasse in ein Zeichenfolgenarray.
es: No se puede serializar el objeto de tipo "{0}". El tipo base "{1}" tiene simpleContent y solo se puede extender agregando elementos XmlAttribute. Considere cambiar el miembro XmlText de la clase base a una matriz de cadena.
fr: Impossible de sérialiser l'objet de type '{0}'. Le type de base '{1}' comprend simpleContent et peut être uniquement étendu en ajoutant des éléments XmlAttribute. Changez le membre XmlText de la classe de base en tableau de chaînes.
it: Non è possibile serializzare l'oggetto di tipo '{0}'. Il tipo di base '{1}' contiene simpleContent e può essere esteso solo aggiungendo elementi XmlAttribute. Provare a modificare il membro XmlText della classe di base in matrice di stringhe.
ja: 型 '{0}' のオブジェクトをシリアル化できません。基本データ型 '{1}' は simpleContent を持ち、XmlAttribute 要素を追加することでのみ展開が可能です。基本クラスの XmlText メンバーを文字列配列に変更してみてください。
ko: '{0}' 형식의 개체를 직렬화할 수 없습니다. 기본 형식 '{1}에는 simpleContent를 사용하며 XmlAttribute 요소를 추가해야만 확장할 수 있습니다. 기본 클래스의 XmlText 멤버를 문자열 배열로 변경하는 것이 좋습니다.
pl: Nie można serializować obiektu typu „{0}”. Typ bazowy „{1}” ma element simpleContent i może być rozszerzony tylko przez dodanie elementów XmlAttribute. Rozważ wymianę skladowej XmlText klasy bazowej na tablicę ciągów.
pt_br: Não é possível serializar objeto do tipo '{0}'. O tipo base '{1}' tem simpleContent e só pode ser estendido pela adição de elementos XmlAttribute. Considere alterar o membro XmlText da classe base para uma matriz de cadeia de caracteres.
ru: Невозможно сериализовать объект типа "{0}". Базовый тип "{1}" имеет элемент simpleContent и может расширяться только за счет добавления элементов XmlAttribute. Рекомендуется заменить член XmlText базового класса массивом строк.
tr: '{0}' türündeki nesne serileştirilemiyor. '{1}' temel türü yalnızca simpleContent içeriyor ve yalnızca XmlAttribute öğeleri eklenerek uzatılabilir. Lütfen temel sınıfın XmlText üyesini dize dizisine çevirmeyi deneyin.
zh_hans: 无法序列化类型“{0}”的对象。基类型“{1}”具有 simpleContent 且只能通过添加 XmlAttribute 元素来扩展。请考虑将基类的 XmlText 成员更改为字符串数组。
zh_hant: 無法將類型 '{0}' 的物件序列化。基底類型 '{1}' 有 simpleContent，且只能以新增 XmlAttribute 元素的方式加以延伸。請考慮將基底類別的 XmlText 成員變更為字串陣列。

# XmlIllegalSoapAttribute
source: Cannot serialize member '{0}' of type {1}. SoapAttribute cannot be used to encode complex types.
cs: Člen {0} typu {1} nelze serializovat. Atribut SoapAttribute nelze použít ke kódování složitých typů.
de: Der Member "{0}" vom Typ {1} kann nicht serialisiert werden. SoapAttribute kann nicht zum Codieren komplexer Typen verwendet werden.
es: No se puede serializar el miembro "{0}" del tipo {1}. No se puede utilizar SoapAttribute para codificar tipos complejos.
fr: Impossible de sérialiser le membre '{0}' de type {1}. SoapAttribute ne peut pas être utilisé pour encoder des types complexes.
it: Non è possibile serializzare il membro '{0}' di tipo {1}. SoapAttribute non può essere usato per codificare tipi complessi.
ja: 型 {1} のメンバー '{0}' はシリアル化できません。SoapAttribute は、複合型のエンコードには使用できません。
ko: {1} 형식의 멤버 '{0}'을(를) 직렬화할 수 없습니다. SoapAttribute는 복합 형식을 인코딩하는 데 사용할 수 없습니다.
pl: Nie można serializować składowej „{0}” typu {1}. Element SoapAttribute nie może być używany do kodowania typów złożonych.
pt_br: Não é possível serializar o membro '{0}' do tipo {1}. Não é possível usar SoapAttribute para codificar tipos complexos.
ru: Невозможно сериализовать член "{0}" типа {1}. SoapAttribute не может использоваться для кодирования составных типов.
tr: {1} türündeki '{0}' üyesi serileştirilemiyor. SoapAttribute karmaşık türleri kodlamada kullanılamaz.
zh_hans: 无法序列化 {1} 类型的成员“{0}”。SoapAttribute 不能用来对复杂类型编码。
zh_hant: 無法序列化類型 {1} 的成員 '{0}'。SoapAttribute 不可用來對複雜類型進行編碼。

# XmlIllegalType
source: The type for {0} may not be specified for primitive types.
cs: Typ pro {0} nesmí být zadán pro primitivní typy.
de: Der Typ für {0} kann nicht für primitive Typen angegeben werden.
es: No se puede especificar el tipo {0} para tipos primitivos.
fr: Le type de {0} ne peut pas être spécifié pour les types primitifs.
it: Non è possibile specificare il tipo per {0} in caso di tipi primitivi.
ja: {0} の型をプリミティブ型に対して指定することはできません。
ko: 기본 형식에 대해 {0}의 형식을 지정할 수 없습니다.
pl: Typ dla elementu {0} nie może być określony dla typów podstawowych.
pt_br: O tipo de {0} não pode ser especificado para tipos primitivos.
ru: Невозможно задать тип {0} для типов примитивов.
tr: {0} türü temel türler için belirtilemez.
zh_hans: 不能为基元类型指定 {0} 的类型。
zh_hant: {0} 的類型不可以針對基本類型指定。

# XmlIllegalTypeContext
source: {0} cannot be used as: 'xml {1}'.
cs: {0} nelze použít jako xml {1}.
de: {0} kann nicht als "xml {1}" verwendet werden.
es: {0} no se puede utilizar como: "xml {1}".
fr: {0} ne peut pas être utilisé comme : 'xml {1}'.
it: Non è possibile usare {0} come: 'xml {1}'.
ja: {0} を 'xml {1}' として使うことはできません。
ko: {0}을(를) 'xml {1}'(으)로 사용할 수 없습니다.
pl: Element {0} nie może być używany jako: „xml {1}”.
pt_br: {0} não pode ser usado como 'XML {1}'.
ru: {0} не может использоваться в качестве "xml {1}".
tr: {0}, 'xml {1}' olarak kullanılamaz.
zh_hans: {0} 不能用作“xml {1}”。
zh_hant: {0} 不可用作為: 'xml {1}'。

# XmlIllegalTypedTextAttribute
source: Cannot serialize object of type '{0}'. Consider changing type of XmlText member '{0}.{1}' from {2} to string or string array.
cs: Objekt typu {0} nelze serializovat. Zvažte změnu typu člena XmlText {0}.{1} z {2} na řetězec nebo pole řetězců.
de: Das Objekt vom Typ "{0}" kann nicht serialisiert werden. Ändern Sie den Typ des XmlText-Members "{0}.{1}" ggf. von {2} in eine Zeichenfolge oder ein Zeichenfolgenarray.
es: No se puede serializar el objeto de tipo "{0}". Considere cambiar el tipo del miembro XmlText "{0}.{1}" de {2} a una cadena o matriz de cadena.
fr: Impossible de sérialiser l'objet de type '{0}'. Changez le type du membre XmlText '{0}.{1}' de {2} en chaîne ou tableau de chaînes.
it: Non è possibile serializzare l'oggetto di tipo '{0}'. Provare a modificare il tipo del membro XmlText '{0}.{1}' da {2} in stringa o matrice di stringhe.
ja: 型 '{0}' のオブジェクトをシリアル化できません。{2} の XmlText メンバーの型 '{0}.{1}' を文字列か文字列配列に変更してみてください。
ko: '{0}' 형식의 개체를 직렬화할 수 없습니다. XmlText 멤버 '{0}.{1}'의 형식을 {2}에서 문자열 또는 문자열 배열로 변경하는 것이 좋습니다.
pl: Nie można serializować obiektu typu „{0}”. Rozważ zmianę typu składowej XmlText „{0}.{1}” z {2} na ciąg lub tablicę ciągów.
pt_br: Não é possível serializar objeto do tipo '{0}'. Considere alterar o tipo do membro XmlText '{0}.{1}' de {2} em uma cadeia de caracteres ou uma matriz de cadeias de caracteres.
ru: Невозможно сериализовать объект типа "{0}". Рекомендуется заменить тип члена XmlText "{0}.{1}" из {2} строкой или массивом строк.
tr: '{0}' türü nesne serileştirilemiyor. '{0}.{1}' XmlText üyesinin türünü {2} yerine dize veya dize dizisi yapmak isteyebilirsiniz.
zh_hans: 无法序列化类型“{0}”的对象。请考虑将 XmlText 成员“{0}.{1}”的类型从 {2} 更改为字符串或字符串数组。
zh_hant: 無法序列化類型為 '{0}' 的物件。請考慮將 XmlText 成員 '{0}.{1}' 的類型從 {2} 變更為字串或字串陣列。

# XmlIllegalWildcard
source: Cannot use wildcards at the top level of a schema.
cs: Zástupné znaky nelze použít na nejvyšší úrovni schématu.
de: Platzhalterzeichen können nicht auf der obersten Schemaebene verwendet werden.
es: No se pueden utilizar comodines en el nivel superior de un esquema.
fr: Impossible d'utiliser des caractères génériques au niveau supérieur d'un schéma.
it: Non è possibile usare caratteri jolly nel primo livello di uno schema.
ja: ワイルドカードをスキーマのトップ レベルで使用ですることはできません。
ko: 스키마의 최상위 수준에서 와일드카드를 사용할 수 없습니다.
pl: Nie można używać symboli wieloznacznych na najwyższym poziomie schematu.
pt_br: Não é possível usar curingas no nível superior de um esquema.
ru: На верхнем уровне схемы нельзя использовать подстановочные знаки.
tr: Şemanın en üst düzeyinde joker parçacıklar kullanılamaz.
zh_hans: 在架构的顶级不能使用通配符。
zh_hant: 結構描述最上層不可使用萬用字元。

# XmlImporterExtensionBadLocalTypeName
source: Schema importer extension {0} returned invalid type information: '{1}' is not a valid type name.
cs: Rozšíření programu pro import schématu {0} vrátilo neplatné informace typu: {1} není platný název typu.
de: Die Schemaimporterweiterung {0} hat ungültige Typinformationen zurückgegeben: "{1}" ist kein gültiger Typname.
es: La extensión del importador de esquemas {0} ha devuelto información de tipo no válida: "{1}" no es un nombre de tipo válido.
fr: L'extension d'importation de schéma {0} a retourné des informations de type non valides : '{1}' n'est pas un nom de type valide.
it: L'estensione dell'utilità di importazione dello schema {0} ha restituito informazioni non valide sul tipo: '{1}' non è un nome di tipo valido.
ja: スキーマ インポーターの拡張機能 {0} から、無効な型情報が返されました。'{1}' は有効な型名ではありません。
ko: 스키마 가져오기 확장 {0}에서 잘못된 형식 정보를 반환했습니다. '{1}'은(는) 적합한 형식 이름이 아닙니다.
pl: Rozszerzenie importera schematów {0} zwróciło nieprawidłowe informacje dotyczące typu: „{1}” nie jest prawidłową nazwą typu.
pt_br: A extensão do importador do esquema {0} retornou informações de tipo inválidas: '{1}' não é um nome de tipo válido.
ru: Расширение программы импорта схем {0} вернуло сведения о недопустимом типе: "{1}" не является допустимым именем типа.
tr: Şema içeri aktarıcı uzantısı {0} geçersiz tür bilgisi döndürdü: '{1}' geçerli bir tür adı değil.
zh_hans: 架构导入程序扩展 {0} 返回了无效的类型信息:“{1}”不是有效的类型名称。
zh_hant: 結構描述匯入工具延伸模組 {0} 傳回無效的類型資訊: '{1}' 不是有效的類型名稱。

# XmlImporterExtensionBadTypeName
source: Schema importer extension {0} returned invalid type information for xsd type {1} from namespace='{2}': '{3}' is not a valid type name.
cs: Rozšíření programu pro import schématu {0} vrátilo neplatné informace typu pro typ xsd {1} z oboru názvů namespace={2}: {3} není platný název typu.
de: Die Schemaimporterweiterung {0} hat ungültige Typinformationen für den xsd-Typ {1} aus dem Namespace="{2}" zurückgegeben: "{3}" ist kein gültiger Typname.
es: La extensión del importador de esquemas {0} ha devuelto información de tipo no válida para el tipo xsd {1} del espacio de nombres="{2}": "{3}" no es un nombre de tipo válido.
fr: L'extension d'importation de schéma {0} a retourné des informations de type non valides pour le type xsd {1} de namespace='{2}' : '{3}' n'est pas un nom de type valide.
it: L'estensione dell'utilità di importazione dello schema {0} ha restituito informazioni non valide sul tipo per il tipo xsd {1} appartenente allo spazio dei nomi='{2}': '{3}' non è un nome di tipo valido.
ja: スキーマ インポーターの拡張機能 {0} から、namespace='{2}' の xsd 型 {1} に対して無効な型情報が返されました。'{3}' は有効な型名ではありません。
ko: 스키마 가져오기 확장 {0}에서 namespace='{2}'의 xsd 형식 {1}에 대해 잘못된 형식 정보를 반환했습니다. '{3}'은(는) 유효한 형식 이름이 아닙니다.
pl: Rozszerzenie importera schematów {0} zwróciło nieprawidłowe informacje dotyczące typu xsd {1} z przestrzeni nazw „{2}”: „{3}” nie jest prawidłową nazwą typu.
pt_br: A extensão do importador do esquema {0} retornou informações de tipo inválidas para o tipo XSD {1} do namespace='{2}': '{3}' não é um nome de tipo válido.
ru: Расширение программы импорта схем {0} вернуло сведения о недопустимом типе для типа xsd {1} из пространства имен="{2}": "{3}" не является допустимым именем типа.
tr: Şema içeri aktarıcı uzantısı {0}, ad alanı '{2}' olan {1} xsd türü için geçersiz tür bilgisi döndürdü: '{3}' geçerli bir tür adı değil.
zh_hans: 架构导入程序扩展 {0} 从 namespace='{2}' 为 xsd 类型 {1} 返回了无效类型信息:“{3}”不是有效的类型名称。
zh_hant: 結構描述匯入工具延伸模組 {0} 傳回無效的類型資訊給命名空間為 '{2}' 的 xsd 類型 {1}: '{3}' 不是有效的類型名稱。

# XmlInternalError
source: Internal error.
cs: Vnitřní chyba
de: Interner Fehler.
es: Error interno.
fr: Erreur interne.
it: Errore interno.
ja: 内部エラーです。
ko: 내부 오류입니다.
pl: Błąd wewnętrzny.
pt_br: Erro interno.
ru: Внутренняя ошибка.
tr: İç hata.
zh_hans: 内部错误。
zh_hant: 內部錯誤。

# XmlInternalErrorDetails
source: Internal error: {0}.
cs: Vnitřní chyba: {0}
de: Interner Fehler: {0}.
es: Error interno: {0}.
fr: Erreur interne : {0}.
it: Errore interno: {0}.
ja: 内部エラー: {0}。
ko: 내부 오류입니다. {0}
pl: Błąd wewnętrzny: {0}.
pt_br: Erro interno: {0}.
ru: Внутренняя ошибка: {0}.
tr: İç hata: {0}.
zh_hans: 内部错误: {0}。
zh_hant: 內部錯誤: {0}。

# XmlInternalErrorMethod
source: Internal error: missing generated method for {0}.
cs: Vnitřní chyba: Chybí vygenerovaná metoda pro {0}.
de: Interner Fehler: Die generierte Methode für {0} fehlt.
es: Error interno: falta el método generado para {0}.
fr: Erreur interne : méthode générée manquante pour {0}.
it: Errore interno: manca il metodo generato per {0}.
ja: 内部エラーです。{0} に対して生成されたメソッドが見つかりません。
ko: 내부 오류입니다. {0}에 대해 생성된 메서드가 없습니다.
pl: Błąd wewnętrzny: brak wygenerowanej metody dla elementu {0}.
pt_br: Erro interno: método gerado ausente para {0}.
ru: Внутренняя ошибка: отсутствует созданный метод для {0}.
tr: İç hata: {0} için oluşturulan metot eksik.
zh_hans: 内部错误: {0} 缺少生成的方法。
zh_hant: 內部錯誤: 遺漏為 {0} 所產生的方法。

# XmlInternalErrorReaderAdvance
source: Internal error: deserialization failed to advance over underlying stream.
cs: Vnitřní chyba: V deserializaci nelze s příslušným streamem pokračovat.
de: Interner Fehler: Die Deserialisierung konnte über den zugrunde liegenden Datenstrom hinaus nicht erweitert werden.
es: Error interno: la deserialización no ha podido avanzar sobre la secuencia subyacente.
fr: Erreur interne : la désérialisation n'a pas pu avancer sur le flux sous-jacent.
it: Errore interno: la deserializzazione non può passare al flusso sottostante.
ja: 内部エラー: 基になるストリームでシリアル化を継続できませんでした。
ko: 내부 오류입니다. 기본 스트림에 대한 deserialization을 계속할 수 없습니다.
pl: Błąd wewnętrzny: podczas deserializacji wystąpił błąd związany z przechodzeniem do odpowiedniego strumienia.
pt_br: Erro interno: a desserialização não pôde avançar sobre o fluxo subjacente.
ru: Внутренняя ошибка: сбой десериализации при перемещении по базовому потоку.
tr: İç hata: Temel alınan akışta yürütülen seri durumdan çıkarma işlemi başarısız oldu.
zh_hans: 内部错误: 反序列化无法越过基础流。
zh_hant: 內部錯誤: 還原序列化在基礎資料上無法前進。

# XmlInvalidAnyAttributeUse
source: Any may not be specified. Attributes are not supported with encoded SOAP. Please review schema type '{0}' from namespace '{1}'.
cs: Atribut Any nesmí být zadán. U kódovaného protokolu SOAP nejsou atributy podporovány. Zkontrolujte typ schématu {0} z oboru názvů {1}.
de: "Any" kann nicht angegeben werden. Attribute werden mit codiertem SOAP nicht unterstützt. Überprüfen Sie den Schematyp "{0}" aus dem Namespace "{1}".
es: No se puede especificar Any. Los atributos no son compatibles con SOAP codificado. Revise el tipo de esquema "{0}" del espacio de nombres "{1}".
fr: Any ne peut pas être spécifié. Les attributs ne sont pas pris en charge avec le SOAP encodé. Passez en revue le type de schéma '{0}' de l'espace de noms '{1}'.
it: Non è possibile specificare any. Gli attributi non sono supportati con SOAP codificato. Esaminare il tipo di schema '{0}' dello spazio dei nomi '{1}'.
ja: Any を指定することはできません。エンコードされた SOAP では、属性はサポートされません。名前空間 '{1}' のスキーマの型 '{0}' を確認してください。
ko: Any는 지정할 수 없습니다. 특성은 인코딩된 SOAP에서 지원되지 않습니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'을(를) 확인하세요.
pl: Nie można określić elementu „any”. Atrybuty nie są obsługiwane przy użyciu zakodowanego protokołu SOAP. Przejrzyj typ schematu „{0}” z przestrzeni nazw „{1}”.
pt_br: Any não pode ser especificado. Não há suporte para atributos com SOAP codificado. Examine o tipo de esquema '{0}' do namespace '{1}'.
ru: Невозможно задать any. Атрибуты с кодированными SOAP не поддерживаются. Просмотрите тип схемы "{0}" из пространства имен "{1}".
tr: Any belirtilmemiş olabilir. Kodlanmış SOAP'ta öznitelikler desteklenmez. Lütfen '{1}' ad alanındaki '{0}' şema türünü gözden geçirin.
zh_hans: 不能指定任何项。编码的 SOAP 不支持特性。请复查来自命名空间“{1}”的架构类型“{0}”。
zh_hant: 不可指定 Any。編碼的 SOAP 不支援屬性。請從檢閱命名空間 '{1}' 的結構描述類型 '{0}'。

# XmlInvalidArrayDimentions
source: SOAP-ENC:arrayType with multidimensional array found at {0}. Only single-dimensional arrays are supported. Consider using an array of arrays instead.
cs: V {0} byl nalezen typ SOAP-ENC:arrayType s vícerozměrným polem. Podporována jsou pouze jednorozměrná pole. Zvažte možnost použít pole polí.
de: Bei {0} wurde ein SOAP-ENC:arrayType mit einem mehrdimensionalen Array gefunden. Es werden nur eindimensionale Arrays unterstützt. Verwenden Sie stattdessen ggf. ein Array, das aus Arrays besteht.
es: SOAP-ENC:arrayType con matriz multidimensional se encontró en {0}. solo se admiten matrices de una sola dimensión. Considere la posibilidad de utilizar una matriz de matrices en su lugar.
fr: SOAP-ENC:arrayType avec un tableau multidimensionnel a été trouvé à {0}. Seuls les tableaux unidimensionnels sont pris en charge. Essayez plutôt d'utiliser un tableau de tableaux.
it: In {0} è stato trovato un elemento SOAP-ENC:arrayType con matrice multidimensionale. Sono supportate solo le matrici monodimensionali. Provare a usare una matrice di matrici.
ja: {0} で、複数次元配列の SOAP-ENC:arrayType が見つかりました。単次元配列のみがサポートされます。配列の配列を使用してください。
ko: {0}에서 다차원 배열의 SOAP-ENC:arrayType을 찾았습니다. 1차원 배열만 지원됩니다. 대신 배열의 배열을 사용하세요.
pl: W elemencie {0} znaleziono element SOAP-ENC:arrayType z tablicą wielowymiarową. Obsługiwane są tylko tablice jednowymiarowe. Rozważ użycie w zamian tablicy tablic.
pt_br: SOAP-ENC:arrayType com matriz multidimensional encontrado em {0}. Só há suporte para matrizes unidimensionais. Considere usar uma matriz de matrizes.
ru: В {0} обнаружен SOAP-ENC:arrayType с многомерным массивом. Поддерживаются только одномерные массивы. Рекомендуется использовать массив массивов.
tr: {0} konumunda çok boyutlu dizisi olan SOAP-ENC:arrayType bulundu. Yalnızca tek boyutlu diziler destekleniyor. Bunun yerine dizi dizisi kullanmayı deneyin.
zh_hans: 在 {0} 处发现具有多维数组的 SOAP-ENC:arrayType。仅支持一维数组。请考虑改用多个数组中的一个。
zh_hant: 在 {0} 處找到有多維度陣列的 SOAP-ENC:arrayType，但支援一維陣列。請考慮改用陣列中的陣列。

# XmlInvalidArrayLength
source: SOAP-ENC:arrayType could not handle '{1}' as the length of the array.
cs: Typ SOAP-ENC:arrayType nemohl zpracovat {1} jako délku pole.
de: SOAP-ENC:arrayType konnte "{1}" nicht als Arraylänge verarbeiten.
es: SOAP-ENC:arrayType no puede tratar "{1}" como longitud de la matriz.
fr: SOAP-ENC:arrayType n'a pas pu prendre en charge '{1}' en tant que longueur du tableau.
it: SOAP-ENC:arrayType non può gestire '{1}' come lunghezza della matrice.
ja: SOAP-ENC:arrayType で '{1}' を配列の長さとして処理できませんでした。
ko: SOAP-ENC:arrayType은 '{1}'을(를) 배열 길이로 처리할 수 없습니다.
pl: Element SOAP-ENC:arrayType nie może obsłużyć „{1}” jako długości tablicy.
pt_br: SOAP-ENC:arrayType não pôde tratar '{1}' como o comprimento da matriz.
ru: SOAP-ENC:arrayType не смог обработать "{1}" как длину массива.
tr: SOAP-ENC:arrayType, dizinin uzunluğu olarak '{1}' uzunluğunu işleyemedi.
zh_hans: SOAP-ENC:arrayType 未能将“{1}”作为数组的长度处理。
zh_hant: SOAP-ENC:arrayType 無法將 '{1}' 處理為陣列的長度。

# XmlInvalidArrayRef
source: Invalid reference id='{0}'. Object of type {1} cannot be stored in an array of this type. Details: array index={2}.
cs: Neplatné ID odkazu: {0}. Objekt typu {1} nemůže být uložen v poli tohoto typu. Podrobnosti: index pole={2}
de: Ungültige reference id="{0}". Ein Objekt vom Typ {1} kann nicht in einem Array dieses Typs gespeichert werden. Details: Arrayindex={2}.
es: Valor id="{0}" de referencia no válido. No se puede almacenar un objeto del tipo {1} en una matriz de este tipo. Detalles: índice de matriz={2}.
fr: Reference id='{0}' non valide. L'objet de type {1} ne peut pas être stocké dans un tableau de ce type. Détails : array index={2}.
it: ID riferimento non valido='{0}'. L'oggetto di tipo {1} non può essere archiviato in una matrice di questo tipo. Dettagli: indice di matrice={2}.
ja: 参照 ID '{0}' が無効です。{1} 型のオブジェクトは、この型の配列には保存できません。詳細: 配列インデックス = {2}。
ko: 참조 ID='{0}'이(가) 잘못되었습니다. {1} 형식의 개체는 이 형식의 배열에 저장할 수 없습니다. 세부 정보: 배열 인덱스={2}.
pl: Nieprawidłowy identyfikator odwołania: „{0}”. Obiekt typu {1} nie może być przechowywany w tablicy tego typu. Szczegóły: indeks tablicy = {2}.
pt_br: ID da referência inválida='{0}'. Não é possível armazenar o objeto do tipo {1} em uma matriz desse tipo. Detalhes: índice da matriz={2}.
ru: Недопустимый идентификатор ссылки "{0}". Объект типа {1} не может храниться в массиве этого типа. Сведения: индекс массива={2}.
tr: Geçersiz reference id='{0}'. {1} türündeki nesne bu tür dizide depolanamaz. Ayrıntılı bilgi: dizi dizini={2}.
zh_hans: 无效的引用 id='{0}'。{1} 类型的对象无法存储在该类型的数组中。详细信息: 数组 index={2}。
zh_hant: reference id='{0}' 無效。類型 {1} 的物件無法儲存於此類型的任何陣列中。詳細資料: array index={2}。
