Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_InvalidCommentChars
source: An XML comment cannot contain '--', and '-' cannot be the last character.
cs: Komentář jazyka XML nemůže obsahovat znak -- a znak - nemůže být jeho posledním znakem.
de: Ein XML-Kommentar darf "--" nicht enthalten, und "-" darf nicht das letzte Zeichen sein.
es: Un comentario XML no puede contener "--", y "-" no puede ser el último carácter.
fr: Un commentaire XML ne peut pas contenir '--' et '-' ne peut pas être le dernier caractère.
it: I commenti XML non possono contenere il carattere '--' né terminare con il carattere '-'.
ja: XML コメントの内部に '--' を含めることも、'-' を最後の文字にすることもできません。
ko: XML 주석 안에 '--' 기호를 사용할 수 없으며 '-' 기호를 마지막 문자로 사용할 수 없습니다.
pl: Komentarz XML nie może zawierać znaku „--”, a znak „-” nie może być ostatni.
pt_br: Um comentário XML não pode ter '--' e '-' não pode ser o último caractere.
ru: Комментарий XML не может содержать "--", а "-" не может быть последним символом.
tr: XML açıklamasında '--' bulunamaz ve son karakter '-' olamaz.
zh_hans: XML 注释中不能包含 "--"，并且 "-" 不能是最后一个字符。
zh_hant: XML 註解不可包含 '--'，且 '-' 不可為最後一個字元。

# Xml_InvalidConditionalSection
source: A conditional section is not allowed in an internal subset.
cs: Oddíl podmínky není ve vnitřní podmnožině povolen.
de: Ein Bedingungsabschnitt ist in einer internen Teilmenge nicht zulässig.
es: Una sección condicional no está permitida dentro un subconjunto interno.
fr: Une section conditionnelle est interdite dans un sous-ensemble interne.
it: Le sezioni condizionali non sono consentite in un sottoinsieme interno.
ja: 条件付セクションは、内部サブセットでは使用できません。
ko: 내부 하위 집합에는 조건 섹션을 사용할 수 없습니다.
pl: Sekcja warunkowa nie jest dozwolona w podzbiorze wewnętrznym.
pt_br: Não é permitida uma seção condicional em um subconjunto interno.
ru: Во внутреннем подмножестве условные разделы не разрешены.
tr: İç alt kümede koşullu bölüme izin verilmez.
zh_hans: 内部子集中不允许有条件节。
zh_hant: 內部子集中不允許條件式區段。

# Xml_InvalidContentModel
source: Invalid content model.
cs: Neplatný model obsahu
de: Ungültiges Inhaltsmodell.
es: Modelo de contenido no válido.
fr: Modèle de contenu non valide.
it: Il modello di contenuto non è valido.
ja: コンテンツ モデルが無効です。
ko: 콘텐츠 모델이 잘못되었습니다.
pl: Nieprawidłowy model zawartości.
pt_br: Modelo de conteúdo inválido.
ru: Недопустимая модель содержимого.
tr: İçerik modeli geçersiz.
zh_hans: 无效的内容模型。
zh_hant: 內容模型無效。

# Xml_InvalidIndentation
source: Indentation value must be greater than 0.
cs: Hodnota odsazení musí být větší než 0.
de: Der Einzugswert muss größer als 0 sein.
es: El valor de sangría debe ser mayor que 0.
fr: La valeur de mise en retrait doit être supérieure à 0.
it: Il valore del rientro deve essere maggiore di 0.
ja: インデント幅は 0 より大きい値である必要があります。
ko: 들여쓰기 값은 0보다 커야 합니다.
pl: Wartość wcięcia musi być większa od 0.
pt_br: O valor de recuo deve ser maior que 0.
ru: Значение величины отступа должно быть больше 0.
tr: Girinti değeri 0'dan büyük olmalıdır.
zh_hans: 缩进值必须大于 0。
zh_hant: 縮排值必須大於 0。

# Xml_InvalidNameChars
source: Invalid name character in '{0}'.
cs: Neplatný znak v názvu {0}
de: Ungültiges Namenszeichen in "{0}".
es: Carácter de nombre no válido en "{0}".
fr: Caractère de nom non valide dans '{0}'.
it: '{0}' contiene un carattere non valido per un nome.
ja: '{0}' の名前に無効な文字が使用されています。
ko: '{0}'에 잘못된 이름 문자가 있습니다.
pl: Nieprawidłowy znak nazwy w elemencie „{0}”.
pt_br: Caractere de nome inválido em '{0}'.
ru: Недопустимый для имени символ в "{0}".
tr: {0} içinde geçersiz bir ad karakteri.
zh_hans: “{0}”中的名称字符无效。
zh_hant: '{0}' 中的名稱字元無效。

# Xml_InvalidNameCharsDetail
source: Invalid name character in '{0}'. The '{1}' character, hexadecimal value {2}, cannot be included in a name.
cs: Název {0} obsahuje neplatný znak. Znak {1} (šestnáctková hodnota {2}) nelze v názvu použít.
de: Ungültiges Namenszeichen in "{0}". Das Zeichen "{1}", Hexadezimalwert {2}, darf nicht in einem Namen enthalten sein.
es: Carácter de nombre no válido en "{0}". El carácter "{1}", con valor hexadecimal {2}, no puede incluirse en un nombre.
fr: Caractère de nom non valide dans '{0}'. Le caractère '{1}', valeur hexadécimale {2}, ne peut pas être inclus dans un nom.
it: '{0}' contiene un carattere non valido per un nome. Un nome non può includere il carattere '{1}' con valore esadecimale {2}.
ja: '{0}' の名前文字が無効です。'{1}' 文字 (16 進数値 {2}) を名前に使用することはできません。
ko: '{0}'에 잘못된 이름 문자가 있습니다. '{1}' 문자, 16진수 값 {2}은(는) 이름에 포함할 수 없습니다.
pl: Nieprawidłowy znak nazwy w elemencie „{0}”. Znak „{1}” (wartość szesnastkowa {2}) nie może zostać uwzględniony w nazwie.
pt_br: Caractere de nome inválido em '{0}'. O caractere '{1}', valor hexadecimal {2}, não pode ser incluído em um nome.
ru: Недопустимый символ имени "{0}". Символ "{1}", шестнадцатеричное значение {2}, не может быть включено в имя.
tr: '{0}' içinde geçersiz bir ad karakteri. '{1}' karakteri, {2} onaltılık değeri ada eklenemez.
zh_hans: “{0}”中的名称字符无效。名称中不能包含“{1}”字符(十六进制值为 {2})。
zh_hant: '{0}' 中的名稱字元無效。'{1}' 字元、十六進位值 {2}，不可包含在名稱中。

# Xml_InvalidNmToken
source: Invalid NmToken value '{0}'.
cs: Neplatná hodnota NmToken {0}
de: Ungültiger NmToken-Wert "{0}".
es: Valor NmToken no válido "{0}".
fr: Valeur NmToken non valide '{0}'.
it: Valore NmToken non valido: '{0}'.
ja: NmToken の値 '{0}' が無効です。
ko: 잘못된 NmToken 값 '{0}'입니다.
pl: Nieprawidłowa wartość elementu NmToken: „{0}”.
pt_br: Valor NmToken inválido '{0}'.
ru: Недопустимое значение NmToken "{0}".
tr: Geçersiz '{0}' NmToken değeri.
zh_hans: 无效的 NmToken 值“{0}”。
zh_hant: NmToken 值 '{0}' 無效。

# Xml_InvalidNodeType
source: '{0}' is an invalid XmlNodeType.
cs: {0} je neplatný typ XmlNodeType.
de: "{0}" ist ein ungültiger XmlNodeType.
es: "{0}" es un XmlNodeType no válido.
fr: '{0}' est un XmlNodeType non valide.
it: '{0}' è un elemento XmlNodeType non valido.
ja: '{0}' は、XmlNodeType としては無効です。
ko: '{0}'은(는) 잘못된 XmlNodeType입니다.
pl: Element „{0}” jest nieprawidłowym typem XmlNodeType.
pt_br: '{0}' é uma expressão XmlNodeType inválida.
ru: "{0}" является недопустимым XmlNodeType.
tr: '{0}', geçersiz bir XmlNodeType.
zh_hans: “{0}”是无效的 XmlNodeType。
zh_hant: '{0}' 是無效的 XmlNodeType。

# Xml_InvalidOperation
source: Operation is not valid due to the current state of the object.
cs: Operace není platná kvůli aktuálnímu stavu objektu.
de: Der Vorgang ist aufgrund des aktuellen Zustands des Objekts ungültig.
es: La operación no es válida debido al estado actual del objeto.
fr: L'opération est non valide en raison de l'état actuel de l'objet.
it: L'operazione non è valida a causa dello stato corrente dell'oggetto.
ja: 現在のオブジェクトの状態では、操作を正しく行うことはできません。
ko: 개체의 현재 상태로 인해 작업이 유효하지 않습니다.
pl: Operacja nie jest prawidłowa z powodu bieżącego stanu obiektu.
pt_br: A operação é inválida devido ao estado atual do objeto.
ru: Операция является недопустимой из-за текущего состояния объекта.
tr: Nesnenin geçerli durumu nedeniyle işlem geçerli değil.
zh_hans: 对象的当前状态使该操作无效。
zh_hant: 由於該物件目前的狀態，導致作業無效。

# Xml_InvalidPIName
source: '{0}' is an invalid name for processing instructions.
cs: Název {0} není platný název pro instrukce pro zpracování.
de: "{0}" ist ein ungültiger Name für Verarbeitungsanweisungen.
es: "{0}" es un nombre no válido para instrucciones de procesamiento.
fr: '{0}' est un nom non valide pour des instructions de traitement.
it: '{0}' è un nome non valido per le istruzioni di elaborazione.
ja: '{0}' は処理命令に対して無効な名前です。
ko: '{0}'은(는) 처리 명령에 사용할 수 없는 이름입니다.
pl: Element „{0}” jest nieprawidłową nazwą dla instrukcji przetwarzania.
pt_br: '{0}' é um nome inválido para instruções de processamento.
ru: "{0}" является недопустимым именем команд обработки.
tr: '{0}', yönergeleri işlemek için geçersiz bir ad.
zh_hans: 对于处理指令，“{0}”是无效的名称。
zh_hant: '{0}' 是無效的名稱，無法處理指示。

# Xml_InvalidParEntityRef
source: A parameter entity reference is not allowed in internal markup.
cs: Odkaz na entitu parametru není ve vnitřní značce povolen.
de: Ein Parameterentitätverweis ist in internem Markup nicht zulässig.
es: No está permitida una referencia a la entidad del parámetro en el marcado interno.
fr: Référence d'entité de paramètre interdite dans un balisage interne.
it: Il riferimento a entità parametro non è consentito nel markup interno.
ja: パラメーターのエンティティ参照は内部マークアップでは使用できません。
ko: 내부 태그에는 매개 변수 엔터티 참조를 사용할 수 없습니다.
pl: Odwołanie do jednostki parametru nie jest dozwolone w oznakowaniu wewnętrznym.
pt_br: Não é permitida uma referência à entidade de parâmetro na marcação interna.
ru: Ссылка на сущность параметра во внутренней разметке не разрешена.
tr: İç işaretlemede parametre varlığı başvurusuna izin verilmez.
zh_hans: 内部标记中不允许使用参数实体引用。
zh_hant: 內部標記中不允許參數實體參考。

# Xml_InvalidPiChars
source: Cannot have '?>' inside an XML processing instruction.
cs: Instrukce pro zpracování XML nemůže obsahovat řetězec ?>.
de: "?>" darf sich nicht innerhalb einer XML-Verarbeitungsanweisung befinden.
es: Dentro de una instrucción de procesamiento XML no puede haber "?>" .
fr: Impossible d'avoir '?>' dans une instruction de traitement XML.
it: Non è possibile usare '?>' in una istruzione di elaborazione XML.
ja: XML 処理命令内部に '?>' を含むことはできません。
ko: XML 처리 명령 안에 '?>'를 사용할 수 없습니다.
pl: Wewnątrz instrukcji przetwarzania XML nie może znajdować się „?>”.
pt_br: Não é possível haver '?>' dentro de uma instrução de processamento de XML.
ru: "?>" не может находиться внутри команды обработки XML.
tr: XML işleme yönergesinde '?>' bulunamaz.
zh_hans: XML 处理指令中不能有“?>”。
zh_hant: 在 XML 處理指示中不可有 '?>'。

# Xml_InvalidPosition
source: The current position on the Reader is neither an element nor an attribute.
cs: Na aktuální pozici čtecího zařízení není ani element, ani atribut.
de: Die aktuelle Position im Leser ist kein Element oder Attribut.
es: La posición actual del lector no es un elemento ni un atributo.
fr: La position actuelle sur le lecteur n'est ni un élément, ni un attribut.
it: La posizione corrente nell'elemento Reader non è un elemento né un attributo.
ja: リーダーの現在位置は、要素でも属性でもありません。
ko: 판독기에서의 현재 위치는 요소도 아니고 특성도 아닙니다.
pl: Bieżąca pozycja w czytniku nie jest ani elementem, ani atrybutem.
pt_br: A posição atual no Leitor não é um elemento nem um atributo.
ru: Текущая позиция в модуле считывания не соответствует ни элементу, ни атрибуту.
tr: Okuyucudaki geçerli konum bir öğe ya da öznitelik değil.
zh_hans: 阅读器上的当前位置既不是元素，也不是特性。
zh_hant: 在讀取器上目前的位置既不是元素也非屬性。

# Xml_InvalidPrefix
source: Prefixes beginning with "xml" (regardless of whether the characters are uppercase, lowercase, or some combination thereof) are reserved for use by XML.
cs: Předpony začínající řetězcem xml (bez ohledu na použití velkých a malých písmen) jsou vyhrazeny pro jazyk XML.
de: Präfixe, die mit "xml" anfangen (unabhängig davon, ob die Zeichen in Groß- und/oder Kleinbuchstaben geschrieben sind), sind für XML reserviert.
es: Los prefijos que comiencen con "xml" (independientemente de la combinación de mayúsculas y minúsculas que presenten) están reservados para su uso en XML.
fr: Les préfixes commençant par "xml" (quelle que soit la combinaison de majuscules, minuscules) sont réservés pour une utilisation par XML.
it: I prefissi che iniziano con "xml" (indipendentemente dalla combinazione di maiuscole e minuscole usata) sono riservati al linguaggio XML.
ja: 文字が大文字か、小文字か、またはその組み合わせである場合でも、"xml" で始まるプレフィックスは、XML によって予約されています。
ko: "xml"로 시작하는 접두사는 대문자, 소문자 또는 대/소문자를 혼합하여 사용하는지 여부에 상관없이 XML에서 사용하도록 예약되어 있습니다.
pl: Prefiksy zaczynające się od „xml” (niezależnie od zastosowania wielkich lub małych liter albo ich kombinacji) są zarezerwowane do użytku przez język XML.
pt_br: Prefixos iniciados por "xml" (independentemente de serem caracteres maiúsculos, minúsculos ou uma combinação de ambos) são reservados para serem usados pelo XML.
ru: Префиксы, начинающиеся с xml (как в верхнем регистре, так и в нижнем регистре или в виде сочетания знаков разных регистров), зарезервированы для использования в XML.
tr: "xml" (harflerin büyük, küçük veya ikisinin karışımı olmasına bağlı olmaksızın) ile başlayan önekler XML tarafından kullanılmak üzere ayrılmıştır.
zh_hans: 以 "xml" 开头的前缀(不管这些字符是大写的、小写的或者大小写组合的)是 XML 保留使用的。
zh_hant: 以 "xml" 開頭的前置詞 (字元不區分大寫、小寫或大小寫混合) 是保留給 XML 使用的詞彙。

# Xml_InvalidQuote
source: Invalid XML attribute quote character. Valid attribute quote characters are ' and ".
cs: Neplatný znak uvozovky atributu XML. Platnými znaky uvozovek atributu jsou ' a ".
de: Ungültiges XML-Attributanführungszeichen. Gültige Attributanführungszeichen sind " und ".
es: Comillas no válidas del atributo XML. Las comillas válidas para los atributos son ' y ".
fr: Guillemet d'attribut XML non valide. Les guillemets d'attribut valides sont ' et ".
it: Tipo di virgolette non valido per un attributo XML. Le virgolette valide per gli attributi sono ' e ".
ja: XML 属性引用符文字が無効です。有効な属性引用符文字は ' および " です。
ko: XML 특성 인용 문자가 잘못되었습니다. 유효한 특성 인용 문자는 ' 및 "입니다.
pl: Nieprawidłowy znak cudzysłowu dla atrybutu XML. Poprawnymi znakami cudzysłowu atrybutu są ' oraz ".
pt_br: Caractere de aspas inválido no atributo XML. Os caracteres de aspas válidos em atributos são ' e ".
ru: Недопустимый символ кавычек для атрибута XML. Допустимыми символами кавычек для атрибута являются ' и ".
tr: Geçersiz XML özniteliği tırnak işareti karakteri. Geçerli tırnak işareti karakterleri: ' ve ".
zh_hans: 无效的 XML 特性引号字符。有效的特性引号字符是 ' 和 "。
zh_hant: XML 屬性引號字元無效。有效的屬性引號字元是 ' 與 "。

# Xml_InvalidReadContentAs
source: The {0} method is not supported on node type {1}. If you want to read typed content of an element, use the ReadElementContentAs method.
cs: Metoda {0} není u uzlů typu {1} podporována. Pokud chcete číst typový obsah elementu, použijte metodu ReadElementContentAs.
de: Die {0}-Methode wird für den Knotentyp {1} nicht unterstützt. Wenn Sie den typisierten Inhalt eines Elements lesen möchten, verwenden Sie die ReadElementContentAs-Methode.
es: No se admite el método {0} en el tipo de nodo {1}. Si desea leer contenido con tipo de un elemento, utilice el método ReadElementContentAs.
fr: La méthode {0} n'est pas prise en charge par le type de nœud {1}. Si vous souhaitez lire le contenu typé d'un élément, utilisez la méthode ReadElementContentAs.
it: Il metodo {0} non è supportato nel tipo di nodo {1}. Per leggere il contenuto digitato di un elemento, usare il metodo ReadElementContentAs.
ja: {0} メソッドは、ノード型 {1} ではサポートされません。型指定された要素のコンテンツを読み取る場合は、ReadElementContentAs メソッドを使用してください。
ko: {0} 메서드는 노드 형식 {1}에서 지원되지 않습니다. 요소의 입력된 콘텐츠를 읽으려면 ReadElementContentAs 메서드를 사용하세요.
pl: Metoda {0} nie jest obsługiwana dla typu węzła {1}. Jeśli chcesz odczytać wpisaną zawartość elementu, użyj metody ReadElementContentAs.
pt_br: Não há suporte para o método {0} no tipo de nó {1}. Se desejar ler o conteúdo definido por tipo de um elemento, use o método ReadElementContentAs.
ru: Метод {0} не поддерживается для узлов типа {1}. Чтобы прочитать типизированное содержимое элемента, используйте метод ReadElementContentAs.
tr: {0} metodu {1} düğüm türünde desteklenmiyor. Öğenin yazılan içeriğini okumak istiyorsanız, ReadElementContentAs metodunu kullanın.
zh_hans: 节点类型 {1} 上不支持 {0} 方法。如果要读取某元素类型化的内容，请使用 ReadElementContentAs 方法。
zh_hant: 節點類型 {1} 不支援 {0} 方法。若要讀取元素類型化的內容，請使用 ReadElementContentAs 方法。

# Xml_InvalidReadElementContentAs
source: The {0} method is not supported on node type {1}.
cs: Metoda {0} není u uzlů typu {1} podporována.
de: Die {0}-Methode wird für den Knotentyp {1} nicht unterstützt.
es: No se admite el método {0} en el tipo de nodo {1}.
fr: La méthode {0} n'est pas prise en charge par le type de nœud {1}.
it: Il metodo {0} non è supportato nel tipo di nodo {1}.
ja: {0} メソッドは、ノード型 {1} ではサポートされません。
ko: {0} 메서드는 노드 형식 {1}에서 지원되지 않습니다.
pl: Metoda {0} nie jest obsługiwana dla węzła typu {1}.
pt_br: Não há suporte para o método {0} no tipo de nó {1}.
ru: Метод {0} не поддерживается для узлов типа {1}.
tr: {0} metodu {1} düğüm türünde desteklenmiyor.
zh_hans: 节点类型 {1} 上不支持 {0} 方法。
zh_hant: 節點類型 {1} 不支援 {0} 方法。

# Xml_InvalidReadValueChunk
source: The ReadValueAsChunk method is not supported on node type {0}.
cs: Metoda ReadValueAsChunk není u uzlů typu {0} podporována.
de: Die ReadValueAsChunk-Methode wird für den Knotentyp {0} nicht unterstützt.
es: No se admite el método ReadValueAsChunk en el tipo de nodo {0}.
fr: La méthode ReadValueAsChunk n'est pas prise en charge par le type de nœud {0}.
it: Il metodo ReadValueAsChunk non è supportato nel tipo di nodo {0}.
ja: ReadValueAsChunk メソッドは、ノード型 {0} ではサポートされていません。
ko: ReadValueAsChunk 메서드는 노드 형식 {0}에서 지원되지 않습니다.
pl: Metoda ReadValueAsChunk nie jest obsługiwana dla węzła typu {0}.
pt_br: Não há suporte para o método ReadValueAsChunk no tipo de nó {0}.
ru: Метод ReadValueAsChunk не поддерживается для узлов типа {0}.
tr: ReadValueAsChunk metodu {0} düğüm türünde desteklenmiyor.
zh_hans: 节点类型 {0} 上不支持 The ReadValueAsChunk 方法。
zh_hant: 節點類型 {0} 不支援 ReadValueAsChunk 方法。

# Xml_InvalidResetStateCall
source: Cannot call ResetState when parsing an XML fragment.
cs: Při parsování fragmentu XML nelze použít volání funkce ResetState.
de: ResetState kann beim Analysieren eines XML-Fragments nicht aufgerufen werden.
es: No se puede llamar a ResetState cuando se analiza un fragmento XML.
fr: Impossible d'appeler ResetState durant l'analyse d'un fragment XML.
it: Non è possibile chiamare ResetState durante l'analisi di un frammento XML.
ja: XML フラグメントを解析するときに、ResetState を呼び出すことはできません。
ko: XML 조각을 구문 분석할 때 ResetState를 호출할 수 없습니다.
pl: Nie można wywołać elementu ResetState podczas analizy fragmentu XML.
pt_br: Não é possível chamar ResetState durante a análise de um fragmento XML.
ru: Невозможно вызвать ResetState во время разбора фрагмента XML.
tr: Bir XML parçası ayrıştırılırken ResetState çağrılamaz.
zh_hans: 在分析 XML 片段时无法调用 ResetState。
zh_hant: 剖析 XML 片段時不可呼叫 ResetState。

# Xml_InvalidRootData
source: Data at the root level is invalid.
cs: Data na kořenové úrovni jsou neplatná.
de: Die Daten auf der Stammebene sind ungültig.
es: Los datos del nivel de raíz no son válidos.
fr: Données non valides au niveau racine.
it: Sono stati rilevati dati non validi a livello di radice.
ja: ルート レベルのデータが無効です。
ko: 루트 수준에 잘못된 데이터가 있습니다.
pl: Dane na poziomie głównym są nieprawidłowe.
pt_br: Dados no nível raiz inválidos.
ru: Недопустимые данные на корневом уровне.
tr: Kök düzeyindeki veriler geçersiz.
zh_hans: 根级别上的数据无效。
zh_hant: 根層次的資料無效。

# Xml_InvalidSurrogateHighChar
source: Invalid high surrogate character (0x{0}). A high surrogate character must have a value from range (0xD800 - 0xDBFF).
cs: Neplatný znak z vysokého rozsahu náhradního páru (0x{0}). Znak z vysokého rozsahu náhradního páru musí mít hodnotu v rozsahu (0xD800–0xDBFF).
de: Ungültiges hohes Ersatzzeichen (0x{0}). Ein hohes Ersatzzeichen muss einen Wert im Bereich (0xD800 – 0xDBFF) aufweisen.
es: Carácter suplente alto no válido (0x{0}). Un carácter suplente alto debe tener un valor dentro del intervalo (0xD800 - 0xDBFF).
fr: Caractère de substitution étendu (0x{0}) non valide. Un caractère de substitution étendu doit avoir une valeur comprise dans la plage (0xD800 - 0xDBFF).
it: Carattere surrogato alto non valido: (0x{0}). Un carattere surrogato alto deve contenere un valore compreso nell'intervallo (0xD800 - 0xDBFF).
ja: 上位サロゲート文字 (0x{0}) が無効です。上位サロゲート文字は (0xD800 - 0xDBFF) の範囲の値である必要があります。
ko: high surrogate 문자(0x{0})가 잘못되었습니다. high surrogate 문자에는 범위 (0xD800 - 0xDBFF)의 값이 있어야 합니다.
pl: Nieprawidłowy znak zastępczy wysokiego poziomu (0x{0}). Znak zastępczy wysokiego poziomu musi mieć wartość z zakresu (0xD800–0xDBFF).
pt_br: Caractere alternativo alto inválido (0x{0}). Um caractere alternativo alto deve ter um valor no intervalo (0xD800 – 0xDBFF).
ru: Недействительный верхний суррогатный символ (0x{0}). Значение верхнего суррогатного символа должно быть в диапазоне (0xD800–0xDBFF).
tr: Üst yedek karakter (0x{0}) geçersiz. Üst yedek karakterin değeri (0xD800 - 0xDBFF) aralığında olmalıdır.
zh_hans: 无效的高代理项字符(0x{0})。高代理项字符必须具有范围(0xD800 - 0xDBFF)内的值。
zh_hant: 高代理字元 (0x{0}) 無效。高代理字元範圍必須是 (0xD800 - 0xDBFF)。

# Xml_InvalidSurrogateMissingLowChar
source: The surrogate pair is invalid. Missing a low surrogate character.
cs: Náhradní pár je neplatný. Chybí znak z nízkého rozsahu náhradního páru.
de: Das Ersatzzeichenpaar ist ungültig. Es fehlt ein niedriges Ersatzzeichen.
es: El par suplente no es válido. Falta un carácter suplente bajo.
fr: La paire de substitution est non valide. Il manque un caractère de substitution faible.
it: La coppia di surrogati non è valida. Manca un carattere surrogato basso.
ja: サロゲート ペアが無効です。下位サロゲート文字がありません。
ko: 서로게이트 쌍이 잘못되었습니다. 하위 서로게이트 문자가 없습니다.
pl: Para zastępcza jest nieprawidłowa. Brak znaku zastępczego niskiego poziomu.
pt_br: O par alternativo é inválido. Um caractere alternativo baixo está ausente.
ru: Недопустимая суррогатная пара. Пропущен младший символ-заместитель.
tr: Yedek çift geçersiz. Alt yedek karakter eksik.
zh_hans: 代理项对无效。缺少低代理项字符。
zh_hant: 代理字組無效。遺漏低代理字元。

# Xml_InvalidSurrogatePair
source: The surrogate pair is invalid.
cs: Náhradní pár je neplatný.
de: Das Ersatzzeichenpaar ist ungültig.
es: El par suplente no es válido.
fr: La paire de substitution est non valide.
it: La coppia di surrogati non è valida.
ja: サロゲート ペアが無効です。
ko: 서로게이트 쌍이 잘못되었습니다.
pl: Para dwuskładnikowa jest nieprawidłowa.
pt_br: O par alternativo é inválido.
ru: Недействительная суррогатная пара.
tr: Yedek çift geçersiz.
zh_hans: 代理项对无效。
zh_hant: 代理字組無效。

# Xml_InvalidSurrogatePairWithArgs
source: The surrogate pair (0x{0}, 0x{1}) is invalid. A high surrogate character (0xD800 - 0xDBFF) must always be paired with a low surrogate character (0xDC00 - 0xDFFF).
cs: Náhradní pár (0x{0}, 0x{1}) je neplatný. Znak z vysokého rozsahu náhradního páru (0xD800–0xDBFF) musí být vždy spárován se znakem z nízkého rozsahu náhradního páru (0xDC00–0xDFFF).
de: Das Ersatzzeichenpaar (0x{0}, 0x{1}) ist ungültig. Ein hohes Ersatzzeichen (0xD800 – 0xDBFF) muss immer mit einem niedrigen Ersatzzeichen (0xDC00 – 0xDFFF) ein Paar bilden.
es: El par suplente (0x{0}, 0x{1}) no es válido. Un carácter suplente alto (0xD800 - 0xDBFF) siempre debe tener como pareja un carácter suplente bajo (0xDC00 - 0xDFFF).
fr: Paire de substitution (0x{0}, 0x{1}) non valide. Un caractère de substitution élevé (0xD800 - 0xDBFF) doit toujours être associé à un caractère de substitution peu élevé (0xDC00 - 0xDFFF).
it: La coppia di surrogati (0x{0}, 0x{1}) non è valida. Un carattere surrogato alto (0xD800 - 0xDBFF) deve sempre essere abbinato a un carattere surrogato basso (0xDC00 - 0xDFFF).
ja: サロゲート ペア (0x{0}, 0x{1}) は無効です。大きなサロゲート文字 (0xD800 - 0xDBFF) は、常に小さなサロゲート文字 (0xDC00 - 0xDFFF) とペアになっている必要があります。
ko: 서로게이트 쌍(0x{0}, 0x{1})이 잘못되었습니다. high surrogate 문자(0xD800 - 0xDBFF)는 항상 하위 서로게이트 문자(0xDC00 - 0xDFFF)와 쌍을 이루어야 합니다.
pl: Para dwuskładnikowa (0x{0}, 0x{1}) jest nieprawidłowa. Wyższa część znaku (0xD800 - 0xDBFF) musi zawsze występować razem z niższą częścią znaku (0xDC00 - 0xDFFF).
pt_br: O par alternativo (0x{0}, 0x{1}) é inválido. Um caractere alternativo alto (0xD800 – 0xDBFF) deve ser sempre combinado com um caractere alternativo baixo (0xDC00 – 0xDFFF).
ru: Суррогатная пара (0x{0}, 0x{1}) недопустима. Старшему байту (0xD800–0xDBFF) должен всегда соответствовать младший байт (0xDC00–0xDFFF).
tr: Yedek çift (0x{0}, 0x{1}) geçersiz. Yüksek bir yedek karakter (0xD800 - 0xDBFF) her zaman düşük bir yedek karakterle (0xDC00 - 0xDFFF) eşleştirilmelidir.
zh_hans: 代理项对(0x{0}, 0x{1})无效。高代理项字符(0xD800 - 0xDBFF)必须始终与低代理项字符(0xDC00 - 0xDFFF)成对出现。
zh_hant: 代理字組 (0x{0}, 0x{1}) 不正確。高替代字元 (0xD800 - 0xDBFF) 一律必須與低替代字元 (0xDC00 - 0xDFFF) 配成對。
