Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_UndeclaredEntity
source: Reference to an undeclared entity, '{0}'.
cs: Odkaz na nedeklarovanou entitu {0}
de: Verweis auf eine nicht deklarierte Entität, "{0}".
es: Referencia a una entidad no declarada, "{0}".
fr: Référence à une entité non déclarée, '{0}'.
it: Riferimento a un'entità non dichiarata '{0}'.
ja: 宣言されていないエンティティ '{0}' を参照しています。
ko: 선언되지 않은 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej jednostki „{0}”.
pt_br: Referência a uma entidade não declarada, '{0}'.
ru: Ссылка на необъявленную сущность, "{0}".
tr: Bildirilmemiş bir '{0}' varlığına başvuru.
zh_hans: 引用未声明的实体“{0}”。
zh_hant: 參考未宣告的實體 '{0}'。

# Sch_UndeclaredEquivClass
source: Substitution group refers to '{0}', an undeclared element.
cs: Skupina nahrazení odkazuje na {0}, což je nedeklarovaný element.
de: Die Ersetzungsgruppe verweist auf "{0}", ein nicht deklariertes Element.
es: El grupo de sustitución hace referencia a "{0}", un elemento no declarado.
fr: Le groupe de substitution fait référence à '{0}', un élément non déclaré.
it: Il gruppo di sostituzione fa riferimento all'elemento non dichiarato '{0}'.
ja: 代替グループは宣言されていない要素 '{0}' を参照しています。
ko: 대체 그룹이 선언되지 않은 요소 '{0}'을(를) 참조합니다.
pl: Grupa podstawienia odwołuje się do niezadeklarowanego elementu „{0}”.
pt_br: Grupo de substituição faz referência a '{0}', um elemento não declarado.
ru: Группа подстановки содержит ссылку на необъявленный элемент "{0}".
tr: Değiştirme grubu bildirilmemiş olan '{0}' öğesine başvuruda bulunuyor.
zh_hans: 替换组引用未声明的元素“{0}”。
zh_hant: 替代群組參考了未宣告的元素 '{0}'。

# Sch_UndeclaredId
source: Reference to undeclared ID is '{0}'.
cs: Odkaz na nedeklarovaný identifikátor je {0}.
de: Der Verweis auf eine nicht deklarierte ID ist "{0}".
es: La referencia al identificador no declarado es "{0}".
fr: La référence à un ID non déclaré est '{0}'.
it: Il riferimento a un ID non dichiarato è '{0}'.
ja: 宣言されていない ID への参照は '{0}' です。
ko: 선언되지 않은 ID에 대한 참조는 '{0}'입니다.
pl: Odwołanie do niezadeklarowanego identyfikatora to „{0}”.
pt_br: A referência a uma ID não declarada é '{0}'.
ru: Ссылка на необъявленный идентификатор: "{0}".
tr: Bildirilmemiş ID için '{0}' başvurusu.
zh_hans: 对未声明的 ID 的引用是“{0}”。
zh_hant: 參考未宣告識別碼 '{0}'。

# Sch_UndeclaredIdentityConstraint
source: The '{0}' identity constraint is not declared.
cs: Omezení identity {0} není deklarováno.
de: Die {0}-Identitätseinschränkung wurde nicht deklariert.
es: No se ha declarado la restricción de identidad "{0}".
fr: La contrainte d'identité '{0}' n'est pas déclarée.
it: Il vincolo di identità '{0}' non è dichiarato.
ja: '{0}' ID 制約が宣言されていません。
ko: '{0}' identity 제약 조건이 선언되지 않았습니다.
pl: Ograniczenie tożsamości „{0}” nie zostało zadeklarowane.
pt_br: A restrição de identidade '{0}' não foi declarada.
ru: Ограничение по идентификатору "{0}" не объявлено.
tr: '{0}' kimlik kısıtlaması bildirilmedi.
zh_hans: 没有声明“{0}”标识约束。
zh_hant: 未宣告 '{0}' 身分識別條件約束。

# Sch_UndeclaredNotation
source: The '{0}' notation is not declared.
cs: Notace {0} není deklarovaná.
de: Die {0}-Notation wurde nicht deklariert.
es: No se ha declarado la notación "{0}".
fr: La notation '{0}' n'est pas déclarée.
it: La notazione '{0}' non è dichiarata.
ja: '{0}' 表記が宣言されていません。
ko: '{0}' 표기법이 선언되지 않았습니다.
pl: Notacja „{0}” nie została zadeklarowana.
pt_br: A notação '{0}' não foi declarada.
ru: Нотация "{0}" не объявлена.
tr: '{0}' yazım biçimi bildirilmedi.
zh_hans: 未声明“{0}”表示法。
zh_hant: 未宣告 '{0}' 標記法。

# Sch_UndeclaredSimpleType
source: Type '{0}' is not declared, or is not a simple type.
cs: Typ {0} není deklarován nebo se nejedná o jednoduchý typ.
de: Der Typ "{0}" wurde nicht deklariert oder ist kein einfacher Typ.
es: El tipo "{0}" no se ha declarado o no es un tipo simple.
fr: Le type '{0}' n'est pas déclaré ou n'est pas un type simple.
it: Il tipo '{0}' non è dichiarato o non è un tipo semplice.
ja: 型 '{0}' が宣言されていないか、または単純型ではありません。
ko: 형식 '{0}'이(가) 선언되지 않았거나 단순 형식이 아닙니다.
pl: Typ „{0}” nie został zadeklarowany lub nie jest typem prostym.
pt_br: O tipo '{0}' não é declarado ou não é um tipo simples.
ru: Тип "{0}" не объявлен или не является простым типом.
tr: '{0}' türü bildirilmemiş veya basit tür değil.
zh_hans: 类型“{0}”未声明或不是简单类型。
zh_hant: 類型 '{0}' 未宣告或不是簡單型別。

# Sch_UndeclaredType
source: Type '{0}' is not declared.
cs: Typ {0} není deklarován.
de: Der Typ "{0}" wurde nicht deklariert.
es: No se ha declarado el tipo "{0}".
fr: Le type '{0}' n'est pas déclaré.
it: Il tipo '{0}' non è dichiarato.
ja: 型 '{0}' は宣言されていません。
ko: 형식 '{0}'이(가) 선언되지 않았습니다.
pl: Typ „{0}” nie został zadeklarowany.
pt_br: O tipo '{0}' não é declarado.
ru: Тип "{0}" не объявлен.
tr: '{0}' türü bildirilmedi.
zh_hans: 未声明“{0}”类型。
zh_hant: 類型 '{0}' 未宣告。

# Sch_UndefAttributeGroupRef
source: Reference to undeclared attribute group '{0}'.
cs: Odkaz na nedeklarovanou skupinu atributů {0}
de: Verweis auf eine nicht deklarierte Attributgruppe "{0}".
es: Referencia a un grupo de atributos sin declarar "{0}".
fr: Référence au groupe d'attributs non déclaré '{0}'.
it: Riferimento al gruppo di attributi non dichiarato '{0}'.
ja: 宣言されていない属性グループ '{0}' への参照です。
ko: 선언되지 않은 특성 그룹 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej grupy atrybutów „{0}”.
pt_br: Referência a grupo de atributos não declarado '{0}'.
ru: Ссылка на необъявленную группу атрибутов "{0}".
tr: Bildirilmemiş '{0}' grubuna başvuru.
zh_hans: 对未声明的特性组“{0}”的引用。
zh_hant: 參考未宣告的屬性群組 '{0}'。

# Sch_UndefBaseExtension
source: Undefined complexType '{0}' is used as a base for complex type extension.
cs: Nedefinovaný typ complexType {0} je použit jako základ pro rozšíření složitého typu.
de: Der nicht definierte complexType "{0}" wird als Basis für die Erweiterung des komplexen Typs verwendet.
es: El elemento complexType "{0}" no definido se utiliza como base para una extensión de tipo complejo.
fr: Le complexType '{0}' non défini est utilisé comme base pour une extension de type complexe.
it: Come base per l'estensione di un tipo complesso viene usato l'elemento complexType non definito '{0}'.
ja: 未定義の complexType '{0}' が、複合型の拡張のベースとして使用されています。
ko: 정의되지 않은 complexType '{0}'이(가) 복합 형식 확장의 기본으로 사용됩니다.
pl: Niezdefiniowany element complexType „{0}” został użyty jako podstawa dla rozszerzenia typu złożonego.
pt_br: O complexType '{0}' indefinido é usado como base para extensão de tipo complexo.
ru: В качестве базы для расширения составного типа используется неопределенный complexType "{0}".
tr: Tanımlanmamış complexType '{0}' karmaşık tür uzantısı için temel olarak kullanıldı.
zh_hans: 未定义的 complexType“{0}”被用作复杂类型扩展的基。
zh_hant: 未定義的 complexType '{0}' 被用來當做複雜類型擴充的基底。

# Sch_UndefBaseRestriction
source: Undefined complexType '{0}' is used as a base for complex type restriction.
cs: Nedefinovaný typ complexType {0} je použit jako základ pro omezení složitého typu.
de: Der nicht definierte complexType "{0}" wird als Basis für die Einschränkung des komplexen Typs verwendet.
es: El elemento complexType "{0}" sin definir se utiliza como base para una restricción de tipo complejo.
fr: Le complexType '{0}' non défini est utilisé comme base pour une restriction de type complexe.
it: Come base per la restrizione di un tipo complesso viene usato l'elemento complexType non definito '{0}'.
ja: 未定義の complexType '{0}' が、複合型の制限のベースとして使用されています。
ko: 정의되지 않은 complexType '{0}'이(가) 복합 형식 제한의 기본으로 사용됩니다.
pl: Niezdefiniowany element complexType „{0}” został użyty jako podstawa dla ograniczenia typu złożonego.
pt_br: O complexType '{0}' indefinido é usado como base para restrição de tipo complexo.
ru: В качестве базы для ограничения составного типа используется неопределенный complexType "{0}".
tr: Tanımlanmamış complexType '{0}' karmaşık tür kısıtlaması için temel olarak kullanıldı.
zh_hans: 未定义的 complexType“{0}”被用作复杂类型限制的基。
zh_hant: 將尚未定義的 complexType '{0}' 用作複雜類型限制的基底。

# Sch_UndefGroupRef
source: Reference to undeclared model group '{0}'.
cs: Odkaz na nedeklarovanou skupinu modelů {0}
de: Verweis auf eine nicht deklarierte Modellgruppe "{0}".
es: Referencia a un grupo de modelos no declarado "{0}".
fr: Référence au groupe de modèles non déclaré '{0}'.
it: Riferimento al gruppo di modelli non dichiarato '{0}'.
ja: 宣言されていないモデル グループ '{0}' への参照です。
ko: 선언되지 않은 모델 그룹 '{0}'에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej grupy modelu „{0}”.
pt_br: Referência a grupo de modelo não declarado '{0}'.
ru: Ссылка на необъявленную группу моделей "{0}".
tr: Bildirilmemiş '{0}' model grubuna başvuru.
zh_hans: 对未声明模型组“{0}”的引用。
zh_hant: 參考未宣告的模型群組 '{0}'。

# Sch_UnexpressibleAnyAttribute
source: The 'anyAttribute' is not expressible.
cs: Atribut anyAttribute nelze vyjádřit.
de: Für "anyAttribute" ist kein Ausdruck verfügbar.
es: El elemento "anyAttribute" no se puede expresar.
fr: Impossible d'exprimer 'anyAttribute'.
it: L'elemento 'anyAttribute' non è esprimibile.
ja: 'anyAttribute' は、表現可能ではありません。
ko: 표현 가능한 'anyAttribute'가 아닙니다.
pl: Nie można wyrazić elementu „anyAttribute”.
pt_br: O 'anyAttribute' não pode ser expressado.
ru: Не поддающийся выражению anyAttribute.
tr: 'anyAttribute' ifade edilemez.
zh_hans: 该 "anyAttribute" 不可表示。
zh_hant: 'anyAttribute' 無法運算。

# Sch_UnionFailed
source: Union does not support this value.
cs: Sjednocení tuto hodnotu nepodporuje.
de: Union unterstützt diesen Wert nicht.
es: La unión no admite este valor.
fr: Union ne prend pas en charge cette valeur.
it: L'unione non supporta questo valore.
ja: union ではこの値をサポートしていません。
ko: Union은 이 값을 지원하지 않습니다.
pl: Unia nie obsługuje tej wartości.
pt_br: Union não dá suporte a esse valor.
ru: Объединение не поддерживает это значение.
tr: Birleşim bu değeri desteklemiyor.
zh_hans: 联合不支持此值。
zh_hant: 聯合不支援此值。

# Sch_UnionFailedEx
source: The value '{0}' is not valid according to any of the memberTypes of the union.
cs: Hodnota {0} není na základě libovolného atributu memberTypes elementu union platná.
de: Der Wert "{0}" ist gemäß den memberTypes der Union nicht gültig.
es: El valor "{0}" no es válido según los elementos memberTypes de la unión.
fr: Selon les memberTypes de l'union, la valeur '{0}' est non valide.
it: Il valore '{0}' non è valido in base agli elementi memberType dell'unione.
ja: union の memberTypes のいずれのデータ型に対しても、値 '{0}' は無効です。
ko: 값 '{0}'에서 Union의 모든 memberTypes가 잘못되었습니다.
pl: Wartość „{0}” nie jest prawidłowa dla żadnego z typów memberTypes unii.
pt_br: O valor '{0}' é inválido de acordo com nenhum dos memberTypes da união.
ru: Значение "{0}" не действительно ни для одного из типов, указанных в свойстве memberTypes объединения.
tr: '{0}' değeri, birleşimin hiçbir memberTypes'ına göre geçerli değil.
zh_hans: 根据联合的任何 memberTypes，值“{0}”无效。
zh_hant: 根據等位的任何 memberTypes，'{0}' 值無效。

# Sch_UnionFromUnion
source: It is an error if a union type has a member with variety union and this member cannot be substituted with its own members. This may be due to the fact that the union member is a restriction of a union with facets.
cs: Pokud typ union má člen s typem variety union a tento člen nelze nahradit vlastními členy, jedná se o chybu. Důvodem může být to, že člen union představuje omezení typu union s omezujícími vlastnostmi.
de: Wenn ein Union-Typ über einen Member mit Variety Union verfügt und dieser Member nicht durch seine eigenen Member ersetzt werden kann, tritt ein Fehler auf. Möglicherweise ist der Union-Member eine Einschränkung einer Union mit Facets.
es: Es un error que un tipo union tenga un miembro con una variable union y que este miembro no pueda reemplazarse por sus propios miembros. Esto puede deberse a que el miembro de union sea una restricción de una unión con facetas.
fr: Il s'agit d'une erreur si un type union a un membre avec une union de variété et si ce membre ne peut pas être remplacé par ses propres membres. Cela peut être dû au fait que le membre union est une restriction d'une union avec facettes.
it: Se un tipo di unione contiene un membro con unione di varietà, questo deve essere sostituibile con i propri membri. Un eventuale errore potrebbe essere dovuto al fatto che il membro dell'unione è una restrizione di un'unione con facet.
ja: 共用体型にさまざまな union を持つメンバーがあり、かつこのメンバーをその独自のメンバーで置き換えることができない場合は、エラーです。原因としては、union のメンバーが、ファセット群を持つ union の制限となっていることが考えられます。
ko: union 형식에 variety union 형식의 멤버가 있을 경우 해당 멤버를 고유 멤버로 대체할 수 없으면 오류가 발생합니다. 이러한 오류는 union 멤버가 패싯이 있는 union의 제한이 되는 패싯으로 인해 발생합니다.
pl: Jeśli typ unii ma składową z różnymi typami unii i tej składowej nie można zastąpić jej własnymi składowymi, występuje błąd. Jego przyczyną może być fakt, że składowa typu unii jest ograniczeniem typu unii z aspektami.
pt_br: Erro se um tipo de união tiver um membro com união de variedade e este não puder ser substituído por seus próprios membros. Isso pode ocorrer porque o membro da união é uma restrição de uma união com facetas.
ru: Является ошибкой, если тип union имеет член с variety union и он не может быть заменен своими собственными членами. Возможно, причина в том, что член объединения является ограничением объединения с аспектами.
tr: Birleşim türünün değişik birleşime sahip bir üyesi varsa ve bu üye kendi üyeleriyle değiştirilemiyorsa, bu bir hatadır. Bu, birleşim üyesinin modellere sahip bir birleşim kısıtlaması olmasından kaynaklanabilir.
zh_hans: 如果联合类型有包含各种联合的成员，并且该成员无法使用其自己的成员替换，则是错误的。这可能是因为该联合成员是对具有方面的联合的限制。
zh_hant: 若等位型別具有多種等位的成員，且此成員不可用本身的成員身分代替，即為錯誤。這可能是因為等位成員是具有 facet 的等位限制。

# Sch_UnknownContent
source: The content attribute must have a value of 'textOnly', 'eltOnly', 'mixed', or 'empty', not '{0}'.
cs: Atribut content musí mít hodnotu textOnly, eltOnly, mixed nebo empty, nikoli hodnotu {0}.
de: Das content-Attribut muss den Wert "textOnly", "eltOnly", "mixed" oder "empty" aufweisen, nicht "{0}".
es: El atributo de contenido debe tener un valor igual a "textOnly", "eltOnly", "mixed" o "empty", pero no "{0}".
fr: L'attribut content doit avoir la valeur 'textOnly', 'eltOnly', 'mixed' ou 'empty', et non '{0}'.
it: Il valore dell'attributo content deve essere 'textOnly', 'eltOnly', 'mixed' o empty, non '{0}'.
ja: content 属性には、'{0}' ではなく、値 'textOnly'、'eltOnly'、'mixed'、'empty' が必要です。
ko: content 특성의 값은 '{0}'이(가) 아니라 'textOnly', 'eltOnly', 'mixed' 또는 'empty'여야 합니다.
pl: Atrybut zawartości musi mieć wartość „textOnly”, „eltOnly”, „mixed” lub „empty”, ale nie „{0}”.
pt_br: O atributo content deve ter valor 'textOnly', 'eltOnly', 'mixed' ou 'empty', e não '{0}'.
ru: Атрибут содержимого может иметь значение textOnly, eltOnly, mixed или empty, но не "{0}".
tr: İçerik özniteliğinin değeri 'textOnly', 'eltOnly', 'mixed' veya 'empty' olmalıdır, '{0}' olamaz.
zh_hans: content 特性的值必须是 "textOnly"、"eltOnly"、"mixed" 或 "empty"，不能是“{0}”。
zh_hant: content 屬性的值必須是 textOnly、eltOnly、mixed 或 empty，但不可為 '{0}'。

# Sch_UnknownDtType
source: Reference to an unknown data type, '{0}'.
cs: Odkaz na neznámý datový typ {0}
de: Verweis auf einen unbekannten Datentyp, "{0}".
es: Referencia a un tipo de datos desconocido, "{0}".
fr: Référence à un type de données inconnu, '{0}'.
it: Riferimento a un tipo di dati sconosciuto '{0}'.
ja: 不明なデータ型 '{0}' への参照です。
ko: 알 수 없는 데이터 형식 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieznanego typu danych „{0}”.
pt_br: Referência a um tipo de dados desconhecido, '{0}'.
ru: Ссылка на неизвестный тип данных, "{0}".
tr: Bilinmeyen '{0}' veri türüne başvuru.
zh_hans: 对未知数据类型“{0}”的引用。
zh_hant: 參考未知的資料類型 '{0}'。

# Sch_UnknownFacet
source: This is an unknown facet.
cs: Toto je neznámá omezující vlastnost.
de: Unbekanntes Facet.
es: Esta faceta es desconocida.
fr: Facette inconnue.
it: Questo è un facet sconosciuto.
ja: 不明なファセットです。
ko: 알 수 없는 패싯입니다.
pl: To jest nieznany aspekt.
pt_br: Faceta desconhecida.
ru: Является неизвестным аспектом.
tr: Bu bilinmeyen bir model.
zh_hans: 这是一个未知方面。
zh_hant: 這是未知的 Facet。

# Sch_UnknownModel
source: The model attribute must have a value of open or closed, not '{0}'.
cs: Atribut model musí mít hodnotu open nebo closed, nikoli hodnotu {0}.
de: Das model-Attribut muss den Wert "open" oder "closed" aufweisen, nicht "{0}".
es: El atributo model debe tener un valor igual a open o closed, pero no "{0}".
fr: L'attribut model doit avoir la valeur open ou closed, et non '{0}'.
it: Il valore dell'attributo model deve essere open o closed, non '{0}'.
ja: model 属性には、'{0}' ではなく、値 open または close が必要です。
ko: model 특성의 값은 '{0}'이(가) 아니라 open 또는 closed여야 합니다.
pl: Atrybut modelu musi mieć wartość open lub closed, nie „{0}”.
pt_br: O atributo model deve ter valor open ou closed, e não '{0}'.
ru: Атрибут модели может иметь значение open или closed, но не "{0}".
tr: Model özniteliğinin değeri open veya closed olmalıdır, '{0}' olamaz.
zh_hans: model 特性的值必须是 open 或 closed，不能是“{0}”。
zh_hant: model 屬性必須有屬於 open 或 closed 的值，但非 '{0}' 的值。

# Sch_UnknownOrder
source: The order attribute must have a value of 'seq', 'one', or 'many', not '{0}'.
cs: Atribut order musí mít hodnotu seq, one nebo many, nikoli hodnotu {0}.
de: Das order-Attribut muss den Wert "seq", "one" oder "many" aufweisen, nicht "{0}".
es: El atributo order debe tener un valor igual a "seq", "one" o "many", pero no "{0}".
fr: L'attribut order doit avoir la valeur 'seq', 'one' ou 'many', et non '{0}'.
it: Il valore dell'attributo order deve essere 'seq', 'one' o 'many', non '{0}'.
ja: order 属性には、'{0}' ではなく、値として 'seq'、'one' または 'many' が必要です。
ko: order 특성의 값은 '{0}'이(가) 아니라 'seq', 'one' 또는 'many'여야 합니다.
pl: Atrybut kolejności musi mieć wartość „seq”, „one” lub „many”, ale nie „{0}”.
pt_br: O atributo order deve ter valor 'seq', 'one' ou 'many', e não '{0}'.
ru: Атрибут порядка может иметь значение seq, one или many, но не "{0}".
tr: Order özniteliğinin değeri 'seq', 'one' veya 'many' olmalıdır, '{0}' olamaz.
zh_hans: order 特性的值必须是 "seq"、"one" 或 "many"，不能是“{0}”。
zh_hant: order 屬性的值必須是 'seq'、'one' 或 'many' 但不能是 '{0}'。

# Sch_UnknownRequired
source: The required attribute must have a value of yes or no.
cs: Atribut required musí mít hodnotu yes nebo no.
de: Das required-Attribut muss den Wert "yes" oder "no" aufweisen.
es: El atributo required debe tener un valor igual a yes o no.
fr: L'attribut required doit avoir la valeur yes ou no.
it: Il valore dell'attributo required deve essere yes o no.
ja: required 属性には値 yes または no が必要です。
ko: required 특성의 값은 yes 또는 no여야 합니다.
pl: Wymagany atrybut musi mieć wartość yes lub no.
pt_br: O atributo required deve ter valor yes ou no.
ru: Обязательный атрибут должен иметь значение yes или no.
tr: Required özniteliğinin değeri yes veya no olmalıdır.
zh_hans: 必需的特性的值必须是 yes 或 no。
zh_hant: required 屬性必須有屬於 yes 或 no 的值。

# Sch_UnparsedEntityRef
source: Reference to an unparsed entity, '{0}'.
cs: Odkaz na neparsovanou entitu {0}
de: Verweis auf eine nicht analysierte Entität, "{0}".
es: Referencia a una entidad sin analizar, "{0}".
fr: Référence à une entité non analysée, '{0}'.
it: Riferimento a un'entità non analizzata '{0}'.
ja: 未解析のエンティティ '{0}' への参照です。
ko: 구문 분석되지 않은 엔터티 '{0}'에 대한 참조입니다.
pl: Odwołanie do nieanalizowanej jednostki „{0}”.
pt_br: Referência a uma entidade não analisada, '{0}'.
ru: Ссылка на неразобранную сущность, "{0}".
tr: Ayrıştırılmamış '{0}' varlığı başvurusu.
zh_hans: 对未分析实体“{0}”的引用。
zh_hant: 未剖析實體 '{0}' 的參考。

# Sch_UnrefNS
source: Namespace '{0}' is not available to be referenced in this schema.
cs: Na obor názvů {0} nelze odkazovat v tomto schématu.
de: In diesem Schema kann nicht auf den Namespace "{0}" verwiesen werden.
es: El espacio de nombres "{0}" no está disponible para hacer una referencia en este esquema.
fr: L'espace de noms '{0}' n'est pas disponible pour être référencé dans ce schéma.
it: Lo spazio dei nomi '{0}' non può essere usato come riferimento in questo schema.
ja: 名前空間 '{0}' はこのスキーマでの参照には使用できません。
ko: 네임스페이스 '{0}'을(를) 이 스키마에서 참조할 수 없습니다.
pl: Przestrzeń nazw „{0}” jest niedostępna dla odwołań w tym schemacie.
pt_br: O namespace '{0}' não está disponível para ser referenciado neste esquema.
ru: Пространство имен "{0}" недоступно для ссылок в этой схеме.
tr: '{0}' ad alanı bu şemada başvurulmak üzere kullanılamaz.
zh_hans: 在此架构中不能引用命名空间“{0}”。
zh_hant: 不可在此結構描述中參考命名空間 '{0}'。

# Sch_UnresolvedKeyref
source: The key sequence '{0}' in '{1}' Keyref fails to refer to some key.
cs: Sekvence klíče {0} v elementu Keyref {1} neodkazuje na žádný klíč.
de: Die Schlüsselsequenz "{0}" in Keyref "{1}" verweist nicht auf einen Schlüssel.
es: Error en la secuencia de clave "{0}" en Keyref "{1}" al hacer referencia a alguna clave.
fr: La séquence de clés '{0}' dans Keyref '{1}' ne fait référence à aucune clé.
it: La sequenza di chiave '{0}' presente nell'elemento Keyref '{1}' non può fare riferimento a una chiave.
ja: '{1}' Keyref のキー シーケンス '{0}' が参照できないキーがあります。
ko: '{1}' Keyref의 키 시퀀스 '{0}'이(가) 다른 키를 참조하지 못했습니다.
pl: Sekwencja klucza „{0}” w elemencie Keyref „{1}” nie może odwołać się do pewnego klucza.
pt_br: A sequência de chaves '{0}' em Keyref '{1}' não pôde fazer referência a alguma chave.
ru: Последовательность ключей "{0}" в "{1}" Keyref не ссылается на какой-либо ключ.
tr: '{1}' Keyref'i içindeki '{0}' anahtar sıralaması bir anahtara başvuramıyor.
zh_hans: “{1}”Keyref 中的键序列“{0}”未能引用某个键。
zh_hant: '{1}' Keyref 中的索引鍵序列 '{0}' 無法參考某個索引鍵。

# Sch_UnresolvedPrefix
source: The prefix '{0}' in XPath cannot be resolved.
cs: Nelze přeložit předponu {0} ve výrazu XPath.
de: Das Präfix "{0}" in XPath kann nicht aufgelöst werden.
es: No se puede resolver el prefijo "{0}" en XPath.
fr: Impossible de résoudre le préfixe '{0}' dans XPath.
it: Non è possibile risolvere il prefisso '{0}' in XPath.
ja: XPath のプレフックス '{0}' を解決できません。
ko: XPath의 접두사 '{0}'을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać prefiksu „{0}” w elemencie XPath.
pt_br: O prefixo '{0}' em XPath não pode ser resolvido.
ru: Невозможно разрешить префикс "{0}" в XPath.
tr: XPath içindeki '{0}' öneki çözümlenemiyor.
zh_hans: 无法解析 XPath 中的前缀“{0}”。
zh_hant: 無法解析 XPath 中的前置詞 '{0}'。

# Sch_UnsupportedAttribute
source: The '{0}' attribute is not supported in this context.
cs: Atribut {0} není v tomto kontextu podporován.
de: Das {0}-Attribut wird in diesem Kontext nicht unterstützt.
es: El atributo "{0}" no es compatible en este contexto.
fr: L'attribut '{0}' n'est pas pris en charge dans ce contexte.
it: L'attributo '{0}' non è supportato in questo contesto.
ja: '{0}' 属性はこのコンテキストではサポートされません。
ko: 이 컨텍스트에서는 '{0}' 특성을 지원하지 않습니다.
pl: Atrybut „{0}” nie jest obsługiwany w tym kontekście.
pt_br: Este contexto não dá suporte para o atributo '{0}'.
ru: Атрибут "{0}" в этом контексте не поддерживается.
tr: '{0}' özniteliği bu bağlamda desteklenmez.
zh_hans: 此上下文中不支持“{0}”特性。
zh_hant: 此內容中不支援 '{0}' 屬性。

# Sch_UnsupportedElement
source: The '{0}' element is not supported in this context.
cs: Element {0} není v tomto kontextu podporován.
de: Das {0}-Element wird in diesem Kontext nicht unterstützt.
es: El elemento "{0}" no es compatible en este contexto.
fr: L'élément '{0}' n'est pas pris en charge dans ce contexte.
it: L'elemento '{0}' non è supportato in questo contesto.
ja: '{0}' 要素はこのコンテキストではサポートされません。
ko: 이 컨텍스트에서는 '{0}' 요소를 지원하지 않습니다.
pl: Element „{0}” nie jest obsługiwany w tym kontekście.
pt_br: Este contexto não dá suporte para o elemento '{0}'.
ru: Элемент "{0}" в этом контексте не поддерживается.
tr: '{0}' öğesi bu bağlamda desteklenmez.
zh_hans: 此上下文中不支持“{0}”元素。
zh_hant: 此內容中不支援 '{0}' 元素。
