Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlConstructorHasSecurityAttributes
source: The type '{0}' cannot be serialized because its parameterless constructor is decorated with declarative security permission attributes. Consider using imperative asserts or demands in the constructor.
cs: Typ {0} nelze serializovat, protože jeho konstruktor bez parametrů je dekorován deklarativními atributy oprávnění zabezpečení. Zvažte možnost použít v konstruktoru nepodmíněné výrazy nebo požadavky.
de: Der Typ "{0}" kann nicht serialisiert werden, da der parameterlose Konstruktor deklarative Sicherheitsberechtigungsattribute aufweist. Verwenden Sie imperative Assertionen oder Anforderungen im Konstruktor.
es: No se puede serializar el tipo "{0}" porque el constructor sin parámetros está decorado con atributos de permiso de seguridad declarativa. Intente utilizar aserciones imperativas o peticiones en el constructor.
fr: Impossible de sérialiser le type '{0}', car son constructeur sans paramètre est décoré avec des attributs d'autorisation de sécurité déclaratifs. Pensez à utiliser des assertions ou des demandes impératives dans le constructeur.
it: Il tipo '{0}' non può essere serializzato perché il costruttore senza parametri è decorato con attributi di autorizzazione della sicurezza dichiarativi. Provare a usare richieste o asserzioni imperative nel costruttore.
ja: 型 '{0}' をシリアル化できません。パラメーターなしのコンストラクターが宣言型セキュリティのアクセス許可属性で修飾されています。代わりに、命令型のアサートか要求をコンストラクターで使用してください。
ko: {0}' 형식의 매개 변수 없는 생성자가 선언적 보안 권한 특성으로 데코레이트되었으므로 이 형식을 직렬화할 수 없습니다. 생성자에 필수적인 어설션 또는 요구를 사용하세요.
pl: Typ „{0}” nie może być serializowany, ponieważ jego bezparametrowy konstruktor ma deklaratywne atrybuty uprawnień zabezpieczeń. Rozważ możliwość użycia deklaracji rozkazujących lub żądań w konstruktorze.
pt_br: O tipo '{0}' não pode ser serializado porque seu construtor sem parâmetros está decorado com atributos de permissão de segurança declarativa. Considere usar declarações ou demandas no construtor.
ru: Невозможно сериализовать тип "{0}", так как его конструктор без параметров снабжен декларативными атрибутами разрешений безопасности. Попробуйте использовать в конструкторе императивные утверждения или требования.
tr: Parametresiz oluşturucusu bildirim güvenliği izin öznitelikleri ile donatılmış olduğundan '{0}' türü serileştirilemiyor. Oluşturucuda zorunlu onay belirtimleri veya istekler kullanmayı deneyin.
zh_hans: 类型“{0}”无法序列化，因为其无参数构造函数是用声明性安全权限特性修饰的。请考虑在构造函数中使用命令性断言或请求。
zh_hant: 因為類型 '{0}' 的無參數建構函式使用了宣告式的安全性使用權限屬性，所以無法進行序列化。請考慮改用在建構函式中必要的判斷提示或是需求。

# XmlConstructorInaccessible
source: {0} cannot be serialized because it does not have a parameterless constructor.
cs: Typ {0} nelze serializovat, protože nemá konstruktor bez parametrů.
de: {0} kann nicht serialisiert werden, weil kein parameterloser Konstruktor vorhanden ist.
es: No se puede serializar {0} porque no tiene un constructor sin parámetros.
fr: Impossible de sérialiser {0}, car il n'a pas de constructeur sans paramètre.
it: Non è possibile serializzare {0} perché non contiene un costruttore senza parametri.
ja: {0} にはパラメーターを持たないコンストラクターが含まれていないため、これをシリアル化することはできません。
ko: {0}에는 매개 변수 없는 생성자가 없으므로 직렬화할 수 없습니다.
pl: Element {0} nie może być serializowany, ponieważ nie ma domyślnego konstruktora bez parametrów.
pt_br: {0} não pode ser serializado porque não tem um construtor sem parâmetros.
ru: Невозможно сериализовать {0}, так как у него нет конструктора без параметров.
tr: Parametresiz oluşturucusu olmadığından {0} serileştirilemiyor.
zh_hans: {0} 无法序列化，因为它没有无参数的构造函数。
zh_hant: 因為 {0} 沒有無參數的建構函式，所以無法序列化。

# XmlConvert_BadFormat
source: The string '{0}' is not a valid {1} value.
cs: Řetězec {0} nepředstavuje platnou hodnotu {1}.
de: Die Zeichenfolge "{0}" ist kein gültiger {1}-Wert.
es: La cadena "{0}" no es un valor {1} válido.
fr: La chaîne '{0}' n'est pas une valeur {1} valide.
it: La stringa '{0}' non è un valore {1} valido.
ja: 文字列 '{0}' は {1} の有効な値ではありません。
ko: 문자열 '{0}'이(가) 유효한 {1} 값이 아닙니다.
pl: Ciąg „{0}” nie jest prawidłową wartością {1}.
pt_br: A cadeia de caracteres '{0}' não é um valor {1} válido.
ru: Строка "{0}" не является допустимым значением {1}.
tr: '{0}' dizesi geçerli bir {1} değeri değil.
zh_hans: 字符串“{0}”不是有效的 {1} 值。
zh_hant: 字串 '{0}' 不是有效的 {1} 值。

# XmlConvert_BadUri
source: The string was not recognized as a valid Uri.
cs: Řetězec nebyl rozpoznán jako platný identifikátor URI.
de: Die Zeichenfolge wurde nicht als gültiger URI erkannt.
es: No se ha reconocido la cadena como Uri válido.
fr: La chaîne n'a pas été reconnue en tant qu'Uri valide.
it: La stringa non è stata riconosciuta come un valore Uri valido.
ja: 有効な Uri として文字列が認識されませんでした。
ko: 문자열을 유효한 Uri로 인식할 수 없습니다.
pl: Ciąg nie został rozpoznany jako prawidłowy identyfikator Uri.
pt_br: A cadeia de caracteres não foi reconhecida como um URI válido.
ru: Строка не распознана в качестве действительного Uri.
tr: Dize geçerli bir Uri olarak tanınmadı.
zh_hans: 该字符串无法识别为有效的 Uri。
zh_hant: 字串沒有像有效 Uri 一樣識別。

# XmlConvert_NotOneCharString
source: String must be exactly one character long.
cs: Řetězec musí mít délku přesně jeden znak.
de: Die Zeichenfolge muss genau ein Zeichen lang sein.
es: La cadena debe contener exactamente un carácter.
fr: La chaîne doit avoir une longueur d'un et un seul caractère.
it: La stringa deve essere composta da un solo carattere.
ja: 文字列には 1 文字しか使用できません。
ko: 문자열의 길이는 1자여야 합니다.
pl: Ciąg musi zawierać dokładnie jeden znak.
pt_br: A cadeia de caracteres deve ter exatamente um caractere de comprimento.
ru: Строка должна содержать один и только один символ.
tr: Dize tam olarak bir karakter uzunluğunda olmalıdır.
zh_hans: 字符串的长度必须正好为一个字符。
zh_hant: 字串的長度必須為一個字元。

# XmlConvert_Overflow
source: Value '{0}' was either too large or too small for {1}.
cs: Hodnota {0} je pro typ {1} buď příliš velká, nebo příliš malá.
de: Der Wert "{0}" war für {1} entweder zu groß oder zu klein.
es: El valor "{0}" era demasiado grande o demasiado pequeño para {1}.
fr: La valeur '{0}' est trop élevée ou trop faible pour {1}.
it: Il valore '{0}' è troppo grande o troppo piccolo per {1}.
ja: 値 '{0}' が {1} に対して大きすぎるか、小さすぎます。
ko: 값 '{0}'은(는) {1}에 너무 크거나 너무 작습니다.
pl: Wartość „{0}” była za duża lub za mała dla elementu {1}.
pt_br: O valor '{0}' era grande ou pequeno demais para {1}.
ru: Значение "{0}" недопустимо мало или недопустимо велико для {1}.
tr: '{0}' değeri, {1} için çok büyük veya çok küçük.
zh_hans: 值“{0}”对 {1} 不是太大就是太小。
zh_hant: 值 '{0}' 對 {1} 太大或太小。

# XmlConvert_TypeBadMapping
source: Xml type '{0}' does not support Clr type '{1}'.
cs: Typ Xml {0} nepodporuje typ Clr {1}.
de: Der XML-Typ "{0}" unterstützt nicht den CLR-Typ "{1}".
es: El tipo Xml "{0}" no admite el tipo Clr "{1}".
fr: Le type Xml '{0}' ne prend pas en charge le type Clr '{1}'.
it: Il tipo Xml '{0}' non supporta il tipo Clr '{1}'.
ja: XML 型 '{0}' は、Clr 型 '{1}' をサポートしていません。
ko: Xml 형식 '{0}'은(는) Clr 형식 '{1}'을(를) 지원하지 않습니다.
pl: Typ XML „{0}” nie obsługuje typu Clr „{1}”.
pt_br: O tipo XML '{0}' não dá suporte ao tipo CLR '{1}'.
ru: Тип Xml "{0}" не поддерживает тип Clr "{1}".
tr: '{0}' Xml türü, '{1}' Clr türünü desteklemiyor.
zh_hans: Xml 类型“{0}”不支持 Clr 类型“{1}”。
zh_hant: Xml 類型 '{0}' 不支援 Clr 類型 '{1}'。

# XmlConvert_TypeBadMapping2
source: Xml type '{0}' does not support a conversion from Clr type '{1}' to Clr type '{2}'.
cs: Typ Xml {0} nepodporuje převod z typu Clr {1} na typ Clr {2}.
de: Der XML-Typ "{0}" unterstützt eine Konvertierung des CLR-Typs "{1}" in den CLR-Typ "{2}" nicht.
es: El tipo Xml "{0}" no admite conversión de tipo Clr "{1}" a tipo Clr "{2}".
fr: Le type Xml '{0}' ne prend en charge aucune conversion du type Clr '{1}' en type Clr '{2}'.
it: Il tipo Xml '{0}' non supporta una conversione da un tipo Clr '{1}' a un tipo Clr '{2}'.
ja: Xml 型 '{0}' は、Clr 型 '{1}' から Clr 型 '{2}' への変換をサポートしていません。
ko: Xml 형식 '{0}'은(는) Clr 형식 '{1}'에서 Clr 형식 '{2}'(으)로의 변환을 지원하지 않습니다.
pl: Typ XML „{0}” nie obsługuje konwersji z typu Clr „{1}” na typ Clr „{2}”.
pt_br: O tipo XML '{0}' não dá suporte à conversão do tipo CLR '{1}' no tipo CLR '{2}'.
ru: Тип Xml "{0}" не поддерживает преобразование из типа Clr "{1}" в тип Clr "{2}".
tr: '{0}' Xml türü '{1}' Clr türü veya '{2}' Clr türünden dönüştürmeyi desteklemiyor.
zh_hans: Xml 类型“{0}”不支持从 Clr 类型“{1}”转换为 Clr 类型“{2}”。
zh_hant: Xml 類型 '{0}' 不支援由 Clr 類型 '{1}' 轉換為 Clr 類型 '{2}'。

# XmlConvert_TypeFromString
source: Xml type '{0}' cannot convert to Clr type '{1}' unless the source value is a String or an XmlAtomicValue.
cs: Typ Xml {0} nelze převést na typ Clr {1}, pokud zdrojová hodnota je String nebo XmlAtomicValue.
de: Der XML-Typ "{0}" kann nur dann in den CLR-Typ "{1}" konvertiert werden, wenn der Quellwert eine Zeichenfolge oder ein XmlAtomicValue ist.
es: El tipo Xml "{0}" no se puede convertir a tipo Clr "{1}" salvo que el valor de origen sea String o XmlAtomicValue.
fr: Le type Xml '{0}' ne peut pas être converti en type Clr '{1}' sauf si la valeur source est de type String ou XmlAtomicValue.
it: Il tipo Xml '{0}' non può essere convertito nel tipo Clr '{1}' a meno che il valore di origine non sia String o XmlAtomicValue.
ja: ソース値が String か XmlAtomicValue でない限り、Xml 型 '{0}' を Clr 型 '{1}' に変換することはできません。
ko: Xml 형식 '{0}'은(는) 소스 값이 String이나 XmlAtomicValue가 아닌 경우 Clr 형식 '{1}'으(로) 변환할 수 없습니다.
pl: Typ XML „{0}” nie obsługuje konwersji na typ Clr „{1}”, chyba że wartość źródłowa to element String lub XmlAtomicValue.
pt_br: O tipo XML '{0}' não pode converter no tipo CLR '{1}', a menos que o valor de origem seja uma Cadeia de Caracteres ou XmlAtomicValue.
ru: Тип Xml "{0}" не поддерживает преобразование в тип Clr "{1}", кроме случаев, когда исходное значение является String или XmlAtomicValue.
tr: '{0}' Xml türü, kaynak değeri String veya XmlAtomicValue olmadığı sürece '{1}' Clr türüne dönüştürülemez.
zh_hans: Xml 类型“{0}”无法转换为 Clr 类型“{1}”，除非源值为 String 或 XmlAtomicValue。
zh_hant: Xml 類型 '{0}' 無法轉換為 Clr 類型 '{1}'，除非來源值為 String 或 XmlAtomicValue。

# XmlConvert_TypeListBadMapping
source: Xml type 'List of {0}' does not support Clr type '{1}'.
cs: Typ Xml List of {0} nepodporuje typ Clr {1}.
de: Der XML-Typ "List of {0}" unterstützt nicht den CLR-Typ "{1}".
es: El tipo Xml "Lista de {0}" no admite tipo Clr "{1}".
fr: Le type Xml 'List of {0}' ne prend pas en charge le type Clr '{1}'.
it: Il tipo Xml 'List of {0}' non supporta il tipo Clr '{1}'.
ja: Xml 型 '{0} の一覧' は、Clr 型 '{1}' をサポートしていません。
ko: Xml 형식 '{0} 목록'은 Clr 형식 '{1}'을(를) 지원하지 않습니다.
pl: Typ XML o nazwie „List of {0}” nie obsługuje typu Clr „{1}”.
pt_br: O tipo XML 'Lista de {0}' não dá suporte ao tipo CLR '{1}'.
ru: Тип Xml "List of {0}" не поддерживает тип Clr "{1}".
tr: 'List of {0}' Xml türü '{1}' Clr türünü desteklemiyor.
zh_hans: Xml 类型“{0} 的列表”不支持 Clr 类型“{1}”。
zh_hant: Xml 類型 'List of {0}' 不支援 Clr 類型 '{1}'。

# XmlConvert_TypeListBadMapping2
source: Xml type 'List of {0}' does not support a conversion from Clr type '{1}' to Clr type '{2}'.
cs: Typ Xml List of {0} nepodporuje převod z typu Clr {1} na typ Clr {2}.
de: Der XML-Typ "List of {0}" unterstützt eine Konvertierung des CLR-Typs "{1}" in den CLR-Typ "{2}" nicht.
es: El tipo Xml "Lista de {0}" no admite conversión de tipo Clr "{1}" a tipo Clr "{2}".
fr: Le type Xml 'List of {0}' ne prend en charge aucune conversion du type Clr '{1}' au type Clr '{2}'.
it: Il tipo Xml 'List of {0}' non supporta la conversione dal tipo Clr '{1}' al tipo Clr '{2}'.
ja: Xml 型 '{0} の一覧' は、Clr 型 '{1}' から Clr 型 '{2}' への変換をサポートしていません。
ko: Xml 형식 '{0} 목록'은 Clr 형식 '{1}'에서 Clr 형식 '{2}'(으)로의 변환을 지원하지 않습니다.
pl: Typ XML o nazwie „List of {0}” nie obsługuje konwersji typu Clr „{1}” na typ Clr „{2}”.
pt_br: O tipo XML 'Lista de {0}' não dá suporte à conversão do tipo CLR '{1}' no tipo CLR '{2}'.
ru: Тип Xml "List of {0}" не поддерживает преобразование из типа Clr "{1}" в тип Clr "{2}".
tr: 'List of {0}' Xml türü, '{1}' Clr türünden '{2}' Clr türüne dönüştürmeyi desteklemiyor.
zh_hans: Xml 类型“{0} 的列表”不支持从 Clr 类型“{1}”转换为 Clr 类型“{2}”。
zh_hant: Xml 類型 'List of {0}' 不支援由 Clr 類型 '{1}' 轉換為 Clr 類型 '{2}'。

# XmlConvert_TypeNoNamespace
source: The String '{0}' cannot be represented as an XmlQualifiedName. A namespace for prefix '{1}' cannot be found.
cs: String {0} nejde reprezentovat jako XmlQualifiedName. Obor názvů pro předponu {1} nejde najít.
de: String "{0}" kann nicht als XmlQualifiedName dargestellt werden. Es wurde kein Namespace für das Präfix "{1}" gefunden.
es: No se puede representar String "{0}" como XmlQualifiedName. No se encuentra un espacio de nombres para el prefijo "{1}".
fr: La valeur String '{0}' ne peut pas être représentée en tant que XmlQualifiedName. Aucun espace de noms correspondant au préfixe '{1}' n'a été trouvé.
it: L'elemento String '{0}' non può essere rappresentata come elemento XmlQualifiedName. Non è stato trovato alcuno spazio dei nomi per il prefisso '{1}'.
ja: String '{0}' を XmlQualifiedName として表すことはできません。プレフィックス '{1}' の名前空間が見つかりません。
ko: String '{0}'은(는) XmlQualifiedName으로 나타낼 수 없습니다. 접두사 '{1}'의 네임스페이스를 찾을 수 없습니다.
pl: Element String „{0}” nie może być reprezentowany przez nazwę XmlQualifiedName. Nie można odnaleźć przestrzeni nazw dla prefiksu „{1}”.
pt_br: Não é possível representar a String '{0}' como um XmlQualifiedName. Não é possível encontrar o namespace do prefixo '{1}'.
ru: Строка String "{0}" не может быть представлена в виде XmlQualifiedName. Не удается найти пространство имен для префикса "{1}".
tr: '{0}' String'i XmlQualifiedName olarak gösterilemez. '{1}' ön ekine yönelik ad alanı bulunamıyor.
zh_hans: String“{0}”无法表示为 XmlQualifiedName。找不到前缀“{1}”的命名空间。
zh_hant: String '{0}' 無法用於代表 XmlQualifiedName。找不到前置詞 '{1}' 的命名空間。

# XmlConvert_TypeNoPrefix
source: The QName '{0}' cannot be represented as a String. A prefix for namespace '{1}' cannot be found.
cs: Název QName {0} nelze reprezentovat jako typ String. Předponu pro obor názvů {1} nelze najít.
de: Der QName "{0}" kann nicht als Zeichenfolge dargestellt werden. Es wurde kein Präfix für den Namespace "{1}" gefunden.
es: No se puede representar QName "{0}" como String. No se puede encontrar un prefijo para el espacio de nombres "{1}".
fr: Le QName '{0}' ne peut pas être représenté en tant que String. Aucun préfixe correspondant à l'espace de noms '{1}' n'a été trouvé.
it: L'elemento QName '{0}' non può essere rappresentato come String. Non è stato trovato alcun prefisso per lo spazio dei nomi '{1}'.
ja: QName '{0}' を文字列として表すことはできません。名前空間 '{1}' のプレフィックスが見つかりません。
ko: QName '{0}'은(는) String으로 나타낼 수 없습니다. 네임스페이스 '{1}'의 접두사를 찾을 수 없습니다.
pl: Nazwa QName „{0}” nie może być reprezentowana przez ciąg (String). Nie można odnaleźć prefiksu dla przestrzeni nazw „{1}”.
pt_br: Não é possível representar QName '{0}' como Cadeia de Caracteres. Não é possível encontrar o prefixo do namespace '{1}'.
ru: QName "{0}" не может быть представлено в виде строки String. Не удается найти префикс для пространства имен "{1}".
tr: QName '{0}' String olarak gösterilemez. '{1}' ad alanına yönelik önek bulunamıyor.
zh_hans: QName“{0}”无法表示为 String。找不到命名空间“{1}”的前缀。
zh_hant: QName '{0}' 無法代表 String。無法找到命名空間 '{1}' 的前置詞。

# XmlConvert_TypeToString
source: Xml type '{0}' cannot convert from Clr type '{1}' unless the destination type is String or XmlAtomicValue.
cs: Typ Xml {0} nelze převést z typu Clr {1}, pokud cílovým typem není String nebo XmlAtomicValue.
de: Der XML-Typ "{0}" kann nur dann aus dem CLR-Typ "{1}" konvertiert werden, wenn der Zieltyp eine Zeichenfolge oder ein XmlAtomicValue ist.
es: No se puede convertir el tipo Xml "{0}" a tipo Clr "{1}" salvo que el tipo de destino sea String o XmlAtomicValue.
fr: Le type Xml '{0}' ne peut pas être converti en type Clr '{1}' sauf si le type de destination est String ou XmlAtomicValue.
it: Il tipo Xml '{0}' non può essere convertito dal tipo Clr '{1}' a meno che il tipo di destinazione non sia String o XmlAtomicValue.
ja: 変換後の型が String または XmlAtomicValue でない限り、Xml 型 '{0}' を Clr 型 '{1}' から変換することはできません。
ko: Xml 형식 '{0}'은(는) 대상 형식이 String이나 XmlAtomicValue가 아닌 경우 Clr 형식 '{1}'에서 변환할 수 없습니다.
pl: Typ XML „{0}” nie może być wynikiem konwersji typu Clr „{1}”, chyba że docelowy typ danych to element String lub XmlAtomicValue.
pt_br: O tipo XML '{0}' não pode converter do tipo CLR '{1}', a menos que o tipo de destino seja uma Cadeia de Caracteres ou XmlAtomicValue.
ru: Тип Xml "{0}" не поддерживает преобразование из типа Clr "{1}", кроме случаев, когда результирующий тип является String или XmlAtomicValue.
tr: '{0}' Xml türü, hedef türü String veya XmlAtomicValue olmadığı sürece '{1}' Clr türünden dönüştürülemez.
zh_hans: Xml 类型“{0}”无法从 Clr 类型“{1}”转换，除非目标类型为 String 或 XmlAtomicValue。
zh_hant: Xml type '{0}' 無法由 Clr 類型 '{1}' 轉換，除非目的地類型為 String 或 XmlAtomicValue。

# XmlDataTypeMismatch
source: '{0}' is an invalid value for the {1} property. {0} cannot be converted to {2}.
cs: Hodnota {0} je pro vlastnost {1} neplatná. {0} nelze převést na typ {2}.
de: "{0}" ist ein ungültiger Wert für die {1}-Eigenschaft. "{0}" kann nicht in "{2}" konvertiert werden.
es: "{0}" es un valor no válido para la propiedad {1}. {0} no se puede convertir en {2}.
fr: '{0}' est une valeur non valide pour la propriété {1}. {0} ne peut pas être converti en {2}.
it: '{0}' non è un valore valido per la proprietà {1}. {0} non può essere convertito in {2}.
ja: '{0}' は、{1} プロパティには無効な値です。{0} を {2} に変換できません。
ko: '{0}'은(는) {1} 속성에 사용할 수 없는 값입니다. {0}을(를) {2}(으)로 변환할 수 없습니다.
pl: Element „{0}” jest nieprawidłową wartością właściwości {1}. Elementu {0} nie można przekonwertować na {2}.
pt_br: '{0}' é um valor inválido para a propriedade {1}. Não é possível converter {0} em {2}.
ru: "{0}" является недопустимым значением свойства {1}. {0} невозможно преобразовать в {2}.
tr: '{0}', {1} özelliği için geçersiz bir değer. {0}, {2} olarak dönüştürülemez.
zh_hans: “{0}”对属性 {1} 是无效值。{0} 无法转换为 {2}。
zh_hant: '{0}' 對 {1} 屬性是無效值。{0} 無法轉換為 {2}。

# XmlDisallowNegativeValues
source: Negative values are prohibited.
cs: Záporné hodnoty jsou zakázány.
de: Negative Werte sind nicht zulässig.
es: Los valores negativos están prohibidos.
fr: Les valeurs négatives sont interdites.
it: I valori negativi non sono consentiti.
ja: 負の値は使用できません。
ko: 음수 값을 사용할 수 없습니다.
pl: Wartości ujemne są niedozwolone.
pt_br: Valores negativos são proibidos.
ru: Отрицательные значения запрещены.
tr: Negatif değerlere izin verilmez.
zh_hans: 禁止使用负值。
zh_hant: 禁止使用負值。

# XmlDocument_NoNodeSchemaInfo
source: Schema information could not be found for the node passed into Validate. The node may be invalid in its current position. Navigate to the ancestor that has schema information, then call Validate again.
cs: Nelze najít informace schématu pro uzel předaný metodě Validate. Je možné, že uzel na aktuální pozici není platný. Přejděte k předchůdci, který má informace schématu, a potom metodu Validate zavolejte znovu.
de: Es wurden keine Schemainformationen für den an "Validate" übergebenen Knoten gefunden. Möglicherweise ist der Knoten an seiner aktuellen Position ungültig. Navigieren Sie zum Vorgängerelement, das Schemainformationen enthält, und rufen Sie "Validate" dann erneut auf.
es: No se encontró la información de esquema para el nodo pasado a Validate. Puede que el nodo no sea válido en su posición actual. Navegue al antecesor que tenga información de esquema y, a continuación, vuelva a llamar a Validate.
fr: Les informations de schéma sont introuvables pour le nœud passé à Validate. Le nœud est peut-être non valide à sa position actuelle. Accédez à l'ancêtre qui détient ces informations, puis appelez Validate une nouvelle fois.
it: Le informazioni dello schema per il nodo corrente passato a Validate non sono state trovate. Il nodo potrebbe non essere valido nella posizione corrente. Passare al predecessore che contiene le informazioni dello schema, quindi chiamare di nuovo Validate.
ja: Validate に渡されたノードのスキーマ情報が見つかりませんでした。ノードは現在の位置では無効の可能性があります。スキーマ情報を持つ祖先を参照し、再度 Validate を呼び出してください。
ko: Validate로 전달된 노드에서 스키마 정보를 찾을 수 없습니다. 노드의 현재 위치가 잘못되었을 수 있습니다. 스키마 정보가 있는 상위로 이동한 다음 Validate를 다시 호출하세요.
pl: Nie można odnaleźć informacji o schemacie dla węzła przekazanego do procesu weryfikacji. W bieżącej lokalizacji węzeł może być nieprawidłowy. Przejdź do elementu nadrzędnego z informacjami o schemacie, a następnie ponownie wywołaj proces weryfikacji.
pt_br: Não foi possível encontrar informações de esquema para o nó passado para Validate. O nó pode ser inválido na posição atual. Navegue para o ancestral que tem informações de esquema e chame Validate novamente.
ru: Для узла, переданного в Validate, не удалось найти данные о схеме. Возможно, узел недопустим в текущей позиции. Перейдите к предку, который содержит данные о схеме, и вызовите Validate повторно.
tr: Validate'e aktarılan düğüme yönelik şema bilgileri bulunamadı. Düğüm bulunduğu konumunda geçersiz olabilir. Şema bilgilerinin olduğu üst düğüme gidin ve Validate'i yeniden çağırın.
zh_hans: 在传递到 Validate 的节点上找不到架构信息。该节点在当前位置可能无效。请导航至具有架构信息的上级，然后再次调用 Validate。
zh_hant: 傳遞至 Validate 的節點找不到結構描述資訊。目前位置的節點可能無效。請瀏覽包函結構描述資訊的上階並再次呼叫 Validate。

# XmlDocument_NoSchemaInfo
source: The XmlSchemaSet on the document is either null or has no schemas in it. Provide schema information before calling Validate.
cs: Třída XmlSchemaSet u dokumentu je buď null, nebo neobsahuje žádná schémata. Před voláním metody Validate je nutné poskytnout informace schématu.
de: Das XmlSchemaSet für das Dokument ist entweder NULL oder enthält keine Schemas. Stellen Sie vor dem Aufrufen von "Validate" Schemainformationen bereit.
es: El elemento XmlSchemaSet del documento es nulo o no tiene esquemas. Debe proporcionar información de esquema antes de llamar a Validate.
fr: Le XmlSchemaSet figurant sur le document a une valeur null ou ne comporte aucun schéma. Fournissez les informations de schéma avant d'appeler Validate.
it: Il valore di XmlSchemaSet nel documento è Null oppure non include schemi. Fornire le informazioni dello schema prima di chiamare Validate.
ja: ドキュメントの XmlSchemaSet が null であるか、または XmlSchemaSet にスキーマが含まれていません。Validate を呼び出す前に、スキーマ情報を指定してください。
ko: 문서의 XmlSchemaSet이 Null이거나 스키마가 없습니다. Validate를 호출하기 전에 스키마 정보를 제공하세요.
pl: Zestaw XmlSchemaSet dokumentu ma wartość null lub nie zawiera schematów. Przed wywołaniem weryfikacji podaj informacje o schemacie.
pt_br: O XmlSchemaSet do documento é nulo ou não tem esquemas. Forneça informações de esquema antes de chamar Validate.
ru: XmlSchemaSet для документа не определен или не содержит схем. Перед вызовом Validate необходимо предоставить данные о схеме.
tr: Belgedeki XmlSchemaSet null veya içinde şema yok. Validate'i çağırmadan önce şema bilgilerini sağlayın.
zh_hans: 该文档上的 XmlSchemaSet 不是为空，就是其中没有架构。请在调用 Validate 之前提供架构信息。
zh_hant: 文件上的 XmlSchemaSet 不是空值也沒有包含結構描述。請在呼叫 Validate 前先提供結構描述資訊。

# XmlDocument_NodeNotFromDocument
source: Cannot validate '{0}' because its owner document is not the current document.
cs: Nelze ověřit {0}. Dokument vlastníka není aktuální dokument.
de: "{0}" kann nicht überprüft werden, da das Besitzerdokument nicht das aktuelle Dokument ist.
es: No se puede validar "{0}", su documento propietario no es el documento actual.
fr: Impossible de valider '{0}', car le document propriétaire n'est pas le document actif.
it: Non è possibile convalidare '{0}' perché il documento del proprietario non è il documento corrente.
ja: オーナー ドキュメントが現在のドキュメントではないため、'{0}' を検証できません。
ko: 소유자 문서가 현재 문서가 아니므로 '{0}'의 유효성을 검사할 수 없습니다.
pl: Nie można zweryfikować elementu „{0}”, ponieważ odpowiedni dokument dotyczący jego właściciela nie jest bieżącym dokumentem.
pt_br: Não é possível validar '{0}', pois seu documento de proprietário não é o documento atual.
ru: Не удается проверить "{0}", поскольку текущий документ не является документом, которому он принадлежит.
tr: '{0}', sahibi olan belge geçerli belge olmadığından doğrulanamıyor.
zh_hans: 无法验证“{0}”，因为其所有者文档不是当前文档。
zh_hant: 因為 '{0}' 的擁有者文件並非目前的文件，所以無法加以驗證。
