Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_ComponentAlreadySeenForNS
source: An element or attribute information item has already been validated from the '{0}' namespace. It is an error if 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation', or an inline schema occurs for that namespace.
cs: Položka informací o elementu nebo atributu již byla ověřena z oboru názvů {0}. Pokud se pro tento obor názvů vyskytne xsi:schemaLocation, xsi:noNamespaceSchemaLocation nebo vložené schéma, jedná se o chybu.
de: Eine Element- oder Attributinformation wurde bereits im Namespace "{0}" überprüft. Wenn "xsi:schemaLocation", "xsi:noNamespaceSchemaLocation" oder ein Inlineschema für diesen Namespace vorkommt, tritt ein Fehler auf.
es: Ya se ha validado el elemento de información de un elemento o atributo desde el espacio de nombres "{0}". Es un error si interviene "xsi:schemaLocation", "xsi:noNamespaceSchemaLocation" o un esquema alineado para ese espacio de nombres.
fr: Un élément ou un élément d'information d'attribut a déjà été validé dans l'espace de noms '{0}'. Il s'agit d'une erreur si 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation' ou un schéma inline existe pour cet espace de noms.
it: L'elemento informazioni relativo a un elemento o un attributo è già stato convalidato dallo spazio dei nomi '{0}'. Si verifica un errore se viene rilevato 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation' o uno schema inline per tale spazio dei nomi.
ja: 要素または属性情報アイテムは、既に '{0}' 名前空間から検証されています。この名前空間に 'xsi:schemaLocation'、'xsi:noNamespaceSchemaLocation' またはインライン スキーマがある場合は、エラーです。
ko: '{0}' 네임스페이스에서 요소 또는 특성 정보 항목의 유효성을 이미 검사했습니다. 해당 네임스페이스에 대해 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation' 또는 인라인 스키마가 발생하면 오류가 발생합니다.
pl: Pozycja informacji o atrybucie lub elemencie została już zweryfikowana z poziomu przestrzeni nazw „{0}”. Jeśli dla tej przestrzeni nazw istnieją schematy „xsi:schemaLocation” lub „xsi:noNamespaceSchemaLocation” bądź schemat wbudowany, występuje błąd.
pt_br: Um item de informações de atributo ou de elemento já foi validado no namespace '{0}'. Erro se 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation' ou um esquema embutido ocorrer nesse namespace.
ru: Информационная единица для элемента или атрибута уже проверена из пространства имен "{0}". Считается ошибкой, если для этого пространства имен встречается xsi:schemaLocation, xsi:noNamespaceSchemaLocation или встроенная схема.
tr: Öğe veya öznitelik bilgisi öğesi, önceden '{0}' ad alanından doğrulandı. Ad alanı için 'xsi:schemaLocation', 'xsi:noNamespaceSchemaLocation' veya bir satır içi şema oluşması hatadır.
zh_hans: 已从“{0}”命名空间验证了元素或特性信息项。如果该命名空间产生了 "xsi:schemaLocation"、"xsi:noNamespaceSchemaLocation" 或内联架构，则是错误的。
zh_hant: 已從 '{0}' 命名空間驗證元素或屬性資訊項目。若對該命名空間發生了 'xsi:schemaLocation'、'xsi:noNamespaceSchemaLocation' 或內嵌結構描述，即為錯誤。

# Sch_ComponentRedefineNotFound
source: Cannot find a {0} with name '{1}' to redefine.
cs: Nelze najít {0} s názvem {1} k předefinování.
de: Es wurde kein {0}-Element mit dem Namen "{1}" zum erneuten Definieren gefunden.
es: No se puede encontrar {0} con nombre "{1}" para redefinir.
fr: {0} introuvable avec le nom '{1}' à redéfinir.
it: Non è stato trovato alcun elemento {0} denominato '{1}' da ridefinire.
ja: 再定義すべき、名前が '{1}' である {0} が見つかりません。
ko: 이름이 '{1}'인 다시 정의할 {0}을(를) 찾을 수 없습니다.
pl: Nie można znaleźć elementu {0} o nazwie „{1}” do ponownego zdefiniowania.
pt_br: Não é possível encontrar um {0} com nome '{1}' para redefinir.
ru: Не удается найти {0} с именем "{1}" для переопределения.
tr: '{1}' adlı yeniden tanımlanacak bir {0} bulunamıyor.
zh_hans: 找不到要重新定义的名为“{1}”的 {0}。
zh_hant: 找不到名為 '{1}' 的 {0} 而無法重新定義。

# Sch_ContentInNill
source: Element '{0}' must have no character or element children.
cs: Element {0} nesmí obsahovat žádné znaky ani podřízené elementy.
de: Das Element "{0}" darf keine Zeichen oder ungeordneten Elemente enthalten.
es: El elemento "{0}" no puede tener caracteres o elementos secundarios.
fr: L'élément '{0}' ne doit comporter aucun caractère ou élément enfant.
it: L'elemento '{0}' non deve contenere caratteri o elementi figlio.
ja: 要素 '{0}' には文字または要素の子を指定できません。
ko: '{0}' 요소에 문자 또는 요소 자식이 없어야 합니다.
pl: Element „{0}” nie może zawierać znaków ani elementów podrzędnych.
pt_br: O elemento '{0}' não deve ter caracteres nem elementos filho.
ru: Элемент "{0}" не должен иметь потомки-знаки или потомки-элементы.
tr: '{0}' öğesinin hiç karakteri veya alt öğesi olmamalıdır.
zh_hans: 元素“{0}”必须没有任何字符或元素子级。
zh_hant: 元素 '{0}' 不得有任何字元或元素子系。

# Sch_ContinuationString
source: {0}as well as
cs: {0} a také
de: {0}sowie
es: {0} así como
fr: {0}ainsi que
it: {0}e anche
ja: {0} および
ko: {0} 및
pl: {0}, a także
pt_br: {0} bem como
ru: {0}, а также
tr: {0} ile birlikte
zh_hans: {0} 以及
zh_hant: {0} 及

# Sch_DataTypeTextOnly
source: Content must be "textOnly" when using DataType on an ElementType.
cs: Je-li pro typ ElementType použita vlastnost DataType, musí být obsah typu textOnly.
de: Der Inhalt muss "textOnly" sein, wenn DataType mit einem ElementType verwendet wird.
es: El contenido debe ser "textOnly" al utilizar DataType en un valor ElementType.
fr: Content doit avoir la valeur "textOnly" quand DataType est utilisé sur ElementType.
it: Quando si usa DataType su un elemento ElementType, il valore di Content deve essere "textOnly".
ja: ElementType の DataType を使用している場合は、コンテンツは "textOnly" でなければなりません。
ko: ElementType에 DataType을 사용하는 경우 콘텐츠는 "textOnly"여야 합니다.
pl: Zawartość musi być „textOnly”, gdy używany jest element DataType na elemencie ElementType.
pt_br: O conteúdo deve ser "textOnly" ao usar DataType em um ElementType.
ru: При использовании DataType для ElementType содержимое должно иметь тип textOnly.
tr: DataType, bir ElementType üzerinde kullanılırken içerik "textOnly" olmalıdır.
zh_hans: 当在 ElementType 上使用 DataType 时，内容必须为 "textOnly"。
zh_hant: 在 ElementType 上使用 DataType 時，內容必須是 "textOnly"。

# Sch_DefaultAttributeNotApplied
source: Default attribute '{0}' for element '{1}' could not be applied as the attribute namespace is not mapped to a prefix in the instance document.
cs: Výchozí atribut {0} pro element {1} nemohl být použit, protože obor názvů atributu není namapován na předponu v dokumentu instance.
de: Das Standardattribut "{0}" für das Element "{1}" konnte nicht angewendet werden, da der Attributnamespace keinem Präfix im Instanzdokument zugeordnet ist.
es: No se pudo aplicar el atributo predeterminado "{0}" al elemento "{1}", ya que el espacio de nombres no está asignado a un prefijo en el documento de instancia.
fr: Impossible d'appliquer l'attribut par défaut '{0}' de l'élément '{1}', car l'espace de noms de l'attribut n'est pas mappé à un préfixe du document de l'instance.
it: Non è stato possibile applicare l'attributo predefinito '{0}' per l'elemento '{1}' perché non è stato eseguito il mapping dello spazio dei nomi dell'attributo a un prefisso nel documento dell'istanza.
ja: 要素 '{1}' の既定の属性 '{0}' は、属性の名前空間がインスタンス ドキュメントのプレフィックスにマップされていないため、適用できませんでした。
ko: 특성 네임스페이스가 인스턴스 문서의 접두사에 매핑되지 않았으므로 요소 '{1}'에 대한 기본 특성 '{0}'은(는) 적용할 수 없습니다.
pl: Nie można zastosować domyślnego atrybutu „{0}” elementu „{1}”, ponieważ przestrzeń nazw atrybutów nie została zamapowana na prefiks w dokumencie wystąpienia.
pt_br: Não foi possível aplicar o atributo padrão '{0}' do elemento '{1}', pois o namespace do atributo não está mapeado para um prefixo no documento de instâncias.
ru: Стандартный атрибут "{0}" для элемента "{1}" не может быть применен, поскольку пространству имен атрибута не сопоставлен префикс в документе экземпляра.
tr: Öznitelik ad alanı örnek belgedeki önekle eşlenmediğinden, '{1}' öğesi için varsayılan '{0}' özniteliği uygulanamadı.
zh_hans: 不能应用元素“{1}”的默认特性“{0}”，因为未将特性命名空间映射到实例文档中的前缀。
zh_hant: 因為屬性命名空間未對應至執行個體文件的前置詞，所以無法套用元素 '{1}' 的預設屬性 '{0}'。

# Sch_DefaultException
source: A schema error occurred.
cs: Došlo k chybě schématu.
de: Ein Schemafehler ist aufgetreten.
es: Error de esquema.
fr: Une erreur de schéma s'est produite.
it: Si è verificato un errore dello schema.
ja: スキーマ エラーが発生しました。
ko: 스키마 오류가 발생했습니다.
pl: Wystąpił błąd schematu.
pt_br: Erro de esquema.
ru: Ошибка схемы.
tr: Şema hatası oluştu.
zh_hans: 出现架构错误。
zh_hant: 發生結構描述錯誤。

# Sch_DefaultFixedAttributes
source: The fixed and default attributes cannot both be present.
cs: Pevné a výchozí atributy nemohou být uvedeny současně.
de: Die fixed- und default-Attribute dürfen nicht beide vorhanden sein.
es: Los atributos fixed y default no pueden estar presentes a la vez.
fr: Les attributs fixed et default ne peuvent pas être tous les deux présents.
it: Gli attributi fixed e default non possono essere entrambi presenti.
ja: 'fixed' および 'default' 属性を同時に指定することはできません。
ko: fixed와 default 특성을 둘 다 지정할 수 없습니다.
pl: Atrybuty stałe oraz domyślne nie mogą być obecne jednocześnie.
pt_br: Os atributos fixos e padrão não podem estar presentes simultaneamente.
ru: Фиксированный атрибут и атрибут по умолчанию нельзя задавать одновременно.
tr: Fixed ve default özniteliklerinin ikisi birden bulunamaz.
zh_hans: 固定特性和默认特性不能同时存在。
zh_hant: 不可同時存在 fixed 與 default 屬性。

# Sch_DefaultIdValue
source: An attribute or element of type xs:ID or derived from xs:ID, should not have a value constraint.
cs: Atribut nebo element typu xs:ID nebo odvozený z typu xs:ID by neměl mít omezení hodnoty.
de: Ein Attribut oder Element, dessen Typ "xs:ID" ist oder das von "xs:ID" abgeleitet wurde, darf keine Werteinschränkung aufweisen.
es: Un atributo o elemento de tipo xs:ID, o derivado de xs:ID, no debería tener restricción de valor.
fr: Un attribut ou élément de type xs:ID ou dérivé de xs:ID ne doit pas avoir de contrainte de valeur.
it: Un attributo o un elemento di tipo xs:ID o derivato da xs:ID non deve contenere un vincolo di valore.
ja: xs:ID 型または xs:ID から派生した型の属性または要素に値の制約を設定することはできません。
ko: 형식이 xs:ID이거나 xs:ID에서 파생된 특성이나 요소에는 값 제약 조건이 없어야 합니다.
pl: Atrybut lub element typu xs:ID lub pochodnego względem typu xs:ID nie powinien mieć ograniczenia wartości.
pt_br: Um atributo ou elemento de tipo xs:ID ou derivado de xs:ID não deve ter uma restrição de valor.
ru: Атрибут или элемент типа xs:ID или производного от xs:ID типа не должен иметь ограничения значения.
tr: xs:ID türündeki veya xs:ID türünden türetilen bir özniteliğin veya öğenin değer kısıtlaması olmamalı.
zh_hans: 类型为 xs:ID 或从 xs:ID 派生的特性或元素不应有值约束。
zh_hant: 屬於類型 xs:ID 或衍生自 xs:ID 的屬性或元素，不可有數值條件約束。

# Sch_DerivedNotFromBase
source: The data type of the simple content is not a valid restriction of the base complex type.
cs: Datový typ jednoduchého obsahu není platným omezením pro základní složitý typ.
de: Der Datentyp des einfachen Inhalts ist keine gültige Einschränkung des komplexen Basistyps.
es: El tipo de datos del contenido simple no es una restricción válida del tipo complejo base.
fr: Le type de données du contenu simple n'est pas une restriction valide du type complexe de base.
it: Il tipo di dati del contenuto semplice non è una restrizione valida del tipo complesso di base.
ja: シンプル コンテンツのデータ型は、ベース複合型として有効な制約ではありません。
ko: 단순 콘텐츠의 데이터 형식은 기본 복합 형식의 유효한 제한이 아닙니다.
pl: Typ danych o prostej zawartości nie jest poprawnym ograniczeniem podstawowego typu złożonego.
pt_br: O tipo de dados do conteúdo simples não é uma restrição válida do tipo complexo base.
ru: Тип данных простого содержимого не является допустимым ограничением для базового составного типа.
tr: Basit içeriğin veri türü temel karmaşık türün geçerli bir kısıtlaması değil.
zh_hans: 简单内容的数据类型不是基复杂类型的有效限制。
zh_hant: 簡單內容的資料類型不是基底複雜類型的有效限制。

# Sch_DifContentType
source: The derived type and the base type must have the same content type.
cs: Odvozený typ a základní typ musí mít stejný typ obsahu.
de: Der abgeleitete Typ und der Basistyp müssen den gleichen Inhaltstyp haben.
es: El tipo derivado y el tipo base deben tener el mismo tipo de contenido.
fr: Le type dérivé et le type de base doivent avoir le même type de contenu.
it: Il tipo derivato e il tipo di base devono includere lo stesso tipo di contenuto.
ja: 派生型と基本データ型は、同じコンテンツ型でなければなりません。
ko: 파생 형식과 기본 형식은 콘텐츠 형식이 같아야 합니다.
pl: Typ pochodny oraz typ podstawowy muszą mieć ten sam typ zawartości.
pt_br: O tipo derivado e o tipo base devem ter o mesmo tipo de conteúdo.
ru: Производный и базовый типы должны иметь одинаковый тип содержимого.
tr: Türetilmiş tür ve temel tür aynı içerik türüne sahip olmalıdır.
zh_hans: 派生类型和基类型必须具有相同的内容类型。
zh_hant: 衍生類型與基底類型必須擁有相同的內容類型。

# Sch_DtMaxLengthInvalid
source: The value '{0}' is invalid for dt:maxLength.
cs: Hodnota {0} je pro atribut dt:maxLength neplatná.
de: Der Wert "{0}" ist für dt:maxLength ungültig.
es: El valor "{0}" no es válido para dt:maxLength.
fr: La valeur '{0}' est non valide pour dt:maxLength.
it: Il valore '{0}' non è valido per dt:maxLength.
ja: 値 '{0}' は dt:maxLength には無効です。
ko: '{0}'은(는) dt:maxLength에 사용할 수 없는 값입니다.
pl: Wartość „{0}” jest nieprawidłowa dla dt:maxLength.
pt_br: O valor '{0}' é inválido para dt:maxLength.
ru: Значение "{0}" для dt:maxLength является недопустимым.
tr: '{0}' değeri dt:maxLength için geçersizdir.
zh_hans: 值“{0}”对于 dt:maxLength 无效。
zh_hant: 值 '{0}' 對 dt:maxLength 無效。

# Sch_DtMinLengthInvalid
source: The value '{0}' is invalid for dt:minLength.
cs: Hodnota {0} je pro atribut dt:minLength neplatná.
de: Der Wert "{0}" ist für dt:minLength ungültig.
es: El valor "{0}" no es válido para dt:minLength.
fr: La valeur '{0}' est non valide pour dt:minLength.
it: Il valore '{0}' non è valido per dt:minLength.
ja: 値 '{0}' は dt:minLength には無効です。
ko: '{0}'은(는) dt:minLength에 사용할 수 없는 값입니다.
pl: Wartość „{0}” jest nieprawidłowa dla dt:minLength.
pt_br: O valor '{0}' é inválido para dt:minLength.
ru: Значение "{0}" для dt:minLength является недопустимым.
tr: '{0}' değeri dt:minLength için geçersizdir.
zh_hans: 值“{0}”对于 dt:minLength 无效。
zh_hant: 值 '{0}' 對 dt:minLength 無效。

# Sch_DtMinMaxLength
source: The maxLength value must be equal to or greater than the minLength value.
cs: Hodnota maxLength musí být větší nebo rovna hodnotě minLength.
de: Der maxLength-Wert muss gleich oder größer als der minLength-Wert sein.
es: El valor maxLength debe ser igual o mayor que el valor minLength.
fr: La valeur maxLength doit être égale ou supérieure à la valeur minLength.
it: Il valore di maxLength deve essere maggiore o uguale a quello di minLength.
ja: maxLength 値は minLength 値以上でなければなりません。
ko: maxLength 값은 minLength 값보다 크거나 같아야 합니다.
pl: Wartość maxLength musi być równa lub większa niż wartość minLength.
pt_br: O valor de maxLength deve ser igual ou maior que o valor de minLength.
ru: Значение maxLength должно быть больше либо равно значению minLength.
tr: maxLength değeri minLength değerine eşit veya büyük olmalıdır.
zh_hans: maxLength 值必须等于或大于 minLength 值。
zh_hant: maxLength 值必須大於或等於 minLength 值。

# Sch_DupAttribute
source: The '{0}' attribute has already been declared for this ElementType.
cs: Atribut {0} již byl pro tento typ ElementType deklarován.
de: Das {0}-Attribut wurde für diesen ElementType bereits deklariert.
es: Ya se ha declarado el atributo "{0}" para este valor ElementType.
fr: L'attribut '{0}' a déjà été déclaré pour ce ElementType.
it: L'attributo '{0}' è già stato dichiarato per questo elemento ElementType.
ja: '{0}' 属性は、この ElementType に対して既に宣言されています。
ko: '{0}' 특성이 이 ElementType에 대해 이미 선언되었습니다.
pl: Atrybut „{0}” został już zadeklarowany dla tego elementu ElementType.
pt_br: O atributo '{0}' já foi declarado para este ElementType.
ru: Атрибут "{0}" для этого ElementType уже объявлен.
tr: '{0}' özniteliği bu ElementType için zaten bildirilmiş.
zh_hans: 已为此 ElementType 声明“{0}”特性。
zh_hant: 已為此 ElementType 宣告了 '{0}' 屬性。

# Sch_DupAttributeGroup
source: The attributeGroup '{0}' has already been declared.
cs: Skupina attributeGroup {0} již byla deklarována.
de: Die attributeGroup "{0}" wurde bereits deklariert.
es: Ya se ha declarado el valor attributeGroup "{0}".
fr: attributeGroup '{0}' a déjà été déclaré.
it: L'elemento attributeGroup '{0}' è già stato dichiarato.
ja: attributeGroup '{0}' は既に宣言されています。
ko: attributeGroup '{0}'이(가) 이미 선언되었습니다.
pl: Element attributeGroup „{0}” został już zadeklarowany.
pt_br: O attributeGroup '{0}' já foi declarado.
ru: Элемент attributeGroup "{0}" уже объявлен.
tr: attributeGroup '{0}' zaten bildirilmiş.
zh_hans: 已声明 attributeGroup“{0}”。
zh_hant: 已宣告 attributeGroup '{0}'。

# Sch_DupAttributeUse
source: The attribute '{0}' already exists.
cs: Atribut {0} již existuje.
de: Das Attribut "{0}" ist bereits vorhanden.
es: El atributo "{0}" ya existe.
fr: L'attribut '{0}' existe déjà.
it: L'attributo '{0}' esiste già.
ja: 属性 '{0}' は既に存在します。
ko: '{0}' 특성이 이미 있습니다.
pl: Atrybut „{0}” już istnieje.
pt_br: O atributo '{0}' já existe.
ru: Атрибут "{0}" уже существует.
tr: '{0}' özniteliği zaten var.
zh_hans: 特性“{0}”已经存在。
zh_hant: 屬性 '{0}' 已存在。

# Sch_DupComplexType
source: The complexType '{0}' has already been declared.
cs: Typ complexType {0} již byl deklarován.
de: Der complexType "{0}" wurde bereits deklariert.
es: Ya se ha declarado el valor complexType "{0}".
fr: complexType '{0}' a déjà été déclaré.
it: L'elemento complexType '{0}' è già stato dichiarato.
ja: complexType '{0}' は既に宣言されています。
ko: complexType '{0}'이(가) 이미 선언되었습니다.
pl: Element complexType „{0}” został już zadeklarowany.
pt_br: O complexType '{0}' já foi declarado.
ru: Элемент complexType "{0}" уже объявлен.
tr: complexType '{0}' zaten bildirilmiş.
zh_hans: 已声明 complexType“{0}”。
zh_hant: 已宣告 complexType '{0}'。

# Sch_DupDtMaxLength
source: The value of maxLength has already been declared.
cs: Hodnota argumentu maxLength již byla deklarována.
de: Der Wert von "maxLength" wurde bereits deklariert.
es: Ya se ha declarado el valor de maxLength.
fr: La valeur de maxLength a déjà été déclarée.
it: Il valore di maxLength è già stato dichiarato.
ja: maxLength は既に宣言されています。
ko: maxLength 값이 이미 선언되었습니다.
pl: Wartość maxLength została już zadeklarowana.
pt_br: O valor de maxLength já foi declarado.
ru: Значение maxLength уже объявлено.
tr: maxLength değeri zaten bildirilmiş.
zh_hans: 已声明 maxLength 的值。
zh_hant: 已經宣告 maxLength 的值。

# Sch_DupDtMinLength
source: The value of minLength has already been declared.
cs: Hodnota argumentu minLength již byla deklarována.
de: Der Wert von "minLength" wurde bereits deklariert.
es: Ya se ha declarado el valor de minLength.
fr: La valeur de minLength a déjà été déclarée.
it: Il valore di minLength è già stato dichiarato.
ja: minLength は既に宣言されています。
ko: minLength 값이 이미 선언되었습니다.
pl: Wartość minLength została już zadeklarowana.
pt_br: O valor de minLength já foi declarado.
ru: Значение minLength уже объявлено.
tr: minLength değeri zaten bildirilmiş.
zh_hans: 已声明 minLength 的值。
zh_hant: 已經宣告 minLength 的值。

# Sch_DupDtType
source: Data type has already been declared.
cs: Datový typ již byl deklarován.
de: Der Datentyp wurde bereits deklariert.
es: Ya se ha declarado el tipo de datos.
fr: Le type de données a déjà été déclaré.
it: Il tipo di dati è già stato dichiarato.
ja: データ型は既に宣言されています。
ko: 데이터 형식이 이미 선언되었습니다.
pl: Typ danych został już zadeklarowany.
pt_br: O tipo de dados já foi declarado.
ru: Тип данных уже объявлен.
tr: Veri türü zaten bildirilmiş.
zh_hans: 已声明数据类型。
zh_hant: 已宣告資料類型。

# Sch_DupElement
source: The '{0}' element already exists in the content model.
cs: Element {0} již v tomto modelu obsahu existuje.
de: Das {0}-Element ist im Inhaltsmodell bereits vorhanden.
es: El elemento "{0}" ya existe en el modelo de contenido.
fr: L'élément '{0}' existe déjà dans le modèle de contenu.
it: L'elemento '{0}' esiste già nel modello di contenuto.
ja: '{0}' 要素はコンテンツ モデルに既に存在します。
ko: '{0}' 요소가 콘텐츠 모델에 이미 있습니다.
pl: Element „{0}” już istnieje w modelu zawartości.
pt_br: O elemento '{0}' já existe no modelo de conteúdo.
ru: Элемент "{0}" в модели содержимого уже существует.
tr: '{0}' öğesi içerik modelinde zaten var.
zh_hans: 内容模型中已存在“{0}”元素。
zh_hant: '{0}' 元素已存在於內容模型中。

# Sch_DupElementDecl
source: The '{0}' element has already been declared.
cs: Element {0} již byl deklarován.
de: Das {0}-Element wurde bereits deklariert.
es: Ya se ha declarado el elemento "{0}".
fr: L'élément '{0}' a déjà été déclaré.
it: L'elemento '{0}' è già stato dichiarato.
ja: '{0}' 要素は既に宣言されています。
ko: '{0}' 요소가 이미 선언되었습니다.
pl: Element „{0}” został już zadeklarowany.
pt_br: O elemento '{0}' já foi declarado.
ru: Элемент "{0}" уже объявлен.
tr: '{0}' öğesi zaten bildirilmiş.
zh_hans: 已声明“{0}”元素。
zh_hant: 已宣告 '{0}' 元素。

# Sch_DupFractionDigitsFacet
source: This is a duplicate FractionDigits constraining facet.
cs: Toto je duplicitní omezující vlastnost FractionDigits.
de: Doppeltes FractionDigits-Einschränkungsfacet.
es: Faceta de restricción de FractionDigits duplicada.
fr: Il s'agit d'une facette de contrainte FractionDigits dupliquée.
it: Questo è un facet vincolante FractionDigits duplicato.
ja: FractionDigits 制約ファセットが重複しています。
ko: 중복 FractionDigits 제약 패싯입니다.
pl: To jest zduplikowany aspekt ograniczający FractionDigits.
pt_br: Esta é uma faceta de restrições FractionDigits duplicada.
ru: Это повторяющийся ограничивающий аспект FractionDigits.
tr: Bu yinelenen bir FractionDigits kısıtlama modeli.
zh_hans: 这是一个重复的 FractionDigits 约束方面。
zh_hant: 這是重複的 FractionDigits 條件約束 Facet。

# Sch_DupGlobalAttribute
source: The global attribute '{0}' has already been declared.
cs: Globální atribut {0} již byl deklarován.
de: Das globale Attribut "{0}" wurde bereits deklariert.
es: Ya se ha declarado el atributo global "{0}".
fr: L'attribut global '{0}' a déjà été déclaré.
it: L'attributo globale '{0}' è già stato dichiarato.
ja: グローバル属性 '{0}' は既に宣言されています。
ko: 전역 특성 '{0}'이(가) 이미 선언되었습니다.
pl: Atrybut globalny „{0}” został już zadeklarowany.
pt_br: O atributo global '{0}' já foi declarado.
ru: Глобальный атрибут "{0}" уже объявлен.
tr: '{0}' genel özniteliği zaten bildirilmiş.
zh_hans: 已声明全局特性“{0}”。
zh_hant: 已宣告全域屬性 '{0}'。

# Sch_DupGlobalElement
source: The global element '{0}' has already been declared.
cs: Globální element {0} již byl deklarován.
de: Das globale Element "{0}" wurde bereits deklariert.
es: Ya se ha declarado el elemento global "{0}".
fr: L'élément global '{0}' a déjà été déclaré.
it: L'elemento globale '{0}' è già stato dichiarato.
ja: グローバル要素 '{0}' は既に宣言されています。
ko: 전역 요소 '{0}'이(가) 이미 선언되었습니다.
pl: Element globalny „{0}” został już zadeklarowany.
pt_br: O elemento global '{0}' já foi declarado.
ru: Глобальный элемент "{0}" уже объявлен.
tr: '{0}' genel öğesi zaten bildirilmiş.
zh_hans: 已声明全局元素“{0}”。
zh_hant: 已宣告全域元素 '{0}'。

# Sch_DupGroup
source: The group '{0}' has already been declared.
cs: Skupina {0} již byla deklarována.
de: Die Gruppe "{0}" wurde bereits deklariert.
es: Ya se ha declarado el grupo "{0}".
fr: Le groupe '{0}' a déjà été déclaré.
it: Il gruppo '{0}' è già stato dichiarato.
ja: グループ '{0}' は既に宣言されています。
ko: 그룹 '{0}'이(가) 이미 선언되었습니다.
pl: Grupa „{0}” została już zadeklarowana.
pt_br: O grupo '{0}' já foi declarado.
ru: Группа "{0}" уже объявлена.
tr: '{0}' grubu zaten bildirilmiş.
zh_hans: 已声明组“{0}”。
zh_hant: 已宣告群組 '{0}'。
