Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XPathDocument_SchemaSetNotAllowed
source: An XmlSchemaSet is only allowed as a parameter on the Root node.
cs: Třída XmlSchemaSet je povolena pouze jako parametr v uzlu Root.
de: Ein XmlSchemaSet ist nur für einen Stammknoten als Parameter zulässig.
es: Solo se permite XmlSchemaSet como parámetro del nodo raíz.
fr: XmlSchemaSet est uniquement autorisé en tant que paramètre sur le nœud racine.
it: Un elemento XmlSchemaSet è consentito solo come parametro per il nodo Root.
ja: XmlSchemaSet を使用できるのは、ルート ノードのパラメーターとしてのみです。
ko: XmlSchemaSet은 Root 노드에서 매개 변수로만 사용할 수 있습니다.
pl: Wartość XmlSchemaSet może być używana jako parametr tylko dla węzła głównego.
pt_br: Um XmlSchemaSet só é permitido como parâmetro no nó raiz.
ru: XmlSchemaSet допустим в качестве параметра только в узле Root.
tr: XmlSchemaSet'e, yalnızca Root düğümünde parametre olarak izin verilir.
zh_hans: XmlSchemaSet 仅在 Root 节点上可以作为参数。
zh_hant: XmlSchemaSet 只允許作為 Root 節點的參數。

# XPathDocument_ValidateInvalidNodeType
source: Validate and CheckValidity are only allowed on Root or Element nodes.
cs: Metody Validate a CheckValidity jsou povoleny pouze u uzlů Root nebo Element.
de: "Validate" und "CheckValidity" sind nur für Stamm- oder Elementknoten zulässig.
es: Validate y CheckValidity no son compatibles con los nodos raíz y de elemento.
fr: Validate et CheckValidity ne sont autorisés que sur les nœuds racines ou d'élément.
it: Validate e CheckValidity sono consentiti solo su nodi Root o Element.
ja: Validate および CheckValidity は、ルート ノードまたは要素ノードでのみ使用できます。
ko: Validate 및 CheckValidity는 Root 또는 Element 노드에서만 사용할 수 있습니다.
pl: Operacje Validate i CheckValidity są dozwolone tylko dla węzłów głównych i węzłów elementów.
pt_br: Validate e CheckValidity só são permitidos em nós Root ou Element.
ru: Validate и CheckValidity допустимы только в узлах Root и Element.
tr: Validate ve CheckValidity'ye yalnızca Root veya Element düğümlerinde izin verilir.
zh_hans: 仅 Root 或 Element 节点允许 Validate 和 CheckValidity。
zh_hant: 僅允許 Validate 與 CheckValidity 位於 Root 或 Element 節點。

# Xdom_AttrCol_Insert
source: The reference node must be a child of the current node.
cs: Referenční uzel musí být podřízeným uzlem aktuálního uzlu.
de: Der Verweisknoten muss dem aktuellen Knoten untergeordnet sein.
es: El nodo de referencia debe ser un nodo secundario del nodo actual.
fr: Le nœud de référence doit être un enfant du nœud actuel.
it: Il nodo dei riferimenti deve essere figlio del nodo corrente.
ja: 参照ノードは、現在のノードの子でなければなりません。
ko: 참조 노드는 현재 노드의 자식이어야 합니다.
pl: Węzeł odwołania musi być węzłem podrzędnym węzła bieżącego.
pt_br: O nó de referência deve ser filho do nó atual.
ru: Узел ссылки должен быть дочерним для текущего узла.
tr: Başvuru düğümü geçerli düğümün alt düğümü olmalıdır.
zh_hans: 引用节点必须是当前节点的子级。
zh_hant: 參考節點必須是目前節點的子系。

# Xdom_AttrCol_Object
source: An 'Attributes' collection can only contain 'Attribute' objects.
cs: Kolekce Attributes může obsahovat pouze objekty Attribute.
de: Eine Attributes-Sammlung darf nur Attribute-Objekte enthalten.
es: Una colección "Attributes" solo puede contener objetos "Attribute".
fr: Une collection 'Attributes' ne peut contenir que des objets 'Attribute'.
it: Una raccolta 'Attributes' può contenere solo oggetti 'Attribute'.
ja: 'Attributes' コレクションには 'Attribute' オブジェクトのみを含めることができます。
ko: 'Attributes' 컬렉션은 'Attribute' 개체만 포함할 수 있습니다.
pl: Kolekcja „Attributes” może zawierać tylko obiekty „Attribute”.
pt_br: Uma coleção de 'Attributes' só pode conter objetos 'Attribute'.
ru: Коллекция Attributes может содержать только объекты Attribute.
tr: 'Attributes' koleksiyonu yalnızca 'Attribute' nesneleri içerebilir.
zh_hans: "Attributes" 集合只能包含 "Attribute" 对象。
zh_hant: 'Attributes' 集合只可包含 'Attribute' 物件。

# Xdom_Attr_InUse
source: The 'Attribute' node cannot be inserted because it is already an attribute of another element.
cs: Uzel Attribute nelze vložit, protože již je atributem jiného elementu.
de: Der Knoten "Attribute" konnte nicht eingefügt werden, da er bereits ein Attribut eines anderen Elements ist.
es: No se puede insertar el nodo "Attribute" porque ya es un atributo de otro elemento.
fr: Le nœud 'Attribute' ne peut pas être inséré, car il est déjà un attribut d'un autre élément.
it: Non è possibile inserire il nodo 'Attribute' perché è già un attributo di un altro elemento.
ja: 'Attribute' ノードを挿入できません。このノードは既に別の要素の属性に指定されています。
ko: 이 'Attribute' 노드는 이미 다른 요소의 특성이므로 삽입할 수 없습니다.
pl: Nie można wstawić węzła „Attribute”, ponieważ jest on już atrybutem innego elementu.
pt_br: Não é possível inserir o nó 'Attribute' porque ele já é um atributo de outro elemento.
ru: Вставка узла Attribute невозможна, так как он уже является атрибутом другого элемента.
tr: 'Attribute' düğümü, zaten başka bir öğenin özniteliği olduğundan eklenemez.
zh_hans: 不能插入 "Attribute" 节点，因为它已经是另一个元素的特性。
zh_hant: 無法插入 'Attribute' 節點，因為其已為其他元素的屬性。

# Xdom_Attr_Name
source: The attribute local name cannot be empty.
cs: Místní název atributu nemůže být prázdný.
de: Der lokale Attributname darf nicht leer sein.
es: El nombre local del atributo no puede estar vacío.
fr: Le nom local de l'attribut ne peut pas être vide.
it: Il nome locale dell'attributo non può essere vuoto.
ja: 属性のローカル名を空にすることはできません。
ko: 특성 지역 이름은 비워 둘 수 없습니다.
pl: Lokalna nazwa atrybutu nie może być pusta.
pt_br: O nome local do atributo não pode estar vazio.
ru: Локальное имя атрибута не может быть пустым.
tr: Özniteliğin yerel adı boş olamaz.
zh_hans: 特性本地名称不能为空。
zh_hant: 屬性本機名稱不可為空白。

# Xdom_Attr_Reserved_XmlNS
source: The namespace declaration attribute has an incorrect 'namespaceURI': '{0}'.
cs: Atribut deklarace oboru názvů má nesprávný identifikátor namespaceURI: {0}
de: Ungültiger "namespaceURI" im Attribut der Namespacedeklaration: "{0}".
es: El atributo de declaración del espacio de nombres tiene un "namespaceURI" incorrecto: "{0}".
fr: L'attribut de déclaration d'espace de noms a un 'namespaceURI' erroné : '{0}'.
it: L'attributo declaration dello spazio dei nomi contiene un elemento 'namespaceURI' errato: '{0}'.
ja: 名前空間宣言属性に、正しくない 'namespaceURI' '{0}' があります。
ko: 네임스페이스 선언 특성에 잘못된 'namespaceURI'가 있습니다. '{0}'
pl: Atrybut deklaracji przestrzeni nazw ma nieprawidłowy identyfikator „namespaceURI”: „{0}”.
pt_br: O atributo de declaração de namespace tem um 'namespaceURI' incorreto. '{0}'.
ru: Атрибут объявления пространства имен имеет некорректный namespaceURI: "{0}".
tr: Ad alanı bildirimi özniteliğinde yanlış 'namespaceURI' var: '{0}'.
zh_hans: 命名空间声明特性的 "namespaceURI" 不正确:“{0}”。
zh_hant: 命名空間宣告屬性擁有不正確的 'namespaceURI': '{0}'。

# Xdom_Document_Innertext
source: The 'InnerText' of a 'Document' node is read-only and cannot be set.
cs: Vlastnost InnerText uzlu Document je jen pro čtení a nelze ji nastavit.
de: Der "InnerText" eines Knotens "Document" ist schreibgeschützt und kann nicht festgelegt werden.
es: El "InnerText" de un nodo "Document" es de solo lectura y no se puede establecer.
fr: Le 'InnerText' d'un nœud 'Document' est en lecture seule et ne peut pas être défini.
it: L'elemento 'InnerText' del nodo 'Document' è di sola lettura e non può essere impostato.
ja: 'Document' ノードの 'InnerText' は読み取り専用であるため、設定できません。
ko: 'Document' 노드의 'InnerText'는 읽기 전용이며 설정할 수 없습니다.
pl: Element „InnerText” węzła „Document” jest tylko do odczytu i nie można go samodzielnie konfigurować.
pt_br: O 'InnerText' de um nó 'Document' é somente leitura e não pode ser definido.
ru: Элемент InnerText узла Document используется только для чтения и не может быть изменен.
tr: Bir 'Document' düğümüne ait 'InnerText' salt okunur durumda ve ayarlanamaz.
zh_hans: "Document" 节点的 "InnerText" 是只读的，不能进行设置。
zh_hant: 'Document' 節點的 'InnerText' 是唯讀節點，且無法設定。

# Xdom_DualDeclarationNode
source: This document already has an 'XmlDeclaration' node.
cs: Tento dokument již má uzel XmlDeclaration.
de: Das Dokument verfügt bereits über einen XmlDeclaration-Knoten.
es: Este documento ya tiene un nodo "XmlDeclaration".
fr: Ce document a déjà un nœud 'XmlDeclaration'.
it: Questo documento contiene già un nodo 'XmlDeclaration'.
ja: このドキュメントには既に 'XmlDeclaration' ノードがあります。
ko: 이 문서에 이미 'XmlDeclaration' 노드가 있습니다.
pl: Ten dokument ma już węzeł „XmlDeclaration”.
pt_br: Este documento já contém um nó 'XmlDeclaration'.
ru: Этот документ уже содержит узел XmlDeclaration.
tr: Bu belgenin bir 'XmlDeclaration' düğümü zaten var.
zh_hans: 此文档已具有 "XmlDeclaration" 节点。
zh_hant: 這份文件已經有 'XmlDeclaration' 節點。

# Xdom_DualDocumentElementNode
source: This document already has a 'DocumentElement' node.
cs: Tento dokument již má uzel DocumentElement.
de: Das Dokument verfügt bereits über einen DocumentElement-Knoten.
es: Este documento ya tiene un nodo "DocumentElement".
fr: Ce document a déjà un nœud 'DocumentElement'.
it: Questo documento contiene già un nodo 'DocumentElement'.
ja: このドキュメントには既に 'DocumentElement' ノードがあります。
ko: 이 문서에 이미 'DocumentElement' 노드가 있습니다.
pl: Ten dokument ma już węzeł „DocumentElement”.
pt_br: Este documento já contém um nó 'DocumentElement'.
ru: Этот документ уже содержит узел DocumentElement.
tr: Bu belgenin 'DocumentElement' düğümü zaten var.
zh_hans: 此文档已具有 "DocumentElement" 节点。
zh_hant: 這份文件已經有 'DocumentElement' 節點。

# Xdom_DualDocumentTypeNode
source: This document already has a 'DocumentType' node.
cs: Tento dokument již má uzel DocumentType.
de: Das Dokument verfügt bereits über einen DocumentType-Knoten.
es: Este documento ya tiene un nodo "DocumentType".
fr: Ce document a déjà un nœud 'DocumentType'.
it: Questo documento contiene già un nodo 'DocumentType'.
ja: このドキュメントには既に 'DocumentType' ノードがあります。
ko: 이 문서에 이미 'DocumentType' 노드가 있습니다.
pl: Ten dokument ma już węzeł „DocumentType”.
pt_br: Este documento já contém um nó 'DocumentType'.
ru: Этот документ уже содержит узел DocumentType.
tr: Bu belgenin 'DocumentType' düğümü zaten var.
zh_hans: 此文档已具有 "DocumentType" 节点。
zh_hant: 這份文件已經有 'DocumentType' 節點。

# Xdom_Empty_LocalName
source: The local name for elements or attributes cannot be null or an empty string.
cs: Místní název elementů ani atributů nemůže být null ani prázdný řetězec.
de: Der lokale Name für Elemente oder Attribute darf nicht NULL oder eine leere Zeichenfolge sein.
es: El nombre local de elementos o atributos no puede ser nulo o una cadena vacía.
fr: Le nom local des éléments ou des attributs ne peut pas avoir une valeur null ou être une chaîne vide.
it: Il nome locale di elementi o attributi non può essere Null o vuoto.
ja: 要素または属性のローカル名を null または空文字列にすることはできません。
ko: 요소 또는 특성의 지역 이름은 Null 또는 빈 문자열일 수 없습니다.
pl: Lokalna nazwa dla elementów lub atrybutów nie może być ciągiem o wartości null ani pustym.
pt_br: O nome local de elementos ou atributos não pode ser nulo nem uma cadeia de caracteres vazia.
ru: Локальные имена элементов и атрибутов не могут быть неопределенными или пустыми строками.
tr: Öğe ve özniteliklerin yerel adları null veya boş dize olamaz.
zh_hans: 元素或特性的本地名称不能为空或空字符串。
zh_hant: 元素的本機名稱或屬性不可為 Null 或空白字串。

# Xdom_EntRef_SetVal
source: 'EntityReference' nodes have no support for setting value.
cs: Uzly EntityReference nepodporují nastavování hodnoty.
de: EntityReference-Knoten bieten keine Unterstützung für das Festlegen des Werts.
es: Los nodos "EntityReference" no son compatibles con el valor de configuración.
fr: Les nœuds 'EntityReference' ne prennent pas en charge la définition de valeur.
it: I nodi 'EntityReference' non includono il supporto per l'impostazione del valore.
ja: 'EntityReference' ノードは値の設定をサポートしません。
ko: 'EntityReference' 노드는 값 설정을 지원하지 않습니다.
pl: Węzły „EntityReference” nie obsługują wartości ustawienia.
pt_br: Não há suporte para a configuração de valor em nós 'EntityReference'.
ru: Для узлов EntityReference присваивание значений не поддерживается.
tr: 'EntityReference' düğümlerinde değer ayarlama desteği yok.
zh_hans: "EntityReference" 节点不支持设置值。
zh_hant: 'EntityReference' 節點不支援設定值。

# Xdom_Ent_Innertext
source: The 'InnerText' of an 'Entity' node is read-only and cannot be set.
cs: Vlastnost InnerText uzlu Entity je jen pro čtení a nelze ji nastavit.
de: Der "InnerText" eines Entity-Knotens ist schreibgeschützt und kann nicht festgelegt werden.
es: El valor "InnerText" de un nodo "Entity" es de solo lectura y no se puede establecer.
fr: Le 'InnerText' d'un nœud 'Entity' est en lecture seule et ne peut pas être défini.
it: L'elemento 'InnerText' del nodo 'Entity' è di sola lettura e non può essere impostato.
ja: 'Entity' ノードの 'InnerText' は読み取り専用であるため、設定できません。
ko: 'Entity' 노드의 'InnerText'는 읽기 전용이며 설정할 수 없습니다.
pl: Element „InnerText” węzła „Entity” jest przeznaczony tylko do odczytu i nie można go ustawić.
pt_br: O 'InnerText' de um nó 'Entity' é somente leitura e não pode ser definido.
ru: InnerText узла Entity доступен только для чтения и не может быть задан.
tr: 'Entity' düğümünün 'InnerText'i salt okunurdur ve değiştirilemez.
zh_hans: "Entity" 节点的 "InnerText" 是只读的，不能进行设置。
zh_hant: 'Entity' 節點的 'InnerText' 是唯讀節點，且無法設定。

# Xdom_Enum_ElementList
source: The element list has changed. The enumeration operation failed to continue.
cs: Seznam elementů se změnil. Operace výčtu nemohla pokračovat.
de: Die Elementliste wurde geändert. Die Enumeration kann nicht fortgesetzt werden.
es: La lista de elementos ha cambiado. La operación de enumeración no puede continuar.
fr: La liste d'éléments a changé. Échec de la poursuite de l'opération d'énumération.
it: L'elenco degli elementi è stato modificato. L'operazione di enumerazione non può continuare.
ja: 要素一覧が変更されました。列挙操作を続行できませんでした。
ko: 요소 목록이 변경되었습니다. 열거 작업을 계속하지 못했습니다.
pl: Lista elementów zmieniła się. Nie można kontynuować operacji wyliczenia.
pt_br: A lista de elementos foi alterada. A operação de enumeração não pôde continuar.
ru: Список элементов изменился. Сбой при продолжении операции перечисления.
tr: Öğe listesi değişti. Sabit listesi oluşturma işlemi devam edemedi.
zh_hans: 元素列表已更改。枚举操作未能继续。
zh_hant: 元素清單已變更。列舉作業無法繼續。

# Xdom_Import
source: Cannot import nodes of type '{0}'.
cs: Uzly typu {0} nelze importovat.
de: Knoten vom Typ "{0}" können nicht importiert werden.
es: No se pueden importar nodos de tipo "{0}".
fr: Impossible d'importer des nœuds de type '{0}'.
it: Non è possibile importare nodi di tipo '{0}'.
ja: タイプ '{0}' のノードをインポートできません。
ko: '{0}' 형식 노드를 가져올 수 없습니다.
pl: Nie można zaimportować węzłów typu „{0}”.
pt_br: Não é possível importar nós do tipo '{0}'.
ru: Невозможно импортировать узлы типа "{0}".
tr: '{0}' türü düğümler içeri aktarılamaz.
zh_hans: 不能导入“{0}”类型的节点。
zh_hant: 無法匯入類型 '{0}' 的節點。

# Xdom_Import_NullNode
source: Cannot import a null node.
cs: Uzel null nelze importovat.
de: Ein NULL-Knoten kann nicht importiert werden.
es: No se puede importar un nodo nulo.
fr: Impossible d'importer un nœud null.
it: Non è possibile importare un nodo Null.
ja: null のノードをインポートできません。
ko: Null 노드를 가져올 수 없습니다.
pl: Nie można zaimportować węzła o wartości null.
pt_br: Não é possível importar um nó nulo.
ru: Невозможно импортировать неопределенный узел.
tr: Null bir düğüm içeri aktarılamaz.
zh_hans: 无法导入空节点。
zh_hant: 無法匯入 Null 節點。

# Xdom_IndexOutOfRange
source: The index being passed in is out of range.
cs: Předávaný index je mimo rozsah.
de: Der übergebene Index liegt außerhalb des gültigen Bereichs.
es: El índice que se está pasando está fuera del intervalo.
fr: L'index passé est hors limites.
it: L'indice passato non è compreso nell'intervallo.
ja: 引き渡された index が範囲を超えています。
ko: 전달되는 인덱스가 범위를 벗어났습니다.
pl: Przekazywany indeks jest poza zakresem.
pt_br: O índice passado está fora do intervalo.
ru: Передаваемый индекс находится вне допустимого диапазона.
tr: Geçirilen dizin aralık dışı.
zh_hans: 传入的索引超出范围。
zh_hant: 傳遞的索引超出範圍。

# Xdom_InvalidCharacter_EntityReference
source: Cannot create an 'EntityReference' node with a name starting with '#'.
cs: Nelze vytvořit uzel EntityReference, jehož název začíná znakem #.
de: Ein EntityReference-Knoten kann nicht mit einem Namen erstellt werden, der mit "#" beginnt.
es: No se puede crear un nodo "EntityReference" con un nombre que comience por "#".
fr: Impossible de créer un nœud 'EntityReference' avec un nom commençant par '#'.
it: Non è possibile creare un nodo 'EntityReference' il cui nome inizia per '#'.
ja: '#' で始まる名前を持つ 'EntityReference' ノードを作成することはできません。
ko: 이름이 '#'으로 시작하는 'EntityReference' 노드를 만들 수 없습니다.
pl: Nie można utworzyć węzła „EntityReference” o nazwie rozpoczynającej się od „#”.
pt_br: Não é possível criar um nó 'EntityReference' com um nome iniciado por '#'.
ru: Невозможно создать узел EntityReference с именем, начинающимся на "#".
tr: 'EntityReference' düğümü '#' ile başlayan bir adla oluşturulamaz.
zh_hans: 不能创建名称以 "#" 开头的 "EntityReference" 节点。
zh_hant: 無法使用以 '#' 為開頭的名稱建立 'EntityReference' 節點。

# Xdom_Invalid_NT_String
source: '{0}' does not represent any 'XmlNodeType'.
cs: {0} nereprezentuje žádný typ XmlNodeType.
de: "{0}" stellt keinen "XmlNodeType" dar.
es: "{0}" no representa ningún "XmlNodeType".
fr: '{0}' ne représente aucun 'XmlNodeType'.
it: '{0}' non rappresenta alcun elemento 'XmlNodeType'.
ja: '{0}' は 'XmlNodeType' を表していません。
ko: '{0}'은(는) 'XmlNodeType'을 나타내지 않습니다.
pl: Element „{0}” nie reprezentuje żadnego elementu „XmlNodeType”.
pt_br: '{0}' não representa nenhum 'XmlNodeType'.
ru: "{0}" не соответствует ни одному XmlNodeType.
tr: {0} bir 'XmlNodeType' temsil etmiyor.
zh_hans: “{0}”不表示任何 "XmlNodeType"。
zh_hant: '{0}' 不代表任何 'XmlNodeType'。

# Xdom_Load_NoDocument
source: The document to be loaded could not be found.
cs: Dokument, který má být načten, nebyl nalezen.
de: Das zu ladende Dokument wurde nicht gefunden.
es: No se puede encontrar el documento que se iba a cargar.
fr: Le document à charger est introuvable.
it: Il documento da caricare non è stato trovato.
ja: 読み込むドキュメントが見つかりませんでした。
ko: 로드할 문서를 찾을 수 없습니다.
pl: Nie można odnaleźć dokumentu do załadowania.
pt_br: O documento a ser carregado não pôde ser localizado.
ru: Не удалось найти подлежащий загрузке документ.
tr: Yüklenecek belge bulunamadı.
zh_hans: 未能找到要加载的文档。
zh_hant: 找不到要載入的文件。

# Xdom_Load_NoReader
source: There is no reader from which to load the document.
cs: Není k dispozici žádné čtecí zařízení, ze kterého se má načíst dokument.
de: Es ist kein Leser zum Laden des Dokuments vorhanden.
es: Falta el lector de donde se carga el documento.
fr: Il n'existe aucun lecteur à partir duquel il est possible de charger le document.
it: Non esiste alcun lettore da cui caricare il documento.
ja: ドキュメントを読み込むリーダーがありません。
ko: 문서를 로드할 판독기가 없습니다.
pl: Brak czytnika, z którego można załadować dokument.
pt_br: Não há nenhum leitor no qual o documento possa ser carregado.
ru: Отсутствует модуль чтения, из которого следует загрузить документ.
tr: Belgenin yüklenebilmesi için hiç okuyucu yok.
zh_hans: 没有可从中加载文档的阅读器。
zh_hant: 沒有載入文件來源的讀取器。

# Xdom_NamedNode_Context
source: The named node is from a different document context.
cs: Pojmenovaný uzel pochází z jiného kontextu dokumentu.
de: Der benannte Knoten stammt aus einem anderen Dokumentkontext.
es: El nodo designado pertenece a un contexto de documento diferente.
fr: Le nœud nommé provient d'un autre contexte de document.
it: Il nodo denominato appartiene a un contesto di documento diverso.
ja: 異なるドキュメント コンテキストの名前付きノードです。
ko: 명명된 노드는 다른 문서 컨텍스트에서 가져왔습니다.
pl: Nazwany węzeł pochodzi z innego kontekstu dokumentu.
pt_br: O nó nomeado é de um contexto de documento diferente.
ru: Именованный узел относится к другому контексту документа.
tr: Adı geçen düğüm farklı bir belge bağlamına ait.
zh_hans: 命名节点来自不同的文档上下文。
zh_hant: 具名節點來自不同的文件內容。

# Xdom_NoRootEle
source: The document does not have a root element.
cs: Dokument nemá kořenový element.
de: Das Dokument hat kein Stammelement.
es: El documento no tiene un elemento raíz.
fr: Le document n'a pas d'élément racine.
it: Il documento non contiene un elemento radice.
ja: ドキュメントにルート要素がありません。
ko: 문서에 루트 요소가 없습니다.
pl: Dokument nie ma elementu głównego.
pt_br: O documento não tem nenhum elemento raiz.
ru: Документ не содержит корневого элемента.
tr: Belgenin kök öğesi yok.
zh_hans: 文档没有根元素。
zh_hant: 文件沒有根項目。

# Xdom_Node_Cloning
source: 'Entity' and 'Notation' nodes cannot be cloned.
cs: Uzly Entity a Notation nelze klonovat.
de: Die Knoten "Entity" und "Notation" können nicht geklont werden.
es: No se pueden clonar los nodos "Entity" y "Notation".
fr: Les nœuds 'Entity' et 'Notation' ne peuvent pas être clonés.
it: Non è possibile clonare i nodi 'Entity' e 'Notation'.
ja: 'Entity' および 'Notation' ノードを複製することはできません。
ko: 'Entity' 및 'Notation' 노드를 복제할 수 없습니다.
pl: Węzły „Entity” i „Notation” nie mogą być klonowane.
pt_br: Não é possível clonar os nós 'Entity' nem 'Notation'.
ru: Невозможно клонировать узлы Entity и Notation.
tr: 'Entity' ve 'Notation' düğümlerinin kopyası oluşturulamaz.
zh_hans: 不能克隆 "Entity" 节点和 "Notation" 节点。
zh_hant: 無法複製 'Entity' 與 'Notation' 節點。

# Xdom_Node_Insert_Child
source: Cannot insert a node or any ancestor of that node as a child of itself.
cs: Uzel ani žádného předchůdce tohoto uzlu nelze vložit jako uzel podřízený sobě samému.
de: Ein Knoten oder Vorgängerelement dieses Knotens kann nicht als untergeordnetes Element von sich selbst eingefügt werden.
es: No se puede insertar un nodo ni ningún antecesor de ese nodo como nodo secundario de sí mismo.
fr: Impossible d'insérer un nœud ou un ancêtre de ce nœud en tant qu'enfant de lui-même.
it: Non è possibile inserire un nodo o uno dei relativi predecessori come figlio di se stesso.
ja: ノードまたはそのノードの先祖をそれ自体の子として挿入することはできません。
ko: 노드 또는 상위 노드를 자신의 자식으로 삽입할 수 없습니다.
pl: Nie można wstawić węzła lub jego elementu nadrzędnego jako elementu podrzędnego dla tego węzła.
pt_br: Não é possível inserir um nó ou qualquer ancestral dele como seu próprio filho.
ru: Невозможно вставить в качестве дочернего узла ни сам этот узел, ни его предка.
tr: Bir düğüm ve onun üst düğümlerinden biri kendisine alt düğüm olarak eklenemez.
zh_hans: 不能将节点或该节点的任何上级节点作为它自己的子级插入。
zh_hant: 無法插入節點或任何該節點的上階作為其本身的子系。

# Xdom_Node_Insert_Contain
source: The current node cannot contain other nodes.
cs: Aktuální uzel nemůže obsahovat další uzly.
de: Der aktuelle Knoten darf keine anderen Knoten enthalten.
es: El nodo actual no puede contener otros nodos.
fr: Le nœud actuel ne peut pas contenir d'autres nœuds.
it: Il nodo corrente non può contenere altri nodi.
ja: 現在のノードに他のノードを含めることはできません。
ko: 현재 노드는 다른 노드를 포함할 수 없습니다.
pl: Bieżący węzeł nie może zawierać innych węzłów.
pt_br: O nó atual não pode conter outros nós.
ru: Текущий узел не может содержать другие узлы.
tr: Geçerli düğüm başka düğümleri içeremez.
zh_hans: 当前节点不能包含其他节点。
zh_hant: 目前的節點不可包含其他節點。

# Xdom_Node_Insert_Context
source: The node to be inserted is from a different document context.
cs: Uzel, který má být vložen, pochází z jiného kontextu dokumentu.
de: Der einzufügende Knoten stammt aus einem anderen Dokumentkontext.
es: El nodo que desea insertar pertenece a otro contexto de documento.
fr: Le nœud à insérer provient d'un autre contexte de document.
it: Il nodo da inserire proviene da un contesto di documento diverso.
ja: 挿入するノードは、異なるドキュメント コンテキストのものです。
ko: 삽입할 노드를 다른 문서 컨텍스트에서 가져왔습니다.
pl: Węzeł, który ma zostać wstawiony, pochodzi z innego kontekstu dokumentu.
pt_br: O nó a ser inserido é de um contexto de documento diferente.
ru: Узел, который требуется вставить, относится к другому контексту документа.
tr: Eklenecek düğüm farklı bir belge bağlamına ait.
zh_hans: 要插入的节点出自不同的文档上下文。
zh_hant: 要插入的節點是來自不同的文件內容。
