Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlSchemaAttributeReference
source: Attribute reference '{0}' declared in schema type '{1}' from namespace '{2}'.
cs: Ve schématu typu {1} z oboru názvů {2} byl deklarován odkaz na atribut {0}.
de: Attributverweis "{0}" im Schematyp "{1}" aus dem Namespace "{2}" deklariert.
es: Referencia de atributo "{0}" declarada en el tipo de esquema "{1}" del espacio de nombres "{2}".
fr: Référence d'attribut '{0}' déclarée dans le type de schéma '{1}' de l'espace de noms '{2}'.
it: Riferimento di attributo '{0}' dichiarato nel tipo di schema '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' のスキーマの型 '{1}' に属性の参照 '{0}' が宣言されています。
ko: 네임스페이스 '{2}'의 스키마 형식 '{1}'에서 특성 참조 '{0}'이(가) 선언되었습니다.
pl: Odwołanie do atrybutu „{0}” zostało zadeklarowane w typie schematu „{1}” z przestrzeni nazw „{2}”.
pt_br: Referência de atributo '{0}' declarada no tipo de esquema '{1}' do namespace '{2}'.
ru: Ссылка на атрибут "{0}" объявлена в типе схемы "{1}" из пространства имен "{2}".
tr: '{0}' öznitelik başvurusu, '{2}' ad alanındaki '{1}' şema türünde bildirildi.
zh_hans: 特性引用“{0}”在来自命名空间“{2}”的架构类型“{1}”中声明。
zh_hant: 已在命名空間 '{2}' 的結構描述類型 '{1}' 中，宣告屬性參考 '{0}'。

# XmlSchemaCompiled
source: Cannot add schema to compiled schemas collection.
cs: Schéma nelze přidat do kolekce zkompilovaných schémat.
de: Das Schema kann nicht der kompilierten Schemasammlung hinzugefügt werden.
es: No se puede agregar el esquema a la colección de esquemas compilada.
fr: Impossible d'ajouter un schéma à une collection de schémas compilés.
it: Non è possibile aggiungere lo schema alla raccolta di schemi compilati.
ja: スキーマをコンパイル済みのスキーマ コレクションに追加することはできません。
ko: 컴파일된 스키마 컬렉션에 스키마를 추가할 수 없습니다.
pl: Nie można dodać schematu do skompilowanej kolekcji schematów.
pt_br: Não é possível adicionar esquema à coleção de esquemas compilada.
ru: Невозможно добавить схему в скомпилированную коллекцию схем.
tr: Şema derlenen şemalar koleksiyonuna eklenemedi.
zh_hans: 无法将架构添加到已编译的架构集合中。
zh_hant: 無法將結構描述新增至經過編譯的結構描述集合。

# XmlSchemaContentDef
source: Check content definition of schema type '{0}' from namespace '{1}'. {2}
cs: Zkontrolujte definici obsahu schématu typu {0} z oboru názvů {1}. {2}
de: Überprüfen Sie die Inhaltsdefinition des Schematyps "{0}" aus dem Namespace "{1}". {2}
es: Compruebe la definición de contenido del tipo de esquema "{0}" del espacio de nombres "{1}". {2}
fr: Vérifiez la définition de contenu du type de schéma '{0}' dans l'espace de noms '{1}'. {2}
it: Controllare la definizione del contenuto del tipo di schema '{0}' dello spazio dei nomi '{1}'. {2}
ja: 名前空間 '{1}' のスキーマの型 '{0}' のコンテンツの定義を確認してください。{2}
ko: 네임스페이스 '{1}'에서 스키마 형식 '{0}'의 콘텐츠 정의를 확인하세요. {2}
pl: Sprawdź definicję zawartości typu schematu „{0}” z przestrzeni nazw „{1}”. {2}
pt_br: Verifique a definição de conteúdo do tipo de esquema'{0}' do namespace '{1}'. {2}
ru: Проверьте определение содержимого для типа схемы "{0}" из пространства имен "{1}". {2}
tr: '{1}' ad alanındaki '{0}' şema türünün içerik tanımını denetleyin. {2}
zh_hans: 检查来自命名空间“{1}”的架构类型“{0}”的内容定义。{2}
zh_hant: 請檢查命名空間 '{1}' 結構描述類型 '{0}' 的內容定義。{2}

# XmlSchemaDuplicateNamespace
source: There are more then one schema with targetNamespace='{0}'.
cs: Existuje více než jedno schéma s oborem názvů targetNamespace={0}.
de: Es sind mehrere Schemas mit targetNamespace="{0}" vorhanden.
es: Hay más de un esquema con targetNamespace="{0}".
fr: Il existe plusieurs schémas avec targetNamespace='{0}'.
it: Esistono più schemi con targetNamespace='{0}'.
ja: targetNamespace='{0}' が設定されているスキーマが複数あります。
ko: targetNamespace='{0}'인 스키마가 둘 이상 있습니다.
pl: Istnieje więcej niż jeden schemat z elementem targetNamespace=„{0}”.
pt_br: Existe mais de um esquema com targetNamespace='{0}'.
ru: Существует несколько схем с targetNamespace="{0}".
tr: targetNamespace='{0}' olan birden çok şema var.
zh_hans: 存在多个 targetNamespace='{0}' 的架构。
zh_hant: 有一個以上 targetNamespace='{0}' 的結構描述。

# XmlSchemaElementReference
source: Element reference '{0}' declared in schema type '{1}' from namespace '{2}'.
cs: Ve schématu typu {1} z oboru názvů {2} byl deklarován odkaz na element {0}.
de: Elementverweis "{0}" im Schematyp "{1}" aus dem Namespace "{2}" deklariert.
es: Referencia de elemento "{0}" declarada en el tipo de esquema "{1}" del espacio de nombres "{2}".
fr: Référence d'élément '{0}' déclarée dans le type de schéma '{1}' de l'espace de noms '{2}'.
it: Riferimento all'elemento '{0}' dichiarato nel tipo di schema '{1}' dello spazio dei nomi '{2}'.
ja: 名前空間 '{2}' のスキーマの型 '{1}' に要素の参照 '{0}' が宣言されています。
ko: 네임스페이스 '{2}'의 스키마 테이블 '{1}'에서 요소 참조 '{0}'이(가) 선언되었습니다.
pl: Odwołanie do elementu „{0}” zostało zadeklarowane w typie schematu „{1}” z przestrzeni nazw „{2}”.
pt_br: Referência de elemento '{0}' declarada no tipo de esquema '{1}' do namespace '{2}'.
ru: Ссылка на элемент "{0}" объявлена в типе схемы "{1}" из пространства имен "{2}".
tr: '{0}' öğe başvurusu '{2}' ad alanındaki '{1}' şema türünde bildirildi.
zh_hans: 元素引用“{0}”在来自命名空间“{2}”的架构类型“{1}”中声明。
zh_hant: 已在命名空間 '{2}' 的結構描述類型 '{1}' 中，宣告了元素參考 '{0}'。

# XmlSchemaIncludeLocation
source: Schema attribute schemaLocation='{1}' is not supported on objects of type {0}. Please set {0}.Schema property.
cs: Atribut schématu schemaLocation={1} není podporován u objektů typu {0}. Nastavte prosím vlastnost {0}.Schema.
de: Das Schema-Attribut schemaLocation="{1}" wird für Objekte vom Typ {0} nicht unterstützt. Legen Sie die {0}.Schema-Eigenschaft fest.
es: El atributo de esquema schemaLocation="{1}" no se admite en los objetos del tipo {0}. Establezca la propiedad {0}.Schema.
fr: L'attribut de schéma schemaLocation='{1}' n'est pas pris en charge dans les objets de type {0}. Définissez la propriété {0}.Schema.
it: L'attributo dello schema schemaLocation='{1}' non è supportato in oggetti di tipo {0}. Impostare la proprietà {0}.Schema.
ja: スキーマの属性 schemaLocation='{1}' は {0} 型のオブジェクトではサポートされていません。{0}.Schema プロパティを設定してください。
ko: 스키마 특성 schemaLocation='{1}'은(는) {0} 형식의 개체에서 지원되지 않습니다. {0}.Schema 속성을 설정하세요.
pl: Atrybut schematu schemaLocation=„{1}” nie jest obsługiwany w przypadku obiektów typu {0}. Ustaw właściwość {0}.Schema.
pt_br: Não há suporte ao atributo de esquema schemaLocation='{1}' em objetos do tipo {0}. Defina a propriedade {0}.Schema.
ru: Атрибут схемы schemaLocation="{1}" не поддерживается для объектов типа {0}. Установите свойство {0}.Schema.
tr: schemaLocation='{1}' şema özniteliği {0} türündeki nesnelerde desteklenmez. Lütfen {0}.Schema özelliğini ayarlayın.
zh_hans: {0} 类型的对象不支持架构特性 schemaLocation='{1}'。请设置 {0}.Schema 属性。
zh_hant: 物件類型 {0} 不支援結構描述屬性 schemaLocation='{1}'。請設定 {0}.Schema 屬性。

# XmlSchemaItem
source: Schema item '{1}' from namespace '{0}'. {2}
cs: Položka schématu {1} z oboru názvů {0}. {2}
de: Schemaelement "{1}" aus dem Namespace "{0}". {2}
es: Elemento de esquema "{1}" del espacio de nombres "{0}". {2}
fr: Élément de schéma '{1}' de l'espace de noms '{0}'. {2}
it: Elemento dello schema '{1}' dello spazio dei nomi '{0}'. {2}
ja: 名前空間 '{0}' のスキーマ アイテム '{1}'。{2}
ko: 네임스페이스 '{0}'의 스키마 항목 '{1}'입니다. {2}
pl: Element schematu „{1}” z przestrzeni nazw „{0}”. {2}
pt_br: Item de esquema '{1}' do namespace '{0}'. {2}
ru: Элемент схемы "{1}" из пространства имен "{0}". {2}
tr: '{0}' ad alanındaki '{1}' şema öğesi. {2}
zh_hans: 来自命名空间“{0}”的架构项“{1}”。{2}
zh_hant: 命名空間 '{0}' 的結構描述項目 '{1}'。{2}

# XmlSchemaNamedItem
source: Schema item '{1}' named '{2}' from namespace '{0}'. {3}
cs: Položka schématu {1} s názvem {2} z oboru názvů {0}. {3}
de: Schemaelement "{1}" mit dem Namen "{2}" aus dem Namespace "{0}". {3}
es: Elemento de esquema "{1}" denominado "{2}" del espacio de nombres "{0}". {3}
fr: Élément de schéma '{1}' nommé '{2}' de l'espace de noms '{0}'. {3}
it: Elemento dello schema '{1}' denominato '{2}' dello spazio dei nomi '{0}'. {3}
ja: 名前空間 '{0}' の '{2}' という名前のスキーマ アイテム '{1}'。{3}
ko: 네임스페이스 '{0}'의 '{2}'(이)라는 스키마 항목 '{1}'입니다. {3}
pl: Element schematu „{1}” o nazwie „{2}” z przestrzeni nazw „{0}”. {3}
pt_br: Item de esquema '{1}' chamado '{2}' do namespace '{0}'. {3}
ru: Элемент схемы "{1}" с именем "{2}" из пространства имен "{0}". {3}
tr: '{0}' ad alanından '{2}' adındaki '{1}' şema öğesi. {3}
zh_hans: 来自命名空间“{0}”、名为“{2}”的架构项“{1}”。{3}
zh_hant: 名為 '{2}' 的命名空間 '{0}' 結構描述項目 '{1}'。{3}

# XmlSchemaSyntaxError
source: Schema with targetNamespace='{0}' has invalid syntax.
cs: Schéma s oborem názvů targetNamespace={0} má neplatnou syntaxi.
de: Das Schema mit targetNamespace="{0}" hat eine ungültige Syntax.
es: El esquema con targetNamespace="{0}" tiene una sintaxis no válida.
fr: Le schéma avec targetNamespace='{0}' a une syntaxe non valide.
it: La sintassi dello schema con targetNamespace='{0}' non è valida.
ja: targetNamespace='{0}' と記述されたスキーマに、無効な構文が含まれています。
ko: targetNamespace='{0}'인 스키마의 구문이 잘못되었습니다.
pl: Schemat, dla którego element targetNamespace=„{0}”, ma nieprawidłową składnię.
pt_br: O esquema com targetNamespace='{0}' tem sintaxe inválida.
ru: Схема с targetNamespace="{0}" имеет недопустимый синтаксис.
tr: targetNamespace='{0}' olan şemanın sözdizimi geçersiz.
zh_hans: targetNamespace='{0}' 的架构的语法无效。
zh_hant: targetNamespace='{0}' 結構描述有無效的語法。

# XmlSchemaSyntaxErrorDetails
source: Schema with targetNamespace='{0}' has invalid syntax. {1} Line {2}, position {3}.
cs: Schéma s oborem názvů targetNamespace={0} má neplatnou syntaxi. {1} řádek {2}, pozice {3}
de: Schema mit targetNamespace="{0}" weist eine ungültige Syntax auf. {1} Zeile {2}, Position {3}.
es: El esquema con targetNamespace="{0}" tiene una sintaxis no válida. {1} Línea {2}, posición {3}.
fr: Le schéma avec targetNamespace='{0}' a une syntaxe non valide. {1} Ligne {2}, position {3}.
it: La sintassi dello schema con targetNamespace='{0}' non è valida. {1} Riga {2}, posizione {3}.
ja: targetNamespace='{0}' を持つスキーマの構文が無効です。{1} 行 {2}、位置 {3}。
ko: targetNamespace='{0}'인 스키마에 잘못된 구문이 있습니다. {1} 줄 {2}, 위치 {3}.
pl: Schemat z elementem targetNamespace=„{0}” ma nieprawidłową składnię. {1} — wiersz: {2}, pozycja: {3}.
pt_br: O esquema com targetNamespace='{0}' tem sintaxe inválida. {1} Linha {2}, posição {3}.
ru: Схема с targetNamespace="{0}" имеет недопустимый синтаксис. {1} Строка {2}, позиция {3}.
tr: targetNamespace='{0}' olan şemanın sözdizimi geçersiz. {1}, Satır {2}, konum {3}.
zh_hans: targetNamespace='{0}' 的架构具有无效的语法。{1} 行 {2}，位置 {3}。
zh_hant: 包含 targetNamespace='{0}' 的結構描述有無效的語法。{1} 行 {2}，位置 {3}。

# XmlSequenceHierarchy
source: There was an error processing type '{0}'. Type member '{1}' declared in '{2}' is missing required '{3}' property. If one class in the class hierarchy uses explicit sequencing feature ({3}), then its base class and all derived classes have to do the same.
cs: Při zpracování typu {0} došlo k chybě. Členu typu {1} deklarovanému v rámci {2} chybí požadovaná vlastnost {3}. Pokud jedna třída v hierarchii tříd používá funkci explicitního řazení ({3}), bude stejná akce provedena také u její základní třídy a všech odvozených tříd.
de: Fehler beim Verarbeiten des Typs "{0}". In dem in "{2}" deklarierten Typmember "{1}" fehlt die erforderliche {3}-Eigenschaft. Wenn eine Klasse in der Klassenhierarchie die explizite Sequenzierungsfunktion ({3}) verwendet, muss dies auch für ihre Basisklasse und alle abgeleiteten Klassen gelten.
es: Error al procesar el tipo "{0}". El miembro de tipo "{1}" declarado en "{2}" es una propiedad "{3}" solicitada que falta. Si una clase de la jerarquía de clases utiliza la característica de secuenciación explícita ({3}), su clase base y todas las clases derivadas tienen que hacer lo mismo.
fr: Une erreur s'est produite durant le traitement du type '{0}'. Le membre '{1}' du type déclaré dans '{2}' n'a pas la propriété '{3}' nécessaire. Si une classe de la hiérarchie des classes utilise une fonctionnalité de séquencement explicite ({3}), la classe de base correspondante et toutes les classes dérivées devront en faire autant.
it: Si è verificato un errore durante l'elaborazione del tipo '{0}'. Nel membro del tipo '{1}' dichiarato in '{2}' manca la proprietà obbligatoria '{3}'. Se una sola classe della gerarchia di classi usa la funzionalità di sequenziazione esplicita ({3}), la classe di base e tutte le classi derivate devono usare la stessa funzionalità.
ja: 型 '{0}' の処理エラーが発生しました。'{2}' で宣言されている型メンバー '{1}' に必要な '{3}' プロパティが見つかりません。クラス階層内のいずれかのクラスが明示的シーケンス機能 ({3}) を使用している場合は、その基本クラスとすべての派生クラスも同様にこれを使用する必要があります。
ko: {0}' 형식을 처리하는 동안 오류가 발생했습니다. '{2}'에서 선언된 형식 멤버 '{1}'에 필요한 '{3}' 속성이 없습니다. 클래스 계층의 한 클래스에서 명시적 시퀀싱 기능({3})을 사용하면 기본 클래스와 모든 파생 클래스는 같은 기능을 수행해야 합니다.
pl: Wystąpił błąd podczas przetwarzania typu „{0}”. Składowa typu „{1}” zadeklarowana w elemencie „{2}” nie ma wymaganej właściwości „{3}”. Jeśli dla jednej z klas w hierarchii klas jest używana funkcja sekwencjonowania jawnego ({3}), musi być też stosowana w przypadku jej klasy bazowej oraz wszystkich klas pochodnych.
pt_br: Erro ao processar o tipo '{0}'. O membro de tipo '{1}' declarado em '{2}' não tem a propriedade '{3}' necessária. Se uma classe na hierarquia de classes usar o recurso de sequenciamento explícito ({3}), sua classe base e todas as classes derivadas terão que fazer o mesmo.
ru: Ошибка при обработке типа "{0}". Член "{1}", объявленный в "{2}", не имеет обязательного свойства "{3}". Если один класс в иерархии использует явную последовательность ({3}), то это также должны делать его базовый и все производные классы.
tr: '{0}' türü işlenirken hata oluştu. '{2}' içinde bildirilen '{1}' türü üyesinde, gereken '{3}' özelliği eksik. Sınıf hiyerarşisindeki bir sınıf ({3}) açık sıralama özelliğini kullanıyorsa, bu sınıfın temel sınıfının ve tüm türetilen sınıflarının aynı özelliği kullanması gerekir.
zh_hans: 处理类型“{0}”时发生错误。“{2}”中声明的类型成员“{1}”缺少必需的“{3}”属性。如果类层次中的一个类使用显式序列化功能({3})，则其基类和所有派生类都必须使用该功能。
zh_hant: 有錯誤的程序類型 '{0}'。在 '{2}' 類型成員 '{1}' 遺失，需要 '{3}' 屬性。若類別級階層的其中一類別使用明確的排序功能 ({3})，則其基底類別及所有衍生類別必須相同。

# XmlSequenceInconsistent
source: Inconsistent sequencing: if used on one of the class's members, the '{0}' property is required on all particle-like members, please explicitly set '{0}' using XmlElement, XmlAnyElement or XmlArray custom attribute on class member '{1}'.
cs: Nekonzistentní řazení: Pokud je vlastnost {0} použita u jednoho člena třídy, bude vyžadována u všech členů podobných částicím. Nastavte prosím explicitně {0} pomocí vlastního atributu XmlElement, XmlAnyElement nebo XmlArray u člena třídy {1}.
de: Inkonsistente Sequenzierung: Bei Verwendung für einen der Klassenmember ist die {0}-Eigenschaft für alle partikelähnlichen Member erforderlich. Legen Sie "{0}" mithilfe von XmlElement, XmlAnyElement oder dem benutzerdefinierten XmlArray-Attribut für den Klassenmember "{1}" explizit fest.
es: Secuenciación inconsistente: si se utiliza en uno de los miembros de clase, se requiere la propiedad "{0}" en todos los miembros en forma de partícula; establezca explícitamente "{0}" utilizando un atributo personalizado XmlElement, XmlAnyElement o XmlArray en el miembro de clase "{1}".
fr: Séquencement incohérent : si la propriété '{0}' est utilisée dans l'un des membres de la classe, elle est obligatoire pour tous les membres de type particule. Définissez '{0}' de manière explicite via l'attribut personnalisé XmlElement, XmlAnyElement ou XmlArray dans le membre de classe '{1}'.
it: Sequenza incoerente: se viene usata su uno dei membri della classe, la proprietà '{0}' è obbligatoria per tutti i membri simili a particelle. Impostare in modo esplicito '{0}' usando l'attributo personalizzato XmlElement, XmlAnyElement o XmlArray sul membro della classe '{1}'.
ja: シーケンスに一貫性がありません。クラスのメンバーの 1 つに使用される場合は、すべてのパーティクル型のメンバーに '{0}' プロパティが必要となります。クラス メンバー '{1}' に対し、XmlElement、XmlAnyElement または XmlArray カスタム属性を使用して '{0}' を明示的に設定してください。
ko: 일관성 없는 시퀀싱: 클래스 멤버 중 하나에서 사용되는 경우에는 모든 파티클 유사 멤버에 '{0}' 속성이 필요하므로 클래스 멤버 '{1}'에서 XmlElement, XmlAnyElement 또는 XmlArray 사용자 지정 특성을 사용하여 명시적으로 '{0}'을(를) 설정하세요.
pl: Niespójne sekwencjonowanie: w przypadku używania tej funkcji dla składowych jednej z klas właściwość „{0}” jest wymagana dla składowych w postaci cząstek. Ustaw jawnie właściwość „{0}”, używając niestandardowego atrybutu XmlElement, XmlAnyElement lub XmlArray dotyczącego składowej klasy „{1}”.
pt_br: Sequenciamento inconsistente: se for usada em um dos membros da classe, a propriedade '{0}' será exigida em todos os membros do tipo partícula. Defina explicitamente '{0}' usando o atributo personalizado XmlElement, XmlAnyElement ou XmlArray no membro da classe '{1}'.
ru: Противоречивая последовательность: при использовании для одного из членов класса свойство "{0}" становится обязательным для всех членов, имеющих вид части; явно установите "{0}" с помощью особого атрибута XmlElement, XmlAnyElement или XmlArray для члена класса "{1}".
tr: Tutarsız sıralama: sınıfın üyelerinden birinde kullanılırsa, tüm parçacık benzeri üyelerde '{0}' özelliği gerekir, lütfen '{0}' özelliğini, '{1}' sınıf üyesinde XmlElement, XmlAnyElement veya XmlArray özel özniteliğini kullanarak açık olarak belirtin.
zh_hans: 不一致的序列化: 如果用于类成员之一上，则所有类似粒子的成员都需要“{0}”属性，请在类成员“{1}”上使用 XmlElement、XmlAnyElement 或 XmlArray 自定义特性来显式设置“{0}”。
zh_hant: 排序不一致: 若使用類別層級及其中之一，則所有類物件的成員必須要有 '{0}' 屬性，請使用類別成員 '{1}' 中的 XmlElement、XmlAnyElement 或 XmlArray 自訂屬性來明確設定 '{0}'。

# XmlSequenceMatch
source: If multiple custom attributes specified on a single member only one of them have to have explicit '{0}' property, however if more that one attribute has the explicit '{0}', all values have to match.
cs: Pokud je u jednoho člena zadáno více vlastních atributů, pouze jeden z nich musí mít explicitní vlastnost {0}. Jestliže však má explicitní vlastnost {0} více než jeden atribut, musí se všechny hodnoty shodovat.
de: Wenn mehrere benutzerdefinierte Attribute für einen einzelnen Member angegeben sind, muss nur für einen von ihnen die {0}-Eigenschaft explizit festgelegt werden. Wurde jedoch für mehrere Attribute "{0}" explizit festgelegt, müssen alle Werte übereinstimmen.
es: Si se especifican varios atributos personalizados en un mismo miembro, solo uno de ellos puede tener la propiedad explícita "{0}"; sin embargo, si más de un atributo tiene la propiedad explícita "{0}", todos los valores deben coincidir.
fr: Si plusieurs attributs personnalisés sont spécifiés pour un membre, un seul d'entre eux doit avoir la propriété '{0}' explicite. Toutefois, si différents attributs disposent de cette propriété '{0}', toutes les valeurs doivent être compatibles.
it: Se sono specificati più attributi personalizzati su un singolo membro, solo uno di essi deve includere la proprietà esplicita '{0}'. Tuttavia, se più attributi includono la proprietà esplicita '{0}', tutti i valori devono corrispondere.
ja: 1 つのメンバーに複数のカスタム属性が指定されている場合、明示的な '{0}' プロパティが必要なのはそのうちの 1 つだけです。ただし、複数の属性に明示的な '{0}' が設定されている場合は、すべての値が一致している必要があります。
ko: 단일 멤버에 여러 사용자 지정 특성을 지정한 경우에는 해당 특성 중 한 특성에만 명시적 '{0}' 속성이 있어야 하지만 둘 이상의 특성에 명시적 '{0}'이(가) 있으면 모든 값이 일치해야 합니다.
pl: Jeśli dla pojedynczej składowej ustawiono wiele atrybutów niestandardowych, tylko jeden z nich musi mieć jawną właściwość „{0}”. Jeśli jednak liczba atrybutów z jawną właściwością „{0}” jest większa, wszystkie wartości muszą być zgodne.
pt_br: Se vários atributos personalizados forem especificados em um único membro, somente um deles terá que ter a propriedade explícita '{0}'. No entanto, se mais de um atributo tiver a propriedade explícita '{0}', todos os valores deverão corresponder.
ru: Если для одного члена указано несколько особых атрибутов, то только один из них должен иметь свойство "{0}" явно; если же свойство "{0}" явно имеют несколько атрибутов, то все значения должны быть равны.
tr: Tek bir üyede birden çok özel öznitelik belirtildiyse, yalnızca bunlardan birinin açık '{0}' özelliği olmalıdır; ancak birden çok özniteliğin açık '{0}' özelliği varsa, tüm değerlerin eşleşmesi gerekir.
zh_hans: 如果在单个成员上指定了多个自定义特性，则只有其中一个特性必须具有显式“{0}”属性；但如果不止一个特性具有显式“{0}”，则所有值都必须匹配。
zh_hant: 若指定於單一成員的多個自訂屬性中，只有其中之一必須要有明確的 '{0}' 屬性，但若一個以上的屬性有明確的 '{0}'，則所有值都必須相符。

# XmlSequenceMembers
source: Explicit sequencing may not be used on parameters or return values. Please remove {0} property from custom attributes.
cs: Explicitní řazení nelze používat u parametrů nebo vrácených hodnot. Odeberte prosím vlastnost {0} z vlastních atributů.
de: Die explizite Sequenzierung kann nicht für Parameter oder Rückgabewerte verwendet werden. Entfernen Sie die {0}-Eigenschaft aus benutzerdefinierten Attributen.
es: No se puede utilizar la secuenciación explícita en parámetros o valores devueltos. Elimine la propiedad {0} de los atributos personalizados.
fr: Impossible d'utiliser un séquencement explicite dans des paramètres ou des valeurs retournées. Supprimez la propriété {0} des attributs personnalisés.
it: Non è possibile usare la sequenza esplicita su parametri o valori restituiti. Rimuovere la proprietà {0} dagli attributi personalizzati.
ja: パラメーターまたは戻り値には、明示的なシーケンスを使用することはできません。カスタム属性の {0} プロパティを削除してください。
ko: 명시적 시퀀싱은 매개 변수나 반환 값에서 사용할 수 없습니다. 사용자 지정 특성에서 {0} 속성을 제거하세요.
pl: Sekwencjonowanie jawne nie może być używane dla parametrów lub wartości zwracanych. Usuń właściwość {0} z atrybutów niestandardowych.
pt_br: O sequenciamento explícito não pode ser usado em vários parâmetros ou em valores retornados. Remova a propriedade {0} dos atributos personalizados.
ru: Невозможно использовать явную последовательность для параметров или возвращаемых значений. Удалите свойство {0} из особых атрибутов.
tr: Açık sıralama, parametrelerde veya dönüş değerlerinde kullanılamayabilir. Lütfen {0} özelliğini özel özniteliklerden kaldırın.
zh_hans: 不能对参数或返回值使用显式序列化。请从自定义特性中删除 {0} 属性。
zh_hant: 明確排序不可用於參數或傳回值。請從自訂屬性中移除 {0}。

# XmlSequenceUnique
source: '{1}' values must be unique within the same scope. Value '{0}' is in use. Please change '{1}' property on '{2}'.
cs: Hodnoty {1} musí být jedinečné v rámci stejného oboru. Hodnota {0} se používá. Změňte prosím vlastnost {1} na hodnotu {2}.
de: {1}-Werte müssen innerhalb desselben Bereichs eindeutig sein. Der Wert "{0}" wird verwendet. Ändern Sie die {1}-Eigenschaft für "{2}".
es: Los valores "{1}" deben ser únicos en el mismo ámbito. Está en uso el valor "{0}". Cambie la propiedad "{1}" de "{2}".
fr: Les valeurs '{1}' doivent être uniques dans la même portée. La valeur '{0}' est utilisée. Changez la propriété '{1}' sur '{2}'.
it: I valori di '{1}' devono essere univoci all'interno dello stesso ambito. Il valore di '{0}' è in uso. Modificare la proprietà '{1}' in '{2}'.
ja: '{1}' の値は、同一スコープ内では一意である必要があります。値 '{0}' は既に使用されています。'{2}' の '{1}' プロパティを変更してください。
ko: '{1}' 값은 같은 범위 내에서 고유해야 합니다. 값 '{0}'은(는) 사용 중입니다. '{2}'에서 '{1}' 속성을 변경하세요.
pl: W jednym zakresie wartości elementu „{1}” muszą być unikatowe. Wartość „{0}” jest już używana. Zmień właściwość „{1}” na „{2}”.
pt_br: Os valores de '{1}' devem ser exclusivos no mesmo escopo. O valor '{0}' está em uso. Altere a propriedade '{1}' em '{2}'.
ru: Значения "{1}" должны быть уникальными в пределах одной области. Значение "{0}" используется. Измените свойство "{1}" для "{2}".
tr: '{1}' değerleri aynı kapsam içinde benzersiz olmalı. '{0}' değeri kullanılıyor. Lütfen '{2}' üzerindeki '{1}' özelliğini değiştirin.
zh_hans: 在同一范围内“{1}”值必须唯一。正在使用值“{0}”。请更改“{2}”上的“{1}”属性。
zh_hant: '{1}' 在相同範圍內必須是唯一的值。值 '{0}' 正在使用中。請變更 '{2}' 上的 '{1}' 屬性。
