Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_GroupBaseRestNotEmptiable
source: All particles in the {particles} of the base particle which are not mapped to by any particle in the {particles} of the derived particle should be emptiable - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
cs: Všechny částice v {particles} základní částice, které nejsou namapovány žádnou částicí v {particles} odvozené částice, by měly být vyprázdnitelné – All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
de: Alle Partikel in {particles} des Basispartikels, die nicht durch ein beliebiges Partikel in {particles} des abgeleiteten Partikels zugeordnet sind, müssen leerbar sein – All:All,Sequence:Sequence -- Recurse-Regel 2 / Choice:Choice -- RecurseLax.
es: Todas las partículas {particles} de la partícula base que no están asignadas por ninguna partícula {particles} de la partícula derivada deben poderse vaciar - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
fr: Toutes les particules des {particles} de la particule de base non mappées à une particule des {particles} de la particule dérivée doivent pouvoir être vidées - All:All,Sequence:Sequence -- Recurse Rule 2/Choice:Choice -- RecurseLax.
it: Tutte le particelle nell'elemento {particles} della particella di base per le quali non è stato eseguito il mapping in nessuna particella nell'elemento {particles} della particella derivata devono essere Emptiable (regola 2 di All:All,Sequence:Sequence -- Recurse/Choice:Choice -- RecurseLax).
ja: 派生型のパーティクルの {particles} に保持されている any パーティクルによりマップされていない、基本型のパーティクルの {particles} に保持されている all パーティクルは、空にもできる必要があります。All:All,Sequence:Sequence -- Recurse 規則 2 または Choice:Choice - RecurseLax
ko: 파생 파티클의 {particles}에 있는 모든 파티클에 의해 매핑되지 않는 기본 파티클의 {particles}에 있는 모든 파티클은 All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax에 따라 비워 둘 수 있어야 합니다.
pl: Wszystkie cząstki elementu {particles} cząstki podstawowej, które nie zostały zamapowane przy użyciu dowolnej cząstki elementu {particles} cząstki pochodnej, powinny być możliwe do wyczyszczenia (All:All,Sequence:Sequence -- Recurse: reguła 2/Choice:Choice -- RecurseLax).
pt_br: Todas as partículas de {particles} da partícula base que não estejam mapeadas por nenhuma partícula nas {particles} da partícula derivada devem poder ser esvaziadas – All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax.
ru: Все части в {particles} базовой части, которые не сопоставлены частям в {particles} производной части, должны предусматривать возможность освобождения — All:All,Sequence:Sequence — Recurse Rule 2/Choice:Choice — RecurseLax.
tr: Temel parçacığın {particles} bölümü içinde bulunan ve türetilen parçacığın {particles} bölümündeki parçacıklara eşlenmeyen tüm parçacıkları, boşaltılabilir olmalıdır - All:All,Sequence:Sequence -- Recurse Kural 2 / Choice:Choice -- RecurseLax.
zh_hans: 根据 All:All,Sequence:Sequence -- Recurse 规则 2 / Choice:Choice -- RecurseLax，如果派生粒子的 {particles} 中的任意粒子均未映射至某基本粒子，则此基本粒子的 {particles} 中的所有粒子应可以为空。
zh_hant: 基底物件 {particles} 中的所有物件，與衍生物件 {particles} 中的 By Any 物件不對應時，應可設為空 - All:All,Sequence:Sequence -- Recurse Rule 2 / Choice:Choice -- RecurseLax。

# Sch_GroupBaseRestRangeInvalid
source: The derived particle's range is not a valid restriction of the base particle's range according to All:All,Sequence:Sequence -- Recurse Rule 1 or Choice:Choice -- RecurseLax.
cs: Rozsah odvozené částice nepředstavuje platné omezení rozsahu základní částice podle All:All,Sequence:Sequence -- Recurse Rule 1 nebo Choice:Choice -- RecurseLax.
de: Gemäß All:All,Sequence:Sequence -- Recurse-Regel 1 oder Choice:Choice -- RecurseLax ist der Bereich des abgeleiteten Partikels keine gültige Einschränkung des Basispartikelbereichs.
es: El intervalo de la partícula derivada no es una restricción válida del intervalo de la partícula base según All:All,Sequence:Sequence -- Recurse Rule 1 o Choice:Choice -- RecurseLax.
fr: La plage de la particule dérivée n'est pas une restriction valide de la plage de la particule de base, selon All:All,Sequence:Sequence -- Recurse Rule 1 ou Choice:Choice -- RecurseLax.
it: L'intervallo della particella derivata non è una restrizione valida dell'intervallo della particella di base in base alla regola 1 di All:All,Sequence:Sequence -- Recurse oppure a Choice:Choice -- RecurseLax.
ja: All:All,Sequence:Sequence -- Recurse 規則 1 または Choice:Choice -- RecurseLax の定義により、派生型のパーティクルの範囲は、基本型のパーティクルの範囲の有効な制限とは認められません。
ko: 파생 파티클의 범위는 All:All,Sequence:Sequence -- Recurse Rule 1 또는 Choice:Choice -- RecurseLax에 따라 기본 파티클 범위의 유효한 제한이 아닙니다.
pl: Zakres cząstki pochodnej nie jest prawidłowym ograniczeniem zakresu cząstki podstawowej (All:All,Sequence:Sequence -- Recurse: reguła 1 lub Choice:Choice -- RecurseLax).
pt_br: O intervalo da partícula derivada não é uma restrição válida do intervalo da partícula base de acordo com All:All,Sequence:Sequence -- Recurse Rule 1 ou Choice:Choice -- RecurseLax.
ru: Диапазон производной части не является действительным ограничением базовой части в соответствии с All:All,Sequence:Sequence — Recurse Rule 1 или Choice:Choice — RecurseLax.
tr: Türetilen parçacığın aralığı, All:All,Sequence:Sequence -- Recurse Kural 1 veya Choice:Choice -- RecurseLax kuralına göre temel parçacık aralığının geçerli bir kısıtlaması değil.
zh_hans: 根据 All:All,Sequence:Sequence -- Recurse 规则 1 或 Choice:Choice -- RecurseLax，派生粒子的范围不是基本粒子范围的有效限制。
zh_hant: 根據 All:All,Sequence:Sequence -- Recurse Rule 1 or Choice:Choice -- RecurseLax，衍生物件範圍不是基底物件範圍的有效限制。

# Sch_GroupCircularRef
source: Circular group reference.
cs: Cyklický odkaz na skupinu
de: Zirkulärer Gruppenverweis.
es: Referencia circular a grupos.
fr: Référence de groupe circulaire.
it: Riferimento circolare a gruppo.
ja: グループの循環参照です。
ko: 순환 그룹 참조입니다.
pl: Cykliczne odwołanie do grupy.
pt_br: Referência circular de grupo.
ru: Циклическая ссылка на группу.
tr: Döngüsel grup başvurusu.
zh_hans: 循环组引用。
zh_hant: 循環群組參考。

# Sch_GroupDisabled
source: The group is not allowed when ElementType has empty or textOnly content.
cs: Pokud má typ ElementType hodnotu empty nebo obsah typu textOnly, není skupina povolena.
de: Die Gruppe ist nicht zulässig, wenn ElementType einen empty- oder textOnly-Inhalt hat.
es: No se permite el grupo cuando ElementType tiene contenido vacío o de tipo textOnly.
fr: Le groupe n'est pas autorisé quand ElementType a un contenu empty ou textOnly.
it: Il gruppo non è consentito quando il contenuto di ElementType è empty o textOnly.
ja: ElementType に 'empty' または 'textOnly' コンテンツが含まれているときは、グループは使用できません。
ko: ElementType에 empty 또는 textOnly 콘텐츠가 있는 경우 Group을 사용할 수 없습니다.
pl: Grupa jest niedozwolona, gdy element ElementType ma zawartość pustą (empty) lub textOnly.
pt_br: O grupo não é permitido quando ElementType tem conteúdo vazio ou textOnly.
ru: Эта группа запрещена, если содержимое ElementType — empty или textOnly.
tr: ElementType empty veya textOnly içeriğe sahip olduğunda Group'a izin verilmez.
zh_hans: 当 ElementType 的内容为空或 textOnly 时，不允许使用该组。
zh_hant: 當 ElementType 擁有 empty 或 textOnly 內容時，不允許群組。

# Sch_GroupDoubleRedefine
source: Double redefine for group.
cs: Skupina byla předefinována dvakrát.
de: Doppelte Neudefinition für Gruppe.
es: Redefinición doble para el grupo.
fr: Double redéfinition pour le groupe.
it: Doppia ridefinizione per il gruppo.
ja: グループに対する二重定義です。
ko: 그룹을 두 번 다시 정의했습니다.
pl: Podwójne przedefiniowanie dla grupy.
pt_br: Redefinição dupla para grupo.
ru: Двойное переопределение для группы.
tr: Grup için çift yeniden tanımlama.
zh_hans: 组的双重重定义。
zh_hant: 重新定義兩次群組。

# Sch_GroupRedefineNotFound
source: No group to redefine.
cs: Nebyla nalezena žádná skupina k předefinování.
de: Es ist keine Gruppe zum erneuten Definieren vorhanden.
es: No hay ningún grupo para redefinir.
fr: Aucun groupe à redéfinir.
it: Non ci sono gruppi da ridefinire.
ja: 再定義するグループがありません。
ko: 다시 정의할 그룹이 없습니다.
pl: Brak grupy do przedefiniowania.
pt_br: Nenhum grupo a ser redefinido.
ru: Отсутствует группа для переопределения.
tr: Yeniden tanımlanacak grup yok.
zh_hans: 没有要重新定义的组。
zh_hant: 沒有群組可以重新定義。

# Sch_ICXpathError
source: '{0}' is an invalid XPath for selector or field.
cs: Hodnota XPath {0} pro selektor nebo pole je neplatná.
de: "{0}" ist ein ungültiger XPath für die Auswahl oder das Feld.
es: "{0}" no es una expresión XPath válida para el selector o campo.
fr: '{0}' est un XPath non valide pour selector ou field.
it: '{0}' non è un XPath valido per un selettore o un campo.
ja: '{0}' は、セレクターまたはフィールドの XPath としては無効です。
ko: '{0}'을(를) 선택기 또는 필드의 XPath로 사용할 수 없습니다.
pl: Element „{0}” jest nieprawidłową ścieżką XPath dla selektora lub pola.
pt_br: '{0}' é um XPath inválido para seletor ou campo.
ru: "{0}" является недопустимым XPath для селектора или поля.
tr: '{0}', seçici veya alan için geçersiz bir XPath.
zh_hans: “{0}”对于选择器或字段是无效的 XPath。
zh_hant: '{0}' 不是選取器或欄位的有效 XPath。

# Sch_IdAttrDeclared
source: The attribute of type ID is already declared on the '{0}' element.
cs: Atribut typu ID již je v elementu {0} deklarován.
de: Das Attribut der Typ-ID ist bereits im {0}-Element deklariert.
es: Ya se ha declarado el atributo de tipo ID en el elemento "{0}".
fr: L'attribut de l'ID de type est déjà déclaré sur l'élément '{0}'.
it: L'attributo dell'ID tipo è già dichiarato nell'elemento '{0}'.
ja: タイプ ID の属性は既に '{0}' 要素で宣言されています。
ko: 형식 ID 특성이 '{0}' 요소에서 이미 선언되었습니다.
pl: Atrybut typu ID jest już zadeklarowany dla elementu „{0}”.
pt_br: O atributo de ID do tipo já foi declarado no elemento '{0}'.
ru: Атрибут с типом ID уже объявлен для элемента "{0}".
tr: ID türünün özniteliği '{0}' öğesinde zaten bildirildi.
zh_hans: “{0}”元素上已声明了类型 ID 的特性。
zh_hant: 已於 '{0}' 元素上宣告類型識別碼的屬性。

# Sch_IdConstraintNoFields
source: At least one field must be present.
cs: Musí být uvedeno alespoň jedno pole.
de: Mindestens ein Feld muss vorhanden sein.
es: Se debe especificar al menos un campo.
fr: Au moins un champ doit être présent.
it: Deve essere presente almeno un campo.
ja: 少なくとも 1 つのフィールドを指定しなければなりません。
ko: 적어도 하나 이상의 필드가 있어야 합니다.
pl: Musi być obecne co najmniej jedno pole.
pt_br: Deve haver pelo menos um campo.
ru: Должно быть указано по меньшей мере одно поле.
tr: En az bir alan bulunmalıdır.
zh_hans: 必须至少存在一个字段。
zh_hant: 至少必須要有一個欄位。

# Sch_IdConstraintNoRefer
source: The referring attribute must be present.
cs: Musí být uveden odkazující atribut.
de: Das verweisende Attribut muss vorhanden sein.
es: El atributo de referencia debe estar presente.
fr: L'attribut de référence doit être présent.
it: L'attributo di riferimento deve essere presente.
ja: 参照元の属性を指定しなければなりません。
ko: 참조 특성이 있어야 합니다.
pl: Atrybut odwołania musi być obecny.
pt_br: O atributo referenciado deve estar presente.
ru: Должен быть указан содержащий ссылку атрибут.
tr: Başvuran öznitelik bulunmalıdır.
zh_hans: 引用特性必须存在。
zh_hant: 必須有參考屬性。

# Sch_IdConstraintNoSelector
source: Selector must be present.
cs: Musí být uveden selektor.
de: Die Auswahl muss vorhanden sein.
es: El selector debe estar presente.
fr: Selector doit être présent.
it: Il selettore deve essere presente.
ja: セレクターを指定しなければなりません。
ko: 선택기가 있어야 합니다.
pl: Selektor musi być obecny.
pt_br: O seletor deve estar presente.
ru: Должен быть указан селектор.
tr: Seçici bulunmalıdır.
zh_hans: 选择器必须存在。
zh_hant: 必須提供選取器。

# Sch_IdentityConstraintCircularRef
source: Circular identity constraint reference.
cs: Cyklický odkaz na omezení identity
de: Zirkulärer Identitätseinschränkungsverweis.
es: Referencia de restricción de identidad circular.
fr: Référence de contrainte d'identité circulaire.
it: Riferimento circolare a vincolo di identità.
ja: identity 制約循環参照です。
ko: 순환 identity 제약 조건 참조입니다.
pl: Cykliczne odwołanie do ograniczenia tożsamości.
pt_br: Referência circular de restrição de identidade.
ru: Циклическая ссылка на ограничение по идентификатору.
tr: Döngüsel kimlik kısıtlama başvurusu.
zh_hans: 循环标识约束引用。
zh_hant: 循環身分識別條件約束參考。

# Sch_ImportLocation
source: The 'import' element cannot appear at this location.
cs: Element import nemůže být použit na tomto umístění.
de: Das import-Element kann an dieser Stelle nicht verwendet werden.
es: El elemento "import" no puede aparecer en esta ubicación.
fr: L'élément 'import' ne peut pas s'afficher à cet emplacement.
it: In questa posizione non può essere presente l'elemento 'import'.
ja: 'import' 要素はこの場所に指定できません。
ko: 'import' 요소는 이 위치에 사용할 수 없습니다.
pl: Element „import” nie może pojawiać się w tym miejscu.
pt_br: O elemento 'import' não pode aparecer neste local.
ru: Элемент import не может находиться в этом месте.
tr: 'import' öğesi bu konumda bulunamaz.
zh_hans: "import" 元素不能出现在此位置。
zh_hant: 'import' 元素不可出現於此位置。

# Sch_ImportTargetNamespace
source: Namespace attribute of an import must not match the real value of the enclosing targetNamespace of the <schema>.
cs: Atribut Namespace importu nesmí odpovídat skutečné hodnotě vlastnosti targetNamespace elementu <schema>.
de: Das namespace-Attribut eines Imports darf nicht mit dem tatsächlichen Wert des einschließenden targetNamespace von <schema> übereinstimmen.
es: El atributo de espacio de nombres de una importación no debe coincidir con el valor real de targetNamespace envolvente del <schema>.
fr: L'attribut d'espace de noms d'une importation ne doit pas correspondre à la valeur réelle du targetNamespace englobant du <schema>.
it: L'attributo Namespace di un'importazione non deve corrispondere al valore reale dell'elemento targetNamespace che contiene l'elemento <schema>.
ja: インポートの名前空間属性が、それを囲む <schema> の targetNamespace の実際の値と一致してはなりません。
ko: 가져오기의 네임스페이스 특성은 <schema>의 바깥쪽 targetNamespace에 대한 실제 값과 일치하지 않아야 합니다.
pl: Atrybutowi przestrzeni nazw dla importu nie może odpowiadać rzeczywista wartość elementu targetNamespace elementu <schema>.
pt_br: O atributo Namespace de uma importação não deve corresponder ao valor real de targetNamespace do <schema> incluso.
ru: Атрибут пространства имен при импорте не должен соответствовать фактическому значению заключающего targetNamespace данной <schema>.
tr: İçeri aktarmanın Namespace özniteliği <schema> öğesinin kapsayan targetNamespace gerçek değeri ile aynı olmamalıdır.
zh_hans: 导入的命名空间特性不得与 <schema> 的封闭 targetNamespace 的实际值匹配。
zh_hant: 匯入的命名空間屬性不可與 <schema> 的封閉式 targetNamespace 實際值相符。

# Sch_ImportTargetNamespaceNull
source: The enclosing <schema> must have a targetNamespace, if the Namespace attribute is absent on the import element.
cs: Pokud v elementu import chybí atribut Namespace, musí mít element <schema> atribut targetNamespace.
de: Das einschließende <schema> muss einen targetNamespace haben, wenn das Namespace-Attribut im import-Element nicht vorhanden ist.
es: El <schema> envolvente debe tener un atributo targetNamespace, si el atributo Namespace no está presente en el elemento de importación.
fr: Le <schema> englobant doit avoir un targetNamespace si l'attribut Namespace est absent de l'élément d'importation.
it: Se l'attributo Namespace non è presente nell'elemento import, l'elemento <schema> che lo contiene deve contenere un elemento targetNamespace.
ja: インポート要素に名前空間属性がない場合は、取り囲み <schema> は targetNamespace を必要とします。
ko: import 요소에 네임스페이스 특성이 없는 경우 바깥쪽 <schema>에 targetNamespace가 있어야 합니다.
pl: Otaczający element <schema> musi mieć element targetNamespace, jeśli w importowanym elemencie nie jest obecny atrybut Namespace.
pt_br: O <schema> incluso deverá ter um targetNamespace se o atributo Namespace estiver ausente no elemento de importação.
ru: Заключающие теги <schema> должны содержать targetNamespace, если атрибут Namespace для элемента импорта отсутствует.
tr: İçeri aktarma öğesinde Namespace özniteliği yoksa, kapsayan <schema> öğesinin bir targetNamespace'i olmalıdır.
zh_hans: 如果导入元素上不存在命名空间特性，则封闭 <schema> 必须具有 targetNamespace。
zh_hant: 若匯入的元素上沒有 Namespace 屬性，則封閉式 <schema> 必須要有 targetNamespace。

# Sch_IncludeLocation
source: The 'include' element cannot appear at this location.
cs: Element include nemůže být použit na tomto umístění.
de: Das include-Element kann an dieser Stelle nicht verwendet werden.
es: El elemento "include" no puede aparecer en esta ubicación.
fr: L'élément 'include' ne peut pas s'afficher à cet emplacement.
it: In questa posizione non può essere presente l'elemento 'include'.
ja: 'include' 要素はこの場所に指定できません。
ko: 'include' 요소는 이 위치에 사용할 수 없습니다.
pl: Element „include” nie może pojawić się w tym miejscu.
pt_br: O elemento 'include' não pode aparecer neste local.
ru: Элемент include не может находиться в этом месте.
tr: 'include' öğesi bu konumda bulunamaz.
zh_hans: "include" 元素不能出现在此位置。
zh_hant: 'include' 元素不可出現於此位置。

# Sch_IncompleteContent
source: The element {0} has incomplete content.
cs: Obsah elementu {0} je neúplný.
de: Der Inhalt des Elements {0} ist unvollständig.
es: El contenido del elemento {0} está incompleto.
fr: Le contenu de l'élément {0} est incomplet.
it: Il contenuto dell'elemento {0} è incompleto.
ja: 要素 {0} に不完全な内容が含まれています。
ko: {0} 요소의 콘텐츠가 완전하지 않습니다.
pl: Element {0} ma niekompletną zawartość.
pt_br: O elemento {0} apresenta conteúdo incompleto.
ru: Содержимое элемента {0} является неполным.
tr: {0} öğesinin içeriği eksik.
zh_hans: 元素 {0} 的内容不完整。
zh_hant: 元素 {0} 的內容不完整。

# Sch_IncompleteContentComplex
source: The element {0} has incomplete content - {2}
cs: Element {0} má neúplný obsah – {2}
de: Der Inhalt des Elements {0} ist unvollständig – {2}.
es: El contenido del elemento {0} está incompleto - {2}
fr: Le contenu de l'élément {0} est incomplet - {2}
it: Il contenuto dell'elemento {0} è incompleto - {2}
ja: 要素 {0} に不完全な内容が含まれています。{2}
ko: {0} 요소의 콘텐츠가 완전하지 않습니다. {2}
pl: Element {0} ma niekompletną zawartość — {2}.
pt_br: O elemento {0} apresenta conteúdo incompleto – {2}
ru: Содержимое элемента {0} является неполным — {2}
tr: {0} öğesinin içeriği eksik - {2}
zh_hans: 元素 {0} 的内容不完整 - {2}
zh_hant: 元素 {0} 的內容不完整 - {2}

# Sch_IncompleteContentExpecting
source: The element {0} has incomplete content. List of possible elements expected: {1}.
cs: Obsah elementu {0} je neúplný. Seznam možných očekávaných elementů: {1}
de: Der Inhalt des Elements {0} ist unvollständig. Erwartet wurde die Liste der möglichen Elemente: {1}.
es: El contenido del elemento {0} está incompleto. Lista esperada de elementos posibles: {1}.
fr: Le contenu de l'élément {0} est incomplet. Liste d'éléments possibles attendus : {1}.
it: Il contenuto dell'elemento {0} è incompleto. Elenco dei possibili elementi previsti: {1}.
ja: 要素 {0} には不完全な内容が含まれています。必要とされる要素は {1} です。
ko: {0} 요소의 콘텐츠가 완전하지 않습니다. 필요한 요소 목록: {1}
pl: Element {0} ma niekompletną zawartość. Lista oczekiwanych elementów: {1}.
pt_br: O elemento {0} apresenta conteúdo incompleto. Lista de possíveis elementos esperados: {1}.
ru: Содержимое элемента {0} является неполным. Список ожидаемых элементов: {1}.
tr: '{0}' öğesinin içeriği eksik. Beklenen olası öğeler listesi: {1}.
zh_hans: 元素 {0} 的内容不完整。应使用的元素如下: {1}。
zh_hant: 元素 {0} 的內容不完整。可能元素的清單應為: {1}。

# Sch_IncompleteContentExpectingComplex
source: The element {0} has incomplete content. List of possible elements expected: {1}. {2}
cs: Obsah elementu {0} je neúplný. Seznam možných očekávaných elementů: {1}. {2}
de: Der Inhalt des Elements {0} ist unvollständig. Erwartet wurde die Liste der möglichen Elemente: {1}. {2}
es: El contenido del elemento {0} está incompleto. Lista esperada de elementos posibles: {1}. {2}
fr: Le contenu de l'élément {0} est incomplet. Liste d'éléments possibles attendus : {1}. {2}
it: Il contenuto dell'elemento {0} è incompleto. Elenco dei possibili elementi previsti: {1}. {2}
ja: 要素 {0} に不完全な内容が含まれています。必要とされる要素は {1} です。{2}
ko: {0} 요소의 콘텐츠가 완전하지 않습니다. 필요한 요소 목록: {1}. {2}
pl: Element {0} ma niekompletną zawartość. Lista oczekiwanych możliwych elementów: {1}. {2}
pt_br: O elemento {0} apresenta conteúdo incompleto. Lista de possíveis elementos esperados: {1}. {2}
ru: Содержимое элемента {0} является неполным. Список ожидаемых элементов: {1}. {2}
tr: {0} öğesinin içeriği eksik. Beklenen olası öğeler listesi: {1}. {2}
zh_hans: 元素 {0} 的内容不完整。应使用的元素如下: {1}。{2}
zh_hant: 元素 {0} 的內容不完整。可能元素的清單應為: {1}。{2}

# Sch_InvalidAllElementMax
source: The {max occurs} of all the particles in the {particles} of an all group must be 0 or 1.
cs: Výraz {max occurs} všech částic v atributu {particles} skupiny all musí mít hodnotu 0 nebo 1.
de: Der Wert von {max occurs} aller Partikel in {particles} einer all-Gruppe muss 0 oder 1 sein.
es: El valor {max occurs} de todas las partículas en los elementos {particles} de todo un grupo debe ser 0 o 1.
fr: Le nombre {max occurs} de toutes les particules des {particles} d'un groupe all doit être 0 ou 1.
it: Il valore di {max occurs} di tutte le particelle negli elementi {particles} di un gruppo all deve essere 0 o 1.
ja: all group の {particles} にあるすべてのパーティクルの {max occurs} は 0 か 1 でなければなりません。
ko: all 그룹의 {particles}에서 모든 파티클의 {max occurs}는 0 또는 1이어야 합니다.
pl: Element {max occurs} wszystkich cząstek w elemencie {particles} grupy all musi wynosić 0 lub 1.
pt_br: As {max occurs} de todas as partículas nas {particles} de um grupo all deve ser 0 ou 1.
ru: {max occurs} всех частей из {particles} группы all должны иметь значения 0 или 1.
tr: Bir 'all' grubunun {particles}'ı içindeki tüm parçacıkların {max occurs} değeri 0 veya 1 olmalıdır.
zh_hans: all 组的 {particles} 中所有粒子的 {max occurs} 必须是 0 或 1。
zh_hant: 所有群組 {particles} 中所有物件的 {max occurs} 必須是 0 或 1。

# Sch_InvalidAllMax
source: 'all' must have {max occurs}=1.
cs: Pro atribut all musí platit {max occurs}=1.
de: "all" muss {max occurs} = 1 aufweisen.
es: "all" debe tener un valor {max occurs}=1.
fr: 'all' doit avoir {max occurs}=1.
it: Con 'all' il valore di {max occurs} deve essere 1.
ja: 'all' には {max occurs}=1 を指定しなければなりません。
ko: 'all'에서 {max occurs}=1이어야 합니다.
pl: Element „all” musi mieć element {max occurs}=1.
pt_br: 'all' deve ter {max occurs}=1.
ru: Для all должно выполняться равенство {max occurs}=1.
tr: 'all' için {max occurs}=1 olmalıdır.
zh_hans: "all" 必须使 {max occurs}=1。
zh_hant: 'all' 必須要有 {max occurs}=1。

# Sch_InvalidAllMin
source: 'all' must have 'minOccurs' value of 0 or 1.
cs: Pro atribut all musí platit, že hodnota minOccurs je rovna 0 nebo 1.
de: "all" muss für "minOccurs" den Wert 0 oder 1 aufweisen.
es: "all" debe tener un valor "minOccurs" igual a 0 o 1.
fr: 'all' doit avoir une valeur 'minOccurs' égale à 0 ou 1.
it: Il valore di 'minOccurs' in 'all' deve essere 0 o 1.
ja: 'all' の値は 0 または 1 の 'minOccurs' 値でなければなりません。
ko: 'all'에는 0 또는 1의 'minOccurs' 값이 있어야 합니다.
pl: Element „all” musi mieć wartość „minOccurs” równą 0 lub 1.
pt_br: 'all' deve ter valor 'minOccurs' igual a 0 ou 1.
ru: Для all значение minOccurs должно быть равно 0 или 1.
tr: 'all' için 'minOccurs' değeri 0 veya 1 olmalıdır.
zh_hans: "all" 必须具有值为 0 或 1 的 "minOccurs"。
zh_hant: 'all' 必須要將 'minOccurs' 的值設定為 0 或 1。

# Sch_InvalidAny
source: Invalid namespace in 'any'.
cs: Neplatný obor názvů v atributu any
de: Ungültiger Namespace in "any".
es: Espacio de nombre no válido en "any".
fr: Espace de noms non valide dans 'any'.
it: Spazio dei nomi non valido in 'any'.
ja: 'any' に無効な名前空間があります。
ko: 'any'에서 네임스페이스가 잘못되었습니다.
pl: Nieprawidłowa przestrzeń nazw w elemencie „any”.
pt_br: Namespace inválido em 'any'.
ru: Недопустимое пространство имен в any.
tr: 'any' içinde geçersiz ad alanı.
zh_hans: "any" 中的命名空间无效。
zh_hant: 'any' 中的命名空間無效。
