Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_RequireEnumeration
source: Data type should be enumeration when the values attribute is present.
cs: Je-li přítomen atribut values, musí se jednat o výčtový datový typ.
de: Der Datentyp muss "enumeration" sein, wenn das values-Attribut vorhanden ist.
es: El tipo de datos debe ser igual a enumeration cuando el atributo values está presente.
fr: Le type de données doit être une énumération quand l'attribut values est présent.
it: Quando è presente l'attributo values, il tipo di dati deve essere enumeration.
ja: 'values' 属性が存在する場合、データ型は 'enumeration' でなければなりません。
ko: values 특성이 있는 경우 데이터 형식은 열거형이어야 합니다.
pl: Typ danych powinien być typem wyliczeniowym, gdy obecny jest atrybut wartości.
pt_br: O tipo de dados deverá ser enumeração quando o atributo values estiver presente.
ru: Когда указан атрибут значений, типом данных должно являться перечисление.
tr: Values özniteliği olduğunda veri türü sabit listesi olmalıdır.
zh_hans: 当存在 values 特性时，数据类型应为 enumeration。
zh_hant: 出現 values 屬性時，資料類型應為列舉。

# Sch_RootMatchDocType
source: Root element name must match the DocType name.
cs: Název kořenového elementu musí odpovídat názvu DocType.
de: Der Stammelementname muss mit dem DocType-Namen übereinstimmen.
es: El nombre del elemento raíz debe coincidir con el nombre de DocType.
fr: Le nom de l'élément racine doit correspondre au nom DocType.
it: Il nome dell'elemento radice deve essere uguale al nome di DocType.
ja: ルート要素名は DocType 名と一致しなければなりません。
ko: 루트 요소 이름이 DocType 이름과 일치해야 합니다.
pl: Nazwa elementu głównego musi odpowiadać nazwie DocType.
pt_br: O nome do elemento raiz deve corresponder ao nome de DocType.
ru: Имя корневого элемента должно соответствовать имени DocType.
tr: Kök öğe adı DocType adıyla eşleşmeli.
zh_hans: 根元素名称必须与 DocType 名称匹配。
zh_hant: 根項目名稱必須符合 DocType 名稱。

# Sch_SchemaAttributeNameMismatch
source: The attribute name '{0}' does not match the name '{1}' of the 'XmlSchemaAttribute' set as a partial validation type.
cs: Atribut s názvem {0} neodpovídá názvu {1} třídy XmlSchemaAttribute nastavené jako typ částečného ověřování.
de: Der Attributname "{0}" stimmt nicht mit dem Namen "{1}" des als Teilvalidierungstyp festgelegten "XmlSchemaAttribute" überein.
es: El nombre del atributo "{0}" no coincide con el nombre "{1}" del valor "XmlSchemaAttribute" configurado como tipo de validación parcial.
fr: Le nom d'attribut '{0}' ne correspond pas au nom '{1}' du 'XmlSchemaAttribute' défini en tant que type de validation partielle.
it: Il nome di attributo '{0}' non è uguale al nome '{1}' di 'XmlSchemaAttribute' impostato come tipo di convalida parziale.
ja: 部分検証型として設定されている 'XmlSchemaAttribute' の名前 '{1}' と属性名 '{0}' が一致していません。
ko: 특성 이름 '{0}'이(가) 부분적 유효성 검사 형식으로 설정된 'XmlSchemaAttribute'의 이름 '{1}'과(와) 일치하지 않습니다.
pl: Nazwa atrybutu „{0}” nie jest zgodna z nazwą elementu „{1}” atrybutu „XmlSchemaAttribute”, dla którego ustawiono typ częściowej weryfikacji.
pt_br: O nome de atributo '{0}' não corresponde ao nome '{1}' do conjunto 'XmlSchemaAttribute' como um tipo de validação parcial.
ru: Имя атрибута "{0}" не соответствует имени "{1}" для XmlSchemaAttribute, установленного в качестве типа неполной проверки.
tr: '{0}' öznitelik adı, kısmi doğrulama türü olarak ayarlanan '{1}' 'XmlSchemaAttribute' adıyla eşleşmiyor.
zh_hans: 特性名“{0}”与设置为部分验证类型的 "XmlSchemaAttribute" 的名称“{1}”不匹配。
zh_hant: 屬性名稱 '{0}' 與設為部分驗證類型之 XmlSchemaAttribute 的名稱 '{1}' 不符。

# Sch_SchemaDoesNotExist
source: Schema does not exist in the set.
cs: Schéma v sadě neexistuje.
de: Das Schema ist in diesem Satz nicht vorhanden.
es: El esquema no existe en el conjunto.
fr: Le schéma n'existe pas dans l'ensemble.
it: Lo schema non esiste nel set.
ja: セットにスキーマがありません。
ko: 스키마가 집합에 없습니다.
pl: Schemat nie istnieje w zestawie.
pt_br: O esquema não existe no conjunto.
ru: Схема отсутствует в наборе.
tr: Şema kümede yok.
zh_hans: 集中不存在架构。
zh_hant: 集合中沒有結構描述。

# Sch_SchemaElementNameMismatch
source: The element name '{0}' does not match the name '{1}' of the 'XmlSchemaElement' set as a partial validation type.
cs: Element s názvem {0} neodpovídá názvu {1} třídy XmlSchemaElement nastavené jako typ částečného ověřování.
de: Der Elementname "{0}" stimmt nicht mit dem Namen "{1}" des als Teilvalidierungstyp festgelegten "XmlSchemaElement" überein.
es: El nombre del elemento "{0}" no coincide con el nombre "{1}" del valor "XmlSchemaElement" configurado como tipo de validación parcial.
fr: Le nom d'élément '{0}' ne correspond pas au nom '{1}' du 'XmlSchemaElement' défini en tant que type de validation partielle.
it: Il nome di elemento '{0}' non è uguale al nome '{1}' di 'XmlSchemaElement' impostato come tipo di convalida parziale.
ja: 部分検証型として設定されている 'XmlSchemaElement' の名前 '{1}' と要素名 '{0}' が一致していません。
ko: 요소 이름 '{0}'이(가) 부분적 유효성 검사 형식으로 설정된 'XmlSchemaElement'의 이름 '{1}'과(와) 일치하지 않습니다.
pl: Nazwa elementu „{0}” nie jest zgodna z nazwą elementu „{1}” elementu „XmlSchemaElement”, dla którego ustawiono typ częściowej weryfikacji.
pt_br: O nome de elemento '{0}' não corresponde ao nome '{1}' do conjunto 'XmlSchemaElement' como um tipo de validação parcial.
ru: Имя элемента "{0}" не соответствует имени "{1}" для XmlSchemaElement, установленного в качестве типа неполной проверки.
tr: '{0}' öğe adı, kısmi doğrulama türü olarak ayarlanan '{1}' 'XmlSchemaElement' adıyla eşleşmiyor.
zh_hans: 元素名“{0}”与设置为部分验证类型的 "XmlSchemaElement" 的名称“{1}”不匹配。
zh_hant: 元素名稱 '{0}' 沒有符合 XmlSchemaElement '{1}' 的部分驗證類型。

# Sch_SchemaNotPreprocessed
source: All schemas in the set should be successfully preprocessed prior to compilation.
cs: Před kompilací musí být úspěšně předzpracována všechna schémata v sadě.
de: Alle Schemas im Satz müssen vor der Kompilierung erfolgreich vorverarbeitet werden.
es: Todos los esquemas del conjunto deben preprocesarse correctamente antes de compilarlos.
fr: Tous les schémas de l'ensemble doivent avoir été prétraités avec succès avant d'être compilés.
it: È necessario pre-elaborare correttamente tutti gli schemi nel set prima della compilazione.
ja: このセットのスキーマは、すべて、コンパイル前に正常に前処理される必要があります。
ko: 집합의 모든 스키마는 컴파일 이전에 전처리되어야 합니다.
pl: Przed rozpoczęciem kompilacji wstępne przetwarzanie wszystkich schematów w zestawie musi zakończyć się pomyślnie.
pt_br: Todos os esquemas do conjunto devem ser pré-processados com êxito antes da compilação.
ru: Все схемы в наборе должны быть успешно обработаны перед компиляцией.
tr: Kümedeki tüm şemalar, derlemeden önce başarılı bir şekilde ön işlemden geçmelidir.
zh_hans: 集中的所有架构应在编译前成功地完成预处理。
zh_hant: 應在編譯之前，先成功地前置處理集合中的所有結構描述。

# Sch_SchemaNotRemoved
source: The schema could not be removed because other schemas in the set have dependencies on this schema or its imports.
cs: Schéma nebylo možné odebrat, protože ostatní schémata v sadě mají závislosti na tomto schématu nebo jeho importech.
de: Das Schema konnte nicht entfernt werden, da andere Schemas im Satz Abhängigkeiten von diesem Schema oder seinen Importen aufweisen.
es: No se pudo eliminar el esquema, porque otros esquemas del conjunto dependen de este esquema o de sus importaciones.
fr: Impossible de supprimer le schéma, car d'autres schémas de l'ensemble ont des dépendances envers ce schéma ou ses importations.
it: Non è stato possibile rimuovere lo schema perché altri schemi nel set sono collegati ad esso o alle relative importazioni.
ja: スキーマを削除できませんでした。セット内の他のスキーマが、このスキーマまたはこのスキーマのインポートに依存しているためです。
ko: 집합의 다른 스키마가 해당 스키마 또는 해당 가져오기에 종속되어 있기 때문에 스키마를 제거할 수 없습니다.
pl: Nie można usunąć schematu, ponieważ inne schematy w zestawie są zależne od tego schematu lub jego procesów importu.
pt_br: Não foi possível remover o esquema, pois outros esquemas do conjunto têm dependências desse esquema ou de suas importações.
ru: Невозможно удалить схему, поскольку другие схемы в наборе зависят от нее или ее импортов.
tr: Kümede bulunan diğer şemaların bu şemaya veya bu şema tarafından içeri aktarılanlara bağımlılıkları olduğundan, şema kaldırılamadı.
zh_hans: 因为集中的其他架构与此架构或其导入项存在相关性，所以不能删除此架构。
zh_hant: 無法移除結構描述，因為其他集合中的結構描述與其或輸入相依存。

# Sch_SchemaRootExpected
source: Expected schema root. Make sure the root element is <schema> and the namespace is 'http://www.w3.org/2001/XMLSchema' for an XSD schema or 'urn:schemas-microsoft-com:xml-data' for an XDR schema.
cs: Byl očekáván kořen schématu. Přesvědčte se, zda je kořenovým elementem <schema> a zda je oborem názvů obor http://www.w3.org/2001/XMLSchema (pro schéma XSD) nebo obor urn:schemas-microsoft-com:xml-data (pro schéma XDR).
de: Erwartet wurde der Schemastamm. Stellen Sie sicher, dass das Stammelement <schema> lautet und der Namespace "http://www.w3.org/2001/XMLSchema" (für ein XSD-Schema) oder "urn:schemas-microsoft-com:xml-data" (für ein XDR-Schema) ist.
es: Se esperaba la raíz de un esquema. Asegúrese de que el elemento raíz es <schema> y el espacio de nombres es "http://www.w3.org/2001/XMLSchema" para un esquema XSD o "urn:schemas-microsoft-com:xml-data" para un esquema XDR.
fr: Racine de schéma attendue. Vérifiez que l'élément racine est <schema> et que l'espace de noms est 'http://www.w3.org/2001/XMLSchema' pour un schéma XSD, ou 'urn:schemas-microsoft-com:xml-data' pour un schéma XDR.
it: È prevista la radice schema. Assicurarsi che l'elemento radice sia <schema> e che lo spazio dei nomi sia 'http://www.w3.org/2001/XMLSchema' per uno schema XSD oppure 'urn:schemas-microsoft-com:xml-data' per uno schema XDR.
ja: スキーマ ルートが必要です。ルート要素が <schema> であり、XSD スキーマについては名前空間が 'http://www.w3.org/2001/XMLSchema'、XDR スキーマについては名前空間が 'urn:schemas-microsoft-com:xml-data' であることを確認してください。
ko: 스키마 루트가 필요합니다. 루트 요소가 <schema>이고 네임스페이스가 'http://www.w3.org/2001/XMLSchema'(XSD 스키마인 경우) 또는 'urn:schemas-microsoft-com:xml-data'(XDR 스키마인 경우)인지 확인하세요.
pl: Oczekiwano schematu głównego. Upewnij się, że elementem głównym jest <schema>, a przestrzeń nazw to http://www.w3.org/2001/XMLSchema dla schematu XSD lub urn:schemas-microsoft-com:xml-data dla schematu XDR.
pt_br: Raiz de esquema esperada. Verifique se o elemento raiz é <schema> e o namespace é 'http://www.w3.org/2001/XMLSchema' para um esquema XSD ou 'urn:schemas-microsoft-com:xml-data' para um esquema XDR.
ru: Ожидался корень схемы. Убедитесь, что корневым элементом является <schema>, а пространством имен — "http://www.w3.org/2001/XMLSchema" для схемы XSD или "urn:schemas-microsoft-com:xml-data" для схемы XDR.
tr: Şema kökü bekleniyor. Kök öğesinin <schema> ve ad alanının XSD şeması için 'http://www.w3.org/2001/XMLSchema', XDR şeması için de 'urn:schemas-microsoft-com:xml-data' olduğundan emin olun.
zh_hans: 应为架构根。请确保根元素是 <schema>，并且命名空间为 "http://www.w3.org/2001/XMLSchema" (对于 XSD 架构)或 "urn:schemas-microsoft-com:xml-data" (对于 XDR 架构)。
zh_hant: 應為結構描述的根。請確定該根項目為 <schema>。而使用 XSD 結構描述的命名空間是 'http://www.w3.org/2001/XMLSchema'，使用 XDR 結構描述時的命名空間為 'urn:schemas-microsoft-com:xml-data'。

# Sch_SelectorAttr
source: '{0}' is an invalid XPath for selector. Selector cannot have an XPath selection with an attribute node.
cs: Výraz {0} je neplatnou cestou XPath pro selektor. Selektor nemůže obsahovat výběr XPath bez uzlu atributu.
de: "{0}" ist ein ungültiger XPath für die Auswahl. Die Auswahl kann keine XPath-Auswahl mit einem Attributknoten enthalten.
es: {0}" no es una selección XPath válida para el selector. El selector no puede tener una selección XPath con un nodo del atributo.
fr: '{0}' est un XPath non valide pour selector. Selector ne peut pas avoir une sélection XPath avec un nœud d'attribut.
it: '{0}' non è un XPath valido per il selettore. Il selettore non può contenere una selezione XPath con un nodo Attribute.
ja: '{0}' はセレクターとしては無効な XPath です。セレクターは、属性ノードと共に XPath 選択を持てません。
ko: '{0}'을(를) 선택기의 XPath로 사용할 수 없습니다. 선택기에는 특성 노드를 갖는 XPath 선택을 사용할 수 없습니다.
pl: Element „{0}” jest nieprawidłową ścieżką XPath dla selektora. W selektorze nie można wybrać ścieżki XPath z węzłem atrybutu.
pt_br: '{0}' é um XPath inválido para seletor. Um seletor não pode ter uma seleção XPath com um nó de atributo.
ru: "{0}" является недопустимым XPath для селектора. Селектор не может иметь варианта выбора XPath с узлом атрибута.
tr: '{0}', seçici için geçersiz bir XPath. Seçici, öznitelik düğümü olan XPath seçimine sahip olamaz.
zh_hans: “{0}”对于选择器是无效的 XPath。选择器不能有带特性节点的 XPath 选择。
zh_hant: '{0}' 對選取器而言不是有效的 XPath。選取器不可有內含屬性節點的 XPath 選取範圍。

# Sch_SelectorBeforeFields
source: Cannot define fields before selector.
cs: Před selektorem nelze definovat pole.
de: Vor der Auswahl können keine Felder definiert werden.
es: No se pueden definir los campos antes que el selector.
fr: Impossible de définir les champs avant selector.
it: Non è possibile definire i campi prima del selettore.
ja: セレクターの前にフィールドを定義できません。
ko: 필드를 정의하려면 먼저 선택기를 정의해야 합니다.
pl: Nie można zdefiniować pól przed selektorem.
pt_br: Não é possível definir campos antes do seletor.
ru: Невозможно определить поля раньше, чем селектор.
tr: Seçiciden önce alanlar tanımlanamaz.
zh_hans: 不能在选择器之前定义字段。
zh_hant: 無法定義選取器之前的欄位。

# Sch_SeqFromAll
source: The derived sequence particle at ({0}, {1}) is not a valid restriction of the base all particle at ({2}, {3}) according to Sequence:All -- RecurseUnordered.
cs: Odvozená částice sequence na pozici ({0}, {1}) není platné omezení základní částice all na pozici ({2}, {3}) podle Sequence:All -- RecurseUnordered.
de: Das abgeleitete Partikel "sequence" bei ({0},{1}) ist gemäß Sequence:All -- RecurseUnordered keine gültige Einschränkung des Basispartikels "all" bei ({2}, {3}).
es: La partícula sequence derivada en ({0}, {1}) no es una restricción válida de la partícula all base en ({2}, {3}) según Sequence:All -- RecurseUnordered.
fr: La particule Sequence dérivée sur ({0}, {1}) n'est pas une restriction valide de la particule all de base sur ({2}, {3}), selon Sequence:All -- RecurseUnordered.
it: La particella derivata sequence alla posizione ({0}, {1}) non è una restrizione valida della particella all di base alla posizione ({2}, {3}) in base a Sequence:All -- RecurseUnordered.
ja: Sequence:All -- RecurseUnordered により、({0}, {1}) にある派生型の sequence パーティクルは、({2}, {3}) にある基本型の all パーティクルの有効な制限とは認められません。
ko: ({0}, {1})에 있는 파생 seqeunce 파티클은 Sequence:All -- RecurseUnordered에 따라 ({2}, {3})에 있는 기본 all 파티클의 유효한 제한이 아닙니다.
pl: Pochodna cząstka sequence w lokalizacji ({0}, {1}) nie jest prawidłowym ograniczeniem podstawowej cząstki all w lokalizacji ({2}, {3}) zgodnie z regułą Sequence:All -- RecurseUnordered.
pt_br: A partícula derivada sequence em ({0}, {1}) não é uma restrição válida da partícula base all em ({2}, {3}) de acordo com Sequence:All -- RecurseUnordered.
ru: Производная часть sequence в ({0}, {1}) не является действительным ограничением для базовой части all в ({2}, {3}) в соответствии с Sequence:All — RecurseUnordered.
tr: ({0}, {1}) konumundaki türetilen sıralama parçacığı, Sequence:All -- RecurseUnordered kuralına göre ({2}, {3}) konumundaki temel all parçacığının geçerli bir kısıtlaması değil.
zh_hans: 根据 Sequence:All -- RecurseUnordered，位于({0}, {1})的派生 sequence 粒子不是位于({2}, {3})的基本 all 粒子的有效限制。
zh_hant: 根據 Sequence:All – RecurseUnordered，({0}, {1}) 中的衍生序列物件不是 ({2}, {3}) 中基底 All 物件的有效限制。

# Sch_SeqFromChoice
source: The derived sequence particle at ({0}, {1}) is not a valid restriction of the base choice particle at ({2}, {3}) according to Sequence:Choice -- MapAndSum.
cs: Odvozená částice sequence na pozici ({0}, {1}) není platné omezení základní částice choice na pozici ({2}, {3}) podle Sequence:Choice -- MapAndSum.
de: Das abgeleitete Partikel "sequence" bei ({0},{1}) ist gemäß Sequence:Choice -- MapAndSum keine gültige Einschränkung des Basispartikels "choice" bei ({2}, {3}).
es: La partícula sequence derivada en ({0}, {1}) no es una restricción válida de la partícula choice base en ({2}, {3}) según Sequence:Choice -- MapAndSum.
fr: La particule Sequence dérivée sur ({0}, {1}) n'est pas une restriction valide de la particule choice de base sur ({2}, {3}), selon Sequence:Choice -- MapAndSum.
it: La particella derivata sequence alla posizione ({0}, {1}) non è una restrizione valida della particella choice di base alla posizione({2}, {3}) in base a Sequence:Choice -- MapAndSum.
ja: Sequence:Choice -- MapAndSum により、({0}, {1}) にある派生型の sequence パーティクルは、({2}, {3}) にある基本型の choice パーティクルの有効な制限とは認められません。
ko: ({0}, {1})에 있는 파생 seqeunce 파티클은 Sequence:Choice -- MapAndSum에 따라 ({2}, {3})에 있는 기본 choice 파티클의 유효한 제한이 아닙니다.
pl: Pochodna cząstka sequence w lokalizacji ({0}, {1}) nie jest prawidłowym ograniczeniem podstawowej cząstki choice w lokalizacji ({2}, {3}) zgodnie z zasadą Sequence:Choice -- MapAndSum.
pt_br: A partícula derivada sequence em ({0}, {1}) não é uma restrição válida da partícula base choice em ({2}, {3}) de acordo com Sequence:Choice -- MapAndSum.
ru: Производная часть sequence в ({0}, {1}) не является действительным ограничением для базовой части choice в ({2}, {3}) в соответствии с Sequence:Choice — MapAndSum.
tr: ({0}, {1}) konumundaki türetilen sıralama parçacığı, Sequence:Choice -- MapAndSum kuralına göre ({2}, {3}) konumundaki temel choice parçacığının geçerli bir kısıtlaması değil.
zh_hans: 根据 Sequence:Choice -- MapAndSum，位于({0}, {1})的派生 sequence 粒子不是位于({2}, {3})的基本 choice 粒子的有效限制。
zh_hant: 根據 Sequence:Choice -- MapAndSum，({0}, {1}) 中的衍生序列物件不是 ({2}, {3}) 中基底 Choice 物件的有效限制。

# Sch_SimpleToComplexTypeRedefine
source: Cannot redefine a simple type as complex type.
cs: Jednoduchý typ nelze předefinovat jako složitý typ.
de: Ein einfacher Typ kann nicht als komplexer Typ neu definiert werden.
es: No se puede redefinir un tipo simple como un tipo complejo.
fr: Impossible de redéfinir un type simple en tant que type complexe.
it: Non è possibile ridefinire un tipo semplice come tipo complesso.
ja: 単純型を複合型として再定義することはできません。
ko: 단순 형식을 복합 형식으로 다시 정의할 수 없습니다.
pl: Nie można przedefiniować typu prostego jako typu złożonego.
pt_br: Não é possível redefinir um tipo simples como um tipo complexo.
ru: Не удалось переопределить простой тип как составной.
tr: Basit tür, karmaşık tür olarak yeniden tanımlanamaz.
zh_hans: 不能将简单类型重定义为复杂类型。
zh_hant: 無法將簡單型別重新定義為複雜類型。

# Sch_SimpleTypeDoubleRedefine
source: Double redefine for simple type.
cs: Jednoduchý typ byl předefinován dvakrát.
de: Doppelte Neudefinition für einfachen Typ.
es: Redefinición doble para el tipo simple.
fr: Double redéfinition pour un type simple.
it: Doppia ridefinizione per il tipo semplice.
ja: 単純型が二重に再定義されています。
ko: 단순 형식을 두 번 다시 정의했습니다.
pl: Podwójne przedefiniowanie dla typu prostego.
pt_br: Redefinição dupla para tipo simples.
ru: Двойное переопределение для простого типа.
tr: Basit tür için çift yeniden tanımlama.
zh_hans: 简单类型的双重重定义。
zh_hant: 重新定義兩次簡單型別。

# Sch_SimpleTypeListRefBase
source: SimpleType list should have either the itemType attribute or a simpleType child, but not both.
cs: Seznam SimpleType by měl mít buď atribut itemType, nebo podřízený atribut simpleType, ale nikoli oba současně.
de: Die SimpleType-Liste muss entweder das itemType-Attribut oder ein untergeordnetes Element "simpleType" enthalten (nicht beide).
es: La lista SimpleType debe tener el atributo itemType o un elemento secundario simpleType, no los dos.
fr: La liste SimpleType doit avoir l'attribut itemType ou un enfant simpleType, mais pas les deux.
it: L'elenco SimpleType deve contenere l'attributo itemType o un elemento simpleType figlio, ma non entrambi.
ja: SimpleType リストには、itemType 属性か simpleType 子要素のどちらか一方が必要です。両方は必要ありません。
ko: SimpleType 목록에는 itemType 특성 또는 simpleType 자식 중 하나가 있어야 하지만 둘 다 지정할 필요는 없습니다.
pl: Lista typu SimpleType musi mieć atrybut typu itemType lub element podrzędny typu simpleType, ale nie oba jednocześnie.
pt_br: A lista SimpleType deve ter o atributo itemType ou um simpleType filho, mas não ambos.
ru: Список SimpleType должен иметь либо только атрибут itemType, либо только дочерний элемент simpleType.
tr: SimpleType listesinde, itemType özniteliği veya simpleType alt öğesi bulunmalıdır, ikisi birlikte bulunamaz.
zh_hans: SimpleType 列表应包含 itemType 特性或 simpleType 子级中的一个，但不能同时包含。
zh_hant: SimpleType 清單要有 itemType 屬性或 simpleType 子系，但兩者不可同時存在。

# Sch_SimpleTypeListRefBaseNone
source: SimpleType list should have either the itemType attribute or a simpleType child to indicate the itemType of the list.
cs: Seznam SimpleType by měl mít buď atribut itemType, nebo podřízený atribut simpleType k označení atributu itemType seznamu.
de: Die SimpleType-Liste muss entweder das itemType-Attribut oder ein untergeordnetes Element "simpleType" enthalten, um den itemType der Liste anzugeben.
es: La lista SimpleType debe tener el atributo itemType o un elemento secundario simpleType para indicar el elemento itemType de la lista.
fr: La liste SimpleType doit avoir l'attribut itemType ou un enfant simpleType, mais pas les deux, pour indiquer l'itemType de la liste.
it: L'elenco SimpleType deve contenere l'attributo itemType o un elemento simpleType foglio per indicare l'elemento itemType dell'elenco.
ja: リストの itemType を示すには、SimpleType リストに、itemType 属性か simpleType 子要素のどちらか一方が含まれている必要があります。
ko: SimpleType 목록에는 itemType 특성이나 목록의 itemType을 나타내는 simpleType 자식 중 하나가 있어야 합니다.
pl: Lista typu SimpleType powinna mieć atrybut itemType lub element podrzędny simpleType, jeśli ma zostać wskazany typ list itemType.
pt_br: A lista SimpleType deve ter o atributo itemType ou um filho de simpleType para indicar o itemType da lista.
ru: Список SimpleType должен иметь либо атрибут itemType, либо дочерний элемент simpleType, определяющий itemType списка.
tr: SimpleType listesinde, listenin itemType özniteliğini belirtmek için itemType özniteliği veya simpleType alt öğesi bulunmalıdır.
zh_hans: SimpleType 列表应包含 itemType 特性或 simpleType 子级中的一个，用于指示列表的 itemType。
zh_hant: SimpleType 清單應要有 itemType 屬性或 simpleType 子系，才可指出清單上的 itemType。

# Sch_SimpleTypeRedefineNotFound
source: No simple type to redefine.
cs: Nebyl nalezen jednoduchý typ k předefinování.
de: Es ist kein einfacher Typ zum erneuten Definieren vorhanden.
es: No hay ningún tipo simple para redefinir.
fr: Aucun type simple à redéfinir.
it: Non ci sono tipi semplici da ridefinire.
ja: 再定義する単純型がありません。
ko: 다시 정의할 단순 형식이 없습니다.
pl: Brak typu prostego do przedefiniowania.
pt_br: Nenhum tipo simples a ser redefinido.
ru: Отсутствует простой тип для переопределения.
tr: Yeniden tanımlanacak basit tür yok.
zh_hans: 没有要重定义的简单类型。
zh_hant: 沒有簡單型別可以重新定義。

# Sch_SimpleTypeRestRefBase
source: SimpleType restriction should have either the base attribute or a simpleType child, but not both.
cs: Omezení SimpleType by mělo mít buď základní atribut, nebo podřízený atribut simpleType, ale nikoli oba současně.
de: Die SimpleType-Einschränkung muss entweder das Basisattribut oder ein untergeordnetes Element "simpleType" enthalten (nicht beide).
es: La restricción SimpleType debe tener el atributo base o un elemento secundario simpleType, no los dos.
fr: La restriction SimpleType doit avoir l'attribut base ou un enfant simpleType, mais pas les deux.
it: Nella restrizione SimpleType deve essere presente l'attributo di base oppure un elemento figlio simpleType, ma non entrambi.
ja: SimpleType 制限には、base 属性か simpleType 子要素のどちらか一方が必要です。両方は必要ありません。
ko: SimpleType 제한에는 base 특성 또는 simpleType 자식 중 하나가 있어야 하지만 둘 다 지정할 필요는 없습니다.
pl: Ograniczenie typu SimpleType musi mieć atrybut podstawowy lub element podrzędny typu simpleType, ale nie oba jednocześnie.
pt_br: A restrição SimpleType deve ter o atributo base itemType ou um simpleType filho, mas não ambos.
ru: Ограничение SimpleType должно иметь либо только базовый атрибут, либо только дочерний элемент simpleType.
tr: SimpleType kısıtlamasında, temel öznitelik veya simpleType alt öğesi bulunmalıdır, ikisi birlikte bulunamaz.
zh_hans: SimpleType 限制应包含基特性或 simpleType 子级中的一个，但不能同时包含。
zh_hant: SimpleType 限制要有 base 屬性或 simpleType 子系，但兩者不可同時存在。
