Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlPrimitiveBaseType
source: Type '{0}' from namespace '{1}' is not a complex type and cannot be used as a {2}.
cs: Typ {0} z oboru názvů {1} není složitým typem a nelze jej použít jako {2}.
de: Der Typ "{0}" aus dem Namespace "{1}" ist kein komplexer Typ und kann nicht als {2} verwendet werden.
es: El tipo "{0}" del espacio de nombres "{1}" no es un tipo complejo y no se puede utilizar como {2}.
fr: Le type '{0}' de l'espace de noms '{1}' n'est pas un type complexe et ne peut pas être utilisé en tant que {2}.
it: Il tipo '{0}' dello spazio dei nomi '{1}' non è un tipo complesso e non può essere usato come {2}.
ja: 名前空間 '{1}' からの型 '{0}' は複合型ではなく、{2} として使用できません。
ko: 네임스페이스 '{1}'의 '{0}' 형식은 복합 형식이 아니므로 {2}(으)로 사용할 수 없습니다.
pl: Typ „{0}” z przestrzeni nazw „{1}” nie jest typem złożonym i nie może być używany jako {2}.
pt_br: O tipo '{0}' do namespace '{1}' não é um tipo complexo e não pode ser usado como um {2}.
ru: Тип "{0}" из пространства имен "{1}" не является составным типом и не может использоваться в качестве {2}.
tr: '{1}' ad alanındaki '{0}' türü bir karmaşık tür değil ve bir {2} olarak kullanılamaz.
zh_hans: 命名空间“{1}”中的类型“{0}”不是复杂类型，不能用作 {2}。
zh_hant: 來自命名空間 '{1}' 的類型 '{0}' 不是複雜類型，不得用為 {2}。

# XmlPropertyReflectionError
source: There was an error reflecting property '{0}'.
cs: Při reflexi vlastnosti {0} došlo k chybě.
de: Fehler beim Reflektieren der Eigenschaft "{0}".
es: Error al reflejar la propiedad "{0}".
fr: Une erreur s'est produite durant la réflexion de la propriété '{0}'.
it: Si è verificato un errore durante la reflection della proprietà '{0}'.
ja: プロパティ '{0}' の反映でエラーが発生しました。
ko: '{0}' 속성을 반영하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd w czasie wykonywania odbicia właściwości „{0}”.
pt_br: Erro ao refletir a propriedade '{0}'.
ru: Возникла ошибка при отражении свойства "{0}".
tr: '{0}' özelliği yansıtılırken bir hata oluştu.
zh_hans: 反射属性“{0}”时出错。
zh_hant: 反映屬性 '{0}' 時發生錯誤。

# XmlReadOnlyCollection
source: Could not deserialize {0}. Parameterless constructor is required for collections and enumerators.
cs: {0} nelze deserializovat. Pro kolekce a čítače výčtu je požadován konstruktor bez parametrů.
de: {0} konnte nicht deserialisiert werden. Für Sammlungen und Enumeratoren ist ein parameterloser Konstruktor erforderlich.
es: No se puede deserializar {0}. Se requiere un constructor sin parámetros para las colecciones y enumeradores.
fr: Impossible de désérialiser {0}. Un constructeur sans paramètre est obligatoire pour les collections et les énumérateurs.
it: Non è stato possibile deserializzare {0}. Per le raccolte e gli enumeratori è necessario un costruttore senza parametri.
ja: {0} のシリアル化を解除できませんでした。パラメーターを持たないコンストラクターには、コレクションおよび列挙子が必要です。
ko: {0}을(를) deserialize할 수 없습니다. 컬렉션 및 열거자에 매개 변수 없는 생성자가 필요합니다.
pl: Nie można cofnąć seryjnego tworzenia elementu {0}. Dla kolekcji i modułów wyliczających wymagane są konstruktory bez parametrów.
pt_br: Não foi possível desserializar {0}. Construtor sem parâmetros é necessário para coleções e enumeradores.
ru: Не удалось десериализовать {0}. Для коллекций и перечислений требуются конструкторы без параметров.
tr: {0} seri durumdan çıkarılamadı. Koleksiyonlar veya numaralandırıcılar için parametresiz oluşturucular gereklidir.
zh_hans: 无法反序列化 {0}。集合和枚举器要求无参数的构造函数。
zh_hant: 無法還原序列化 {0}。集合與列舉值需要參數建構函式。

# XmlReadOnlyPropertyError
source: Cannot deserialize type '{0}' because it contains property '{1}' which has no public setter.
cs: Typ {0} nelze deserializovat, protože obsahuje vlastnost {1}, která nemá veřejnou metodu setter.
de: Der Typ "{0}" kann nicht deserialisiert werden, da er die Eigenschaft "{1}" enthält, die keinen öffentlichen Setter besitzt.
es: No se puede deserializar el tipo "{0}" porque contiene una propiedad "{1}" que no tiene establecedor público.
fr: Impossible de désérialiser le type '{0}', car il contient la propriété '{1}' qui n'a aucun setter public.
it: Non è possibile deserializzare il tipo '{0} perché contiene la proprietà '{1}' che non include un setter pubblico.
ja: パブリック setter を持たないプロパティ '{1}' が含まれているため、型 '{0}' を逆シリアル化できません。
ko: public setter가 없는 '{1}' 속성을 포함하므로 '{0}' 형식을 deserialize할 수 없습니다.
pl: Nie można zdeserializować typu „{0}”, ponieważ zawiera on właściwość „{1}”, która nie ma publicznej metody ustawiającej.
pt_br: Não é possível desserializar o tipo '{0}' porque ele contém a propriedade '{1}' que não tem um setter público.
ru: Невозможно выполнить десериализацию типа "{0}", поскольку он содержит свойство "{1}", не имеющее общего метода задания.
tr: Genel ayarlayıcıya sahip olmayan '{1}' özelliğini içerdiğinden, '{0}' türü seri durumdan çıkarılamıyor.
zh_hans: 无法对“{0}”类型进行反序列化，因为它包含无公共 setter 的属性“{1}”。
zh_hant: 無法還原序列化類型 '{0}'，因為它包含的屬性 '{1}' 沒有公用 setter。

# XmlReflectionError
source: There was an error reflecting '{0}'.
cs: Při reflexi {0} došlo k chybě.
de: Fehler beim Reflektieren von "{0}".
es: Error al reflejar "{0}".
fr: Erreur de réflexion de '{0}'.
it: Si è verificato un errore durante la reflection di '{0}'.
ja: '{0}' の反映でエラーが発生しました。
ko: '{0}'을(를) 반영하는 동안 오류가 발생했습니다.
pl: Wystąpił błąd podczas odzwierciedlania elementu „{0}”.
pt_br: Erro ao refletir '{0}'.
ru: Возникла ошибка при отражении "{0}".
tr: '{0}' yansıtmada bir hata oluştu.
zh_hans: 反射“{0}”时出错。
zh_hant: 反映 '{0}' 時發生錯誤。

# XmlRpcArrayOfValueTypes
source: Cannot serialize {0}. Arrays of structs are not supported with encoded SOAP.
cs: {0} nelze serializovat. Kódovaný protokol SOAP nepodporuje pole struktur.
de: {0} kann nicht serialisiert werden. Arrays von Strukturen werden mit codiertem SOAP nicht unterstützt.
es: No se puede serializar {0}. Las matrices de structs no son compatibles con SOAP codificado.
fr: Impossible de sérialiser {0}. Les tableaux de structs ne sont pas pris en charge avec le SOAP encodé.
it: Non è possibile serializzare {0}. Le matrici di struct non sono supportate con SOAP codificato.
ja: {0} をシリアル化できません。構造体はエンコードされた SOAP でサポートされていません。
ko: {0}을(를) 직렬화할 수 없습니다. 구조체 배열은 인코딩된 SOAP에서 지원되지 않습니다.
pl: Nie można serializować elementu {0}. Struktury tablic nie są obsługiwane w kodowanym elemencie SOAP.
pt_br: Não é possível serializar {0}. Não há suporte para matrizes de structs com codificação SOAP.
ru: Невозможно сериализовать {0}. Массивы структур с кодированными SOAP не поддерживаются.
tr: {0} serileştirilemiyor. Kodlanmış SOAP ile yapı dizileri desteklenmiyor.
zh_hans: 无法序列化 {0}。编码的 SOAP 不支持结构数组。
zh_hant: 無法序列化 {0}。編碼的 SOAP 不支援結構陣列。

# XmlRpcLitArrayElement
source: Input or output values of an rpc\literal method cannot have maxOccurs > 1. Provide a wrapper element for '{0}' by using XmlArray or XmlArrayItem instead of XmlElement attribute.
cs: Vstupní nebo výstupní hodnoty metody rpc\literal nemohou mít hodnotu atributu maxOccurs > 1. Poskytněte element obálky pro {0}, a to použitím atributu XmlArray nebo XmlArrayItem místo atributu XmlElementAttribute.
de: Für Ein- oder Ausgabewerte der rpc\literal-Methode kann maxOccurs nicht größer als 1 sein. Stellen Sie für "{0}" ein Wrapperelement bereit, in dem Sie XmlArray oder XmlArrayItem anstelle des XmlElement-Attributs verwenden.
es: Los valores de entrada o salida de un método rpc o literal no pueden tener maxOccurs > 1. Debe proporcionar un elemento contenedor para "{0}" utilizando XmlArray o XmlArrayItem en vez del atributo XmlElement.
fr: Les valeurs d'entrée ou de sortie d'une méthode rpc\literal ne peuvent pas avoir maxOccurs > 1. Fournissez un élément wrapper pour '{0}' en utilisant XmlArray ou XmlArrayItem à la place de l'attribut XmlElement.
it: I valori di input e di output di un metodo rpc\literal non possono includere un elemento maxOccurs impostato su un valore maggiore di 1. Fornire un elemento wrapper per '{0}' usando XmlArray o XmlArrayItem invece dell'attributo XmlElement.
ja: rpc\literal メソッドの入力または出力の値に maxOccurs > 1 を設定することはできません。XmlElement 属性ではなく、XmlArray または XmlArrayItem を使用して '{0}' のラッパー要素を指定してください。
ko: rpc\literal 메서드 입력 또는 출력 값의 maxOccurs는 1보다 클 수 없습니다. XmlElement 특성 대신 XmlArray 또는 XmlArrayItem을 사용하여 '{0}'에 래퍼 요소를 지정하세요.
pl: Dla wartości wejściowych i wyjściowych metody rpc\literal parametr maxOccurs musi być większy od 1. Określ element otoki „{0}”, używając atrybutu XmlArray lub XmlArrayItem zamiast atrybutu XmlElement.
pt_br: Os valores de entrada ou de saída de um método rpc\literal não podem ter maxOccurs > 1. Forneça um elemento wrapper para '{0}' usando XmlArray ou XmlArrayItem em vez do atributo XmlElement.
ru: Входные и выходные значения метода rpc\literal не могут иметь maxOccurs > 1. Укажите элемент-оболочку для "{0}", используя XmlArray или XmlArrayItem вместо атрибута XmlElement.
tr: rpc\literal metodunun giriş veya çıkış değerlerinde maxOccurs > 1 olamaz. XmlElement özniteliği yerine XmlArray veya XmlArrayItem kullanarak '{0}' için bir sarmalayıcı öğe sağlayın.
zh_hans: rpc\literal 方法的输入或输出值的 maxOccurs 不能大于 1。请使用 XmlArray 或 XmlArrayItem (而非 XmlElement)特性为“{0}”提供包装元素。
zh_hant: rpc\literal 方法的輸入或輸出值不可出現 maxOccurs > 1。請使用 XmlArray 或 XmlArrayItem 為 '{0}' 提供包裝函式元素，而非使用 XmlElement 屬性進行。

# XmlRpcLitAttributeAttributes
source: XmlAttribute and XmlAnyAttribute cannot be used with rpc\literal SOAP, you may use the following attributes: XmlArray, XmlArrayItem, or single XmlElement.
cs: Atributy XmlAttribute a XmlAnyAttribute nelze používat s protokolem SOAP rpc\literal. Můžete používat následující atributy: XmlArray, XmlArrayItem nebo jeden atribut XmlElement
de: XmlAttribute und XmlAnyAttribute können nicht mit rpc\literal SOAP verwendet werden. Sie können die folgenden Attribute verwenden: XmlArray, XmlArrayItem oder ein einzelnes XmlElement-Attribut.
es: Los elementos XmlAttribute y XmlAnyAttribute no son compatibles con SOAP rpc o literal, puede utilizar los siguientes atributos: XmlArray, XmlArrayItem o un XmlElement único.
fr: Impossible d'utiliser XmlAttribute et XmlAnyAttribute avec le SOAP rpc\literal. Vous pouvez utiliser les attributs suivants : XmlArray, XmlArrayItem ou XmlElement (unique).
it: Non è possibile usare XmlAttribute e XmlAnyAttribute con SOAP rpc\literal. È possibile usare gli attributi seguenti: XmlArray, XmlArrayItem oppure un singolo attributo XmlElement.
ja: XmlAttribute および XmlAnyAttribute は rpc\literal SOAP を付けて使用できません。使用できる属性は、XmlArray、XmlArrayItem または単一の XmlElement です。
ko: XmlAttribute 및 XmlAnyAttribute는 rpc\literal SOAP에서 사용할 수 없으며 XmlArray, XmlArrayItem 또는 단일 XmlElement 특성을 사용할 수 있습니다.
pl: Elementy XmlAttribute i XmlAnyAttribute nie mogą być używane z protokołem rpc\literal SOAP. Możesz użyć następujących atrybutów: XmlArray, XmlArrayItem lub pojedynczego atrybutu XmlElement.
pt_br: XmlAttribute e XmlAnyAttribute não podem ser usados com SOAP rpc\literal. Você pode usar os seguintes atributos: XmlArray, XmlArrayItem ou XmlElement único.
ru: XmlAttribute и XmlAnyAttribute не могут использоваться с rpc\literal SOAP; допустимы такие атрибуты: XmlArray, XmlArrayItem или одинарный XmlElement.
tr: XmlAttribute ve XmlAnyAttribute, rpc\literal SOAP ile kullanılamaz, aşağıdaki öznitelikleri kullanabilirsiniz: XmlArray, XmlArrayItem veya single XmlElement.
zh_hans: XmlAttribute 和 XmlAnyAttribute 不能与 rpc\literal SOAP 一起使用，你可以使用以下特性: XmlArray、XmlArrayItem 或单独使用 XmlElement。
zh_hant: XmlAttribute 與 XmlAnyAttribute 不可用於 rpc\literal SOAP，您可使用下列屬性: XmlArray、XmlArrayItem 或單一 XmlElement。

# XmlRpcLitAttributes
source: XmlText, XmlAnyElement, or XmlChoiceIdentifier cannot be used with rpc\literal SOAP, you may use the following attributes: XmlArray, XmlArrayItem, or single XmlElement.
cs: Atributy XmlText, XmlAnyElement nebo XmlChoiceIdentifier nelze používat s protokolem SOAP rpc\literal. Můžete používat následující atributy: XmlArray, XmlArrayItem nebo jeden atribut XmlElement
de: XmlText, XmlAnyElement oder XmlChoiceIdentifier können nicht mit rpc\literal SOAP verwendet werden. Sie können die folgenden Attribute verwenden: XmlArray, XmlArrayItem oder ein einzelnes XmlElement-Attribut.
es: Los elementos XmlText, XmlAnyElement o XmlChoiceIdentifier no son compatibles con SOAP rpc o literal, puede utilizar los siguientes atributos: XmlArray, XmlArrayItem o un XmlElement único.
fr: Impossible d'utiliser XmlText, XmlAnyElement ou XmlChoiceIdentifier avec le SOAP rpc\literal. Vous pouvez utiliser les attributs suivants : XmlArray, XmlArrayItem ou XmlElement (unique).
it: Non è possibile usare XmlText, XmlAnyElement oppure XmlChoiceIdentifier con SOAP rpc\literal. È possibile usare gli attributi XmlArray e XmlArrayItem oppure un singolo attributo XmlElement.
ja: XmlText、XmlAnyElement または XmlChoiceIdentifier は、rpc\literal SOAP を付けて使用できません。使用できる属性は、XmlArray、XmlArrayItem または単一の XmlElement です。
ko: XmlText, XmlAnyElement 또는 XmlChoiceIdentifier는 rpc\literal SOAP에서 사용할 수 없으며 XmlArray, XmlArrayItem 또는 단일 XmlElement 특성을 사용할 수 있습니다.
pl: Atrybuty XmlText, XmlAnyElement i XmlChoiceIdentifier nie mogą być używane z protokołem rpc\literal SOAP. Możesz użyć następujących atrybutów: XmlArray, XmlArrayItem lub pojedynczego atrybutu XmlElement.
pt_br: XmlText, XmlAnyElement ou XmlChoiceIdentifier não podem ser usados com SOAP rpc\literal. Você pode usar os seguintes atributos: XmlArray, XmlArrayItem ou XmlElement único.
ru: XmlText, XmlAnyElement и XmlChoiceIdentifier не могут использоваться с rpc\literal SOAP; допустимы такие атрибуты: XmlArray, XmlArrayItem или одинарный XmlElement.
tr: XmlText, XmlAnyElement veya XmlChoiceIdentifier, rpc\literal SOAP ile kullanılamaz, şu öznitelikleri kullanabilirsiniz: XmlArray, XmlArrayItem veya single XmlElement.
zh_hans: XmlText、XmlAnyElement 或 XmlChoiceIdentifier 不能与 rpc\literal SOAP 一起使用，你可以使用以下特性: XmlArray、XmlArrayItem 或单独使用 XmlElement。
zh_hant: XmlText、XmlAnyElement 或 XmlChoiceIdentifier 無法用於 rpc\literal SOAP，您可以使用下列屬性: XmlArray、XmlArrayItem 或單一 XmlElement。

# XmlRpcLitElementNamespace
source: {0}='{1}' is not supported with rpc\literal SOAP. The wrapper element has to be unqualified.
cs: {0}={1} není u protokolu SOAP rpc\literal podporováno. Element obálky musí mít nekvalifikovaný název.
de: {0}="{1}" wird mit rpc\literal SOAP nicht unterstützt. Das Wrapperelement muss unqualifiziert sein.
es: {0}="{1}" no es compatible con SOAP rpc o literal. El elemento contenedor tiene que estar incompleto.
fr: {0}='{1}' n'est pas pris en charge avec le SOAP rpc\literal. L'élément wrapper ne doit pas être qualifié.
it: {0}='{1}' non è supportato con SOAP rpc\literal. L'elemento wrapper deve essere non qualificato.
ja: rpc\literal SOAP を付けた {0}='{1}' はサポートされていません。ラッパー要素は非修飾である必要があります。
ko: {0}='{1}'은(는) rpc\literal SOAP에서 지원되지 않습니다. 래퍼 요소는 비정규화해야 합니다.
pl: Atrybut {0}=„{1}” nie jest obsługiwany przy użyciu protokołu rpc\literal SOAP. Element otoki musi być niekwalifikowany.
pt_br: {0}='{1}' não tem suporte com SOAP rpc\literal. O elemento wrapper tem que ser não qualificado.
ru: {0}="{1}" не поддерживается с rpc\literal SOAP. Определение элемента-оболочки должно быть отменено.
tr: rpc\literal SOAP ile {0}='{1}' desteklenmez. Sarmalayıcı öğe nitelenmemiş olmalıdır.
zh_hans: rpc\literal SOAP 不支持 {0}='{1}'。包装元素必须是非限定的。
zh_hant: 不支援 {0}='{1}' 具有 rpc\literal SOAP。包裝函式元素必須不合格。

# XmlRpcLitElementNullable
source: {0}='{1}' is not supported with rpc\literal SOAP. The wrapper element cannot be nullable.
cs: {0}={1} není u protokolu SOAP rpc\literal podporováno. Pro element obálky nesmí být možné zadat hodnotu null.
de: {0}="{1}" wird mit rpc\literal SOAP nicht unterstützt. Das Wrapperelement darf keine NULL-Werte zulassen.
es: {0}="{1}" no es compatible con SOAP rpc o literal. El elemento contenedor no puede tener un valor nulo.
fr: {0}='{1}' n'est pas pris en charge avec le SOAP rpc\literal. L'élément wrapper ne peut pas accepter la valeur Null.
it: {0}='{1}' non è supportato con SOAP rpc\literal. L'elemento wrapper non può ammettere valori Null.
ja: {0}='{1}' は、rpc\literal SOAP ではサポートされていません。このラッパー要素には null 値を使用できません。
ko: {0}='{1}'은(는) rpc\literal SOAP에서 지원되지 않습니다. 래퍼 요소는 Null을 허용할 수 없습니다.
pl: Atrybut {0}=„{1}” nie jest obsługiwany przy użyciu protokołu rpc\literal SOAP. Element otoki nie może przyjmować wartości null.
pt_br: {0}='{1}' não tem suporte com SOAP rpc\literal. O elemento wrapper não pode permitir valor nulo.
ru: {0}="{1}" не поддерживается с rpc\literal SOAP. Элемент-оболочка не может допускать значение null.
tr: rpc\literal SOAP ile {0}='{1}' desteklenmez. Sarmalayıcı null atanabilir bir öğe olamaz.
zh_hans: rpc\literal SOAP 不支持 {0}='{1}'。不允许包装元素可为 Null。
zh_hant: 不支援 {0}='{1}' 具有 rpc\literal SOAP。包裝函式元素不能可設為 null。

# XmlRpcLitElements
source: Multiple accessors are not supported with rpc\literal SOAP, you may use the following attributes: XmlArray, XmlArrayItem, or single XmlElement.
cs: Více přístupových objektů není u protokolu SOAP rpc\literal podporováno. Můžete používat následující atributy: XmlArray, XmlArrayItem nebo jeden atribut XmlElement
de: Mehrere Zugriffsmethoden werden mit rpc\literal SOAP nicht unterstützt. Sie können die folgenden Attribute verwenden: XmlArray, XmlArrayItem oder ein einzelnes XmlElement-Attribut.
es: SOAP rpc o literal no admite varios descriptores de acceso, puede utilizar los siguientes atributos: XmlArray, XmlArrayItem o un XmlElement único.
fr: Plusieurs accesseurs ne sont pas pris en charge avec le SOAP rpc\literal. Vous pouvez utiliser les attributs suivants : XmlArray, XmlArrayItem ou XmlElement (unique).
it: Con SOAP rpc\literal non sono supportate più funzioni di accesso. È possibile usare gli attributi seguenti: XmlArray, XmlArrayItem oppure un singolo attributo XmlElement.
ja: rpc\literal SOAP を付けた複数のアクセサーはサポートされていません。使用できる属性は、XmlArray、XmlArrayItem または単一の XmlElement です。
ko: 여러 접근자는 rpc\literal SOAP에서 지원되지 않으며 XmlArray, XmlArrayItem 또는 단일 XmlElement 특성을 사용할 수 있습니다.
pl: Protokół rpc\literal SOAP nie obsługuje wielu metod dostępu. Możesz użyć następujących atrybutów: XmlArray, XmlArrayItem lub pojedynczego atrybutu XmlElement.
pt_br: Não há suporte a vários acessadores com SOAP rpc\literal. Você pode usar os seguintes atributos: XmlArray, XmlArrayItem ou XmlElement único.
ru: Несколько методов доступа не поддерживаются с rpc\literal SOAP; можно использовать следующие атрибуты: XmlArray, XmlArrayItem или одинарный XmlElement.
tr: rpc\literal SOAP'ta birden çok erişimci desteklenmez. Şu öznitelikleri kullanabilirsiniz: XmlArray, XmlArrayItem veya single XmlElement.
zh_hans: rpc\literal SOAP 不支持多个父级，你可以使用以下特性: XmlArray、XmlArrayItem 或单独使用 XmlElement。
zh_hant: rpc\literal SOAP 不支援多重存取子，可使用下列屬性: XmlArray、XmlArrayItem 或單一 XmlElement。

# XmlRpcLitXmlns
source: Input or output values of an rpc\literal method cannot have an XmlNamespaceDeclarations attribute (member '{0}').
cs: Vstupní nebo výstupní hodnoty metody rpc\literal nemohou mít atribut XmlNamespaceDeclarations (člen {0}).
de: Die Ein- oder Ausgabewerte einer rpc\literal-Methode dürfen kein XmlNamespaceDeclarations-Attribut (Member "{0}") enthalten.
es: Los valores de entrada o salida de un método rpc\\literal no pueden tener un atributo XmlNamespaceDeclarations (miembro "{0}").
fr: Les valeurs d'entrée ou de sortie d'une méthode rpc\literal ne peuvent pas avoir d'attribut XmlNamespaceDeclarations (membre '{0}').
it: I valori di input o output di un metodo rpc\literal non possono includere un attributo XmlNamespaceDeclarations (membro '{0}').
ja: rpc\literal メソッドの入力値または出力値に XmlNamespaceDeclarations 属性 (メンバー '{0}') を指定することはできません。
ko: rpc\literal 메서드의 입력 또는 출력 값에는 XmlNamespaceDeclarations 특성(멤버 '{0}')을 사용할 수 없습니다.
pl: Wartości wejściowe i wyjściowe metody rpc\literal nie mogą mieć atrybutu XmlNamespaceDeclarations (składowa „{0}”).
pt_br: Os valores de entrada ou de saída de um método rpc\literal não podem ter um atributo XmlNamespaceDeclarations (membro '{0}').
ru: Входные и выходные значения метода rpc\literal не могут иметь атрибут XmlNamespaceDeclarations (член "{0}").
tr: rpc\literal metodunun giriş ve çıkış değerlerinde XmlNamespaceDeclarations özniteliği olamaz ('{0}' üyesi).
zh_hans: rpc\literal 方法的输入值或输出值不能有 XmlNamespaceDeclarations 特性(成员“{0}”)。
zh_hant: rpc\literal 方法的輸入或輸出不可有 XmlNamespaceDeclarations 屬性 (成員 '{0}')。

# XmlRpcNestedValueType
source: Cannot serialize {0}. Nested structs are not supported with encoded SOAP.
cs: {0} nelze serializovat. Kódovaný protokol SOAP nepodporuje vnořené struktury.
de: {0} kann nicht serialisiert werden. Geschachtelte Strukturen werden mit codiertem SOAP nicht unterstützt.
es: No se puede serializar {0}. Los structs anidados no son compatibles con SOAP codificado.
fr: Impossible de sérialiser {0}. Les structs imbriqués ne sont pas pris en charge avec le SOAP encodé.
it: Non è possibile serializzare {0}. Le struct annidate non sono supportate con SOAP codificato.
ja: {0} をシリアル化できません。構造体はエンコードされた SOAP でサポートされていません。
ko: {0}을(를) 직렬화할 수 없습니다. 중첩 구조체는 인코딩된 SOAP에서 지원되지 않습니다.
pl: Nie można serializować elementu {0}. Struktury zagnieżdżone nie są obsługiwane w kodowanym elemencie SOAP.
pt_br: Não é possível serializar {0}. Não há suporte para structs aninhados com codificação SOAP.
ru: Невозможно сериализовать {0}. Вложенные структуры с кодированными SOAP не поддерживаются.
tr: {0} serileştirilemiyor. Kodlanmış SOAP ile iç içe yapılar desteklenmiyor.
zh_hans: 无法序列化 {0}。编码的 SOAP 不支持嵌套结构。
zh_hant: 無法序列化 {0}。編碼的 SOAP 不支援巢狀結構。

# XmlRpcRefsInValueType
source: Cannot serialize {0}. References in structs are not supported with encoded SOAP.
cs: {0} nelze serializovat. Kódovaný protokol SOAP nepodporuje odkazy ve strukturách.
de: {0} kann nicht serialisiert werden. Verweise in Strukturen werden mit codiertem SOAP nicht unterstützt.
es: No se puede serializar {0}. Las referencias en los structs no son compatibles con SOAP codificado.
fr: Impossible de sérialiser {0}. Les références contenues dans les structs ne sont pas prises en charge avec le SOAP encodé.
it: Non è possibile serializzare {0}. I riferimenti nelle struct non sono supportati con SOAP codificato.
ja: {0} をシリアル化できません。構造体の参照はエンコードされた SOAP でサポートされていません。
ko: {0}을(를) 직렬화할 수 없습니다. 구조체의 참조는 인코딩된 SOAP에서 지원되지 않습니다.
pl: Nie można serializować elementu {0}. Odwołania w strukturach nie są obsługiwane w kodowanym elemencie SOAP.
pt_br: Não é possível serializar {0}. Não há suporte para referências em structs com codificação SOAP.
ru: Невозможно сериализовать {0}. Ссылки в структурах с кодированными SOAP не поддерживаются.
tr: {0} serileştirilemiyor. Kodlanmış SOAP ile yapılarda başvurular desteklenmiyor.
zh_hans: 无法序列化 {0}。编码的 SOAP 不支持结构中的引用。
zh_hant: 無法序列化 {0}。編碼的 SOAP 不支援結構中的參考。

# XmlSchema
source: Schema with targetNamespace='{0}' has invalid syntax. {1}
cs: Schéma s oborem názvů targetNamespace={0} má neplatnou syntaxi. {1}
de: Das Schema mit targetNamespace="{0}" weist eine ungültige Syntax auf. {1}
es: El esquema con targetNamespace="{0}" tiene una sintaxis no válida. {1}
fr: Le schéma avec targetNamespace='{0}' a une syntaxe non valide. {1}
it: La sintassi dello schema con targetNamespace='{0}' non è valida. {1}
ja: targetNamespace='{0}' を持つスキーマの構文が無効です。{1}
ko: targetNamespace='{0}'인 스키마의 구문이 잘못되었습니다. {1}
pl: Schemat z elementem targetNamespace=„{0}” ma nieprawidłową składnię. {1}
pt_br: O esquema com targetNamespace='{0}' tem sintaxe inválida. {1}
ru: Схема с targetNamespace="{0}" имеет недопустимый синтаксис. {1}
tr: targetNamespace='{0}' olan şemanın sözdizimi geçersiz. {1}
zh_hans: targetNamespace='{0}' 的架构具有无效的语法。{1}
zh_hant: 包含 targetNamespace='{0}' 的結構描述有無效的語法。{1}
