Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# XmlInvalidFormUnqualified
source: The Form property may not be 'Unqualified' when an explicit Namespace property is present.
cs: Pokud je přítomna explicitní vlastnost Namespace, vlastnost Form nesmí mít hodnotu Unqualified.
de: Die Form-Eigenschaft darf nicht "Unqualified" sein, wenn eine explizite Namespace-Eigenschaft vorhanden ist.
es: La propiedad Form no puede ser "Unqualified" cuando está presente una propiedad Namespace.
fr: La propriété Form ne peut pas être 'Unqualified' quand une propriété Namespace explicite est présente.
it: La proprietà Form non può essere 'Unqualified' quando è presente una proprietà Namespace esplicita.
ja: 明示的な Namespace プロパティが存在するときに Form プロパティを 'Unqualified' にすることはできません。
ko: 명시적 Namespace 속성이 있는 경우 Form 속성은 'Unqualified'일 수 없습니다.
pl: Właściwość Form nie może mieć wartości „Unqualified”, jeśli występuje jawna właściwość Namespace.
pt_br: A propriedade Form não pode ser 'Unqualified' quando há uma propriedade Namespace explícita.
ru: Свойство Form не может иметь значение Unqualified, когда свойство Namespace задано в явном виде.
tr: Açık olarak bir Namespace özelliği varken Form özelliği 'Unqualified' olamaz.
zh_hans: 当存在显式 Namespace 属性时，Form 属性不能为 "Unqualified"。
zh_hant: 出現明確的 Namespace 屬性時，Form 屬性不可為 'Unqualified'。

# XmlInvalidHref
source: The referenced element with ID '{0}' was not found in the document.
cs: Odkazovaný element s identifikátorem {0} nebyl v dokumentu nalezen.
de: Das Element mit der ID "{0}", auf das verwiesen wird, wurde nicht im Dokument gefunden.
es: No se encontró en el documento el elemento con id. "{0}" al que se hace referencia.
fr: L'élément référencé avec l'ID '{0}' est introuvable dans le document.
it: Nel documento non è stato trovato l'elemento con ID '{0}' a cui viene fatto riferimento.
ja: ID '{0}' を持つ参照要素はドキュメントに見つかりませんでした。
ko: 문서에서 ID가 '{0}'인 참조된 요소를 찾을 수 없습니다.
pl: W dokumencie nie odnaleziono elementu o identyfikatorze „{0}”, do którego nastąpiło odwołanie.
pt_br: O elemento referenciado com ID '{0}' não foi encontrado no documento.
ru: Элемент с идентификатором "{0}", на который задана ссылка, не найден в документе.
tr: Başvurulan '{0}' kimliğine sahip öğe belgede bulunamadı.
zh_hans: 文档中未找到 ID 为“{0}”的引用元素。
zh_hant: 文件中找不到擁有 ID '{0}' 的參考元素。

# XmlInvalidIdentifier
source: Identifier '{0}' is not CLS-compliant.
cs: Identifikátor {0} neodpovídá specifikaci CLS.
de: Der Bezeichner "{0}" ist nicht CLS-kompatibel.
es: El identificador "{0}" no es conforme a CLS.
fr: L'identificateur '{0}' n'est pas conforme CLS.
it: L'identificatore '{0}' non è conforme a CLS.
ja: 識別子 '{0}' は CLS に準拠していません。
ko: '{0}' 식별자는 CLS 규격이 아닙니다.
pl: Identyfikator „{0}” nie jest zgodny ze specyfikacją CLS.
pt_br: O identificador '{0}' não está em conformidade com CLS.
ru: Идентификатор "{0}" не совместим с CLS.
tr: '{0}' tanımlayıcısı Ortak Dil Belirtimi (CLS) uyumlu değil.
zh_hans: 标识符“{0}”不符合 CLS。
zh_hant: 識別碼 '{0}' 不符合 CLS 規範。

# XmlInvalidIsNullable
source: IsNullable may not be 'true' for value type {0}. Please consider using Nullable<{0}> instead.
cs: Vlastnost IsNullable nesmí být pro typ hodnoty {0} nastavena na hodnotu true. Zvažte prosím možnost použít místo toho hodnotu Nullable<{0}>.
de: IsNullable darf für den Werttyp {0} nicht "true" sein. Verwenden Sie stattdessen "Nullable<{0}>".
es: Puede que IsNullable no sea "true" para el tipo de valor {0}. Considere utilizar Nullable<{0}> en su lugar.
fr: IsNullable ne peut pas être 'true' pour le type valeur {0}. Utilisez Nullable<{0}> à la place.
it: IsNullable non può essere 'true' per il tipo valore {0}. Provare a usare Nullable<{0}>.
ja: 値の型 {0} の IsNullable を 'true' にすることはできません。代わりに Nullable<{0}> の使用を検討してください。
ko: IsNullable은 값 형식 {0}에 대해 'true'일 수 없습니다. 대신 Nullable<{0}>을 사용하세요.
pl: Element IsNullable nie może mieć wartości „true” dla typu wartości {0}. Rozważ użycie zamiast niego elementu Nullable<{0}>.
pt_br: IsNullable não pode ser 'true' para o tipo de valor {0}. Considere usar Nullable<{0}>.
ru: IsNullable для типа значения {0} не может иметь значение true (истина). Рекомендуется использовать Nullable<{0}>.
tr: {0} değer türü için IsNullable 'true' olamaz. Bunun yerinde Nullable<{0}> kullanmayı deneyin.
zh_hans: 对于值类型 {0}，IsNullable 不能为 "true"。请考虑使用 Nullable<{0}>。
zh_hant: 實值型別 {0} 的 IsNullable 不可為 'true'。請考慮改用 Nullable<{0}>。

# XmlInvalidNotNullable
source: IsNullable may not be set to 'false' for a Nullable<{0}> type. Consider using '{0}' type or removing the IsNullable property from the {1} attribute.
cs: Vlastnost IsNullable nesmí být pro typ Nullable<{0}> nastavena na hodnotu false. Zvažte možnost použít typ {0} nebo odebrat vlastnost IsNullable z atributu {1}.
de: IsNullable darf für einen Nullable<{0}>-Typ nicht auf "false" gesetzt werden. Verwenden Sie ggf. den Typ "{0}", oder entfernen Sie die IsNullable-Eigenschaft aus dem {1}-Attribut.
es: IsNullable no se puede establecer como "false" para un tipo Nullable<{0}>. Considere utilizar el tipo "{0}" o extraer la propiedad IsNullable del atributo {1}.
fr: IsNullable ne peut pas avoir la valeur 'false' pour un type Nullable<{0}>. Utilisez le type '{0}' ou supprimez la propriété IsNullable de l'attribut {1}.
it: IsNullable non può essere impostato su 'false' per il Nullable<{0}>. Provare a usare il tipo '{0}' o rimuovere la proprietà IsNullable dall'attributo {1}.
ja: Nullable<{0}> 型の IsNullable を 'false' にすることはできません。'{0}' 型を使用するか、または {1} 属性から IsNullable プロパティを削除してください。
ko: IsNullable은 Nullable<{0}> 형식에 대해 'false'로 설정할 수 없습니다. '{0}' 형식을 사용하거나 {1} 특성에서 IsNullable 속성을 제거하세요.
pl: Nie można ustawić właściwości IsNullable na „false” dla typu Nullable<{0}>. Rozważ użycie typu „{0}” lub usunięcie właściwości IsNullable z atrybutu {1}.
pt_br: IsNullable não pode ser definido como 'false' para um tipo Nullable<{0}>. Considere usar o tipo '{0}' ou remover a propriedade IsNullable do atributo {1}.
ru: IsNullable не может быть присвоено значение false для типа Nullable<{0}>. Попробуйте использовать тип "{0}" или удалите свойство IsNullable из атрибута {1}.
tr: IsNullable, Nullable<{0}> türü için 'false' olarak ayarlanamaz. '{0}' türünü kullanmayı veya {1} özniteliğinden IsNullable özelliğini kaldırmayı deneyin.
zh_hans: 对于 Nullable<{0}> 类型，IsNullable 不能为 "false"。请考虑使用“{0}”类型或将 IsNullable 属性从 {1} 特性中移除。
zh_hant: Nullable<{0}> 類型的 IsNullable 不可設定為 'false'。請考慮使用 '{0}' 類型或將 IsNullable 內容由 {1} 屬性中移除。

# XmlInvalidNullCast
source: Cannot assign null value to an object of type {1}.
cs: Objektu typu {1} nelze přiřadit hodnotu null.
de: Ein NULL-Wert kann einem Objekt vom Typ {1} nicht zugewiesen werden.
es: No se puede asignar un valor nulo a un objeto de tipo {1}.
fr: Impossible d'assigner une valeur null à un objet de type {1}.
it: Non è possibile assegnare il valore Null a un oggetto di tipo {1}.
ja: 型 {1} のオブジェクトに null 値を割り当てることはできません。
ko: Null 값은 {1} 형식의 개체에 할당할 수 없습니다.
pl: Nie można przypisać wartości null do obiektu typu {1}.
pt_br: Não é possível atribuir valor nulo para objeto do tipo {1}.
ru: Объекту типа {1} невозможно присвоить значение null.
tr: Null değer {1} türü bir nesneye atanamaz.
zh_hans: 无法将空值赋给类型 {1} 的对象。
zh_hant: 無法對類型 {1} 的物件指派 Null 值。

# XmlInvalidReturnPosition
source: The return value must be the first member.
cs: Vrácená hodnota musí být prvním členem.
de: Der Rückgabewert muss der erste Member sein.
es: El valor devuelto debe ser el primer miembro.
fr: La valeur retournée doit être le premier membre.
it: Il valore restituito deve essere il primo membro.
ja: 戻り値は最初のメンバーでなければなりません。
ko: 반환 값은 첫째 멤버여야 합니다.
pl: Pierwszą składową musi być zwracana wartość.
pt_br: O valor retornado deve ser o primeiro membro.
ru: Возвращаемое значение должно быть первым членом.
tr: Dönüş değeri ilk üye olmalıdır.
zh_hans: 返回值必须是第一个成员。
zh_hant: 傳回值必須是第一個成員。

# XmlInvalidSchemaElementType
source: Types must be declared at the top level in the schema. Please review schema type '{0}' from namespace '{1}': element '{2}' is using anonymous type declaration, anonymous types are not supported with encoded SOAP.
cs: Typy musí být deklarovány na nejvyšší úrovni schématu. Zkontrolujte typ schématu {0} z oboru názvů {1}: element {2} používá anonymní typ deklarace. U kódovaného protokolu SOAP nejsou anonymní typy podporovány.
de: Typen müssen auf der obersten Schemaebene deklariert werden. Überprüfen Sie den Schematyp "{0}" aus dem Namespace "{1}": Das Element "{2}" verwendet eine anonyme Typdeklaration. Anonyme Typen werden mit codiertem SOAP nicht unterstützt.
es: Los tipos se deben declarar en el nivel superior del esquema. Revise el tipo de esquema "{0}" del espacio de nombres "{1}": el elemento "{2}" usa una declaración de tipos anónimos y los tipos anónimos no son compatibles con SOAP codificado.
fr: Les types doivent être déclarés au niveau supérieur dans le schéma. Passez en revue le type de schéma '{0}' de l'espace de noms '{1}' : l'élément '{2}' utilise une déclaration de type anonyme. Les types anonymes ne sont pas pris en charge avec le SOAP encodé.
it: I tipi devono essere dichiarati al primo livello dello schema. Esaminare il tipo di schema '{0}' appartenente allo spazio dei nomi '{1}': l'elemento '{2}' usa la dichiarazione di tipo anonimo. I tipi anonimi non sono supportati con SOAP codificato.
ja: 型は、スキーマのトップ レベルで宣言される必要があります。名前空間 '{1}' のスキーマの型 '{0}' を確認してください。要素 '{2}' では、無名型宣言が使用されています。エンコードされた SOAP では無名型をサポートしていません。
ko: 형식은 스키마의 최상위 수준에서 선언해야 합니다. 네임스페이스 '{1}'에서 스키마 형식 '{0}'을(를) 확인하세요. 요소 '{2}'은(는) 무명 형식 선언을 사용하고 있는데 무명 형식은 인코딩된 SOAP에서 지원되지 않습니다.
pl: Typy należy zadeklarować na najwyższym poziomie schematu. Przejrzyj typ schematu „{0}” z przestrzeni nazw „{1}”: dla elementu „{2}” jest używana deklaracja typu anonimowego. Typy anonimowe nie są obsługiwane przy użyciu zakodowanego protokołu SOAP.
pt_br: Os tipos devem ser declarados no nível superior do esquema. Examine o tipo de esquema '{0}' do namespace '{1}': o elemento '{2}' está usando uma declaração de tipo anônimo; não há suporte para tipos anônimos com SOAP codificado.
ru: Типы должны объявляться на верхнем уровне схемы. Просмотрите тип схемы "{0}" из пространства имен "{1}": элемент "{2}" использует объявление анонимного типа, а анонимные типы с кодированными SOAP не поддерживаются.
tr: Türler, şemadaki en üst düzeyde bildirilmeli. Lütfen '{1}' ad alanındaki '{0}' şema türünü gözden geçirin: '{2}' öğesi anonim türü bildirimi kullanıyor, kodlanmış SOAP'da anonim türler desteklenmez.
zh_hans: 必须在架构的顶层声明类型。请复查来自命名空间“{1}”的架构类型“{0}”: 元素“{2}”正在使用匿名类型声明，编码的 SOAP 不支持匿名类型。
zh_hant: 類型必須在結構描述的第一層中宣告。請從命名空間 '{1}' 中檢閱結構描述類型 '{0}': 元素 '{2}' 正在使用匿名的型別宣告，不支援以 SOAP 編碼匿名類型。

# XmlInvalidSchemaExtension
source: '{0}' is not a valid SchemaExtensionType.
cs: {0} není platná hodnota SchemaExtensionType.
de: "{0}" ist kein gültiger SchemaExtensionType.
es: "{0}" no es un SchemaExtensionType válido.
fr: '{0}' n'est pas un attribut SchemaExtensionType valide.
it: '{0}' non è un elemento SchemaExtensionType valido.
ja: '{0}' は有効な SchemaExtensionType ではありません。
ko: '{0}'은(는) 유효한 SchemaExtensionType이 아닙니다.
pl: Element „{0}” nie jest prawidłowym typem SchemaExtensionType.
pt_br: '{0}' não é um SchemaExtensionType válido.
ru: "{0}" не является допустимым SchemaExtensionType.
tr: '{0}' geçerli bir SchemaExtensionType değil.
zh_hans: “{0}”不是有效的 SchemaExtensionType。
zh_hant: '{0}' 不是有效的 SchemaExtensionType。

# XmlInvalidSerializable
source: The type {0} may not be used in this context. To use {0} as a parameter, return type, or member of a class or struct, the parameter, return type, or member must be declared as type {0} (it cannot be object). Objects of type {0} may not be used in un-typed collections, such as ArrayLists.
cs: Typ {0} nesmí být použit v tomto kontextu. Chcete-li typ {0} použít jako parametr, typ vrácené hodnoty nebo člen třídy či struktury, musí být příslušný parametr, typ vrácené hodnoty nebo člen deklarován jako typ {0} (nemůže se jednat o objekt). Objekty typu {0} nesmí být použity v kolekcích bez určení typu, jako je například kolekce ArrayLists.
de: Der Typ {0} kann in diesem Kontext nicht verwendet werden. Um {0} als Parameter, Rückgabetyp oder Member einer Klasse oder einer Struktur zu verwenden, muss der Parameter, Rückgabetyp oder Member als Typ {0} deklariert werden (nicht als Objekt). Objekte vom Typ {0} können nicht in nicht typisierten Sammlungen wie ArrayLists verwendet werden.
es: El tipo {0} no se puede utilizar en este contexto. Para usar {0} como parámetro, tipo de valor devuelto o miembro de una clase o struct, el parámetro, tipo de valor devuelto o miembro debe declararse como tipo {0} (no puede ser un objeto). Los objetos de tipo {0} no se pueden usar en colecciones sin tipo, como ArrayLists.
fr: Le type {0} ne peut pas être utilisé dans ce contexte. Pour utiliser {0} comme paramètre, type de retour ou membre d'une classe ou d'un struct, le paramètre, type de retour ou membre doit être déclaré comme étant du type {0} (il ne peut pas s'agir d'un objet). Les objets de type {0} ne peuvent pas être utilisés dans des collections non typées, comme ArrayLists.
it: Non è possibile usare il tipo {0} in questo contesto. Per usare {0} come parametro, tipo restituito o membro di una classe o di una struct, il parametro, il tipo restituito o il membro deve essere dichiarato come tipo {0} (non può essere un oggetto). Non è possibile usare gli oggetti di tipo {0} in raccolte senza tipo, come ArrayLists.
ja: このコンテキストでは、型 {0} は使用できません。{0} をパラメーター、戻り値の型、またはクラスや構造体のメンバーとして使用するには、そのパラメーター、戻り値の型、クラスまたは構造体のメンバーは、型 {0} として宣言されている必要があります (オブジェクトは不可)。{0} 型のオブジェクトは、ArrayLists のような型指定されていないコレクションでは使用できません。
ko: 이 컨텍스트에서는 형식 {0}을(를) 사용할 수 없습니다. {0}을(를) 매개 변수, 반환 형식 또는 클래스나 구조체의 멤버로 사용하려면 매개 변수, 반환 형식 또는 멤버를 형식 {0}(으)로 선언해야 합니다(개체는 될 수 없음). {0} 형식의 개체는 ArrayLists와 같이 형식화되지 않은 컬렉션에서 사용할 수 없습니다.
pl: Typ {0} nie może być używany w tym kontekście. Aby używać typu {0} jako parametru, typu zwracanego albo składowej klasy lub struktury, parametr, typ zwracany lub składowa musi zostać zadeklarowana jako typ {0} (nie może być obiektem). Obiekty typu {0} nie mogą być używane w kolekcjach nieokreślonego typu (np. ArrayLists).
pt_br: O tipo {0} não pode ser usado neste contexto. Para usar {0} como parâmetro, tipo de retorno ou membro de uma classe ou struct, o parâmetro, o tipo de retorno ou o membro deve ser declarado como tipo {0} (não pode ser objeto). Objetos do tipo {0} não podem ser usados em coleções sem tipo, como ArrayLists.
ru: Тип "{0}" не может использоваться в этом контексте. Чтобы использовать {0} в качестве параметра, возвращаемого типа, члена класса или структуры, параметр, возвращаемый тип или член должны быть объявлены как имеющие тип {0} (не может являться объектом). Объекты типа {0} не могут использоваться в коллекциях без типа, например ArrayLists.
tr: {0} türü bu bağlamda kullanılamıyor. {0} türünü parametre, dönüş türü veya bir sınıf ya da yapının üyesi olarak kullanabilmek için parametre, dönüş türü veya üyenin {0} türünde (nesne olamaz) olacak şekilde bildirilmesi gerekir. {0} türündeki nesneler, ArrayList gibi türü belirtilmemiş koleksiyonlarda kullanılamaz.
zh_hans: 类型 {0} 不能用在此上下文中。要将 {0} 用作参数、返回类型或者类或结构的成员，该参数、返回类型或成员必须声明为类型 {0}(它不能是对象)。类型 {0} 的对象不能用在非类型化的集合如 ArrayList 中。
zh_hant: 類型 {0} 不可以在這個內容中使用。若要使用 {0} 當作參數、傳回型別或類別或建構的成員，參數、類型或成員必須宣告為類型 {0} (它不可是物件)。類型 {0} 的物件不可以在未類型化的集合中使用，例如 ArrayLists。

# XmlInvalidSoapArray
source: An array of type {0} may not be used with XmlArrayType.Soap.
cs: Pole typu {0} nemůže být použito s typem XmlArrayType.Soap.
de: Ein Array vom Typ {0} kann nicht mit XmlArrayType.Soap verwendet werden.
es: No se puede utilizar una matriz de tipo {0} con XmlArrayType.Soap.
fr: Un tableau de type {0} ne peut pas être utilisé avec XmlArrayType.Soap.
it: Non è possibile usare una matrice di tipo {0} con XmlArrayType.Soap.
ja: {0} 型の配列を XmlArrayType.Soap で使うことはできません。
ko: {0} 형식 배열을 XmlArrayType.Soap와 함께 사용할 수 없습니다.
pl: Tablica typu {0} nie może być używana z elementem XmlArrayType.Soap.
pt_br: Uma matriz do tipo {0} não pode ser usada com XmlArrayType.Soap.
ru: Массив типа {0} не может использоваться с XmlArrayType.Soap.
tr: {0} türü bir dizi XmlArrayType.Soap ile kullanılamaz.
zh_hans: {0} 类型的数组不能和 XmlArrayType.Soap 一起使用。
zh_hant: 類型為 {0} 的陣列不可與 XmlArrayType.Soap 一起使用。

# XmlInvalidSpecifiedType
source: Member '{0}' of type {1} cannot be serialized. Members with names ending on 'Specified' suffix have special meaning to the XmlSerializer: they control serialization of optional ValueType members and have to be of type {2}.
cs: Člen {0} typu {1} nelze serializovat. Členy, jejichž názvy končí příponou Specified, mají u objektu XmlSerializer zvláštní význam: řídí serializaci volitelných členů ValueType a musí být typu {2}.
de: Der Member "{0}" vom Typ {1} kann nicht serialisiert werden. Member mit Namen, die mit dem Suffix "Specified" enden, haben für den XmlSerializer eine besondere Bedeutung: Sie steuern die Serialisierung optionaler ValueType-Member und müssen vom Typ {2} sein.
es: No se puede serializar un miembro "{0}" del tipo {1}. Los miembros con nombres que terminan en el sufijo "Specified" tienen un significado especial para XmlSerializer: controlan la serialización de miembros ValueType opcionales y deben ser del tipo {2}.
fr: Impossible de sérialiser le membre '{0}' de type {1}. Les membres dont le nom finit par le suffixe 'Specified' ont une signification particulière pour XmlSerializer : ils contrôlent la sérialisation des membres ValueType facultatifs et doivent être de type {2}.
it: Non è possibile serializzare il membro '{0}' di tipo {1}. I membri con nomi che terminano con il suffisso 'Specified' hanno un significato particolare per XmlSerializer: consentono di controllare la serializzazione dei membri facoltativi ValueType e devono essere di tipo {2}.
ja: 型 {1} のメンバー '{0}' はシリアル化できません。'Specified' サフィックスで終わる名前が付けられたメンバーは、XmlSerializer にとっては特別な意味があります。これらは任意の ValueType メンバーのシリアル化を制御し、{2} 型である必要があります。
ko: {1} 형식의 멤버 '{0}'은(는) 직렬화할 수 없습니다. 이름이 'Specified' 접미사로 끝나는 멤버는 XmlSerializer에 특별한 의미가 있습니다. 이 멤버는 선택적인 ValueType 멤버의 serialization을 제어하며 {2} 형식이어야 합니다.
pl: Nie można serializować składowej „{0}” typu {1}. Składowe, których nazwy kończą się sufiksem „Specified”, mają specjalne znaczenie dla elementu XmlSerializer: służą do sterowania serializacją opcjonalnych składowych ValueType, dlatego muszą być typu {2}.
pt_br: Não é possível serializar o membro '{0}' do tipo {1}. Membros com nomes que terminam com o sufixo 'Specified' têm significado especial para o XmlSerializer: eles controlam a serialização de membros ValueType opcionais e precisam ser do tipo {2}.
ru: Член "{0}" типа {1} не может быть сериализован. Члены, имена которых заканчиваются суффиксом Specified, имеют для XmlSerializer особенное значение: они управляют сериализацией необязательных членов ValueType и должны иметь тип {2}.
tr: {1} türündeki '{0}' üyesi serileştirilemiyor. Adları 'Specified' sonekiyle biten üyeler XmlSerializer tarafından farklı değerlendirilir: İsteğe bağlı ValueType üyelerinin serileştirilmesini denetlerler ve türlerinin {2} olması gerekir.
zh_hans: 无法序列化 {1} 类型的成员“{0}”。名称以 "Specified" 后缀结尾的成员对 XmlSerializer 具有特殊含义: 它们控制可选 ValueType 成员的序列化，并且必须是 {2} 类型。
zh_hant: 無法序列化類型 {1} 的成員 '{0}'。名稱結尾在 'Specified' 字尾的成員對 XmlSerializer 有特殊意義: 他們會控制選用性 ValueType 成員的序列化，且必須是類型 {2}。

# XmlInvalidSubstitutionGroupUse
source: Substitution group may not be used with encoded SOAP. Please review type declaration '{0}' from namespace '{1}'.
cs: Skupina nahrazení nesmí být použita s kódovaným protokolem SOAP. Zkontrolujte deklaraci typu {0} z oboru názvů {1}.
de: Eine Ersetzungsgruppe kann nicht mit codiertem SOAP verwendet werden. Überprüfen Sie die Typdeklaration "{0}" aus dem Namespace "{1}".
es: No se puede utilizar el grupo de sustitución con SOAP codificado. Revise la declaración de tipos "{0}" del espacio de nombres "{1}".
fr: Un groupe de substitution ne peut pas être utilisé avec le SOAP encodé. Passez en revue la déclaration de type '{0}' de l'espace de noms '{1}'.
it: Non è possibile usare un gruppo di sostituzione con SOAP codificato. Esaminare la dichiarazione di tipo '{0}' dello spazio dei nomi '{1}'.
ja: エンコードされた SOAP では、代替グループを使用できません。名前空間 '{1}' の型宣言 '{0}' を確認してください。
ko: 대체 그룹은 인코딩된 SOAP에서 사용할 수 없습니다. 네임스페이스 '{1}'에서 형식 선언 '{0}'을(를) 확인하세요.
pl: Grupa podstawienia nie może być używana z zakodowanym protokołem SOAP. Przejrzyj deklarację typu „{0}” z przestrzeni nazw „{1}”.
pt_br: O grupo de substituição não pode ser usado com SOAP codificado. Examine a declaração de tipo '{0}' do namespace '{1}'.
ru: Группа подстановки не может использоваться с кодированными SOAP. Просмотрите объявление типа "{0}" из пространства имен "{1}".
tr: Kodlanmış SOAP ile değiştirme grubu kullanılamaz. Lütfen '{1}' ad alanındaki '{0}' tür bildirimini gözden geçirin.
zh_hans: 替换组不能与编码的 SOAP 一起使用。请复查来自命名空间“{1}”的类型声明“{0}”。
zh_hant: 替代群組不可與經過編碼的 SOAP 一起使用。請檢閱命名空間 '{1}' 的型別宣告 '{0}'。

# XmlInvalidTypeAttributes
source: XmlRoot and XmlType attributes may not be specified for the type {0}.
cs: Atributy XmlRoot a XmlType nesmí být zadány pro typ {0}.
de: Die Attribute XmlRoot und XmlType können für den Typ {0} nicht angegeben werden.
es: No se pueden especificar los atributos XmlRoot y XmlType para el tipo {0}.
fr: Vous ne pouvez pas spécifier les attributs XmlRoot et XmlType pour le type {0}.
it: Non è possibile specificare gli attributi XmlRoot e XmlType per il tipo {0}.
ja: XmlRoot および XmlType 属性のみを {0} 型に対して指定することはできません。
ko: XmlRoot 및 XmlType 특성을 {0} 형식에 대해 지정할 수 없습니다.
pl: Atrybuty XmlRoot i XmlType nie mogą być określone dla typu {0}.
pt_br: Atributos XmlRoot e XmlType não podem ser especificados para o tipo {0}.
ru: Невозможно задать атрибуты XmlRoot и XmlType для типа {0}.
tr: XmlRoot ve XmlType öznitelikleri {0} türü için belirtilemez.
zh_hans: 不能为类型 {0} 指定 XmlRoot 和 XmlType 特性。
zh_hant: XmlRoot 和 XmlType 屬性不可以指定給類型 {0}。

# XmlInvalidUseOfType
source: The type {0} may not be used in this context.
cs: Typ {0} nesmí být použit v tomto kontextu.
de: Der Typ {0} kann in diesem Kontext nicht verwendet werden.
es: No se puede utilizar en este contexto el tipo {0}.
fr: Le type {0} ne peut pas être utilisé dans ce contexte.
it: Non è possibile usare il tipo {0} in questo contesto.
ja: 型 {0} をこのコンテキストで使うことはできません。
ko: 이 컨텍스트에는 {0} 형식을 사용할 수 없습니다.
pl: Typ {0} nie może być używany w tym kontekście.
pt_br: O tipo {0} não pode ser usado neste contexto.
ru: Тип "{0}" не может использоваться в этом контексте.
tr: {0} türü bu bağlamda kullanılamaz.
zh_hans: 类型 {0} 不能在此上下文中使用。
zh_hant: 在這個內容中不可以使用類型 {0}。

# XmlInvalidVoid
source: The type Void is not valid in this context.
cs: Typ Void není v tomto kontextu platný.
de: Der Typ Void ist in diesem Kontext ungültig.
es: Tipo Void no válido en este contexto.
fr: Le type Void est non valide dans ce contexte.
it: Il tipo Void non è valido in questo contesto.
ja: Void 型はこのコンテキストでは無効です。
ko: 이 컨텍스트에서는 Void 형식을 사용할 수 없습니다.
pl: Typ Void nie jest prawidłowy w tym kontekście.
pt_br: O tipo Void é inválido neste contexto.
ru: Тип Void для этого контекста не допускается.
tr: Void türü bu bağlamda geçerli değildir.
zh_hans: 在此上下文中，类型 Void 无效。
zh_hant: 在這個內容中類型 Void 無效。
