Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Sch_MismatchTargetNamespaceInclude
source: The targetNamespace '{0}' of included/redefined schema should be the same as the targetNamespace '{1}' of the including schema.
cs: Obor názvů targetNamespace {0} zahrnutého či předefinovaného schématu by měl být stejný jako obor názvů targetNamespace {1} schématu, ve kterém je zahrnut.
de: Der targetNamespace "{0}" des eingeschlossenen/neu definierten Schemas muss dem targetNamespace "{1}" des einschließenden Schemas entsprechen.
es: El elemento targetNamespace "{0}" de un esquema incluido/redefinido debe coincidir con el elemento targetNamespace "{1}" del esquema que lo incluye.
fr: Le targetNamespace '{0}' du schéma inclus/redéfini doit être identique au targetNamespace '{1}' du schéma d'inclusion.
it: Il valore dell'elemento targetNamespace '{0}' dello schema incluso/ridefinito deve essere uguale a quello dell'elemento targetNamespace '{1}' dello schema di inclusione.
ja: インクルードまたは再定義されたスキーマの targetNamespace '{0}' は、インクルードするスキーマの targetNamespace '{1}' と同じである必要があります。
ko: 포함되거나 다시 정의된 스키마의 targetNamespace '{0}'은(는) 포함하는 스키마의 targetNamespace '{1}'과(와) 같아야 합니다.
pl: Przestrzeń nazw targetNamespace „{0}” schematu uwzględnionego/ponownie definiowanego powinna być taka sama jak przestrzeń nazw targetNamespace „{1}” schematu uwzględniającego.
pt_br: O targetNamespace '{0}' do esquema incluído/redefinido deve ser igual ao targetNamespace '{1}' do esquema de inclusão.
ru: Параметр targetNamespace "{0}" включенной/переопределенной схемы должен иметь то же значение, что и targetNamespace "{1}" включающей схемы.
tr: Eklenen/yeniden tanımlanan şemadaki targetNamespace '{0}', eklenen şemadaki targetNamespace '{1}' ile aynı olmalı.
zh_hans: 包括的/重新定义的架构的 targetNamespace“{0}”应与所含架构的 targetNamespace“{1}”相同。
zh_hant: 已內含的/已重新定義的結構描述 targetNamespace '{0}' 應與內含結構描述 targetNamespace '{1}' 有相同的值。

# Sch_MissAttribute
source: The '{0}' attribute is either invalid or missing.
cs: Atribut {0} je neplatný nebo nebyl nalezen.
de: Das {0}-Attribut ist ungültig oder fehlt.
es: Falta el atributo "{0}" o no es válido.
fr: L'attribut '{0}' est non valide ou manquant.
it: L'attributo '{0}' non è valido o manca.
ja: '{0}' 属性が無効か、または見つかりません。
ko: '{0}' 특성이 잘못되었거나 없습니다.
pl: Brak atrybutu „{0}” lub jest on nieprawidłowy.
pt_br: O atributo '{0}' é inválido ou inexistente.
ru: Атрибут "{0}" отсутствует или является недопустимым.
tr: '{0}' özniteliği geçersiz ya da eksik.
zh_hans: “{0}”特性无效或缺少。
zh_hant: '{0}' 屬性無效，或遺漏了該屬性。

# Sch_MissDtvalue
source: The DataType value cannot be empty.
cs: Hodnota DataType nemůže být prázdná.
de: Der DataType-Wert darf nicht leer sein.
es: El valor DataType no puede estar vacío.
fr: La valeur de DataType ne peut pas être vide.
it: Il valore di DataType non può essere vuoto.
ja: DataType 値を空にすることはできません。
ko: DataType 값은 비워 둘 수 없습니다.
pl: Wartość elementu DataType nie może być pusta.
pt_br: O valor de DataType não pode estar vazio.
ru: Значение DataType не может быть пустым.
tr: DataType değeri boş olamaz.
zh_hans: DataType 值不能为空。
zh_hant: DataType 值不可為空白。

# Sch_MissDtvaluesAttribute
source: The dt:values attribute is missing.
cs: Atribut dt:values nebyl nalezen.
de: Das dt:values-Attribut fehlt.
es: Falta el atributo dt:values.
fr: Attribut dt:values manquant.
it: Manca l'attributo dt:values.
ja: 'dt:values' 属性が見つかりません。
ko: dt:values 특성이 없습니다.
pl: Brak atrybutu dt:values.
pt_br: O atributo dt:values é inexistente.
ru: Отсутствует атрибут dt:values.
tr: dt:values özniteliği eksik.
zh_hans: 缺少 dt:values 特性。
zh_hant: 遺漏 dt:values 屬性。

# Sch_MissRequiredAttribute
source: The required attribute '{0}' is missing.
cs: Požadovaný atribut {0} nebyl nalezen.
de: Das erforderliche Attribut "{0}" fehlt.
es: Falta el atributo "{0}" necesario.
fr: L'attribut obligatoire '{0}' est manquant.
it: Manca l'attributo obbligatorio '{0}'.
ja: 必要な属性 '{0}' が見つかりません。
ko: 필요한 특성 '{0}'이(가) 없습니다.
pl: Brak wymaganego atrybutu „{0}”.
pt_br: O atributo necessário '{0}' está ausente.
ru: Отсутствует обязательный атрибут "{0}".
tr: Gerekli '{0}' özniteliği eksik.
zh_hans: 缺少必需的特性“{0}”。
zh_hant: 遺漏必要屬性 '{0}'。

# Sch_MissingKey
source: The identity constraint '{0}' validation has failed. Either a key is missing or the existing key has an empty node.
cs: Ověření omezení identity {0} se nezdařilo. Buď nebyl nalezen klíč, nebo stávající klíč obsahuje prázdný uzel.
de: Fehler bei der Validierung der Identitätseinschränkung "{0}". Entweder fehlt ein Schlüssel, oder der vorhandene Schlüssel enthält einen leeren Knoten.
es: Error al validar la restricción de identidad "{0}". Falta una clave o la clave existente tiene un nodo vacío.
fr: Échec de la validation de la contrainte d'identité '{0}'. Une clé est manquante ou la clé existante a un nœud vide.
it: La convalida del vincolo di identità '{0}' non è riuscita. Manca una chiave o la chiave esistente contiene un nodo vuoto.
ja: Identity 制約 '{0}' 検証は、キーがないか、または既存のキーのノードが空のために失敗しました。
ko: 키가 없거나 기존 키에 빈 노드가 있어 identity 제약 조건 '{0}'의 유효성을 검사하지 못했습니다.
pl: Weryfikacja ograniczenia tożsamości „{0}” nie powiodła się z powodu braku klucza lub pustego węzła w istniejącym kluczu.
pt_br: Falha na validação da restrição de identidade '{0}'. Uma chave está ausente ou a chave existente tem um nó vazio.
ru: Сбой при проверке ограничения по идентификатору "{0}". Отсутствует ключ, или существующий ключ содержит пустой узел.
tr: '{0}' kimlik kısıtlaması doğrulaması başarısız oldu. Anahtar eksik veya mevcut anahtarda boş bir düğüm var.
zh_hans: 标识约束“{0}”验证失败。缺少键或现有键具有空节点。
zh_hant: 身分識別條件約束 '{0}' 驗證已失敗。遺漏索引鍵或現有索引鍵中含有空的節點。

# Sch_MissingPublicSystemAttribute
source: NOTATION must have either the Public or System attribute present.
cs: Pro NOTATION musí existovat atribut Public nebo System.
de: Für NOTATION muss das Public- oder System-Attribut vorhanden sein.
es: NOTATION debe tener presente cualquier de los atributos Public o System.
fr: NOTATION doit comporter l'un des attributs Public ou System.
it: Per NOTATION deve essere presente un attributo Public o System.
ja: NOTATION には Public または System 属性のいずれかが必要です。
ko: NOTATION에는 Public 또는 System 특성 중 하나가 있어야 합니다.
pl: Element NOTATION musi mieć atrybut publiczny (Public) lub systemowy (System).
pt_br: O atributo Public ou System deve estar presente em NOTATION.
ru: NOTATION должен содержать атрибут Public или System.
tr: NOTATION içinde Public veya System özniteliği olmalı.
zh_hans: NOTATION 必须有一个 Public 或 System 特性。
zh_hant: NOTATION 必須有 Public 或 System 屬性。

# Sch_MixSchemaTypes
source: Different schema types cannot be mixed.
cs: Nelze směšovat různé typy schémat.
de: Verschiedene Schematypen dürfen nicht gemischt werden.
es: No se pueden mezclar diferentes tipos de esquema.
fr: Vous ne pouvez pas mélanger différents types de schéma.
it: Non è possibile combinare tipi di schema diversi.
ja: 異なるスキーマ型は混在できません。
ko: 서로 다른 스키마 형식은 혼합할 수 없습니다.
pl: Nie można łączyć różnych typów schematów.
pt_br: Diferentes tipos de esquema não podem ser misturados.
ru: Комбинировать различные типы схем запрещено.
tr: Farklı şema türleri karıştırılamaz.
zh_hans: 不能混合不同的架构类型。
zh_hant: 不同的結構描述類型不可混合。

# Sch_MixedMany
source: The order must be many when content is mixed.
cs: Je-li obsah smíšený, musí být order nastaveno na many.
de: Wenn Inhalt gemischt wird, muss die Reihenfolge "many" verwendet werden.
es: El orden debe ser igual a many (muchos) cuando el contenido es igual a mixed (mezclado).
fr: L'ordre doit être many quand le contenu est mixed.
it: Quando content è impostato su mixed, order deve essere many.
ja: コンテンツが 'mixed' のときは、order は 'many' でなければなりません。
ko: content가 mixed인 경우 Order는 many여야 합니다.
pl: Porządek musi być określony jako „many”, gdy zawartość jest mieszana.
pt_br: A ordem deverá ser many quando conteúdo for mixed.
ru: Для комбинированного содержимого должен назначаться порядок many.
tr: İçerik karışık olduğunda düzen many olmalıdır.
zh_hans: 当内容为混合类型时，顺序必须为 many。
zh_hant: 當內容是 mixed 時，順序必須是 many。

# Sch_MoreThanOneWildId
source: It is an error if more than one attribute whose type is xs:ID or is derived from xs:ID, matches an attribute wildcard on an element.
cs: Pokud více než jeden atribut s typem xs:ID nebo odvozený od typu xs:ID odpovídá zástupnému znaku atributu v elementu, jedná se o chybu.
de: Wenn mehrere Attribute, deren Typ "xs:ID" lautet oder von "xs:ID" abgeleitet wurde, mit einem Attributplatzhalter in einem Element übereinstimmen, tritt ein Fehler auf.
es: Es incorrecto que más de un atributo de tipo xs:ID, o derivado de xs:ID, coincida con un comodín de atributo en un elemento.
fr: Un ou plusieurs attributs dont le type est xs:ID ou est dérivé de xs:ID ne peuvent pas correspondre au caractère générique d'un attribut sur un élément.
it: Un carattere jolly di attributo in un elemento non può corrispondere a più di un attributo di tipo xs:ID o derivato da xs:ID.
ja: 型が xs:ID であるか、または xs:ID から派生している 1 つ以上の属性が要素上の属性のワイルドカードに一致する場合はエラーです。
ko: 형식이 xs:ID이거나 xs:ID에서 파생된 둘 이상의 특성이 한 요소에서 특성 와일드카드와 일치할 경우 오류가 발생합니다.
pl: Jeśli liczba atrybutów typu xs:ID lub typu pochodnego względem typu xs:ID, zgodnych z symbolem wieloznacznym atrybutu elementu, jest większa niż jeden, występuje błąd.
pt_br: Erro se mais de um atributo cujo tipo for xs:ID ou derivado de xs:ID corresponder a um curinga de atributo em um elemento.
ru: Является ошибкой, если несколько атрибутов с типом xs:ID или производным от xs:ID соответствует подстановочному знаку атрибута для элемента.
tr: Türü xs:ID olan veya xs:ID türünden türetilen birden çok özniteliğin öğedeki bir öznitelik joker parçacığıyla eşleşmesi hatadır.
zh_hans: 如果类型为 xs:ID 或从 xs:ID 派生的类型的多个特性与元素上的某个元素通配符匹配，则是错误的。
zh_hant: 若超過一個其類型為 xs:ID 的屬性或衍生自 xs:ID 的屬性，符合元素上的屬性萬用字元，即為錯誤。

# Sch_MultipleAttrGroupSelfRef
source: Multiple self-reference within an attribute group is redefined.
cs: Bylo předefinováno několik odkazů na sebe sama v rámci skupiny atributů.
de: Mehrere Eigenverweise bei der Neudefinition einer Attributgruppe.
es: Se han redefinido varias autorreferencias dentro de un grupo de atributos.
fr: Plusieurs autoréférences sont redéfinies dans un groupe d'attributs.
it: Sono stati ridefiniti più riferimenti interni all'interno di un gruppo di attributi.
ja: 属性グループの複数の自己参照が再定義されました。
ko: 특성 그룹에 자기 참조를 여러 번 다시 정의했습니다.
pl: Wielokrotne odwołanie do samego siebie w grupie atrybutów zostało przedefiniowane.
pt_br: Várias autorreferências em um grupo de atributos são redefinidas.
ru: Множественная рекурсивная ссылка в группе атрибутов переопределена.
tr: Öznitelik grubundaki birden çok kendine başvuru yeniden tanımlandı.
zh_hans: 特性组中的多个自引用被重定义。
zh_hant: 已重新定義屬性群組中的多項自我參考。

# Sch_MultipleGroupSelfRef
source: Multiple self-reference within a group is redefined.
cs: Bylo předefinováno několik odkazů na sebe sama v rámci skupiny.
de: Mehrere Eigenverweise bei der Neudefinition einer Gruppe.
es: Se han redefinido varias autorreferencias dentro de un grupo.
fr: Plusieurs autoréférences sont redéfinies dans un groupe.
it: Sono stati ridefiniti più riferimenti interni all'interno di un gruppo.
ja: グループの複数の自己参照が再定義されました。
ko: 그룹에 자기 참조를 여러 번 다시 정의했습니다.
pl: Wielokrotne odwołanie do samego siebie w grupie zostało przedefiniowane.
pt_br: Várias autorreferências em um grupo são redefinidas.
ru: Множественная рекурсивная ссылка в группе переопределена.
tr: Gruptaki birden çok kendine başvuru yeniden tanımlandı.
zh_hans: 组中的多个自引用被重定义。
zh_hant: 已重新定義群組中的多項自我參考。

# Sch_MultipleRedefine
source: Multiple redefines of the same schema will be ignored.
cs: Více předefinování stejného schématu bude ignorováno.
de: Mehrere Neudefinitionen desselben Schemas werden ignoriert.
es: Se omitirán redefiniciones múltiples del mismo esquema.
fr: Les redéfinitions multiples d'un même schéma sont ignorées.
it: Più ridefinizioni dello stesso schema verranno ignorate.
ja: 同じスキーマの複数の再定義は無視されます。
ko: 같은 스키마는 여러 번 다시 정의할 수 없습니다.
pl: Wiele ponownie zdefiniowanych wystąpień tego samego schematu zostanie zignorowanych.
pt_br: Várias redefinições do mesmo esquema serão ignoradas.
ru: Несколько переопределений одной и той же схемы будут проигнорированы.
tr: Aynı şemaya yönelik birden çok yeniden tanımlama yok sayılır.
zh_hans: 将忽略对同一架构的多次重定义。
zh_hant: 將會略過多次重新定義的相同結構描述。

# Sch_NeedSimpleTypeChild
source: Simple content restriction must have a simple type child if the content type of the base type is not a simple type definition.
cs: Pokud typ obsahu základního typu není definicí jednoduchého typu, musí omezení jednoduchého obsahu obsahovat podřízený element jednoduchého typu.
de: Die einfache Inhaltseinschränkung muss einen untergeordneten einfachen Typ haben, wenn der Inhaltstyp des Basistyps keine einfache Typdefinition ist.
es: La restricción de contenido simple debe tener un tipo secundario simple si el tipo de contenido del tipo base no es una definición de tipo simple.
fr: Une restriction de contenu simple doit avoir un enfant de type simple si le type de contenu du type de base n'est pas une définition de type simple.
it: Una restrizione di contenuto semplice deve includere un elemento figlio di tipo semplice, se il tipo di contenuto del tipo di base non è una definizione di tipo semplice.
ja: シンプル コンテンツ制限は、基本データ型のコンテンツ型が単純型の定義でない場合は、単純型の子を持たなければなりません。
ko: 기본 형식의 콘텐츠 형식이 단순 형식 정의가 아닌 경우 단순 콘텐츠 제한에 단순 형식 자식이 있어야 합니다.
pl: Proste ograniczenie zawartości musi mieć element podrzędny typu prostego, jeśli typ zawartości typu podstawowego nie jest definicją typu prostego.
pt_br: Restrição de conteúdo simples deverá ter um filho de tipo simples se o tipo de conteúdo do tipo base não for uma definição de tipo simples.
ru: Если тип содержимого базового типа не является определением простого типа, то ограничение простого содержимого должно содержать потомок простого типа.
tr: Temel türün içerik türü basit bir tür tanımı değilse, basit içerik kısıtlamasının basit türde bir alt öğesi olmalıdır.
zh_hans: 如果基类型的内容类型不是简单类型定义，则简单内容限制必须有简单类型子级。
zh_hant: 當基底類型的內容類型並非為簡單型別定義時，簡單內容限制必須要有簡單型別的子系。

# Sch_NoAttributeSchemaFound
source: Could not find schema information for the attribute '{0}'.
cs: Informace o schématu pro atribut {0} nebyly nalezeny.
de: Die Schemainformationen für das Attribut "{0}" wurden nicht gefunden.
es: No se puede encontrar la información de esquema para el atributo "{0}".
fr: Les informations de schéma sont introuvables pour l'attribut '{0}'.
it: Le informazioni dello schema per l'attributo '{0}' non sono state trovate.
ja: 属性 '{0}' のスキーマ情報が見つかりませんでした。
ko: '{0}' 특성에 대한 스키마 정보를 찾을 수 없습니다.
pl: Nie można odnaleźć informacji schematu dla atrybutu „{0}”.
pt_br: Não foi possível encontrar informações sobre o esquema para o atributo '{0}'.
ru: Не удалось найти информацию о схеме для атрибута "{0}".
tr: '{0}' özniteliğinin şema bilgileri bulunamadı.
zh_hans: 未能找到特性“{0}”的架构信息。
zh_hant: 找不到屬性 '{0}' 的結構描述資訊。

# Sch_NoDerivedAttribute
source: The base attribute '{0}' whose use = 'required' does not have a corresponding derived attribute while redefining attribute group '{1}'.
cs: Základní atribut {0}, jehož use = required, nemá během změny definice skupiny atributu {1} odpovídající odvozený atribut.
de: Das Basisattribut "{0}", für das "use = required" festgelegt ist, verfügt bei der Neudefinition der Attributgruppe "{1}" nicht über ein entsprechendes abgeleitetes Attribut.
es: El atributo base "{0}" cuyo uso = "required" no tiene un atributo derivado correspondiente al redefinir el grupo de atributos "{1}".
fr: L'attribut de base '{0}' dont l'utilisation est 'required' n'a pas d'attribut dérivé correspondant durant la redéfinition du groupe d'attributs '{1}'.
it: L'attributo di base '{0}', il cui uso è 'required', non contiene un attributo derivato corrispondente durante la ridefinizione del gruppo di attributi '{1}'.
ja: 属性グループ '{1}' が再定義されていますが、use = 'required' が設定されている基本型の属性 '{0}' に、対応する派生型の属性がありません。
ko: 특성 그룹 '{1}'을(를) 다시 정의하는 동안 use = 'required'인 기본 특성 '{0}'에 해당 파생 특성이 없습니다.
pl: Podczas ponownego definiowania grupy atrybutów „{1}” nie utworzono atrybutu pochodnego odpowiadającego atrybutowi podstawowemu „{0}”, którego użycie = „required”.
pt_br: O atributo base '{0}' cujo uso = 'required' não tem um atributo derivado correspondente ao redefinir o grupo de atributos '{1}'.
ru: Базовый атрибут "{0}" с use="required" не имеет соответствующего производного атрибута при переопределении группы атрибутов "{1}".
tr: Kullanımı 'required' olan '{0}' temel özniteliğinin, '{1}' öznitelik grubunu yeniden tanımlarken karşılık gelen bir türetilen özniteliği yok.
zh_hans: 在重新定义特性组“{1}”时，use = 'required' 的基本特性“{0}”没有相应的派生特性。
zh_hant: 重新定義屬性群組 '{1}' 時，其 use = 'required' 的 base 屬性 '{0}' 沒有相同的衍生屬性。

# Sch_NoElementSchemaFound
source: Could not find schema information for the element '{0}'.
cs: Informace o schématu pro element {0} nebyly nalezeny.
de: Die Schemainformationen für das Element "{0}" wurden nicht gefunden.
es: No se puede encontrar la información de esquema para el elemento "{0}".
fr: Les informations de schéma sont introuvables pour l'élément '{0}'.
it: Le informazioni dello schema per l'elemento '{0}' non sono state trovate.
ja: 要素 '{0}' のスキーマ情報が見つかりませんでした。
ko: '{0}' 요소에 대한 스키마 정보를 찾을 수 없습니다.
pl: Nie można odnaleźć informacji schematu dla elementu „{0}”.
pt_br: Não foi possível encontrar informações sobre o esquema para o elemento '{0}'.
ru: Не удалось найти информацию о схеме для элемента "{0}".
tr: '{0}' öğesinin şema bilgileri bulunamadı.
zh_hans: 未能找到元素“{0}”的架构信息。
zh_hant: 找不到元素 '{0}' 的結構描述資訊。

# Sch_NoExamplar
source: Reference to undeclared substitution group affiliation.
cs: Odkaz na nedeklarované přidružení skupiny nahrazení
de: Verweis auf eine nicht deklarierte Ersetzungsgruppenzuordnung.
es: Referencia a una afiliación de grupo de sustitución no declarada.
fr: Référence à une affiliation de groupe de substitution non déclarée.
it: Riferimento a un'affiliazione di gruppo di sostituzione non dichiarato.
ja: 未宣言の substitution group affiliation が参照されました。
ko: 선언되지 않은 대체 그룹 affiliation에 대한 참조입니다.
pl: Odwołanie do niezadeklarowanej przynależności grupy podstawienia.
pt_br: Referência à afiliação de grupo de substituição não declarada.
ru: Ссылка на назначение необъявленной группы подстановки.
tr: Bildirilmemiş değiştirme grubu ilişkisine başvuru.
zh_hans: 引用未声明的替换组从属。
zh_hant: 參考未宣告的替代群組關係。

# Sch_NoGroupParticle
source: 'sequence', 'choice', or 'all' child is required.
cs: Je požadován podřízený element sequence, choice nebo all.
de: Ein untergeordnetes Element "sequence", "choice" oder "all" ist erforderlich.
es: Se requiere el elemento secundario "sequence", "choice" o "all".
fr: Un enfant de 'sequence', 'choice' ou 'all' est obligatoire.
it: L'elemento figlio 'sequence', 'choice' o 'all' è obbligatorio.
ja: 子は、'sequence'、'choice'、または 'all' である必要があります。
ko: 'sequence', 'choice' 또는 'all' 자식이 필요합니다.
pl: Wymagany jest element podrzędny „sequence”, „choice” lub „all”.
pt_br: 'sequence', 'choice' ou 'all' filho é necessário.
ru: Требуется дочерний элемент sequence, choice или all.
tr: 'sequence', 'choice' veya 'all' alt öğesi gerekli.
zh_hans: 需要 "sequence"、"choice" 或 "all" 子级。
zh_hant: 需要 'sequence'、'choice' 或 'all' 的子系。

# Sch_NoRestOrExt
source: 'restriction' or 'extension' child is required for complexType with simpleContent or complexContent child.
cs: Pro vlastnost complexType s atributem simpleContent nebo complexContent musí být použit podřízený element restriction nebo extension.
de: Das untergeordnete Element "restriction" oder "extension" ist für complexType mit dem untergeordneten Element "simpleContent" oder "complexContent" erforderlich.
es: Se requiere el elemento secundario "restriction" o "extension" para complexType con el elemento secundario simpleContent o complexContent.
fr: L'enfant de 'restriction' ou 'extension' est obligatoire pour complexType avec l'enfant simpleContent ou complexContent.
it: È richiesto un elemento figlio 'restriction' o 'extension' per l'elemento complexType con l'elemento simpleContent o complexContent figlio.
ja: simpleContent または complexContent の子を持つ complexType には、'restriction' または 'extension' の子が必要です。
ko: simpleContent 또는 complexContent 자식이 있는 complexType에는 'restriction' 또는 'extension' 자식이 필요합니다.
pl: Dla typu complexType z podrzędnym elementem simpleContent lub complexContent wymagany jest podrzędny element „restriction” lub „extension”.
pt_br: 'restriction' ou 'extension' filho é exigido para complexType com simpleContent ou complexContent filho.
ru: Для complexType с потомком simpleContent или complexContent требуется потомок restriction или extension.
tr: simpleContent veya complexContent alt öğesi olan complexType için 'restriction' veya 'extension' alt öğesi gerekir.
zh_hans: 具有 simpleContent 或 complexContent 子级的 complexType 要求 "restriction" 或 "extension" 子级。
zh_hant: complexType 需要 'restriction' 或 'extension' 子系以用於 simpleContent 或 complexContent 子系。

# Sch_NoRestOrExtQName
source: 'restriction' or 'extension' child is required for complexType '{0}' in namespace '{1}', because it has a simpleContent or complexContent child.
cs: Pro vlastnost complexType {0} v oboru názvů {1} musí být použit podřízený element restriction nebo extension, protože má atribut simpleContent nebo complexContent.
de: Das untergeordnete Element "restriction" oder "extension" ist für complexType "{0}" im Namespace "{1}" erforderlich, da dieser ein untergeordnetes Element "simpleContent" oder "complexContent" aufweist.
es: Se requiere el elemento secundario "restriction" o "extension" para complexType "{0}" en espacio de nombres "{1}", tiene un elemento secundario simpleContent o complexContent.
fr: L'enfant de 'restriction' ou 'extension' est obligatoire pour complexType '{0}' dans l'espace de noms '{1}', car il a un enfant simpleContent ou complexContent.
it: È richiesto un elemento figlio 'restriction' or 'extension' per l'elemento complexType '{0}' nello spazio dei nomi '{1}' perché contiene un elemento simpleContent o complexContent figlio.
ja: simpleContent または complexContent の子を持つため、名前空間 '{1}' の complexType '{0}' には、'restriction' または 'extension' の子が必要です。
ko: 네임스페이스 '{1}'의 complexType '{0}'에는 simpleContent 또는 complexContent 자식이 있기 때문에 'restriction' 또는 'extension' 자식이 필요합니다.
pl: Element podrzędny „restriction” lub „extension” jest wymagany dla typu complexType „{0}” w przestrzeni nazw „{1}”, ponieważ ma element podrzędny simpleContent lub complexContent.
pt_br: O filho de 'restriction' ou de 'extension' é necessário para complexType '{0}' no namespace '{1}', pois ele tem um filho de simpleContent ou de complexContent.
ru: Для complexType "{0}" в пространстве имен "{1}" требуется потомок restriction или extension, поскольку он имеет потомка simpleContent или complexContent.
tr: '{1}' ad alanındaki '{0}' complexType için, simpleContent veya complexContent alt öğesine sahip olduğundan, 'restriction' veya 'extension' alt öğesi gerekir.
zh_hans: 命名空间“{1}”中的 complexType“{0}”包含 simpleContent 或 complexContent 子项，因此要求 "restriction" 或 "extension" 子级。
zh_hant: 因為命名空間 '{1}' 中的 complexType '{0}' 擁有 simpleContent 或 complexContent 子系，所以需要 'restriction' 或 'extension' 子系。

# Sch_NoSimpleTypeContent
source: SimpleType content is missing.
cs: Obsah SimpleType nebyl nalezen.
de: SimpleType-Inhalt fehlt.
es: Falta el contenido SimpleType.
fr: Le contenu de SimpleType est manquant.
it: Manca il contenuto di SimpleType.
ja: SimpleType の内容が見つかりません。
ko: SimpleType 콘텐츠가 없습니다.
pl: Brak zawartości SimpleType.
pt_br: Conteúdo de SimpleType inexistente.
ru: Отсутствует содержимое SimpleType.
tr: SimpleType içerik eksik.
zh_hans: 缺少 SimpleType 内容。
zh_hant: 遺漏 SimpleType 內容。
