Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xml_InvalidTextDecl
source: Invalid text declaration.
cs: Neplatná deklarace textu
de: Ungültige Textdeklaration.
es: Declaración de texto no válida.
fr: Déclaration de texte non valide.
it: La dichiarazione di testo non è valida.
ja: テキスト宣言が無効です。
ko: 텍스트 선언이 잘못되었습니다.
pl: Nieprawidłowa deklaracja tekstu.
pt_br: Declaração de texto inválida.
ru: Недопустимое объявление текста.
tr: Metin bildirimi geçersiz.
zh_hans: 无效的文本声明。
zh_hant: 文字宣告無效。

# Xml_InvalidVersionNumber
source: Version number '{0}' is invalid.
cs: Číslo verze {0} je neplatné.
de: Die Versionsnummer "{0}" ist ungültig.
es: El número de versión "{0}" no es válido.
fr: Le numéro de version '{0}' est non valide.
it: Il numero di versione '{0}' non è valido.
ja: バージョン番号 '{0}' は無効です。
ko: 버전 번호 '{0}'이(가) 잘못되었습니다.
pl: Numer wersji „{0}” jest nieprawidłowy.
pt_br: Número de versão '{0}' inválido.
ru: Недопустимый номер версии {0}.
tr: '{0}' sürüm numarası geçersiz.
zh_hans: 版本号“{0}”无效。
zh_hant: 版本號碼 '{0}' 無效。

# Xml_InvalidWhitespaceCharacter
source: The Whitespace or SignificantWhitespace node can contain only XML white space characters. '{0}' is not an XML white space character.
cs: Uzel Whitespace nebo SignificantWhitespace může obsahovat pouze prázdné znaky XML. {0} není prázdný znak XML.
de: Der Whitespace- oder SignificantWhitespace-Knoten darf nur XML-Leerraumzeichen enthalten. "{0}" ist kein XML-Leerraumzeichen.
es: El nodo Whitespace o SignificantWhitespace solo puede contener caracteres de espacios en blanco XML. "{0}" no es un carácter de espacio en blanco XML.
fr: Le nœud Whitespace ou SignificantWhitespace peut uniquement contenir des espaces blancs XML. '{0}' n'est pas un espace blanc XML.
it: Il nodo Whitespace o SignificantWhitespace può contenere solo spazi vuoti XML. '{0}' non è uno spazio vuoto XML.
ja: Whitespace または SignificantWhitespace ノードには、XML スペース文字しか設定できません。'{0}' は XML スペース文字ではありません。
ko: Whitespace 또는 SignificantWhitespace 노드에는 XML 공백 문자만 포함될 수 있습니다. '{0}'은(는) XML 공백 문자가 아닙니다.
pl: Węzeł typu Whitespace lub typu SignificantWhitespace może zawierać tylko białe znaki XML. „{0}” nie jest białym znakiem XML.
pt_br: O nó Whitespace ou SignificantWhitespace só pode conter caracteres de espaço em branco XML. '{0}' não é um caractere de espaço em branco XML.
ru: Узел Whitespace или SignificantWhitespace может содержать только символы пробела XML. "{0}" не является символом пробела XML.
tr: Whitespace veya SignificantWhitespace düğümü yalnızca XML boşluk karakterleri içerebilir. '{0}', XML boşluk karakteri değil.
zh_hans: Whitespace 或 SignificantWhitespace 节点只能包含 XML 空格字符。“{0}”不是 XML 空格字符。
zh_hant: Whitespace 或 SignificantWhitespace 節點僅可包含 XML 空白字元。'{0}' 不是 XML 空白字元。

# Xml_InvalidXmlDecl
source: Syntax for an XML declaration is invalid.
cs: Syntaxe pro deklaraci XML je neplatná.
de: Die Syntax für eine XML-Deklaration ist ungültig.
es: Sintaxis para una declaración XML no válida.
fr: Syntaxe non valide pour une déclaration XML.
it: La sintassi per una dichiarazione XML non è valida.
ja: XML 宣言の構文が無効です。
ko: XML 선언 구문이 잘못되었습니다.
pl: Składnia deklaracji XML jest nieprawidłowa.
pt_br: Sintaxe de uma declaração XML inválida.
ru: Недопустимый синтаксис объявления XML.
tr: Bir XML bildiriminin sözdizimi geçersiz.
zh_hans: XML 声明的语法无效。
zh_hant: XML 宣告的語法無效。

# Xml_InvalidXmlDocument
source: Invalid XML document. {0}
cs: Dokument XML je neplatný. {0}
de: Ungültiges XML-Dokument. {0}
es: Documento XML no válido. {0}
fr: Document XML non valide. {0}
it: Documento XML non valido. {0}
ja: XML ドキュメントが無効です。{0}
ko: XML 문서가 잘못되었습니다. {0}
pl: Nieprawidłowy dokument XML. {0}
pt_br: Documento XML inválido, {0}
ru: Недопустимый XML-документ. {0}
tr: Geçersiz XML belgesi. {0}
zh_hans: XML 文档无效。{0}
zh_hant: XML 文件無效。{0}

# Xml_InvalidXmlSpace
source: '{0}' is an invalid xml:space value.
cs: {0} je neplatná hodnota xml:space.
de: "{0}" ist ein ungültiger xml:space-Wert.
es: "{0}" es un valor xml:space no válido.
fr: '{0}' est une valeur xml:space non valide.
it: '{0}' è un valore xml:space non valido.
ja: '{0}' は無効な xml:space 値です。
ko: '{0}'은(는) 잘못된 xml:space 값입니다.
pl: Element „{0}” jest nieprawidłową wartością xml:space.
pt_br: '{0}' é um valor xml:space inválido.
ru: "{0}" является недопустимым значением xml:space.
tr: '{0}', geçersiz bir xml:space değeri.
zh_hans: “{0}”是无效的 xml:space 值。
zh_hant: '{0}' 是無效的 xml:space 值。

# Xml_LimitExceeded
source: The input document has exceeded a limit set by {0}.
cs: Vstupní dokument překročil nastavený limit o {0}.
de: Das Eingabedokument hat einen von {0} festgelegten Grenzwert überschritten.
es: El documento de entrada ha superado un límite establecido por {0}.
fr: Le document d'entrée a dépassé une limite définie par {0}.
it: Il documento di input ha superato un limite impostato da {0}.
ja: 入力ドキュメントが、{0} で設定された上限を超えました。
ko: 입력 문서가 {0}(으)로 설정된 한계를 초과했습니다.
pl: Dokument wejściowy przekroczył limit wyznaczony przez element {0}.
pt_br: O documento de entrada excedeu um limite definido por {0}.
ru: Входящий документ превысил ограничение, установленное {0}.
tr: Giriş belgesi, {0} tarafından ayarlanan sınırı aştı.
zh_hans: 输入文档超出了 {0} 设置的限制。
zh_hant: 輸入文件超過 {0} 設定的限制。

# Xml_MessageWithErrorPosition
source: {0} Line {1}, position {2}.
cs: {0} řádek {1}, pozice {2}
de: {0} Zeile {1}, Position {2}.
es: {0} línea {1}, posición {2}.
fr: {0} ligne {1}, position {2}.
it: {0} Riga {1}, posizione {2}.
ja: {0} 行 {1}、場所 {2}。
ko: {0} 줄 {1}, 위치 {2}.
pl: {0}: wiersz {1}, pozycja {2}.
pt_br: {0} Linha {1}, posição {2}.
ru: {0} Строка {1}, позиция {2}.
tr: {0} Satır {1}, konum {2}.
zh_hans: {0} 行 {1}，位置 {2}。
zh_hant: {0} 行 {1}，位置 {2}。

# Xml_MissingByteOrderMark
source: There is no Unicode byte order mark. Cannot switch to Unicode.
cs: Neexistuje žádná značka pro pořadí bajtů kódování Unicode. Nelze přepnout na kódování Unicode.
de: Es ist keine Unicode-Bytereihenfolgemarkierung vorhanden. Es kann nicht zu Unicode gewechselt werden.
es: No hay marca de orden de bytes Unicode. No se puede cambiar a Unicode.
fr: Marque d'ordre d'octet Unicode manquante. Impossible de passer à Unicode.
it: Non ci sono byte order mark Unicode. Non è possibile passare a Unicode.
ja: Unicode バイト順マークがないため、Unicode に切り替えられません。
ko: 유니코드 바이트 순서 표시가 없습니다. 유니코드로 전환할 수 없습니다.
pl: Brak znacznika kolejności bajtów Unicode. Nie można przełączyć na kod Unicode.
pt_br: Não há uma marca de ordem de byte Unicode. Não é possível mudar para Unicode.
ru: Отсутствует метка порядка байт в Юникоде. Переход в Юникод невозможен.
tr: Unicode bayt düzeni işareti yok. Unicode'a geçiş yapılamaz.
zh_hans: 没有 Unicode 字节顺序标记。不能切换到 Unicode。
zh_hant: 沒有 Unicode 位元順序標記。無法切換至 Unicode。

# Xml_MissingRoot
source: Root element is missing.
cs: Chybí kořenový element.
de: Das Stammelement fehlt.
es: Falta el elemento raíz.
fr: Élément racine manquant.
it: Manca l'elemento radice.
ja: ルート要素が見つかりません。
ko: 루트 요소가 없습니다.
pl: Brak elementu głównego.
pt_br: Elemento raiz inexistente.
ru: Отсутствует корневой элемент.
tr: Kök öğesi eksik.
zh_hans: 缺少根元素。
zh_hant: 遺漏根項目。

# Xml_MixedReadElementContentAs
source: ReadElementContentAs() methods cannot be called on an element that has child elements.
cs: Metody ReadElementContentAs() nelze volat u elementů s podřízenými elementy.
de: Die ReadElementContentAs()-Methoden können nicht für ein Element mit untergeordneten Elementen aufgerufen werden.
es: No se puede llamar a los métodos ReadElementContentAs() en un elemento que contiene elementos secundarios.
fr: Les méthodes ReadElementContentAs() ne peuvent pas être appelées sur un élément qui est un des éléments enfants.
it: I metodi ReadElementContentAs() non possono essere chiamati su un elemento con elementi figlio.
ja: 子要素を持つ要素では、ReadElementContentAs() メソッドを呼び出すことはできません。
ko: ReadElementContentAs() 메서드는 자식 요소가 있는 요소에서 호출할 수 없습니다.
pl: W przypadku elementu, który ma elementy podrzędne, nie można wywoływać metod typu ReadElementContentAs().
pt_br: Os métodos ReadElementContentAs() não podem ser chamados em um elemento que tenha elementos filho.
ru: Невозможно вызвать метод ReadElementContentAs() для элемента, имеющего дочерние элементы.
tr: Alt öğeleri olan bir öğede ReadElementContentAs() metotları çağrılamaz.
zh_hans: 不能在包含子元素的元素上调用 ReadElementContentAs() 方法。
zh_hant: 無法在有子項目的元素上呼叫 ReadElementContentAs()。

# Xml_MixingBinaryContentMethods
source: ReadContentAsBase64 and ReadContentAsBinHex method calls cannot be mixed with calls to ReadElementContentAsBase64 and ReadElementContentAsBinHex.
cs: Volání metod ReadContentAsBase64 a ReadContentAsBinHex nelze směšovat s voláními metod ReadElementContentAsBase64 a ReadElementContentAsBinHex.
de: Die ReadContentAsBase64- und ReadContentAsBinHex-Methodenaufrufe können nicht mit Aufrufen von ReadElementContentAsBase64 und ReadElementContentAsBinHex kombiniert werden.
es: Las llamadas de los métodos ReadContentAsBase64 y ReadContentAsBinHex no se pueden mezclar con las llamadas a ReadElementContentAsBase64 y ReadElementContentAsBinHex.
fr: Impossible de mélanger les appels de méthodes ReadContentAsBase64 et ReadContentAsBinHex avec l'appel de ReadElementContentAsBase64 et de ReadElementContentAsBinHex.
it: Non è possibile combinare le chiamate ai metodi ReadContentAsBase64 e ReadContentAsBinHex con chiamate a ReadElementContentAsBase64 e ReadElementContentAsBinHex.
ja: ReadContentAsBase64 メソッドおよび ReadContentAsBinHex メソッドの呼び出しと、ReadElementContentAsBase64 および ReadElementContentAsBinHex の呼び出しを混在させることはできません。
ko: ReadContentAsBase64 및 ReadContentAsBinHex 메서드는 ReadElementContentAsBase64 및 ReadElementContentAsBinHex와 함께 호출할 수 없습니다.
pl: Wywołań metod ReadContentAsBase64 i ReadContentAsBinHex nie można łączyć z wywołaniami metod ReadElementContentAsBase64 i ReadElementContentAsBinHex.
pt_br: Chamadas de método ReadContentAsBase64 e ReadContentAsBinHex não podem ser misturadas a chamadas para ReadElementContentAsBase64 e ReadElementContentAsBinHex.
ru: Вызовы методов ReadContentAsBase64 и ReadContentAsBinHex нельзя комбинировать с вызовами методов ReadElementContentAsBase64 и ReadElementContentAsBinHex.
tr: ReadContentAsBase64 ve ReadContentAsBinHex metodu çağrıları, ReadElementContentAsBase64 ve ReadElementContentAsBinHex çağrılarıyla birlikte kullanılamaz.
zh_hans: ReadContentAsBase64 和 ReadContentAsBinHex 方法调用不能与 ReadElementContentAsBase64 和 ReadElementContentAsBinHex 调用混在一起。
zh_hant: ReadContentAsBase64 與 ReadContentAsBinHex 方法呼叫，無法與 ReadElementContentAsBase64 和 ReadElementContentAsBinHex 呼叫結合。

# Xml_MixingReadValueChunkWithBinary
source: ReadValueChunk calls cannot be mixed with ReadContentAsBase64 or ReadContentAsBinHex.
cs: Volání metody ReadValueChunk nelze směšovat s metodou ReadContentAsBase64 nebo ReadContentAsBinHex.
de: ReadValueChunk-Aufrufe können nicht mit ReadContentAsBase64 oder ReadContentAsBinHex kombiniert werden.
es: Las llamadas ReadValueChunk no se pueden mezclar con ReadContentAsBase64 o ReadContentAsBinHex.
fr: Les appels de ReadValueChunk ne peuvent pas être utilisés avec ReadContentAsBase64 ou ReadContentAsBinHex.
it: Non è possibile combinare le chiamate a ReadValueChunk con chiamate a ReadContentAsBase64 o ReadContentAsBinHex.
ja: ReadValueChunk 呼び出しと、ReadContentAsBase64 または ReadContentAsBinHex を混在させることはできません。
ko: ReadValueChunk는 ReadContentAsBase64 또는 ReadContentAsBinHex와 함께 호출할 수 없습니다.
pl: Wywołań metody ReadValueChunk nie można łączyć z wywołaniami metod ReadContentAsBase64 ani ReadContentAsBinHex.
pt_br: Chamadas ReadValueChunk não podem ser misturadas a ReadContentAsBase64 ou ReadContentAsBinHex.
ru: Вызов ReadValueChunk нельзя комбинировать с вызовом метода ReadContentAsBase64 или ReadContentAsBinHex.
tr: ReadValueChunk çağrıları ReadContentAsBase64 veya ReadContentAsBinHex ile birlikte kullanılamaz.
zh_hans: ReadValueChunk 调用不能与 ReadContentAsBase64 或 ReadContentAsBinHex 混在一起。
zh_hant: ReadValueChunk 呼叫無法與 ReadContentAsBase64 或 ReadContentAsBinHex 混合。

# Xml_MixingV1StreamingWithV2Binary
source: ReadContentAsBase64 and ReadContentAsBinHex method calls cannot be mixed with calls to ReadChars, ReadBase64, and ReadBinHex.
cs: Volání metod ReadContentAsBase64 a ReadContentAsBinHex nelze směšovat s voláními metod ReadChars, ReadBase64 a ReadBinHex.
de: ReadContentAsBase64- und ReadContentAsBinHex-Methodenaufrufe können nicht mit Aufrufen von ReadChars, ReadBase64 und ReadBinHex kombiniert werden.
es: Las llamadas de los métodos ReadContentAsBase64 y ReadContentAsBinHex no se pueden mezclar con las llamadas a ReadChars, ReadBase64 y ReadBinHex.
fr: Impossible de mélanger les appels de méthodes ReadContentAsBase64 et ReadContentAsBinHex avec l'appel de ReadChars, de ReadBase64 et de ReadBinHex.
it: Non è possibile combinare le chiamate ai metodi ReadContentAsBase64 e ReadContentAsBinHex con chiamate a ReadChars, ReadBase64 e ReadBinHex.
ja: ReadContentAsBase64 メソッドおよび ReadContentAsBinHex メソッドの呼び出しと、ReadChars、ReadBase64 および ReadBinHex の呼び出しを混在させることはできません。
ko: ReadContentAsBase64 및 ReadContentAsBinHex 메서드는 ReadChars, ReadBase64 및 ReadBinHex와 함께 호출할 수 없습니다.
pl: Wywołań metod ReadContentAsBase64 i ReadContentAsBinHex nie można łączyć z wywołaniami dotyczącymi metod ReadChars, ReadBase64 i ReadBinHex.
pt_br: Chamadas de método ReadContentAsBase64 e ReadContentAsBinHex não podem ser misturadas a chamadas para ReadChars, ReadBase64 e ReadBinHex.
ru: Вызовы методов ReadContentAsBase64 и ReadContentAsBinHex нельзя комбинировать с вызовами методов ReadChars, ReadBase64 и ReadBinHex.
tr: ReadContentAsBase64 ve ReadContentAsBinHex metodu çağrıları ReadChars, ReadBase64 ve ReadBinHex çağrıları ile birlikte kullanılamaz.
zh_hans: ReadContentAsBase64 和 ReadContentAsBinHex 方法调用不能与 ReadChars、ReadBase64 和 ReadBinHex 调用混在一起。
zh_hant: ReadContentAsBase64 與 ReadContentAsBinHex 方法呼叫，無法與 ReadChars、ReadBase64 和 ReadBinHex 呼叫相結合。

# Xml_MultipleDTDsProvided
source: Cannot have multiple DTDs.
cs: Nelze použít více definic DTD.
de: Mehrere DTDs sind unzulässig.
es: No puede tener varias DTD.
fr: Impossible d'avoir plusieurs DTD.
it: Non possono esistere più DTD.
ja: 複数の DTD を指定することはできません。
ko: DTD를 여러 개 포함할 수 없습니다.
pl: Nie może być wielu elementów DTD.
pt_br: Não é possível ter vários DTDs.
ru: Существование нескольких DTD невозможно.
tr: Birden çok DTD bulunamaz.
zh_hans: 不能有多个 DTD。
zh_hant: 無法擁有多個 DTD。

# Xml_MultipleRoots
source: There are multiple root elements.
cs: Existuje několik kořenových elementů.
de: Es sind mehrere Stammelemente vorhanden.
es: Hay varios elementos raíz.
fr: Il existe plusieurs éléments racines.
it: Sono presenti più elementi radice.
ja: ルート要素が複数あります。
ko: 루트 요소가 여러 개 있습니다.
pl: Istnieje wiele elementów głównych.
pt_br: Há vários elementos raiz.
ru: Имеется несколько корневых элементов.
tr: Birden çok kök öğesi var.
zh_hans: 有多个根元素。
zh_hant: 有多個根項目。

# Xml_MultipleValidaitonTypes
source: Unsupported combination of validation types.
cs: Nepodporovaná kombinace ověřovacích typů
de: Nicht unterstützte Kombination von Validierungstypen.
es: Combinación de tipos de validación no compatible.
fr: Combinaison de types de validation non prise en charge.
it: La combinazione di tipi di convalida non è supportata.
ja: サポートされない評価型の組み合わせです。
ko: 지원되지 않는 유효성 검사 형식 조합입니다.
pl: Nieobsługiwana kombinacja typów weryfikacji.
pt_br: Combinação sem suporte de tipos de validação.
ru: Неподдерживаемое сочетание типов проверки.
tr: Doğrulama türlerinin desteklenmeyen birleşimi.
zh_hans: 不受支持的验证类型组合。
zh_hant: 不支援的驗證類型組合。

# Xml_NamespaceDeclXmlXmlns
source: Prefix '{0}' cannot be mapped to namespace name reserved for "xml" or "xmlns".
cs: Předpona {0} nemůže být mapována na název oboru názvů vyhrazený pro hodnoty xml nebo xmlns.
de: Das Präfix "{0}" kann keinem Namespacenamen zugeordnet werden, der für "xml" oder "xmlns" reserviert ist.
es: No se puede asignar el prefijo "{0}" a un nombre de espacio de nombres reservado para "xml" o "xmlns".
fr: Le préfixe '{0}' ne peut pas être mappé au nom d'espace de noms réservé à "xml" ou "xmlns".
it: Non è possibile eseguire il mapping del prefisso '{0}' al nome dello spazio dei nomi riservato per "xml" o "xmlns".
ja: "xml" または "xmlns" 用に保存されている名前空間には、プレフィックス '{0}' をマップできません。
ko: 접두사 '{0}'은(는) "xml" 또는 "xmlns"에서 사용하도록 예약된 네임스페이스 이름으로 매핑할 수 없습니다.
pl: Nie można zamapować prefiksu „{0}” na nazwę przestrzeni nazw, która została zarezerwowana dla „xml” lub „xmlns”.
pt_br: Não é possível mapear o prefixo '{0}' para o nome de namespace reservado para "xml" ou "xmlns".
ru: Префикс "{0}" не может быть сопоставлен имени пространства имен, зарезервированному для xml или xmlns.
tr: '{0}' öneki, "xml" veya "xmlns" için ayrılan ad alanı adına eşlenemez.
zh_hans: 无法将前缀“{0}”映射到为 "xml" 或 "xmlns" 保留的命名空间名称。
zh_hant: 前置詞 '{0}' 無法對應到保留給 "xml" 或 "xmlns" 的命名空間名稱。

# Xml_NametableMismatch
source: XmlReaderSettings.XmlNameTable must be the same name table as in XmlParserContext.NameTable or XmlParserContext.NamespaceManager.NameTable, or it must be null.
cs: XmlReaderSettings.XmlNameTable musí být tabulka se stejným názvem jako v XmlParserContext.NameTable nebo XmlParserContext.NamespaceManager.NameTable nebo musí být null.
de: XmlReaderSettings.XmlNameTable muss der Namenstabelle in XmlParserContext.NameTable oder XmlParserContext.NamespaceManager.NameTable entsprechen oder NULL sein.
es: XmlReaderSettings.XmlNameTable debe ser la misma tabla de nombres que en XmlParserContext.NameTable o XmlParserContext.NamespaceManager.NameTable o ser nulo.
fr: XmlReaderSettings.XmlNameTable doit avoir le même nom de table que XmlParserContext.NameTable ou XmlParserContext.NamespaceManager.NameTable, ou doit avoir une valeur null.
it: Il valore di XmlReaderSettings.XmlNameTable deve essere uguale alla tabella dei nomi in XmlParserContext.NameTable o in XmlParserContext.NamespaceManager.NameTable oppure deve essere Null.
ja: XmlReaderSettings.XmlNameTable は、XmlParserContext.NameTable または XmlParserContext.NamespaceManager.NameTable の名前テーブルと同じであるか、null である必要があります。
ko: XmlReaderSettings.XmlNameTable은 XmlParserContext.NameTable 또는 XmlParserContext.NamespaceManager.NameTable의 이름 테이블과 같거나 Null이어야 합니다.
pl: Tabela XmlReaderSettings.XmlNameTable musi być taką samą tabelą nazw jak tabele XmlParserContext.NameTable i XmlParserContext.NamespaceManager.NameTable lub musi być równa null.
pt_br: XmlReaderSettings.XmlNameTable deve ser igual à tabela de nomes encontrada em XmlParserContext.NameTable ou em XmlParserContext.NamespaceManager.NameTable ou deve ser nulo.
ru: XmlReaderSettings.XmlNameTable должен иметь то же имя таблицы, что и в XmlParserContext.NameTable или XmlParserContext.NamespaceManager.NameTable, либо быть неопределенным.
tr: XmlReaderSettings.XmlNameTable, XmlParserContext.NameTable veya XmlParserContext.NamespaceManager.NameTable içindeki ad tablosuyla aynı olmalı veya null olmalı.
zh_hans: XmlReaderSettings.XmlNameTable 必须与 XmlParserContext.NameTable 或 XmlParserContext.NamespaceManager.NameTable 中的名称表相同，否则必须为空。
zh_hant: XmlReaderSettings.XmlNameTable 必須與 XmlParserContext.NameTable 或 XmlParserContext.NamespaceManager.NameTable 中的資料表相同，或必須為空值。

# Xml_NoDTDPresent
source: No DTD found.
cs: Nenašla se žádná definice DTD.
de: Es wurde keine DTD gefunden.
es: No se puede encontrar DTD.
fr: DTD introuvable.
it: Non sono stati trovati DTD.
ja: DTD が見つかりませんでした。
ko: DTD를 찾을 수 없습니다.
pl: Nie odnaleziono elementu DTD.
pt_br: Não foi encontrado nenhum DTD.
ru: Содержимое DTD не найдено.
tr: Hiç DTD bulunamadı.
zh_hans: 找不到 DTD。
zh_hant: 找不到 DTD。

# Xml_NoMultipleRoots
source: Document cannot have multiple document elements.
cs: Dokument nemůže mít více elementů document.
de: Das Dokument darf nicht mehrere Dokumentelemente enthalten.
es: El documento no puede tener varios elementos de documento.
fr: Ce document ne peut pas comporter plusieurs éléments de document.
it: Il documento non può contenere vere più elementi del documento.
ja: ドキュメントに、複数のドキュメント要素を含めることはできません。
ko: 문서에 여러 문서 요소를 지정할 수 없습니다.
pl: Dokument nie może zawierać wielu elementów dokumentu.
pt_br: O documento não pode ter vários elementos de documento.
ru: Документ не может иметь несколько элементов документа.
tr: Belgenin birden çok belge öğesi olamaz.
zh_hans: 文档不能包含多个文档元素。
zh_hant: 此文件沒有多種文件元素。

# Xml_NoNamespaces
source: Cannot set the namespace if Namespaces is 'false'.
cs: Pokud má atribut Namespaces hodnotu false, obor názvů nelze nastavit.
de: Der Namespace kann nicht festgelegt werden, wenn Namespaces "false" ist.
es: No se puede establecer el espacio de nombres si Namespaces es igual a "false".
fr: Impossible de définir l'espace de noms si Namespaces a la valeur 'false'.
it: Non è possibile impostare lo spazio dei nomi se il valore di Namespaces è 'false'.
ja: Namespaces が 'false' に設定されているときは名前空間を設定できません。
ko: Namespaces가 'false'인 경우 네임스페이스를 설정할 수 없습니다.
pl: Nie można ustawić przestrzeni nazw, jeśli element Namespaces ma wartość „false”.
pt_br: Não será possível definir o namespace se Namespaces for 'false'.
ru: Невозможно задать пространство имен, если Namespaces имеет значение false (ложь).
tr: Namespaces 'false' olduğunda ad alanı ayarlanamaz.
zh_hans: 如果 Namespaces 为 "false"，则不能设置命名空间。
zh_hant: 若 Namespaces 為 'false'，即無法設定命名空間。

# Xml_NoRoot
source: Document does not have a root element.
cs: Dokument neobsahuje kořenový element.
de: Das Dokument enthält kein Stammelement.
es: El documento no tiene un elemento raíz.
fr: Ce document n'a pas d'élément racine.
it: Il documento non contiene un elemento radice.
ja: ドキュメントにルート要素がありません。
ko: 문서에 루트 요소가 없습니다.
pl: Dokument nie ma elementu głównego.
pt_br: O documento não tem elemento raiz.
ru: Документ не содержит корневой элемент.
tr: Belgenin kök öğesi yok.
zh_hans: 文档没有根元素。
zh_hant: 這份文件沒有根項目。

# Xml_NoStartTag
source: There was no XML start tag open.
cs: Nebyla otevřena žádná úvodní značka XML.
de: Es war kein XML-Starttag geöffnet.
es: No hay ninguna etiqueta de apertura XML abierta.
fr: Aucune balise XML de début ouverte.
it: Non ci sono tag di inizio XML aperti.
ja: 開いている XML 開始タグはありません。
ko: 열려 있는 XML 시작 태그가 없습니다.
pl: Brak otwartego początkowego tagu XML.
pt_br: Nenhuma marca de início de XML aberta.
ru: Отсутствует открытый начальный тег XML.
tr: XML başlangıç etiketi açılışı yoktu.
zh_hans: 没有打开的 XML 开始标记。
zh_hant: 沒有開啟的 XML 開始標記。

# Xml_NoValidation
source: No validation occurred.
cs: Nedošlo k žádnému ověřování.
de: Es wurde keine Validierung durchgeführt.
es: No se produjo ninguna validación.
fr: Aucune validation n'a eu lieu.
it: Non è stata eseguita alcuna convalida.
ja: 検証が実行されませんでした。
ko: 유효성 검사가 수행되지 않았습니다.
pl: Nie przeprowadzono weryfikacji.
pt_br: Não ocorreu nenhuma validação.
ru: Проверка не выполнена.
tr: Doğrulama gerçekleşmedi.
zh_hans: 未进行任何验证。
zh_hant: 未執行任何驗證。

# Xml_NonWhitespace
source: Only white space characters should be used.
cs: Měly by být použity pouze prázdné znaky.
de: Es sollten nur Leerraumzeichen verwendet werden.
es: Solo puede utilizar caracteres de espacios en blanco.
fr: Seuls des espaces blancs doivent être utilisés.
it: Sono consentiti solo spazi vuoti.
ja: 使用できるのはスペース文字のみです。
ko: 공백 문자만 사용해야 합니다.
pl: Należy używać tylko białych znaków.
pt_br: Só podem ser usados caracteres de espaço em branco.
ru: Можно использовать только пробелы.
tr: Yalnızca başlık karakterleri kullanılmalı.
zh_hans: 只能使用空格字符。
zh_hant: 只可使用空格字元。
