Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/Microsoft.Xml/xlf/ResXml.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# Xdom_Node_Insert_Location
source: Cannot insert the node in the specified location.
cs: Na zadané umístění nelze uzel vložit.
de: Der Knoten kann nicht am angegebenen Ort eingefügt werden.
es: No se puede insertar el nodo en la ubicación especificada.
fr: Impossible d'insérer le nœud à l'emplacement spécifié.
it: Non è possibile inserire il nodo nella posizione specificata.
ja: 指定された場所にノードを挿入できません。
ko: 지정한 위치에 노드를 삽입할 수 없습니다.
pl: Nie można wstawić węzła w określonej lokalizacji.
pt_br: Não é possível inserir o nó no local especificado.
ru: Невозможно вставить узел в указанную позицию.
tr: Düğüm belirtilen konumda araya eklenemez.
zh_hans: 不能在指定的位置插入节点。
zh_hant: 無法將節點插入指定的位置。

# Xdom_Node_Insert_Path
source: The reference node is not a child of this node.
cs: Referenční uzel není podřízeným uzlem tohoto uzlu.
de: Der Verweisknoten ist diesem Knoten nicht untergeordnet.
es: El nodo de referencia no es un nodo secundario de este nodo.
fr: Le nœud de référence n'est pas un enfant de ce nœud.
it: Il nodo dei riferimenti non è figlio di questo nodo.
ja: 参照ノードはこのノードの子ではありません。
ko: 참조 노드는 이 노드의 자식이 아닙니다.
pl: Węzeł odwołania nie jest elementem podrzędnym tego węzła.
pt_br: O nó de referência não é um filho deste nó.
ru: Узел ссылки не является дочерним по отношению к этому узлу.
tr: Başvuru düğümü bu düğümün alt düğümü değil.
zh_hans: 引用节点不是此节点的子级。
zh_hant: 參考節點不是這個節點的子系。

# Xdom_Node_Insert_TypeConflict
source: The specified node cannot be inserted as the valid child of this node, because the specified node is the wrong type.
cs: Zadaný uzel nelze vložit jako platný podřízený uzel tohoto uzlu, protože je nesprávného typu.
de: Der angegebene Knoten kann nicht als gültiges untergeordnetes Element dieses Knotens eingefügt werden, da der angegebene Knoten den falschen Typ hat.
es: No se puede insertar el nodo especificado como elemento secundario válido de este nodo, porque el nodo especificado es incorrecto.
fr: Impossible d'insérer le nœud spécifié en tant qu'enfant valide de ce nœud, car le type du nœud spécifié est incorrect.
it: Non è possibile inserire il nodo specificato come figlio valido di questo nodo perché il tipo non è corretto.
ja: 指定したノードをこのノードの有効な子ノードとして挿入できません。指定されたノードの種類が正しくありません。
ko: 지정한 노드는 형식이 잘못되었으므로 이 노드의 유효한 자식으로 삽입할 수 없습니다.
pl: Określony węzeł nie może być wstawiony jako prawidłowy element podrzędny tego węzła, ponieważ określony węzeł jest niewłaściwego typu.
pt_br: O nó especificado não pode ser inserido como filho válido deste nó porque o nó especificado tem tipo errado.
ru: Невозможно вставить указанный узел в качестве действительного дочернего узла этого узла, так как указанный узел имеет неверный тип.
tr: Belirtilen düğümün türü yanlış olduğundan bu düğümün alt düğümü olarak eklenemez.
zh_hans: 指定的节点不能作为此节点的有效子级插入，因为指定节点的类型错误。
zh_hant: 無法將指定的節點插入為這個節點的有效子系，因為指定的節點是錯誤的類型。

# Xdom_Node_Modify_ReadOnly
source: This node is read-only. It cannot be modified.
cs: Tento uzel je jen pro čtení. Nelze jej změnit.
de: Dieser Knoten ist schreibgeschützt und kann nicht geändert werden.
es: Este nodo es de solo lectura y no se puede modificar.
fr: Ce nœud est en lecture seule. Impossible de le modifier.
it: Questo nodo è di sola lettura e non è possibile modificarlo.
ja: このノードは読み取り専用です。変更できません。
ko: 이 노드는 읽기 전용이므로 수정할 수 없습니다.
pl: Ten węzeł jest tylko do odczytu. Nie może być modyfikowany.
pt_br: Nó somente leitura. Não é possível modificá-lo.
ru: Этот узел доступен только для чтения. Он не может быть изменен.
tr: Bu düğüm salt okunur. Değiştirilemez.
zh_hans: 此节点是只读的。不能进行修改。
zh_hant: 這個節點是唯讀。無法修改。

# Xdom_Node_Null_Doc
source: Cannot create a node without an owner document.
cs: Nelze vytvořit uzel bez dokumentu vlastníka.
de: Ein Knoten kann nicht ohne Besitzerdokument erstellt werden.
es: No se puede crear un nodo sin un documento de propietario.
fr: Impossible de créer un nœud sans un document propriétaire.
it: Non è possibile creare un nodo senza un documento proprietario.
ja: オーナー ドキュメントなしのノードを作成することはできません。
ko: 소유자 문서가 없는 노드를 만들 수 없습니다.
pl: Nie można utworzyć węzła bez dokumentu właściciela.
pt_br: Não é possível criar um nó sem um documento proprietário.
ru: Невозможно создать узел без документа, которому он принадлежит.
tr: Sahibi olan bir belge olmadan düğüm oluşturulamaz.
zh_hans: 没有所有者文档就无法创建节点。
zh_hant: 沒有擁有者文件，無法建立節點。

# Xdom_Node_Remove_Child
source: The node to be removed is not a child of this node.
cs: Uzel, který má být odebrán, není podřízeným uzlem tohoto uzlu.
de: Der zu entfernende Knoten ist diesem Knoten nicht untergeordnet.
es: El nodo que desea eliminar no es un nodo secundario de este nodo.
fr: Le nœud à supprimer n'est pas un enfant de ce nœud.
it: Il nodo da rimuovere non è figlio di questo nodo.
ja: 削除するノードはこのノードの子ではありません。
ko: 제거할 노드가 이 노드의 자식이 아닙니다.
pl: Węzeł, który ma zostać usunięty, nie jest elementem podrzędnym tego węzła.
pt_br: O nó a ser removido não é um filho deste nó.
ru: Подлежащий удалению узел не является дочерним по отношению к этому узлу.
tr: Kaldırılacak düğüm bu düğümün alt düğümü değil.
zh_hans: 要移除的节点不是此节点的子级。
zh_hant: 要移除的節點不是這個節點的子系。

# Xdom_Node_Remove_Contain
source: The current node cannot contain other nodes, so the node to be removed is not its child.
cs: Aktuální uzel nemůže obsahovat žádné uzly, a proto uzel, který má být odebrán, není podřízeným uzlem tohoto uzlu.
de: Der aktuelle Knoten kann keine anderen Knoten enthalten. Deshalb wird der Knoten, und nicht der untergeordnete Knoten entfernt.
es: El nodo actual no puede contener otros nodos, por lo tanto, el nodo que va a eliminar no es un nodo secundario.
fr: Le nœud actuel ne peut pas contenir d'autres nœuds, ce qui signifie que le nœud à supprimer n'est pas son enfant.
it: Il nodo corrente non può contenere altri nodi. Il nodo da rimuovere non è quindi figlio del nodo corrente.
ja: 現在のノードに他のノードが含まれていないため、削除するノードは子ノードではありません。
ko: 현재 노드는 다른 노드를 포함할 수 없으므로 제거할 노드는 이 노드의 자식이 아닙니다.
pl: Bieżący węzeł nie może zawierać innych węzłów, więc węzeł, który ma zostać usunięty, nie jest elementem podrzędnym bieżącego węzła.
pt_br: O nó atual não pode conter outros nós, portanto o nó a ser removido não é seu filho.
ru: Текущий узел не может содержать другие узлы, поэтому удаляемый узел не является дочерним для этого узла.
tr: Geçerli düğüm alt düğüm içeremez, bu yüzden kaldırılacak düğüm bunun alt düğümü değil.
zh_hans: 当前节点不能包含其他节点，因此要移除的节点不是它的子级。
zh_hant: 目前節點不可包含其他節點，所以要移除的節點不是它的子系。

# Xdom_Node_SetVal
source: Cannot set a value on node type '{0}'.
cs: Nelze nastavit hodnotu typu uzlu {0}.
de: Der Wert für den Knotentyp "{0}" kann nicht festgelegt werden.
es: No se puede establecer un valor en el tipo de nodo "{0}".
fr: Impossible de définir une valeur pour le type de nœud '{0}'.
it: Non è possibile impostare un valore su un nodo di tipo '{0}'.
ja: ノード タイプ '{0}' では、値を設定できません。
ko: 노드 형식 '{0}'에 값을 설정할 수 없습니다.
pl: Nie można ustawić wartości dla typu węzła „{0}”.
pt_br: Não é possível definir um valor no tipo de nó '{0}'.
ru: Невозможно присвоить значение узлу типа "{0}".
tr: {0} düğüm türünde değer ayarlanamaz.
zh_hans: 不能在节点类型“{0}”上设置值。
zh_hant: 無法在節點類型 '{0}' 上設定值。

# Xdom_Set_InnerXml
source: Cannot set the 'InnerXml' for the current node because it is either read-only or cannot have children.
cs: Pro aktuální uzel nelze nastavit atribut InnerXml, protože je určen jen pro čtení nebo nemůže mít podřízené uzly.
de: "InnerXml" kann für den aktuellen Knoten nicht festgelegt werden, da der Knoten entweder schreibgeschützt ist oder keine untergeordneten Elemente haben kann.
es: No se puede establecer "InnerXml" para el nodo actual porque es de solo lectura o no puede tener nodos secundarios.
fr: Impossible de définir le 'InnerXml' du nœud actuel, car il est en lecture seule ou ne peut pas avoir d'enfant.
it: Non è possibile impostare 'InnerXml' per il nodo corrente. Il nodo corrente è di sola lettura o non può contenere nodi figlio.
ja: 現在のノードに 'InnerXml' を設定できません。このノードは、読み取り専用か、または子ノードを持っていません。
ko: 현재 노드는 읽기 전용이거나 자식을 포함할 수 없으므로 'InnerXml'을 설정할 수 없습니다.
pl: Nie można ustawić elementu „InnerXml” dla bieżącego węzła, ponieważ jest on przeznaczony tylko do odczytu albo nie może mieć węzłów podrzędnych.
pt_br: Não é possível definir 'InnerXml' para o nó atual porque ele é somente leitura ou não pode ter filhos.
ru: Невозможно задать InnerXml для текущего узла, так как он доступен только для чтения или не может иметь дочерних узлов.
tr: Geçerli düğüm salt okunur olduğundan veya alt öğeleri olamayacağından bu düğüm için InnerXml ayarlanamaz.
zh_hans: 不能设置当前节点的 InnerXml，因为它是只读的或者不能有子级。
zh_hant: 無法設定目前節點的 'InnerXml'，因為其為唯讀或不可有子系。

# Xdom_TextNode_SplitText
source: The 'Text' node is not connected in the DOM live tree. No 'SplitText' operation could be performed.
cs: Uzel Text není připojen k živému stromu DOM. Nelze provést žádnou operaci SplitText.
de: Der Text-Knoten ist in der DOM-Live-Struktur nicht verbunden. Es konnte kein SplitText-Vorgang durchgeführt werden.
es: El nodo "Text" no está conectado al árbol DOM. No se puede realizar ninguna operación "SplitText".
fr: Le nœud 'Text' n'est pas connecté dans l'arborescence dynamique DOM. Aucune opération 'SplitText' n'a pu être effectuée.
it: Il nodo 'Text' non è connesso all'albero DOM attivo. Non è possibile effettuare alcuna operazione 'SplitText'.
ja: 'Text' ノードは DOM ライブ ツリーで接続されていません。'SplitText' 操作を実行できませんでした。
ko: 'Text' 노드가 DOM 라이브 트리에 연결되어 있지 않습니다. 'SplitText' 작업을 수행할 수 없습니다.
pl: Węzeł „Text” nie jest połączony w bezpośrednim drzewie DOM. Nie można wykonać żadnej operacji typu „SplitText”.
pt_br: O nó 'Text' não está conectado na árvore DOM. Nenhuma operação 'SplitText' pôde ser realizada.
ru: Узел Text не имеет подключений в динамическом дереве DOM. Невозможно выполнить операцию SplitText.
tr: 'Text' düğümü etkin DOM ağacına bağlı değil. 'SplitText' işlemi gerçekleştirilemedi.
zh_hans: "Text" 节点在 DOM 活动目录树中未连接。无法执行任何 SplitText 操作。
zh_hant: 'Text' 節點並未在 DOM Live Tree 中連線。無法進行 'SplitText' 作業。

# Xdom_Version
source: Wrong XML version information. The XML must match production "VersionNum ::= '1.' [0-9]+".
cs: Chybné informace o verzi jazyka XML. Jazyk XML se musí shodovat s verzí VersionNum ::= '1.' [0-9]+.
de: Falsche XML-Versionsinformationen. Es wird nur die XML-Version "VersionNum ::= '1.' [0-9]+" unterstützt.
es: Información de versión XML incorrecta. El XML debe coincidir con la versión de producción "VersionNum ::= '1.' [0-9]+".
fr: Informations de version XML erronées. La version XML doit correspondre à la production "VersionNum ::= '1.' [0-9]+".
it: Le informazioni sulla versione XML sono errate. La versione XML deve corrispondere a "VersionNum ::= '1.' [0-9]+" di produzione.
ja: XML のバージョン情報が正しくありません。XML は "VersionNum ::= '1.' [0-9]+" に一致する必要があります。
ko: XML 버전 정보가 잘못되었습니다. XML 버전이 프로덕션 "VersionNum ::= '1.' [0-9]+"와 일치해야 합니다.
pl: Nieprawidłowe informacje o wersji XML. Składnia XML musi być zgodna ze składnią wersji produkcyjnej „VersionNum ::= '1.' [0-9]+”.
pt_br: Informações de versão XML incorretas. O XML deve corresponder à "VersionNum ::= '1.' [0-9]+" de produção.
ru: Неверная информация о XML-версии. XML должен соответствовать выражению VersionNum ::= '1.' [0-9]+.
tr: Yanlış XML sürüm bilgisi. XML "VersionNum ::= '1.' [0-9]+" üretimiyle eşleşmelidir.
zh_hans: XML 版本信息错误。XML 必须与“VersionNum ::= '1.' [0-9]+”的结果匹配。
zh_hant: 錯誤的 XML 版本資訊。XML 必須符合實際執行 "VersionNum ::= '1.' [0-9]+"。

# Xdom_WS_Char
source: The string for white space contains an invalid character.
cs: Řetězec pro prázdné znaky obsahuje nesprávný znak.
de: Die Zeichenfolge für Leerzeichen enthält ein ungültiges Zeichen.
es: La cadena para el espacio en blanco contiene un carácter no válido.
fr: La chaîne pour l'espace blanc contient un caractère non valide.
it: La stringa per lo spazio vuoto contiene un carattere non valido.
ja: スペース文字列に無効な文字が含まれています。
ko: 공백 문자열에 잘못된 문자가 있습니다.
pl: Ciąg dla białego znaku zawiera nieprawidłowy znak.
pt_br: A cadeia de caracteres de espaço em branco contém um caractere inválido.
ru: Строка пробелов и знаков табуляции содержит недопустимый символ.
tr: Boşluk karakterleri dizesi geçersiz karakter içeriyor.
zh_hans: 空白字符串包含无效的字符。
zh_hant: 空格的字串包含無效的字元。

# Xdom_standalone
source: Wrong value for the XML declaration standalone attribute of '{0}'.
cs: Chybná hodnota samostatného atributu deklarace XML {0}
de: Falscher Wert für das eigenständige Attribut der XML-Deklaration "{0}".
es: Valor incorrecto del atributo independiente de la declaración XML "{0}".
fr: Valeur erronée pour l'attribut autonome de déclaration XML de '{0}'.
it: Valore errato per l'attributo autonomo di dichiarazione XML di '{0}'.
ja: '{0}' の XML 宣言スタンドアロン属性の値が無効です。
ko: XML 선언 독립형 특성 '{0}'에 대한 값이 잘못되었습니다.
pl: Nieprawidłowa wartość dla autonomicznego atrybutu deklaracji XML „{0}”.
pt_br: Valor errado para o atributo autônomo da declaração XML de '{0}'.
ru: Неверное значение изолированного атрибута, "{0}", в объявлении XML.
tr: XML bildirimi tek başına özniteliği '{0}' için yanlış değer.
zh_hans: “{0}”的 XML 声明独立特性的值错误。
zh_hant: '{0}' 中 XML 宣告獨立屬性的錯誤值。

# XmlAbstractType
source: The specified type is abstract: name='{0}', namespace='{1}', at {2}.
cs: Zadaný typ je abstraktní: název={0}, obor názvů={1}, pozice {2}
de: Der angegebene Typ ist abstrakt: Name="{0}", Namespace="{1}", bei {2}.
es: El tipo especificado es abstracto: nombre="{0}", espacio de nombres="{1}", en {2}.
fr: Le type spécifié est abstrait : nom='{0}', espace de noms='{1}', à {2}.
it: Il tipo specificato è astratto: nome='{0}', spazio dei nomi='{1}' alla posizione {2}.
ja: 指定された型は abstract です : name='{0}'、namespace='{1}'、場所 {2}
ko: 지정된 형식은 추상입니다. name='{0}', namespace='{1}', 위치: {2}
pl: Określony typ jest abstrakcyjny: nazwa=„{0}”, przestrzeń nazw=„{1}”, w {2}.
pt_br: O tipo especificado é abstrato: nome='{0}', namespace='{1}', em {2}.
ru: Указанный тип является абстрактным: имя="{0}", пространство имен="{1}", в {2}.
tr: Belirtilen tür özettir: adı='{0}', ad alanı='{1}', konumu {2}.
zh_hans: 指定的类型是抽象的: name='{0}'，namespace='{1}'，位于 {2}。
zh_hant: 指定的類型是抽象: 位於 {2} 的 name='{0}', namespace='{1}'。

# XmlAnonymousBaseType
source: Illegal type derivation: Type '{0}' derives from anonymous type '{1}'. Please change '{1}' to be a named type by setting {2}={3} in the type definition.
cs: Neplatné odvození typu: Typ {0} je odvozen z anonymního typu {1}. Změňte prosím {1} na pojmenovaný typ nastavením {2}={3} v definici typu.
de: Unzulässige Typableitung: Der Typ "{0}" wurde vom anonymen Typ "{1}" abgeleitet. Ändern Sie "{1}" in einen benannten Typ, indem Sie {2}={3} in der Typdefinition festlegen.
es: Derivación de tipo no válida: el tipo "{0}" deriva del tipo anónimo "{1}". Cambie "{1}" a un tipo con nombre estableciendo {2}={3} en la definición de tipo.
fr: Dérivation de type non conforme : le type '{0}' dérive du type anonyme '{1}'. Changez '{1}' en type nommé en définissant {2}={3} dans la définition de type.
it: Derivazione di tipo non consentita: il tipo '{0}' deriva dal tipo anonimo '{1}'. Modificare la definizione '{1}' nel tipo denominato impostando {2}={3}.
ja: 無効な型派生です。型 '{0}' は、無名型 '{1}' から派生しています。型定義で {2}={3} を設定することで、'{1}' を名前付きの型になるように変更してください。
ko: 형식 파생이 잘못되었습니다. 형식 '{0}'이(가) 무명 형식 '{1}'에서 파생되었습니다. 형식 정의에서 {2}={3}을(를) 설정하여 '{1}'을(를) 명명된 형식으로 변경하세요.
pl: Niedozwolone tworzenie typu pochodnego: „{0}” jest typem pochodnym typu anonimowego „{1}”. Zmień typ „{1}” na typ nazwany, ustawiając wartość {2}={3} w definicji typu.
pt_br: Derivação de tipo ilegal: o tipo '{0}' deriva do tipo anônimo '{1}'. Altere '{1}' para um tipo nomeado configurando {2}={3} na definição do tipo.
ru: Недопустимое получение производного типа: тип "{0}" выводится из анонимного типа "{1}". Измените объявление "{1}", указав именованный тип; установите {2}={3} в определении типа.
tr: Geçersiz tür türetme: '{0}' türü '{1}' anonim türünden türetilir. Lütfen tür tanımında {2}={3} ayarını gerçekleştirerek '{1}' tanımını adlandırılmış tür olacak şekilde değiştirin.
zh_hans: 无效的类型派生: 类型“{0}”从匿名类型“{1}”派生。请通过设置 {2}={3} 将“{1}”定义更改为命名的类型。
zh_hant: 類型衍生非法: 類型 '{0}' 由匿名類型 '{1}' 取得。請將 '{1}' 變更為命名類型，方法是在類型定義中設定 {2}={3}。

# XmlAnonymousInclude
source: Cannot include anonymous type '{0}'.
cs: Nelze zahrnout anonymní typ {0}.
de: Der anonyme Typ "{0}" darf nicht enthalten sein.
es: No se puede incluir el tipo anónimo "{0}".
fr: Impossible d'inclure le type anonyme '{0}'.
it: Non è possibile includere il tipo anonimo '{0}'.
ja: 無名型 '{0}' を含めることはできません。
ko: 무명 형식 '{0}'을(를) 포함할 수 없습니다.
pl: Nie można uwzględnić typu anonimowego „{0}”.
pt_br: Não é possível incluir o tipo anônimo '{0}'.
ru: Невозможно включить анонимный тип "{0}".
tr: '{0}' anonim türünü içeremez.
zh_hans: 不能包含匿名类型“{0}”。
zh_hant: 不可包含匿名類型 '{0}'。

# XmlAnyElementDuplicate
source: The element '{0}' has been attributed with duplicate XmlAnyElementAttribute(Name="{1}", Namespace="{2}").
cs: Elementu {0} byl přiřazen duplicitní atribut XmlAnyElementAttribute(Name="{1}", Namespace="{2}").
de: Das Element "{0}" wurde mit doppeltem XmlAnyElementAttribute(Name="{1}", Namespace="{2}") attributiert.
es: El elemento "{0}" se ha atribuido con la propiedad XmlAnyElementAttribute (Nombre="{1}", Espacio de nombres="{2}") duplicada.
fr: Un XmlAnyElementAttribute(Name="{1}", Namespace="{2}") en double a été attribué à l'élément '{0}'.
it: All'elemento '{0}' è stato attribuito un elemento XmlAnyElementAttribute(Name="{1}", Namespace="{2}") duplicato.
ja: 要素 '{0}' は重複した XmlAnyElementAttribute(Name="{1}", Namespace="{2}") に属性付けられています。
ko: 요소 '{0}'에 중복되는 XmlAnyElementAttribute(Name="{1}", Namespace="{2}") 특성이 사용되었습니다.
pl: Elementowi „{0}” nadano zduplikowany atrybut XmlAnyElementAttribute(Name="{1}", Namespace="{2}").
pt_br: O elemento '{0}' foi atribuído com XmlAnyElementAttribute(Name="{1}", Namespace="{2}") duplicado.
ru: Элементу "{0}" был дважды назначен атрибут XmlAnyElementAttribute(Name="{1}", Namespace="{2}").
tr: '{0}' öğesine yinelenen XmlAnyElementAttribute(Name="{1}", Namespace="{2}") verilmiş.
zh_hans: 元素“{0}”已用重复的 XmlAnyElementAttribute(Name="{1}", Namespace="{2}")特性化。
zh_hant: 元素 '{0}' 使用了重複的 XmlAnyElementAttribute(Name="{1}", Namespace="{2}") 賦予屬性。

# XmlArrayItemAmbiguousTypes
source: Ambiguous types specified for member '{0}'. Items '{1}' and '{2}' have the same type. Please consider using {3} with {4} instead.
cs: Pro člen {0} byly zadány dvojznačné typy. Položky {1} a {2} jsou stejného typu. Zvažte prosím možnost použít typy {3} a {4}.
de: Für den Member "{0}" wurden mehrdeutige Typen angegeben. Die Elemente "{1}" und "{2}" haben denselben Typ. Verwenden Sie stattdessen ggf. {3} mit {4}.
es: Se especificaron tipos ambiguos para el miembro "{0}". Los elementos "{1}" y "{2}" tienen el mismo tipo. Considere la posibilidad de utilizar {3} con {4} en su lugar.
fr: Types ambigus spécifiés pour le membre '{0}'. Les éléments '{1}' et '{2}' ont le même type. Utilisez {3} avec {4} à la place.
it: Sono stati specificati tipi non univoci per il membro '{0}'. Il tipo degli elementi '{1}' e '{2}' è identico. Provare invece a usare {3} con {4}.
ja: メンバー '{0}' にあいまいな型が指定されました。項目 '{1}' および '{2}' は同じ型です。代わりに、{3} を {4} と共に使用してください。
ko: 멤버 '{0}'에 대해 모호한 형식이 지정되었습니다. '{1}'과(와) '{2}' 항목의 형식이 동일하므로 {3}과(와) {4}을(를) 대신 사용해야 합니다.
pl: Niejednoznaczne określenie typów dla składowej „{0}”. Elementy „{1}” i „{2}” mają ten sam typ. Rozważ zamienne użycie elementów {3} i {4}.
pt_br: Tipos ambíguos especificados para o membro '{0}'. Os itens '{1}' e '{2}' têm o mesmo tipo. Considere usar {3} com {4}.
ru: Для члена "{0}" указаны неоднозначные типы. Элементы "{1}" и "{2}" имеют одинаковый тип. Рекомендуется использовать {3} с {4}.
tr: '{0}' öğesi için belirsiz türler belirtildi. '{1}' ve '{2}' öğeleri aynı türe sahip. Bunun yerine {4} ile {3} kullanmak isteyebilirsiniz.
zh_hans: 为成员“{0}”指定的类型不明确。项“{1}”和“{2}”具有相同的类型。请考虑将 {3} 与 {4} 一起使用。
zh_hant: 為成員 '{0}' 所指定的類型不明確。項目 '{1}' 與 '{2}' 有相同的類型，請考慮改用 {3} 搭配 {4}。

# XmlAttributeHasNoName
source: This attribute has no name.
cs: Tento atribut nemá žádný název.
de: Das Attribut hat keinen Namen.
es: Este atributo no tiene nombre.
fr: L'attribut n'a pas de nom.
it: Questo attributo non ha nome.
ja: この属性に名前がありません。
ko: 이 특성에 이름이 없습니다.
pl: Ten atrybut nie ma nazwy.
pt_br: O atributo não tem nome.
ru: Этот атрибут не имеет имени.
tr: Özniteliğin adı yok.
zh_hans: 此特性没有名称。
zh_hant: 這個屬性沒有名稱。

# XmlAttributeSetAgain
source: '{0}.{1}' already has attributes.
cs: Položka {0}.{1} již má atributy.
de: "{0}.{1}" hat bereits Attribute.
es: "{0}.{1}" ya tiene atributos.
fr: '{0}.{1}' a déjà des attributs.
it: '{0}.{1}' contiene già attributi.
ja: '{0}.{1}' には既に属性が指定されています。
ko: '{0}.{1}'에 이미 특성이 있습니다.
pl: Element „{0}.{1}” ma już atrybuty.
pt_br: '{0}.{1}' já tem atributos.
ru: "{0}.{1}" уже имеет атрибуты.
tr: '{0}.{1}' zaten özniteliklere sahip.
zh_hans: “{0}.{1}”已具有特性。
zh_hant: '{0}.{1}' 已經有屬性。

# XmlBadBaseElement
source: Element '{0}' from namespace '{1}' is not a complex type and cannot be used as a {2}.
cs: Element {0} z oboru názvů {1} není složitým typem a nelze jej použít jako {2}.
de: Das Element "{0}" aus dem Namespace "{1}" ist kein komplexer Typ und kann nicht als {2} verwendet werden.
es: El elemento "{0}" del espacio de nombres "{1}" no es un tipo complejo y no se puede utilizar como {2}.
fr: L'élément '{0}' de l'espace de noms '{1}' n'est pas un type complexe et ne peut pas être utilisé en tant que {2}.
it: L'elemento '{0}' dello spazio dei nomi '{1}' non è un tipo complesso e non può essere usato come {2}.
ja: 名前空間 '{1}' の要素 '{0}' は複合型ではなく、{2} として使用できません。
ko: 네임스페이스 '{1}'의 '{0}' 요소는 복합 형식이 아니므로 {2}(으)로 사용할 수 없습니다.
pl: Element „{0}” z przestrzeni nazw „{1}” jest typem złożonym i nie może być używany jako {2}.
pt_br: O elemento '{0}' do namespace '{1}' não é um tipo complexo e não pode ser usado como {2}.
ru: Элемент "{0}" из пространства имен "{1}" не является составным типом и не может использоваться в качестве {2}.
tr: '{1}' ad alanındaki '{0}' öğesinin türü karmaşık değil ve bir {2} olarak kullanılamaz.
zh_hans: 命名空间“{1}”的元素“{0}”不是复杂类型，不能用作 {2}。
zh_hant: 命名空間 '{1}' 中的元素 '{0}' 不是複雜類型，所以不可用作為 {2}。

# XmlBadBaseType
source: Type '{0}' from namespace '{1}' is not a complex type and cannot be used as a {2}.
cs: Typ {0} z oboru názvů {1} není složitým typem a nelze jej použít jako {2}.
de: Der Typ "{0}" aus dem Namespace "{1}" ist kein komplexer Typ und kann nicht als {2} verwendet werden.
es: El tipo "{0}" del espacio de nombres "{1}" no es un tipo complejo y no se puede utilizar como {2}.
fr: Le type '{0}' de l'espace de noms '{1}' n'est pas un type complexe et ne peut pas être utilisé en tant que {2}.
it: Il tipo '{0}' dello spazio dei nomi '{1}' non è un tipo complesso e non può essere usato come {2}.
ja: 名前空間 '{1}' からの型 '{0}' は複合型ではなく、{2} として使用できません。
ko: 네임스페이스 '{1}'의 '{0}' 형식은 복합 형식이 아니므로 {2}(으)로 사용할 수 없습니다.
pl: Typ „{0}” z przestrzeni nazw „{1}” nie jest typem złożonym i nie może być używany jako {2}.
pt_br: O tipo '{0}' do namespace '{1}' não é um tipo complexo e não pode ser usado como um {2}.
ru: Тип "{0}" из пространства имен "{1}" не является составным типом и не может использоваться в качестве {2}.
tr: '{1}' ad alanındaki '{0}' türü bir karmaşık tür değil ve bir {2} olarak kullanılamaz.
zh_hans: 命名空间“{1}”中的类型“{0}”不是复杂类型，不能用作 {2}。
zh_hant: 來自命名空間 '{1}' 的類型 '{0}' 不是複雜類型，不得用為 {2}。
