Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/*_IdentityModel.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FoundMultipleCerts
source: Found multiple X.509 certificates using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Provide a more specific find value.
cs: Bylo nalezeno více certifikátů X.509 pomocí následujících kritérií hledání: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3}. Zadejte přesnější hledanou hodnotu.
de: Es wurden mehrere X.509-Zertifikate mit den folgenden Suchkriterien gefunden: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Geben Sie einen spezifischeren Wert für die Suche an.
es: Se encontraron varios certificados X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Especifique un valor de búsqueda más concreto.
fr: Plusieurs certificats X.509 ont été trouvés à partir des critères de recherche suivants : StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Indiquez une valeur de recherche plus spécifique.
it: Sono stati trovati più certificati X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Specificare un valore di ricerca più specifico.
ja: 次の検索条件を使った結果、複数の X.509 証明書が見つかりました: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。より具体的な検索条件を指定してください。
ko: 다음 검색 조건을 사용하여 여러 X.509 인증서를 찾았습니다. StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. 더 구체적인 찾기 값을 제공하세요.
pl: Znaleziono wiele certyfikatów X.509 przy użyciu następujących kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}”. Podaj dokładniejszą wartość wyszukiwania.
pt_br: Encontrados vários certificados X.509 usando os seguintes critérios de pesquisa: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Forneça um valor de localização mais específico.
ru: Несколько сертификатов X.509 найдено с помощью условий StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Укажите более точное значение.
tr: Aşağıdaki arama ölçütleri kullanılarak birden çok X.509 sertifikası bulundu: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Daha belirli bir arama değeri girin.
zh_hans: 使用下列搜索标准找到多个 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。请提供更具体的查找值。
zh_hant: 使用下列搜尋條件找到多個 X.509 憑證: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。請提供更精確的尋找值。

# ID0023
source: ID0023: Failed to create an instance of '{0}' from configuration. A custom configuration element was specified, but the method LoadCustomConfiguration was not implemented. Override LoadCustomConfiguration to handle custom configuration loading.
cs: ID0023: Nepodařilo se vytvořit instanci {0} z konfigurace. Byl zadán vlastní element konfigurace, ale nebyla naimplementována metoda LoadCustomConfiguration. Přepište metodu LoadCustomConfiguration tak, aby dokázala načítat vlastní konfigurace.
de: ID0023: Fehler beim Erstellen einer Instanz von "{0}" aus der Konfiguration. Ein benutzerdefiniertes Konfigurationselement wurde angegeben, aber die LoadCustomConfiguration-Methode wurde nicht implementiert. Setzen Sie LoadCustomConfiguration außer Kraft, um das Laden der benutzerdefinierten Konfiguration zu behandeln.
es: ID0023: Error al crear una instancia de "{0}" a partir de la configuración. Se especificó un elemento de configuración personalizado, pero no se implementó el método LoadCustomConfiguration. Invalide LoadCustomConfiguration para tratar la carga de la configuración personalizada.
fr: ID0023 : échec de la création d'une instance de '{0}' à partir de la configuration. Un élément de configuration personnalisé a été spécifié, mais la méthode LoadCustomConfiguration n'a pas été implémentée. Remplacez LoadCustomConfiguration pour prendre en charge le chargement de la configuration personnalisée.
it: ID0023: non è stato possibile creare un'istanza di '{0}' dalla configurazione. È stato specificato un elemento della configurazione personalizzata, ma non è stato implementato il metodo LoadCustomConfiguration. Eseguire l'override di LoadCustomConfiguration per gestire il caricamento della configurazione personalizzata.
ja: ID0023: '{0}' のインスタンスを構成から作成できませんでした。カスタム構成要素が指定されましたが、LoadCustomConfiguration メソッドが実装されていませんでした。LoadCustomConfiguration をオーバーライドしてカスタム構成の読み込みを処理してください。
ko: ID0023: 구성에서 '{0}' 인스턴스를 만들지 못했습니다. 사용자 지정 구성 요소를 지정했지만 LoadCustomConfiguration 메서드가 구현되지 않았습니다. 사용자 지정 구성 로드를 처리하도록 LoadCustomConfiguration을 재정의하세요.
pl: ID0023: Nie udało się utworzyć wystąpienia elementu „{0}” na podstawie konfiguracji. Został określony niestandardowy element konfiguracji, ale metoda LoadCustomConfiguration nie została zaimplementowana. Przesłoń metodę LoadCustomConfiguration, aby obsłużyć ładowanie niestandardowej konfiguracji.
pt_br: ID0023: falha ao criar uma instância de '{0}' com base na configuração. Um elemento de configuração personalizada foi especificado, mas o método LoadCustomConfiguration não foi implementado. Substitua LoadCustomConfiguration para tratar o carregamento da configuração personalizada.
ru: ID0023: не удалось создать экземпляр "{0}" из конфигурации. Указан настраиваемый элемент конфигурации, но метод LoadCustomConfiguration не реализован. Переопределите LoadCustomConfiguration для обработки загрузки настраиваемых конфигураций.
tr: ID0023: Yapılandırmadan bir '{0}' örneği oluşturulamadı. Özel bir yapılandırma öğesi belirtildi, ancak LoadCustomConfiguration metodu uygulanmadı. Özel yapılandırma yüklemesini işlemek için LoadCustomConfiguration öğesini geçersiz kılın.
zh_hans: ID0023: 未能从配置创建“{0}”的实例。指定了自定义配置元素，但未实现 LoadCustomConfiguration 方法。替代 LoadCustomConfiguration 以处理自定义配置加载。
zh_hant: ID0023: 無法從組態建立 '{0}' 的執行個體。已指定了自訂組態元素，但並未實作方法 LoadCustomConfiguration。請覆寫 LoadCustomConfiguration 以處理自訂組態載入。

# ID4140
source: ID4140: This Assertion cannot be re-emitted as raw XML. This may be because it was not read from XML in the first place, or because Assertion was changed after it was read, as indicated by a changed Id property.
cs: ID4140: Tento výraz Assertion nelze znovu vygenerovat jako nezpracovaný kód XML. To může být způsobeno tím, že výraz nebyl přečten z kódu XML nebo že se po přečtení změnil, jak to naznačuje změněná vlastnost Id.
de: ID4140: Diese Assertion kann nicht erneut als unformatiertes XML ausgegeben werden. Möglicherweise wurde die Assertion ursprünglich nicht aus XML gelesen, oder die Assertion wurde nach dem Lesen geändert. Dies wird durch eine geänderte Id-Eigenschaft angezeigt.
es: ID4140: Este elemento Assertion no se puede volver a emitir como XML sin formato. Esto puede deberse a que no se lee de XML en primer lugar, o a que el elemento Assertion se cambió una vez leído, tal como indica la propiedad del identificador que cambió.
fr: ID4140 : impossible de réémettre cette assertion en tant que contenu XML brut. Il est possible qu'elle n'ait pas été lue initialement dans le contenu XML, ou que l'assertion ait changé après sa lecture, comme l'indique tout changement de valeur de la propriété Id.
it: ID4140: non è possibile creare nuovamente l'elemento Assertion come codice XML non elaborato. È possibile che l'elemento Assertion non sia stato letto dal codice XML oppure che sia stato modificato dopo la lettura, come indicato da una proprietà Id modificata.
ja: ID4140: このアサーションは未加工の XML として再生成できません。これは最初の段階でこのアサーションを XML から読み取ることができなかった、または変更された Id プロパティに示されるように、読み取った後にアサーションが変更されたことが原因である可能性があります。
ko: ID4140: 이 Assertion을 원시 XML로 다시 내보낼 수 없습니다. 원래 XML에서 읽지 않았거나, 변경된 ID 속성에 표시된대로 Assertion을 읽은 후 변경했기 때문일 수 있습니다.
pl: ID4140: Ta asercja nie może być ponownie emitowana jako nieprzetworzony element XML. Może to wynikać przede wszystkim z tego, że nie została ona odczytana z elementu XML lub ponieważ asercja została zmieniona po odczytaniu, na co wskazuje zmiana właściwości Id.
pt_br: ID4140: não é possível emitir novamente esta Declaração como XML bruto. Isso pode ser porque ela não foi lida com base no XML em primeiro lugar ou porque a Declaração foi alterada após ter sido lida, conforme indicado pela propriedade ID alterada.
ru: ID4140: этот элемент Assertion невозможно создать повторно в качестве необработанных XML-данных. Это может быть связано с тем, что элемент Assertion не был считан из XML-файла или был изменен после чтения, как указано в свойстве ChangedId.
tr: ID4140: Assertion ham XML olarak yeniden verilemiyor. Bunun nedeni başlangıçta XML'den okunmaması veya Assertion'ın, değiştirilen Id özelliğiyle belirtildiği gibi, okunduktan sonra değiştirilmesi olabilir.
zh_hans: ID4140: 无法以原始 XML 的形式重新发出此 Assertion。这可能是因为它事先并非从 XML 读入，或者因为 Assertion 在读入后已发生更改，如更改的 ID 属性所示。
zh_hant: ID4140: 無法將此判斷提示以原始 XML 重新發出。這可能是因為它並非原先從 XML 中讀取，或是讀取後因為由已變更的 ID 屬性所指定，所以判斷提示已經變更。

# ImpersonationLevelNotSupported
source: The athentication modes using Kerberos do not support the impersonation level '{0}'. Specify identification or impersonation.
cs: Režimy ověřování pomocí protokolu Kerberos nepodporují úroveň zosobnění {0}. Zadejte identifikaci nebo zosobnění.
de: Die Authentifizierungsmodi mit Kerberos unterstützen die Identitätswechselebene "{0}" nicht. Geben Sie Identifizierung oder Identitätswechsel an.
es: Los modos de autenticación que usan Kerberos no admiten el nivel de suplantación '{0}'. Especifique la identificación o la suplantación.
fr: Les modes d'authentification basés sur Kerberos ne prennent pas en charge le niveau d'emprunt d'identité '{0}'. Spécifiez une identification ou un emprunt d'identité.
it: Le modalità di autenticazione che usano Kerberos non supportano il livello di rappresentazione '{0}'. Specificare Identification o Impersonation.
ja: Kerberos を使用した認証モードは、偽装レベル '{0}' をサポートしていません。ID または偽装を指定してください。
ko: Kerberos를 사용하는 인증 모드가 가장 수준 '{0}'을(를) 지원하지 않습니다. ID 또는 가장을 지정하세요.
pl: Tryby uwierzytelniania przy użyciu protokołu Kerberos nie obsługują poziomu personifikacji „{0}”. Określ identyfikację lub personifikację.
pt_br: Os modos de autenticação usando Kerberos não dão suporte ao nível de representação '{0}'. Especifique a identificação ou a representação.
ru: Режимы аутентификации, использующие протокол Kerberos, не поддерживают уровень олицетворения "{0}". Укажите идентификацию или олицетворение.
tr: Kerberos kullanan kimlik doğrulama modları '{0}' kimliğe bürünme düzeyini desteklemez. Kimlik ya da kimliğe bürünme belirtin.
zh_hans: 使用 Kerberos 的身份验证模式不支持模拟级别“{0}”。请指定标识或模拟。
zh_hant: 使用 Kerberos 的驗證模式不支援模擬等級 '{0}'。請指定識別或模擬。

source: Invalid AsyncResult.
cs: Neplatný výsledek AsyncResult
de: Ungültiges AsyncResult.
es: AsyncResult no válido.
fr: AsyncResult non valide.
it: Il valore di AsyncResult non è valido.
ja: AsyncResult が無効です。
ko: AsyncResult가 잘못되었습니다.
pl: Nieprawidłowy element AsyncResult.
pt_br: AsyncResult inválido.
ru: Недопустимое значение AsyncResult.
tr: AsyncResult geçersiz.
zh_hans: AsyncResult 无效。
zh_hant: AsyncResult 無效。

# InvalidDataReferenceInReferenceList
source: The data reference '{0}' in encryption reference list is not valid.
cs: Odkaz na data {0} v seznamu odkazů šifrování není platný.
de: Der Datenverweis "{0}" in der Verschlüsselungsverweisliste ist ungültig.
es: La referencia de datos '{0}' de la lista de referencias de cifrado no es válida.
fr: La référence de données '{0}' dans la liste des références de chiffrement est non valide.
it: Il riferimento dati '{0}' nell'elenco di riferimenti di crittografia non è valido.
ja: 暗号化参照一覧内のデータ参照 '{0}' は無効です。
ko: 암호화 참조 목록의 '{0}' 데이터 참조가 잘못되었습니다.
pl: Odwołanie do danych „{0}” na liście odwołania szyfrowania jest nieprawidłowe.
pt_br: A referência de dados '{0}' na lista de referências de criptografia é inválida.
ru: Ссылка на данные "{0}" в списке ссылок шифрования недопустима.
tr: Şifreleme başvuru listesindeki '{0}' veri başvurusu geçerli değil.
zh_hans: 加密引用列表中的数据引用“{0}”无效。
zh_hant: 加密參考清單中的資料參考 '{0}' 無效。

# InvalidX509RawData
source: Invalid binary representation of an X.509 certificate.
cs: Neplatná binární reprezentace certifikátu X.509
de: Ungültige binäre Darstellung eines X.509-Zertifikats.
es: Representación binaria no válida de un certificado X.509.
fr: Représentation binaire non valide d'un certificat X.509.
it: La rappresentazione binaria di un certificato X.509 non è valida.
ja: X.509 証明書の無効なバイナリ表記です。
ko: X.509 인증서의 잘못된 이진 표시입니다.
pl: Nieprawidłowa reprezentacja binarna certyfikatu X.509.
pt_br: Representação binária inválida de um certificado X.509.
ru: Недопустимое двоичное представление сертификата X.509.
tr: X.509 sertifikasının geçersiz ikili gösterimi.
zh_hans: X.509 证书的无效二进制表示。
zh_hant: X.509 憑證的二進位表示法無效。

# InvalidXmlQualifiedName
source: An Xml qualified name was expected. '{0}' was found.
cs: Byl očekáván kvalifikovaný název XML. Nalezen byl název {0}.
de: Ein qualifizierter XML-Name wurde erwartet. "{0}" wurde gefunden.
es: Se esperaba un nombre XML completo, pero se encontró '{0}'.
fr: Un nom qualifié XML est attendu. '{0}' a été trouvé.
it: È previsto un nome completo XML, ma è stato trovato '{0}'.
ja: Xml 修飾名が必要ですが、'{0}' が見つかりました。
ko: 정규화된 XML 이름이 필요한데 '{0}'이(가) 발견되었습니다.
pl: Oczekiwano kwalifikowanej nazwy XML. Znaleziono wartość „{0}”.
pt_br: Um nome qualificado XML era esperado. '{0}' foi encontrado.
ru: Ожидалось полное имя Xml. Найдено: "{0}".
tr: Bir Xml tam adı bekleniyordu. '{0}' bulundu.
zh_hans: 需要 XML 限定名称。找到“{0}”。
zh_hant: 應為 Xml 限定名稱，但找到 '{0}'。

# KeyIdentifierCannotCreateKey
source: This SecurityKeyIdentifier does not have any clause that can create a key.
cs: Tento identifikátor SecurityKeyIdentifier neobsahuje žádnou klauzuli, která by mohla vytvořit klíč.
de: Dieser SecurityKeyIdentifier weist keine Klausel auf, die einen Schlüssel erstellen kann.
es: Esta propiedad SecurityKeyIdentifier no tiene ninguna cláusula que pueda crear una clave.
fr: SecurityKeyIdentifier n'a aucune clause pouvant créer une clé.
it: L'elemento SecurityKeyIdentifier non contiene clausole che consentono la creazione di una chiave.
ja: この SecurityKeyIdentifier には、キーを作成できる句がありません。
ko: 이 SecurityKeyIdentifier에는 키를 만들 수 있는 절이 없습니다.
pl: Ten element SecurityKeyIdentifier nie ma żadnej klauzuli, która może utworzyć klucz.
pt_br: Este SecurityKeyIdentifier não tem nenhuma cláusula que possa criar uma chave.
ru: Этот идентификатор SecurityKeyIdentifier не содержит предложения, которые могут создавать ключ.
tr: Bu SecurityKeyIdentifier, anahtar oluşturabilecek bir yan tümceye sahip değil.
zh_hans: 此 SecurityKeyIdentifier 没有可以创建密钥的任何子句。
zh_hant: 此 SecurityKeyIdentifier 沒有任何可建立金鑰的子句。

# KeyIdentifierClauseDoesNotSupportKeyCreation
source: This SecurityKeyIdentifierClause does not support key creation.
cs: Tato klauzule SecurityKeyIdentifierClause nepodporuje vytváření klíčů.
de: Diese SecurityKeyIdentifierClause unterstützt die Schlüsselerstellung nicht.
es: Esta propiedad SecurityKeyIdentifierClause no admite la creación de claves.
fr: SecurityKeyIdentifierClause ne prend pas en charge la création de clé.
it: Questo elemento SecurityKeyIdentifierClause che non supporta la creazione di chiavi.
ja: この SecurityKeyIdentifierClause は、キーの作成をサポートしていません。
ko: 이 SecurityKeyIdentifierClause는 키 생성을 지원하지 않습니다.
pl: Ten element SecurityKeyIdentifierClause nie obsługuje tworzenia klucza.
pt_br: Esta SecurityKeyIdentifierClause não dá suporte à criação de chave.
ru: Этот SecurityKeyIdentifierClause не поддерживает создание ключей.
tr: Bu SecurityKeyIdentifierClause anahtar oluşturmayı desteklemiyor.
zh_hans: 此 SecurityKeyIdentifierClause 不支持密钥创建。
zh_hant: 此 SecurityKeyIdentifierClause 不支援建立金鑰。

# KeyLengthMustBeMultipleOfEight
source: Key length '{0}' is not a multiple of 8 for symmetric keys.
cs: Délka klíče {0} není násobkem čísla 8 pro symetrické klíče.
de: Die Schlüssellänge "{0}" ist für symmetrische Schlüssel kein Vielfaches von 8.
es: La longitud de clave "{0}" no es múltiplo de 8 para las claves simétricas.
fr: La longueur de clé '{0}' n'est pas un multiple de 8 pour des clés symétriques.
it: La lunghezza di chiave '{0}' non è un multiplo di 8 per le chiavi simmetriche.
ja: 対称キーについては、キーの長さ '{0}' は 8 の倍数ではありません。
ko: 키 길이 '{0}'이(가) 대칭 키에 대하여 8의 배수가 아닙니다.
pl: Długość klucza „{0}” dla kluczy symetrycznych nie jest wielokrotnością liczby 8.
pt_br: O comprimento da chave '{0}' não é um múltiplo de 8 para chaves simétricas.
ru: Длина ключа "{0}" не кратна 8, как полагается для симметричных ключей.
tr: '{0}' anahtar uzunluğu simetrik anahtarlar için 8'in katı değil.
zh_hans: 对称密钥的密钥长度“{0}”不是 8 的倍数。
zh_hant: 對稱金鑰的金鑰長度 '{0}' 不是 8 的倍數。

# LengthMustBeGreaterThanZero
source: The length of this argument must be greater than 0.
cs: Délka tohoto argumentu musí být větší než 0.
de: Die Länge dieses Arguments muss größer als 0 sein.
es: La longitud de este argumento debe ser mayor que 0.
fr: La longueur de cet argument doit être supérieure à 0.
it: La lunghezza di questo argomento deve essere maggiore di 0.
ja: この引数の長さは、正の値である必要があります。
ko: 이 인수의 길이는 0보다 커야 합니다.
pl: Długość tego argumentu musi być większa niż 0.
pt_br: O comprimento deste argumento deve ser maior que 0.
ru: Длина этого аргумента должна быть больше 0.
tr: Bu bağımsız değişkenin uzunluğu 0'dan büyük olmalıdır.
zh_hans: 此参数的长度必须大于 0。
zh_hant: 此引數的長度必須大於 0。

# LocalIdCannotBeEmpty
source: The localId cannot be empty. Specify a valid 'localId'.
cs: Hodnota localId nemůže být prázdná. Zadejte platnou hodnotu localId.
de: Die localId darf nicht leer sein. Geben Sie eine gültige "localId" an.
es: El valor de localId no puede estar vacío. Especifique un "localId" válido.
fr: localId ne peut pas être vide. Spécifiez un 'localId' valide.
it: L'elemento localId non può essere vuoto. Specificare un elemento 'localId' valido.
ja: localId を空にすることはできません。有効な 'localId' を指定してください。
ko: localId는 비워 둘 수 없습니다. 유효한 'localId'를 지정하세요.
pl: Identyfikator localId nie może być pusty. Określ prawidłowy identyfikator „localId”.
pt_br: A localId não pode estar vazia. Especifique uma 'localId' válida.
ru: Идентификатор localId не может быть пустым. Укажите допустимый localId.
tr: localId boş olamaz. Geçerli bir 'localId' belirtin.
zh_hans: LocalId 不能为空。请指定有效的 "localId"。
zh_hant: localId 不可為空白。請指定有效的 'localId'。

# MultipleKeyIdentifiersInReference
source: The SecurityTokenReference contains multiple KeyIdentifier elements.
cs: SecurityTokenReference obsahuje několik elementů KeyIdentifier.
de: Der SecurityTokenReference enthält mehrere KeyIdentifier-Elemente.
es: El elemento SecurityTokenReference contiene varios elementos KeyIdentifier.
fr: SecurityTokenReference contient plusieurs éléments KeyIdentifier.
it: L'elemento SecurityTokenReference contiene più elementi KeyIdentifier.
ja: SecurityTokenReference に複数の KeyIdentifier 要素があります。
ko: SecurityTokenReference에 KeyIdentifier 요소가 여러 개 있습니다.
pl: Element SecurityTokenReference zawiera wiele elementów KeyIdentifier.
pt_br: A SecurityTokenReference contém vários elementos KeyIdentifier.
ru: SecurityTokenReference содержит несколько элементов KeyIdentifier.
tr: SecurityTokenReference birden çok KeyIdentifier öğesi içeriyor.
zh_hans: SecurityTokenReference 包含多个 KeyIdentifier 元素。
zh_hant: SecurityTokenReference 包含多個 KeyIdentifier 元素。

# MultipleSamlAuthorityBindingsInReference
source: The SecurityTokenReference to the SAML assertion contains multiple AuthorityBinding elements.
cs: Odkaz SecurityTokenReference na kontrolní výraz SAML obsahuje několik elementů AuthorityBinding.
de: Der SecurityTokenReference auf die SAML-Assertion enthält mehrere AuthorityBinding-Elemente.
es: El elemento SecurityTokenReference de la aserción SAML contiene varios elementos AuthorityBinding.
fr: La référence SecurityTokenReference à l'assertion SAML contient plusieurs éléments AuthorityBinding.
it: L'elemento SecurityTokenReference per l'asserzione SAML contiene più elementi AuthorityBinding.
ja: SAML アサーションへの SecurityTokenReference に複数の AuthorityBinding 要素があります。
ko: SAML 어설션에 대한 SecurityTokenReference에 AuthorityBinding 요소가 여러 개 있습니다.
pl: Element SecurityTokenReference dla asercji SAML zawiera wiele elementów AuthorityBinding.
pt_br: A SecurityTokenReference à declaração SAML contém vários elementos AuthorityBinding.
ru: Ссылка SecurityTokenReference на утверждение SAML содержит несколько элементов AuthorityBinding.
tr: SAML onaylaması SecurityTokenReference başvurusu birden çok AuthorityBinding öğesi içeriyor.
zh_hans: SAML 断言的 SecurityTokenReference 包含多个 AuthorityBinding 元素。
zh_hant: SAML Assertion 的 SecurityTokenReference 包含多個 AuthorityBinding 元素。

# NoKeyIdentifierClauseFound
source: No clause of type '{0}' was found in the SecurityKeyIdentifier.
cs: V identifikátoru SecurityKeyIdentifier nebyla nalezena žádná klauzule typu {0}.
de: Im SecurityKeyIdentifier wurde keine Klausel vom Typ "{0}" gefunden.
es: No se encontró ninguna cláusula del tipo "{0}" en SecurityKeyIdentifier.
fr: La clause de type '{0}' est introuvable dans SecurityKeyIdentifier.
it: Non è stata trovata alcuna clausola di tipo '{0}' nell'elemento SecurityKeyIdentifier.
ja: '{0}' 型の句が SecurityKeyIdentifier にありません。
ko: SecurityKeyIdentifier에서 '{0}' 형식의 절을 찾을 수 없습니다.
pl: W elemencie SecurityKeyIdentifier nie odnaleziono żadnej klauzuli typu „{0}”.
pt_br: Nenhuma cláusula do tipo '{0}' foi encontrada no SecurityKeyIdentifier.
ru: Предложение типа "{0}" не найдено в SecurityKeyIdentifier.
tr: SecurityKeyIdentifier içinde '{0}' türünde yan tümce bulunamadı.
zh_hans: 在 SecurityKeyIdentifier 中没有找到类型为“{0}”的子句。
zh_hant: 在 SecurityKeyIdentifier 中找不到類型 '{0}' 的子句。

# NoKeyInfoClausesToWrite
source: The SecurityKeyIdentifier has no key identifier clauses to write.
cs: SecurityKeyIdentifier nemá žádné klazule identifikátoru klíče k zápisu.
de: Der SecurityKeyIdentifier weist keine Schlüsselbezeichnerklauseln zum Schreiben auf.
es: El elemento SecurityKeyIdentifier no tiene cláusulas de identificador de clave para escribir.
fr: SecurityKeyIdentifier n'a aucune clause d'identificateur de clé à écrire.
it: L'elemento SecurityKeyIdentifier non contiene clausole di identificatore chiave da scrivere.
ja: SecurityKeyIdentifier には、書き込むことができるキー識別子句がありません。
ko: 쓰려는 키 식별자 절이 SecurityKeyIdentifier에 없습니다.
pl: Element SecurityKeyIdentifier nie ma klauzul identyfikatora klucza do zapisania.
pt_br: O SecurityKeyIdentifier não tem cláusulas do identificador da chave a serem gravadas.
ru: SecurityKeyIdentifier не содержит предложения идентификатора ключа для записи.
tr: SecurityKeyIdentifier öğesinin yazılacak anahtar tanımlayıcı ifadesi yok.
zh_hans: SecurityKeyIdentifier 不具有任何要写入的密钥标识符子句。
zh_hant: SecurityKeyIdentifier 沒有可寫入的金鑰識別碼子句。

# ObjectIsReadOnly
source: The object is read-only.
cs: Objekt je určen jen pro čtení.
de: Das Objekt ist schreibgeschützt.
es: El objeto es de solo lectura.
fr: L'objet est en lecture seule.
it: L'oggetto è di sola lettura.
ja: このオブジェクトは読み取り専用です。
ko: 개체가 읽기 전용입니다.
pl: Obiekt jest tylko do odczytu.
pt_br: O objeto é somente leitura.
ru: Объект доступен только для чтения.
tr: Nesne salt okunur.
zh_hans: 对象为只读。
zh_hant: 該物件是唯讀物件。
