Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/*_IdentityModel.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ArgumentCannotBeEmptyString
source: The argument must be a non-empty string.
cs: Argument musí být neprázdný řetězec.
de: Das Argument darf keine leere Zeichenfolge sein.
es: El argumento debe ser una cadena no vacía.
fr: L'argument doit être une chaîne non vide.
it: L'argomento deve essere una stringa non vuota.
ja: 引数には空でない文字列を指定する必要があります。
ko: 인수는 비어 있지 않은 문자열이어야 합니다.
pl: Argument musi być ciągiem niepustym.
pt_br: O argumento deve ser uma cadeia de caracteres não vazia.
ru: Аргумент должен быть непустой строкой.
tr: Bağımsız değişken boş olmayan bir dize olmalıdır.
zh_hans: 参数必须为非空字符串。
zh_hant: 引數必須是非空白字串。

# BadEncryptionState
source: The EncryptedData or EncryptedKey is in an invalid state for this operation.
cs: Třída EncryptedData nebo EncryptedKey je pro tuto operaci v neplatném stavu.
de: EncryptedData oder EncryptedKey befindet sich in einem für diesen Vorgang ungültigen Zustand.
es: EncryptedData o EncryptedKey no tienen un estado válido para esta operación.
fr: EncryptedData ou EncryptedKey présente un état non valide pour cette opération.
it: Lo stato di EncryptedData o EncryptedKey non è valido per questa operazione.
ja: EncryptedData または EncryptedKey は、この操作に対して無効な状態です。
ko: EncryptedData 또는 EncryptedKey가 이 작업에 사용할 수 없는 상태입니다.
pl: Element EncryptedData lub EncryptedKey jest w nieprawidłowym stanie dla tej operacji.
pt_br: O objeto EncryptedData ou EncryptedKey está em um estado inválido para esta operação.
ru: EncryptedData или EncryptedKey находятся в недопустимом для этой операции состоянии.
tr: EncryptedData veya EncryptedKey, bu işlem için geçersiz bir durumda.
zh_hans: 对于此操作，EncryptedData 或 EncryptedKey 处于无效状态。
zh_hant: EncryptedData 或 EncryptedKey 對此作業而言，狀態無效。

# BufferQuotaExceededReadingBase64
source: Unable to finish reading Base64 data as the given buffer quota has been exceeded. Buffer quota: {0}. Consider increasing the MaxReceivedMessageSize quota on the TransportBindingElement. Please note that a very high value for MaxReceivedMessageSize will result in buffering a large message and might open the system to DOS attacks.
cs: Nelze dokončit načtení dat Base64, protože byla překročena daná kvóta vyrovnávací paměti. Kvóta vyrovnávací paměti: {0}. Zvažte možnost zvýšit kvótu MaxReceivedMessageSize ve třídě TransportBindingElement. Poznámka: Příliš vysoká hodnota MaxReceivedMessageSize způsobí, že do vyrovnávací paměti bude uložena objemná zpráva, a může systém vystavit útokům DOS.
de: Das Lesen der Base64-Daten kann nicht abgeschlossen werden, da das angegebene Pufferkontingent überschritten wurde. Pufferkontingent: {0}. Erhöhen Sie ggf. das MaxReceivedMessageSize-Kontingent für das TransportBindingElement. Beachten Sie, dass bei einem sehr hohen Wert für MaxReceivedMessageSize eine große Nachricht gepuffert wird und das System dadurch anfällig für DOS-Angriffe werden kann.
es: No se puede terminar de leer los datos Base64, ya que se superó la cuota de búfer especificada. Cuota de búfer: {0}. Considere la posibilidad de aumentar la cuota de MaxReceivedMessageSize en TransportBindingElement. Tenga en cuenta que un valor muy alto para MaxReceivedMessageSize provocará que se almacene en búfer un mensaje de gran tamaño y podría exponer el sistema a ataques DOS.
fr: Impossible de finir la lecture des données Base64 en raison du dépassement de quota de la mémoire tampon donnée. Quota de la mémoire tampon : {0}. Augmentez le quota de MaxReceivedMessageSize sur TransportBindingElement. Notez qu'une valeur très élevée pour MaxReceivedMessageSize entraîne la mise en mémoire tampon d'un message volumineux et peut rendre le système vulnérable aux attaques DOS.
it: Non è possibile terminare la lettura dei dati Base64 perché è stata superata la quota di buffer specificata. Quota buffer: {0}. Provare ad aumentare la quota di MaxReceivedMessageSize in TransportBindingElement. Si noti che l'impostazione di un valore molto elevato per MaxReceivedMessageSize può causare la memorizzazione di un messaggio di grandi dimensioni nel buffer e potrebbe rendere il sistema vulnerabile ad attacchi di tipo DoS (Denial of Service).
ja: 指定されたバッファー クォータを超えたため、Base64 データの読み取りを完了できません。バッファー クォータ: {0}。TransportBindingElement の MaxReceivedMessageSize クォータを増やしてください。MaxReceivedMessageSize の値を大きくしすぎると、サイズの大きいメッセージがバッファリングされることになり、その結果としてシステムが DoS 攻撃を受けやすくなるので注意してください。
ko: 지정한 버퍼 할당량을 초과했기 때문에 Base64 데이터 읽기를 끝낼 수 없습니다. 버퍼 할당량은 {0}입니다. TransportBindingElement에서 MaxReceivedMessageSize 할당량을 늘려 보세요. MaxReceivedMessageSize의 값이 너무 크면 결과적으로 큰 메시지가 버퍼링되고 시스템이 DOS 공격에 노출될 수 있습니다.
pl: Nie można dokończyć odczytu danych Base64 z powodu przekroczenia limitu przydziału buforu. Limit przydziału buforu: {0}. Rozważ zwiększenie limitu przydziału MaxReceivedMessageSize w obiekcie TransportBindingElement. Należy zauważyć, że bardzo duża wartość właściwości MaxReceivedMessageSize spowoduje buforowanie dużych komunikatów i może otworzyć system na ataki typu „odmowa usługi” (DoS).
pt_br: Não é possível concluir a leitura de dados Base64 porque a cota de buffer determinada foi excedida. Cota de buffer: {0}. Considere aumentar a cota de MaxReceivedMessageSize no TransportBindingElement. Observe que um valor muito alto para MaxReceivedMessageSize resultará no armazenamento em buffer de uma mensagem extensa e poderá abrir o sistema a ataques DOS.
ru: Не удалось завершить чтение данных Base64 из-за превышения заданной квоты буфера. Квота буфера: {0}. Увеличьте квоту MaxReceivedMessageSize элемента TransportBindingElement. Учтите, что слишком высокое значение для MaxReceivedMessageSize сделает возможным буферизацию длинных сообщений и откроет систему для DOS-атак.
tr: Verilen arabellek kotası aşıldığından Base64 verilerinin okunması bitirilemedi. Arabellek kotası: {0}. TransportBindingElement üstündeki MaxReceivedMessageSize kotasını artırmayı deneyin. Çok yüksek bir MaxReceivedMessageSize değerinin, çok büyük bir iletiyi arabelleğe alarak, sistemi DOS saldırılarına açabileceğini unutmayın.
zh_hans: 无法完成读取 Base64 数据，因为已经超过给定的缓冲区配额。缓冲区配额: {0}。请考虑增大 TransportBindingElement 上的 MaxReceivedMessageSize 配额。请注意，MaxReceivedMessageSize 的值过高会导致缓冲过大的消息并且可能会使系统面临 DOS 攻击。
zh_hant: 因為超過了指定的緩衝區配額，所以無法完成 Base64 資料的讀取作業。緩衝區配額: {0}。請考慮增加 TransportBindingElement 的 MaxReceivedMessageSize 配額。請注意，若為 MaxReceivedMessageSize 配額設定極大的值，將會因為必須緩衝大型的訊息而致使系統遭受 DOS 攻擊。

# CannotFindCert
source: Unable to find X.509 certificate using search criteria StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
cs: Nelze najít certifikát X.509 pomocí kritérií hledání: StoreName {0}, StoreLocation {1}, FindType {2}, FindValue {3}.
de: Das X.509-Zertifikat wurde mit den Suchkriterien StoreName "{0}", StoreLocation "{1}", FindType "{2}" und FindValue "{3}" nicht gefunden.
es: No se encuentra el certificado X.509 con los siguientes criterios de búsqueda: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}".
fr: Le certificat X.509 est introuvable à partir des critères de recherche StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
it: Non è stato trovato alcun certificato X.509 usando i criteri di ricerca seguenti: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
ja: 次の検索条件を使って X.509 証明書を見つけることができませんでした: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。
ko: 검색 조건 StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'을(를) 사용하여 X.509 인증서를 찾을 수 없습니다.
pl: Nie można odnaleźć certyfikatu X.509 przy użyciu podanych kryteriów wyszukiwania: StoreName „{0}”, StoreLocation „{1}”, FindType „{2}”, FindValue „{3}”.
pt_br: Não é possível encontrar o certificado X.509 usando os critérios de pesquisa StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
ru: Не удается найти сертификат X.509 с помощью условий поиска: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}".
tr: Arama ölçütleriyle X.509 sertifikası bulunamıyor: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
zh_hans: 无法使用以下搜索标准找到 X.509 证书: StoreName“{0}”、StoreLocation“{1}”、FindType“{2}”、FindValue“{3}”。
zh_hant: 使用搜尋條件找不到 X.509 憑證: StoreName '{0}'、StoreLocation '{1}'、FindType '{2}'、FindValue '{3}'。

# CannotReadKeyIdentifierClause
source: Cannot read KeyIdentifierClause from element '{0}' with namespace '{1}'. Custom KeyIdentifierClauses require custom SecurityTokenSerializers, please refer to the SDK for examples.
cs: Nelze přečíst klauzuli KeyIdentifierClause z elementu {0} s oborem názvů {1}. Vlastní klauzule KeyIdentifierClause vyžadují vlastní serializátory SecurityTokenSerializers. Příklady naleznete v sadě SDK.
de: Die KeyIdentifierClause kann nicht aus dem Element "{0}" mit dem Namespace "{1}" gelesen werden. Benutzerdefinierte KeyIdentifierClauses erfordern benutzerdefinierte SecurityTokenSerializers. Beispiele hierzu finden Sie im SDK.
es: No se puede leer KeyIdentifierClause en el elemento "{0}" con el espacio de nombres "{1}". Las cláusulas KeyIdentifierClause personalizadas requieren serializadores SecurityTokenSerializer personalizados. Consulte el SDK para ver ejemplos.
fr: Impossible de lire KeyIdentifierClause à partir de l'élément '{0}' avec l'espace de noms '{1}'. Des KeyIdentifierClauses personnalisés nécessitent des SecurityTokenSerializers personnalisés. Consultez le SDK pour obtenir des exemples.
it: Non è possibile leggere l'elemento KeyIdentifierClause dall'elemento '{0}' con spazio dei nomi '{1}'. Con gli elementi KeyIdentifierClause personalizzati sono richiesti elementi SecurityTokenSerializer personalizzati. Per gli esempi, fare riferimento all'SDK.
ja: 名前空間 '{1}' の要素 '{0}' から KeyIdentifierClause を読み取ることができません。カスタムの KeyIdentifierClauses には、カスタムの SecurityTokenSerializers が必要です。例については、SDK をご覧ください。
ko: 네임스페이스가 '{1}'인 '{0}' 요소에서 KeyIdentifierClause를 읽을 수 없습니다. 사용자 지정 KeyIdentifierClauses에는 사용자 지정 SecurityTokenSerializers가 필요합니다. 예제를 보려면 SDK를 참조하세요.
pl: Nie można odczytać klauzuli KeyIdentifierClause z elementu „{0}” z przestrzeni nazw „{1}”. Niestandardowe klauzule KeyIdentifierClauses wymagają niestandardowych elementów SecurityTokenSerializers. Przykłady można znaleźć w zestawie SDK.
pt_br: Não é possível ler a KeyIdentifierClause do elemento '{0}' com namespace '{1}'. As KeyIdentifierClauses personalizadas necessitam de SecurityTokenSerializers personalizados. Consulte o SDK para obter exemplos.
ru: Невозможно прочитать KeyIdentifierClause из элемента "{0}" с пространством имен "{1}". Пользовательские KeyIdentifierClause требуют пользовательских SecurityTokenSerializer (примеры см. в пакете SDK).
tr: '{1}' ad alanına sahip '{0}' öğesinden KeyIdentifierClause okunamıyor. Özel KeyIdentifierClause'lar için özel SecurityTokenSerializer'lar gerekir, örnekleri görmek için lütfen SDK'ya başvurun.
zh_hans: 无法从命名空间为“{1}”的元素“{0}”读取 KeyIdentifierClause 。自定义 KeyIdentifierClauses 需要自定义 SecurityTokenSerializers，有关示例，请参考 SDK。
zh_hant: 無法從命名空間為 '{1}' 的元素 '{0}' 讀取 KeyIdentifierClause。自訂 KeyIdentifierClauses 需要自訂 SecurityTokenSerializers，請參考 SDK 以取得範例。

# CannotReadToken
source: Cannot read the token from the '{0}' element with the '{1}' namespace for BinarySecretSecurityToken, with a '{2}' ValueType. If this element is expected to be valid, ensure that security is configured to consume tokens with the name, namespace and value type specified.
cs: Nelze přečíst token z elementu {0} s oborem názvů {1} pro BinarySecretSecurityToken s typem ValueType {2}. Je-li očekáváno, že tento element bude platný, ujistěte se, že zabezpečení je nakonfigurováno tak, aby využívalo tokeny se zadaným názvem, oborem názvů a typem hodnoty.
de: Das Token aus dem Element "{0}" mit dem Namespace "{1}" für BinarySecurityToken mit dem ValueType "{2}" kann nicht gelesen werden. Wenn Sie dieses Element für gültig halten, stellen Sie sicher, dass die Sicherheit für die Nutzung von Token mit dem angegebenen Namen, Namespace und Werttyp konfiguriert ist.
es: No se puede leer el token en el elemento "{0}" con el espacio de nombres "{1}" para BinarySecretSecurityToken, con un valor ValueType "{2}". Si se espera que este elemento sea válido, asegúrese de que la seguridad esté configurada para consumir tokens con el nombre, espacio de nombres y tipo de valor especificados.
fr: Impossible de lire le jeton à partir de l'élément '{0}' avec l'espace de noms '{1}' pour BinarySecretSecurityToken, avec un ValueType '{2}'. Si cet élément est censé être valide, vérifiez que la sécurité est configurée pour consommer des jetons dotés du nom, de l'espace de noms et du type valeur spécifiés.
it: Non è possibile leggere il token dall'elemento '{0}' con spazio dei nomi '{1}' per BinarySecretSecurityToken con un elemento ValueType '{2}'. Se l'elemento deve essere valido, assicurarsi che la sicurezza sia configurata in modo da usare token con il nome, lo spazio dei nomi e il tipo valore specificati.
ja: ValueType が '{2}' である BinarySecretSecurityToken の名前空間 '{1}' を持つ要素 '{0}' からトークンを読み取ることができません。この要素が有効であることが予期される場合は、指定された名前、名前空間、および値の型のトークンを使用するようにセキュリティが構成されていることを確認してください。
ko: BinarySecretSecurityToken에 대한 '{1}' 네임스페이스를 가진 '{0}' 요소에서 '{2}' ValueType의 토큰을 읽을 수 없습니다. 이 요소가 유효한지 보려면 보안이 해당 이름, 네임스페이스 및 값 형식이 지정된 토큰을 사용하도록 구성되었는지 확인하세요.
pl: Nie można odczytać tokenu z elementu „{0}” z przestrzenią nazw „{1}” dla elementu BinarySecretSecurityToken, z typem ValueType „{2}”. Jeśli ten element ma być poprawny, należy tak skonfigurować zabezpieczenia, aby obsługiwały tokeny o określonej nazwie, przestrzeni nazw i typie wartości.
pt_br: Não é possível ler o token do elemento '{0}' com o namespace '{1}' para BinarySecretSecurityToken, com ValueType '{2}'. Se esse elemento for esperado como válido, verifique se a segurança está configurada para consumir tokens com o nome, o namespace e o tipo de valor especificados.
ru: Невозможно считать маркер из элемента "{0}" с пространством имен "{1}" для маркера BinarySecretSecurityToken с типом параметра ValueType "{2}". Чтобы этот элемент был допустимым, безопасность должна быть настроена на использование маркеров с указанным именем, пространством имен и типом параметра.
tr: '{1}' ad alanına sahip '{0}' öğesinden '{2}' ValueType öğesine sahip BinarySecretSecurityToken için belirteç okunamıyor. Bu öğenin geçerli olması bekleniyorsa, güvenliğin ad, ad alanı ve değer türleri belirtilen belirteçleri kullanmasını sağlayın.
zh_hans: 对于具有“{2}”ValueType 的 BinarySecretSecurityToken，无法从命名空间为“{1}”的“{0}”元素中读取令牌。如果此元素预期有效，则请确保将安全性配置为使用具有指定的名称、命名空间和值类型的令牌。
zh_hant: 無法從 ValueType 為 '{2}'、BinarySecretSecurityToken 命名空間為 '{1}' 的元素 '{0}' 讀取權杖。若此元素應該要有效，請確認將安全性設定為使用具有該指定名稱、命名空間及實值型別的權杖。

# CannotValidateSecurityTokenType
source: The security token authenticator '{0}' cannot validate a token of type '{1}'.
cs: Ověřovací data tokenu zabezpečení {0} nemohou ověřit token typu {1}.
de: Der Sicherheitstokenauthentifizierer "{0}" kann ein Token vom Typ "{1}" nicht überprüfen.
es: El autenticador de tokens de seguridad "{0}" no puede validar un token de tipo "{1}".
fr: L'authentificateur de jeton de sécurité '{0}' ne peut pas valider un jeton de type '{1}'.
it: L'autenticatore del token di sicurezza '{0}' non può convalidare un token di tipo '{1}'.
ja: セキュリティ トークン認証システム '{0}' は、型が '{1}' のトークンを検証できません。
ko: 보안 토큰 인증자 '{0}'은(는) '{1}' 형식의 토큰 유효성을 검사할 수 없습니다.
pl: Wystawca uwierzytelnienia tokenu zabezpieczeń „{0}” nie może weryfikować tokenu typu „{1}”.
pt_br: O autenticador de token de segurança '{0}' não pode validar um token do tipo '{1}'.
ru: Средству проверки подлинности маркеров безопасности "{0}" не удается проверить маркер типа "{1}".
tr: '{0}' güvenlik belirteci kimlik doğrulayıcısı '{1}' türündeki bir belirteci doğrulayamaz.
zh_hans: 安全令牌身份验证器“{0}”无法验证类型为“{1}”的令牌。
zh_hant: 安全性權杖驗證器 '{0}' 無法驗證類型 '{1}' 的權杖。

# DidNotFindKeyIdentifierInReference
source: The SecurityTokenReference does not contain a KeyIdentifier.
cs: SecurityTokenReference neobsahuje KeyIdentifier.
de: Der SecurityTokenReference enthält keinen KeyIdentifier.
es: La propiedad SecurityTokenReference no contiene un valor para KeyIdentifier.
fr: SecurityTokenReference ne contient aucun KeyIdentifier.
it: L'elemento SecurityTokenReference non contiene un elemento KeyIdentifier.
ja: SecurityTokenReference に KeyIdentifier が含まれていません。
ko: SecurityTokenReference에 KeyIdentifier가 포함되어 있지 않습니다.
pl: Odwołanie SecurityTokenReference nie zawiera elementu KeyIdentifier.
pt_br: A SecurityTokenReference não contém um KeyIdentifier.
ru: SecurityTokenReference не содержит KeyIdentifer.
tr: SecurityTokenReference bir KeyIdentifier içermiyor.
zh_hans: SecurityTokenReference 不包含 KeyIdentifier。
zh_hant: SecurityTokenReference 未包含 KeyIdentifier。

# ErrorDeserializingKeyIdentifierClause
source: There was an error deserializing the security key identifier clause XML. Please see the inner exception for more details.
cs: Při deserializaci klauzule identifikátoru klíče zabezpečení kódu XML došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Deserialisieren des XML-Codes für die Sicherheitsschlüsselbezeichner-Klausel ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al deserializar el código XML de la cláusula de identificador de clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la désérialisation du code XML de la clause de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la deserializzazione dell'XML della clausola dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子句の XML の逆シリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자 절 XML을 deserialize하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas deserializacji kodu XML klauzuli identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao desserializar o XML da cláusula do identificador da chave de segurança. Consulte a exceção interna para obter mais detalhes.
ru: Ошибка при десериализации XML конструкции идентификатора ключа безопасности. Подробнее см. в описании внутреннего исключения.
tr: Güvenlik anahtarı tanımlayıcısının yan tümce XML'i seri durumdan çıkarılırken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 反序列化安全密钥标识符子句 XML 时发生错误。请参见内部异常以了解详细信息。
zh_hant: 還原序列化安全性金鑰識別碼子句時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ErrorSerializingKeyIdentifier
source: There was an error serializing the security key identifier. Please see the inner exception for more details.
cs: Při serializaci identifikátoru klíče zabezpečení došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Serialisieren des Sicherheitsschlüsselbezeichners ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al serializar el identificador de la clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la sérialisation de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la serializzazione dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子のシリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자를 직렬화하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas serializacji identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao serializar o identificador de chave de segurança. Consulte a exceção interna para obter mais detalhes.
ru: Ошибка при сериализации идентификатора ключа безопасности. Подробнее см. в описании внутреннего исключения.
tr: Anahtar tanımlayıcısı serileştirilirken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 序列化安全密钥标识符时发生错误。请参见内部异常以了解详细信息。
zh_hant: 序列化安全性金鑰識別碼時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ErrorSerializingKeyIdentifierClause
source: There was an error serializing the security key identifier clause. Please see the inner exception for more details.
cs: Při deserializaci klauzule identifikátoru klíče zabezpečení došlo k chybě. Další informace naleznete u vnitřní výjimky.
de: Beim Serialisieren der Sicherheitsschlüsselbezeichner-Klausel ist ein Fehler aufgetreten. Detaillierte Informationen finden Sie in der inneren Ausnahme.
es: Error al serializar la cláusula de identificador de clave de seguridad. Consulte la excepción interna para obtener más información.
fr: Une erreur s'est produite durant la sérialisation de la clause de l'identificateur de la clé de sécurité. Pour plus d'informations, consultez l'exception interne.
it: Si è verificato un errore durante la serializzazione della clausola dell'identificatore della chiave di sicurezza. Per maggiori dettagli, vedere l'eccezione interna.
ja: セキュリティ キー識別子句のシリアル化でエラーが発生しました。詳細については、内部例外を参照してください。
ko: 보안 키 식별자 절을 직렬화하는 중 오류가 발생했습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Wystąpił błąd podczas serializacji klauzuli identyfikatora klucza zabezpieczeń. Aby uzyskać więcej informacji, sprawdź wewnętrzny wyjątek.
pt_br: Erro ao serializar a cláusula do identificador da chave de segurança. Consulte a exceção interna para obter mais detalhes.
ru: Ошибка при сериализации конструкции идентификатора ключа безопасности. Подробнее см. в описании внутреннего исключения.
tr: Güvenlik anahtarı tanımlayıcısı yan tümcesi serileştirilirken bir hata oluştu. Ayrıntılar için iç özel duruma bakın.
zh_hans: 序列化安全密钥标识符子句时发生错误。请参见内部异常以了解详细信息。
zh_hant: 序列化安全性金鑰識別碼子句時發生錯誤。請參閱內部例外狀況，以取得詳細資料。

# ExpectedElementMissing
source: The expected '{0}' element with the '{1}' namespace is missing.
cs: Očekávaný element {0} s oborem názvů {1} chybí.
de: Das erwartete {0}-Element mit dem {1}-Namespace fehlt.
es: Falta el elemento esperado "{0}" con el espacio de nombres "{1}".
fr: L'élément '{0}' attendu avec l'espace de noms '{1}' est manquant.
it: Manca l'elemento previsto '{0}' con lo spazio dei nomi '{1}'.
ja: 名前空間 '{1}' の要素 '{0}' が必要ですが、見つかりません。
ko: 네임스페이스가 '{1}'인 필요한 '{0}' 요소가 없습니다.
pl: Brak oczekiwanego elementu „{0}” z przestrzenią nazw „{1}”.
pt_br: O elemento '{0}' esperado com o namespace '{1}' está ausente.
ru: Ожидаемый элемент "{0}" с пространством имен "{1}" отсутствует.
tr: Beklenen '{1}' ad alanına sahip '{0}' öğesi eksik.
zh_hans: 缺少所需的带有“{1}”命名空间的“{0}”元素。
zh_hant: 遺漏命名空間為 '{1}' 的應有之 '{0}' 元素。
