Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/*_IdentityModel.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# SAMLUnableToLoadUnknownElement
source: The selected SamlSerializer is unable to deserialize this element {0}. Please register a custom SamlSerializer to deserialize custom elements.
cs: Vybraný serializátor SamlSerializer nemohl deserializovat tento element {0}. Chcete-li deserializovat vlastní elementy, zaregistrujte prosím vlastní SamlSerializer.
de: Der SamlSerializer kann dieses {0}-Element nicht deserialisieren. Registrieren Sie einen benutzerdefinierten SamlSerializer zum Deserialisieren von benutzerdefinierten Elementen.
es: El elemento SamlSerializer seleccionado no puede deserializar este elemento {0}. Registre un elemento SamlSerializer personalizado para deserializar los elementos personalizados.
fr: Le SamlSerializer sélectionné ne peut pas désérialiser cet élément {0}. Inscrivez un SamlSerializer personnalisé pour désérialiser les éléments personnalisés.
it: L'elemento SamlSerializer selezionato non riesce a deserializzare l'elemento {0}. Per deserializzare gli elementi personalizzati, registrare un elemento SamlSerializer personalizzato.
ja: 選択された SamlSerializer は、この要素 {0} を逆シリアル化できません。カスタム要素を逆シリアルするためのカスタム SamlSerializer を登録してください。
ko: 선택한 SamlSerializer는 이 {0} 요소를 deserialize할 수 없습니다. 사용자 지정 요소를 deserialize하려면 사용자 지정 SamlSerializer를 등록하세요.
pl: Wybrany serializator nie może deserializować tego elementu {0}. Zarejestruj niestandardowy serializator SamlSerializer, aby deserializować elementy niestandardowe.
pt_br: O SamlSerializer selecionado não pode desserializar este elemento {0}. Registre um SamlSerializer personalizado para desserializar elementos personalizados.
ru: Выбранному сериализатору SamlSerializer не удается десериализовать элемент {0}. Зарегистрируйте пользовательский SamlSerializer для десериализации пользовательских элементов.
tr: Seçili SamlSerializer, bu {0} öğesini seri durumdan çıkaramıyor. Özel öğeleri seri durumdan çıkarmak için lütfen özel bir SamlSerializer kaydettirin.
zh_hans: 选定的 SamlSerializer 无法反序列化此元素 {0}。请注册自定义 SamlSerializer 来反序列化自定义元素。
zh_hant: 所選取的 SamlSerializer 無法還原序列化此元素 {0}。請註冊自訂 SamlSerializer，以還原序列化自訂元素。

# SAMLUnableToResolveSignatureKey
source: Unable to resolve SecurityKeyIdentifier found in the SamlAssertion signature. The SamlAssertion signature can not be validated for the Issuer {0}.
cs: Nelze přeložit identifikátor SecurityKeyIdentifier nalezený v podpisu SamlAssertion. Pro vydavatele {0} nelze ověřit podpis SamlAssertion.
de: Der in der SamlAssertion-Signatur gefundene SecurityKeyIdentifier kann nicht aufgelöst werden. Die SamlAssertion-Signatur kann für den Aussteller "{0}" nicht überprüft werden.
es: No se puede resolver el elemento SecurityKeyIdentifier encontrado en la signatura SamlAssertion. No se puede validar la signatura SamlAssertion para el emisor {0}.
fr: Impossible de résoudre le SecurityKeyIdentifier trouvé dans la signature de SamlAssertion. Impossible de valider la signature de SamlAssertion pour l'émetteur {0}.
it: Non è possibile risolvere l'elemento SecurityKeyIdentifier trovato nella firma di SamlAssertion. Non è possibile convalidare la firma di SamlAssertion per l'elemento Issuer {0}.
ja: SamlAssertion 署名で見つかった SecurityKeyIdentifier を解決できません。SamlAssertion 署名を発行者 '{0}' について検証できません。
ko: SamlAssertion 시그니처의 SecurityKeyIdentifier를 확인할 수 없습니다. {0} 발급자에 대해 SamlAssertion 시그니처의 유효성을 검사할 수 없습니다.
pl: Nie można rozpoznać identyfikatora SecurityKeyIdentifier znalezionego w podpisie elementu SamlAssertion. Podpisu elementu SamlAssertion nie można zweryfikować dla wystawcy {0}.
pt_br: Não é possível resolver o SecurityKeyIdentifier encontrado na assinatura da SamlAssertion. Não é possível validar a assinatura da SamlAssertion para o Emissor {0}.
ru: Не удается разрешить SecurityKeyIdentifier, найденный в сигнатуре SamlAssertion. Невозможно проверить сигнатуру SamlAssertion для издателя {0}.
tr: SamlAssertion imzasında bulunan SecurityKeyIdentifier çözümlenemedi. {0} adlı sertifika veren için SamlAssertion imzası doğrulanamıyor.
zh_hans: 无法解析 SamlAssertion 签名中找到的 SecurityKeyIdentifier。无法验证颁发者 {0} 的 SamlAssertion 签名。
zh_hant: 無法解析在 SamlAssertion 簽章中找到的 SecurityKeyIdentifier。無法為簽發者 {0} 驗證 SamlAssertion 簽章。

# SamlAssertionMissingSigningCredentials
source: SigningCredentials have not been set on the SamlAssertion. SamlAssertions must be signed, please set a valid SigningCredentials on the SamlAssertion to proceed.
cs: Ve výrazu SamlAssertion nebyly nastaveny přihlašovací údaje SigningCredentials. Výrazy SamlAssertion musí být podepsány. Chcete-li pokračovat, nastavte prosím platné přihlašovací údaje SigningCredentials ve výrazu SamlAssertion.
de: Für die SamlAssertion wurden keine SigningCredentials festgelegt. SamlAssertions müssen signiert werden. Legen Sie gültige SigningCredentials für die SamlAssertion fest, um fortzufahren.
es: No se configuraron las credenciales SigningCredentials en el elemento SamlAssertion. Los elementos SamlAssertion deben estar firmados. Para continuar, establezca credenciales SigningCredentials válidas en SamlAssertion.
fr: Les SigningCredentials n'ont pas été définis pour SamlAssertion. Les SamlAssertions doivent être signés. Définissez des SigningCredentials valides pour SamlAssertion afin de continuer.
it: L'elemento SigningCredentials non è impostato in SamlAssertion. SamlAssertion deve essere firmato. Per procedere, impostare un elemento SigningCredentials valido in SamlAssertion.
ja: SigningCredentials が SamlAssertion に設定されていません。SamlAssertions には署名が必要です。続行するには、有効な SigningCredentials を SamlAssertion に設定してください。
ko: SamlAssertion에 SigningCredentials가 설정되어 있지 않습니다. SamlAssertions는 서명되어야 합니다. 계속하려면 SamlAssertion에 유효한 SigningCredentials를 설정하세요.
pl: Nie ustawiono elementu SigningCredentials w elemencie SamlAssertion. Element SamlAssertion musi być podpisany. Aby kontynuować, ustaw prawidłowy element SigningCredentials w elemencie SamlAssertion.
pt_br: As SigningCredentials não foram definidas na SamlAssertion. As SamlAssertions devem ser assinadas. Defina SigningCredentials válidas na SamlAssertion para continuar.
ru: Для элемента SamlAssertion не заданы SigningCredentials. Элементы SamlAssertion должны быть подписаны. Для продолжения укажите допустимые учетные данные SigningCredentials для SamlAssertion.
tr: SamlAssertion'da SigningCredentials ayarlanmadı. SamlAssertions imzalanmalıdır, devam etmek için SamlAssertion'da geçerli bir SigningCredentials ayarlayın.
zh_hans: 尚未在 SamlAssertion 上设置 SigningCredentials。SamlAssertion 必须进行签名，请在要处理的 SamlAssertion 上设置有效的 SigningCredentials。
zh_hant: 尚未對 SamlAssertion 設定 SigningCredentials。SamlAssertions 必須簽署，請對 SamlAssertion 設定有效的 SigningCredentials，才可繼續。

# SamlSerializerRequiresExternalSerializers
source: The SamlSerializer requires a SecurityTokenSerializer to serialize the SecurityKeyIdentifier present in the token.
cs: Aby serializátor SamlSerializer mohl serializovat SecurityKeyIdentifier v tokenu, potřebuje SecurityTokenSerializer.
de: Der SamlSerializer erfordert ein SecurityTokenSerializer, um den im Token enthaltenen SecurityKeyIdentifier zu serialisieren.
es: El elemento SamlSerializer requiere un serializador SecurityTokenSerializer para serializar el identificador SecurityKeyIdentifier que hay en el token.
fr: SamlSerializer nécessite SecurityTokenSerializer pour sérialiser le SecurityKeyIdentifier présent dans le jeton.
it: Con l'elemento SamlSerializer è richiesto un elemento SecurityTokenSerializer per serializzare l'elemento SecurityKeyIdentifier presente nel token.
ja: SamlSerializer は、トークン内に存在する SecurityKeyIdentifier をシリアル化するために SecurityTokenSerializer を必要とします。
ko: SamlSerializer에서 토큰에 있는 SecurityKeyIdentifier를 직렬화하려면 SecurityTokenSerializer가 필요합니다.
pl: Element SamlSerializer wymaga, aby element SecurityTokenSerializer zserializował wartość SecurityKeyIdentifier występującą w tokenie.
pt_br: O SamlSerializer exige um SecurityTokenSerializer para serializar o SecurityKeyIdentifier presente no token.
ru: SamlSerializer требует SecurityTokenSerializer для сериализации SecurityKeyIdentifier, присутствующего в маркере.
tr: SamlSerializer, belirteç içinde bulunan SecurityKeyIdentifier öğesini serileştirmek için bir SecurityTokenSerializer öğesine gereksinim duyar.
zh_hans: SamlSerializer 要求 SecurityTokenSerializer 序列化令牌中的 SecurityKeyIdentifier。
zh_hant: SamlSerializer 要求 SecurityTokenSerializer 將權杖中出現的 SecurityKeyIdentifier 序列化。

# SamlSerializerUnableToReadSecurityKeyIdentifier
source: The SamlSerializer does not contain a SecurityTokenSerializer capable of reading the SecurityKeyIdentifier. If you are using a custom SecurityKeyIdentifier, you must provide a custom SecurityTokenSerializer.
cs: SamlSerializer neobsahuje serializátor SecurityTokenSerializer, který umí přečíst SecurityKeyIdentifier. Používáte-li vlastní SecurityKeyIdentifier, je nutné poskytnout vlastní SecurityTokenSerializer.
de: Der SamlSerializer enthält keinen SecurityTokenSerializer, der den SecurityKeyIdentifier lesen kann. Bei Verwendung eines benutzerdefinierten SecurityKeyIdentifier muss ein benutzerdefinierter SecurityTokenSerializer bereitgestellt werden.
es: El elemento SamlSerializer no contiene un serializador SecurityTokenSerializer capaz de leer el identificador SecurityKeyIdentifier. Si se usa un identificador SecurityKeyIdentifier personalizado, es necesario proporcionar un serializador SecurityTokenSerializer personalizado.
fr: SamlSerializer ne contient aucun SecurityTokenSerializer capable de lire SecurityKeyIdentifier. Si vous utilisez un SecurityKeyIdentifier personnalisé, vous devez fournir un SecurityTokenSerializer personnalisé.
it: L'elemento SamlSerializer non contiene un elemento SecurityTokenSerializer in grado di leggere l'elemento SecurityKeyIdentifier. Se si usa un elemento SecurityKeyIdentifier personalizzato, è necessario fornire un elemento SecurityTokenSerializer personalizzato.
ja: SamlSerializer には、SecurityKeyIdentifier を読み取ることができる SecurityTokenSerializer が含まれていません。カスタム SecurityKeyIdentifier を使用している場合は、カスタム SecurityTokenSerializer を提供する必要があります。
ko: SamlSerializer에 SecurityKeyIdentifier를 읽을 수 있는 SecurityTokenSerializer가 없습니다. 사용자 지정 SecurityKeyIdentifier를 사용하는 경우 사용자 지정 SecurityTokenSerializer를 제공해야 합니다.
pl: Element SamlSerializer nie zawiera elementu SecurityTokenSerializer umożliwiającego odczyt wartości SecurityKeyIdentifier. Jeśli używasz niestandardowej wartości SecurityKeyIdentifier, musisz dostarczyć niestandardowy element SecurityTokenSerializer.
pt_br: O SamlSerializer não contém um SecurityTokenSerializer que possa ler o SecurityKeyIdentifier. Se você estiver usando um SecurityKeyIdentifier personalizado, forneça um SecurityTokenSerializer personalizado.
ru: SamlSerializer не содержит SecurityTokenSerializer, способный считать SecurityKeyIdentifier. При использовании пользовательских SecurityKeyIdentifier необходимо предоставить пользовательский SecurityTokenSerializer.
tr: SamlSerializer, SecurityKeyIdentifier öğesini okuyabilecek bir SecurityTokenSerializer içermiyor. Özel bir SecurityKeyIdentifier kullanıyorsanız, özel bir SecurityTokenSerializer sağlamalısınız.
zh_hans: SamlSerializer 不包含能够读取 SecurityKeyIdentifier 的 SecurityTokenSerializer。如果使用自定义 SecurityKeyIdentifier，必须提供自定义 SecurityTokenSerializer。
zh_hant: SamlSerializer 並未包含能夠讀取 SecurityKeyIdentifier 的 SecurityTokenSerializer。若目前使用自訂的 SecurityKeyIdentifier，則必須提供自訂的 SecurityTokenSerializer。

# SamlSerializerUnableToWriteSecurityKeyIdentifier
source: The SamlSerializer does not contain a SecurityTokenSerializer capable of serializing the given SecurityKeyIdentifier '{0}'. If you are using a custom SecurityKeyIdentifier, you must provide a custom SecurityTokenSerializer.
cs: SamlSerializer neobsahuje serializátor SecurityTokenSerializer, který umí serializovat daný SecurityKeyIdentifier {0}. Používáte-li vlastní SecurityKeyIdentifier, je nutné poskytnout vlastní SecurityTokenSerializer.
de: Der SamlSerializer enthält keinen SecurityTokenSerializer, der den angegebenen SecurityKeyIdentifier "{0}" serialisieren kann. Bei Verwendung eines benutzerdefinierten SecurityKeyIdentifier muss ein benutzerdefinierter SecurityTokenSerializer bereitgestellt werden.
es: El elemento SamlSerializer no contiene un serializador SecurityTokenSerializer capaz de serializar el identificador SecurityKeyIdentifier '{0}' especificado. Si se usa un identificador SecurityKeyIdentifier personalizado, es necesario proporcionar un serializador SecurityTokenSerializer personalizado.
fr: SamlSerializer ne contient aucun SecurityTokenSerializer capable de sérialiser le SecurityKeyIdentifier donné '{0}'. Si vous utilisez un SecurityKeyIdentifier personnalisé, vous devez fournir un SecurityTokenSerializer personnalisé.
it: L'elemento SamlSerializer non contiene un elemento SecurityTokenSerializer in grado di serializzare l'elemento SecurityKeyIdentifier '{0}' specificato. Se si usa un elemento SecurityKeyIdentifier personalizzato, è necessario fornire un elemento SecurityTokenSerializer personalizzato.
ja: SamlSerializer には、指定された SecurityKeyIdentifier '{0}' をシリアル化できる SecurityTokenSerializer が含まれていません。カスタム SecurityKeyIdentifier を使用している場合は、カスタム SecurityTokenSerializer を提供する必要があります。
ko: SamlSerializer에 지정된 SecurityKeyIdentifier '{0}'을(를) 직렬화할 수 있는 SecurityTokenSerializer가 없습니다. 사용자 지정 SecurityKeyIdentifier를 사용하는 경우 사용자 지정 SecurityTokenSerializer를 제공해야 합니다.
pl: Element SamlSerializer nie zawiera elementu SecurityTokenSerializer umożliwiającego serializację danej wartości SecurityKeyIdentifier „{0}”. Jeśli używasz niestandardowego elementu SecurityKeyIdentifier, musisz dostarczyć niestandardowy element SecurityTokenSerializer.
pt_br: O SamlSerializer não contém um SecurityTokenSerializer que pode serializar o SecurityKeyIdentifier '{0}'. Se você estiver usando um SecurityKeyIdentifier personalizado, forneça um SecurityTokenSerializer personalizado.
ru: SamlSerializer не содержит SecurityTokenSerializer, способный выполнить сериализацию данного SecurityKeyIdentifier "{0}". При использовании пользовательских SecurityKeyIdentifier необходимо предоставить пользовательский SecurityTokenSerializer.
tr: SamlSerializer, verilen SecurityKeyIdentifier '{0}' öğesini serileştirebilecek bir SecurityTokenSerializer içermiyor. Özel bir SecurityKeyIdentifier kullanıyorsanız, özel bir SecurityTokenSerializer sağlamalısınız.
zh_hans: SamlSerializer 不包含能够序列化给定 SecurityKeyIdentifier“{0}”的 SecurityTokenSerializer。如果使用自定义 SecurityKeyIdentifier，则必须提供自定义 SecurityTokenSerializer。
zh_hant: SamlSerializer 並未包含能夠序列化指定之 SecurityKeyIdentifier '{0}' 的 SecurityTokenSerializer。若目前使用自訂的 SecurityKeyIdentifier，則必須提供自訂的 SecurityTokenSerializer。

# SamlSigningTokenNotFound
source: The SamlAssertion is signed but the tolen that signed the SamlAssertion cannot be found. Ensure that the SecurityTokenResolver contains the token that signed the SamlAssertion.
cs: Výraz SamlAssertion je podepsán, ale token, který jej podepsal, nelze najít. Ujistěte se, že SecurityTokenResolver obsahuje token, kterým byl podepsán výraz SamlAssertion.
de: Die SamlAssertion ist signiert, das zum Signieren der SamlAssertion verwendete Token wurde jedoch nicht gefunden. Vergewissern Sie sich, dass der SecurityTokenResolver das Token enthält, von dem die SamlAssertion signiert wurde.
es: El elemento SamlAssertion está firmado, pero no se encuentra al token que se usó para la firma. Asegúrese de que el elemento SecurityTokenResolver contiene el token que se usó para firmar SamlAssertion.
fr: SamlAssertion est signé mais le jeton qui a signé SamlAssertion est introuvable. Vérifiez que SecurityTokenResolver contient le jeton qui a signé SamlAssertion.
it: L'elemento SamlAssertion è firmato ma il token con cui è stato firmato non è stato trovato. Assicurarsi che l'elemento SecurityTokenResolver contenga il token con cui è stato firmato SamlAssertion.
ja: SamlAssertion は署名されていますが、SamlAssertion に署名したトークンが見つかりません。SecurityTokenResolver に、SamlAssertion に署名したトークンが含まれていることをご確認ください。
ko: SamlAssertion이 서명되었는데 SamlAssertion에 서명한 토큰을 찾을 수 없습니다. SamlAssertion에 서명한 토큰이 SecurityTokenResolver에 포함되어 있는지 확인하세요.
pl: Element SamlAssertion jest podpisany, ale nie można odnaleźć tokenu, który podpisał element SamlAssertion. Upewnij się, że element SecurityTokenResolver zawiera token, który podpisał element SamlAssertion.
pt_br: A SamlAssertion está assinada, mas não é possível encontrar o token que assinou a SamlAssertion. Verifique se o SecurityTokenResolver contém o token que assinou a SamlAssertion.
ru: SamlAssertion подписан, однако невозможно найти маркер, подписывающий SamlAssertion. Убедитесь, что SecurityTokenResolver содержит маркер, подписывающий SamlAssertion.
tr: SamlAssertion imzalandı, ancak SamlAssertion öğesini imzalayan belirteç bulunamıyor. SecurityTokenResolver öğesinin, SamlAssertion'ı imzalayan belirteci içerdiğinden emin olun.
zh_hans: 已对 SamlAssertion 进行签名，但找不到对 SamlAssertion 进行签名的令牌。请确保 SecurityTokenResolver 包含对 SamlAssertion 进行签名的令牌。
zh_hant: SamlAssertion 已簽署，但找不到已簽署 SamlAssertion 的權杖。請確定 SecurityTokenResolver 包含簽署 SamlAssertion 的權杖。

# SamlTokenMissingSignature
source: The SamlAssertion is not signed. SamlAssertions can be signed by setting the SigningCredentials.
cs: Výraz SamlAssertion není podepsán. Výrazy SamlAssertion lze podepsat nastavením přihlašovacích údajů SigningCredentials.
de: Die SamlAssertion ist nicht signiert. SamlAssertions können durch Festlegen der SigningCredentials signiert werden.
es: SamlAssertion no está firmado. Los elementos SamlAssertion se pueden firmar estableciendo valores de SigningCredentials.
fr: SamlAssertion n'est pas signé. Vous pouvez signer les SamlAssertions en définissant les SigningCredentials.
it: L'elemento SamlAssertion non è firmato. È possibile firmare SamlAssertion impostando SigningCredentials.
ja: SamlAssertion は署名されていません。SamlAssertions に署名するには、SigningCredentials を設定します。
ko: SamlAssertion이 서명되어 있지 않습니다. SigningCredentials를 설정하면 SamlAssertions에 서명할 수 있습니다.
pl: Element SamlAssertion nie jest podpisany. Elementy SamlAssertion można podpisać, ustawiając element SigningCredentials.
pt_br: A SamlAssertion não está assinada. SamlAssertions podem ser assinadas definindo as SigningCredentials.
ru: SamlAssertion не подписан. Элементы SamlAssertion можно подписывать путем задания SigningCredentials.
tr: SamlAssertion imzalanmamış. SamlAssertion öğeleri SigningCredential değerleri ayarlanarak imzalanabilir.
zh_hans: 未对 SamlAssertion 进行签名。可设置 SigningCredentials 对 SamlAssertion 进行签名。
zh_hant: SamlAssertion 未簽署。設定 SigningCredentials 即可簽署 SamlAssertions。

# SecurityTokenRequirementDoesNotContainProperty
source: The token requirement does not contain a property '{0}'.
cs: Požadavek tokenu neobsahuje vlastnost {0}.
de: Die Tokenanforderung enthält keine Eigenschaft "{0}".
es: El requisito de token no contiene una propiedad "{0}".
fr: L'exigence du jeton ne contient aucune propriété '{0}'.
it: Il requisito di token non contiene alcuna proprietà '{0}'.
ja: トークンの要件に、プロパティ '{0}' が含まれていません。
ko: 토큰 요구 사항에 '{0}' 속성이 없습니다.
pl: Wymaganie tokenu nie zawiera właściwości „{0}”.
pt_br: O requisito de token não contém uma propriedade '{0}'.
ru: Требование к маркеру не содержит свойство "{0}".
tr: Belirteç gereksinimi '{0}' özelliğini içermiyor.
zh_hans: 令牌要求不包含属性“{0}”。
zh_hant: 權杖需求不包含屬性 '{0}'。

# SecurityTokenRequirementHasInvalidTypeForProperty
source: The token requirement has an unexpected type '{1}' for property '{0}'. The expected property type is '{2}'.
cs: Požadavek tokenu má pro vlastnost {1} neočekávaný typ {0}. Očekávaný typ vlastnosti je {2}.
de: Die Tokenanforderung enthält einen unerwarteten Typ "{1}" für die Eigenschaft "{0}". Erwartet wurde der Eigenschaftentyp "{2}" .
es: El requisito de token tiene un tipo no esperado "{1}" para la propiedad "{0}". El tipo de propiedad esperado es "{2}".
fr: L'exigence du jeton présente un type '{1}' inattendu pour la propriété '{0}'. Le type de propriété attendu est '{2}'.
it: Il tipo '{1}' della proprietà '{0}' non è previsto per il requisito del token. Il tipo previsto della proprietà è '{2}'.
ja: トークンの要件に、プロパティ '{0}' では予期されていない型 '{1}' が含まれています。予期されたプロパティの型は '{2}' です。
ko: 토큰 요구 사항에서 '{0}' 속성에 대해 예기치 않은 형식 '{1}'이(가) 있습니다. 필요한 속성 형식은 '{2}'입니다.
pl: Wymaganie tokenu ma nieoczekiwany typ „{1}” dla właściwości „{0}”. Oczekiwanym typem właściwości jest „{2}”.
pt_br: O requisito de token tem um tipo inesperado '{1}' para a propriedade '{0}'. O tipo de propriedade esperado é '{2}'.
ru: Требование к маркеру содержит непредвиденный тип "{1}" для свойства "{0}". Ожидаемый тип свойства "{2}".
tr: Belirteç gereksiniminin '{0}' özelliği için beklenmeyen bir '{1}' türü var. Beklenen özellik türü: '{2}'.
zh_hans: 令牌要求对于属性“{0}”具有意外类型“{1}”。预期的属性类型为“{2}”。
zh_hant: 權杖需求的屬性 '{0}' 出現非預期的類型 '{1}'。屬性類型應為 '{2}'。

# StandardsManagerCannotWriteObject
source: The token Serializer cannot serialize '{0}'. If this is a custom type you must supply a custom serializer.
cs: Serializátor tokenů nemůže serializovat {0}. Pokud je to vlastní typ, je nutné poskytnout vlastní serializátor.
de: Das Tokenserialisierungsmodul kann "{0}" nicht serialisieren. Falls es sich hierbei um einen benutzerdefinierten Typ handelt, müssen Sie ein benutzerdefiniertes Serialisierungsmodul bereitstellen.
es: El serializador de tokens no puede serializar "{0}". Si se trata de un tipo personalizado, deberá suministrar un serializador personalizado.
fr: Le sérialiseur de jetons ne peut pas sérialiser '{0}'. S'il s'agit d'un type personnalisé, vous devez fournir un sérialiseur personnalisé.
it: Il serializzatore di token non può serializzare '{0}'. Se si tratta di un tipo personalizzato, è necessario fornire un serializzatore personalizzato.
ja: トークン シリアライザーは '{0}' をシリアル化できません。これがカスタム型である場合は、カスタム シリアライザーを提供する必要があります。
ko: 토큰 직렬 변환기가 '{0}'을(를) 직렬화할 수 없습니다. 사용자 지정 형식인 경우에는 사용자 지정 직렬 변환기를 제공해야 합니다.
pl: Serializator tokenów nie może zserializować elementu „{0}”. Jeśli jest to typ niestandardowy, należy użyć serializatora niestandardowego.
pt_br: O Serializador de token não pode serializar '{0}'. Se for um tipo personalizado, você deverá fornecer um serializador personalizado.
ru: Cериализатор маркеров не может сериализовать "{0}". Если используется особый тип, необходимо предоставить особый сериализатор.
tr: Belirteç Serializer özelliği, '{0}' öğesini serileştiremiyor. Bu özel bir türse, özel bir serileştirici sağlamalısınız.
zh_hans: 令牌序列化程序无法序列化“{0}”。如果这是自定义类型，则必须提供自定义序列化程序。
zh_hant: 權杖序列化程式無法將 '{0}' 序列化。若這是自訂類型，必須提供自訂序列化程式。

# SymmetricKeyLengthTooShort
source: The length of the symmetric key specified is too short ({0} bytes).
cs: Zadaný symetrický klíč je příliš krátký (počet bajtů: {0}).
de: Die angegebene Länge des symmetrischen Schlüssels ist zu kurz ({0} Bytes).
es: La longitud de la clave simétrica especificada es demasiado corta ({0} bytes).
fr: La longueur de la clé symétrique spécifiée est trop courte ({0} octets).
it: La chiave simmetrica specificata è troppo breve ({0} byte).
ja: 指定された対称キーの長さが短すぎます ({0} バイト)。
ko: 지정한 대칭 키의 길이가 너무 짧습니다({0}바이트).
pl: Długość określonego klucza symetrycznego jest za mała ({0} B).
pt_br: O comprimento da chave simétrica especificada é muito curto ({0} bytes).
ru: Указанный симметричный ключ слишком короткий ({0} байт).
tr: Belirtilen simetrik anahtarın uzunluğu ({0} bayt) çok kısa.
zh_hans: 指定的对称密钥的长度太短({0} 个字节).
zh_hant: 指定的對稱金鑰長度太短 ({0} 個位元組)。
