Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/*_IdentityModel.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# TokenCancellationNotSupported
source: The token provider '{0}' does not support token cancellation.
cs: Poskytovatel tokenu {0} nepodporuje možnost zrušit token.
de: Der Tokenanbieter "{0}" unterstützt den Tokenabbruch nicht.
es: El proveedor de token "{0}" no admite la cancelación de token.
fr: Le fournisseur de jetons '{0}' ne prend pas en charge l'annulation des jetons.
it: Il provider di token '{0}' non supporta l'annullamento dei token.
ja: トークン プロバイダー '{0}' はトークンのキャンセルをサポートしていません。
ko: 토큰 공급자 '{0}'은(는) 토큰 취소를 지원하지 않습니다.
pl: Dostawca tokenu „{0}” nie obsługuje anulowania tokenu.
pt_br: O provedor de token '{0}' não dá suporte ao cancelamento de token.
ru: Поставщик маркеров "{0}" не поддерживает отмену маркеров.
tr: '{0}' belirteç sağlayıcısı, belirteç iptal etmeyi desteklemiyor.
zh_hans: 令牌提供程序“{0}”不支持令牌取消。
zh_hant: 權杖提供者 '{0}' 不支援取消權杖。

# TokenDoesNotSupportKeyIdentifierClauseCreation
source: '{0}' does not support '{1}' creation.
cs: {0} nepodporuje vytvoření {1}.
de: "{0}" unterstützt nicht die Erstellung von "{1}".
es: "{0}" no admite la creación de "{1}".
fr: '{0}' ne prend pas en charge la création de '{1}'.
it: '{0}' non supporta la creazione di '{1}'.
ja: '{0}' は '{1}' の作成をサポートしていません。
ko: '{0}'이(가) '{1}' 작성을 지원하지 않습니다.
pl: Element „{0}” nie obsługuje tworzenia elementu „{1}”.
pt_br: '{0}' não dá suporte à criação de '{1}'.
ru: "{0}" не поддерживает создание "{1}".
tr: '{0}', '{1}' oluşturmayı desteklemiyor.
zh_hans: “{0}”不支持“{1}”创建。
zh_hant: '{0}' 不支援建立 '{1}'。

# TokenProviderUnableToGetToken
source: The token provider '{0}' was unable to provide a security token.
cs: Poskytovatel tokenu {0} nemohl poskytnout token zabezpečení.
de: Der Tokenanbieter "{0}" konnte kein Sicherheitstoken bereitstellen.
es: El proveedor de token "{0}" no pudo proporcionar un token de seguridad.
fr: Le fournisseur de jetons '{0}' n'a pas pu fournir de jeton de sécurité.
it: Il provider di token '{0}' non è riuscito a fornire un token di sicurezza.
ja: トークン プロバイダー '{0}' はセキュリティ トークンを提供できませんでした。
ko: 토큰 공급자 '{0}'에서 보안 토큰을 제공하지 못했습니다.
pl: Dostawca tokenu „{0}” nie mógł zapewnić tokenu zabezpieczającego.
pt_br: O provedor de token '{0}' não pôde fornecer um token de segurança.
ru: Поставщику маркеров "{0}" не удалось предоставить маркер безопасности.
tr: '{0}' belirteç sağlayıcısı bir güvenlik belirteci sağlayamadı.
zh_hans: 令牌提供程序“{0}”无法提供安全令牌。
zh_hant: 權杖提供者 '{0}' 無法提供安全性權杖。

# TokenProviderUnableToRenewToken
source: The token provider '{0}' was unable to renew the security token.
cs: Poskytovatel tokenu {0} nemohl obnovit token zabezpečení.
de: Der Tokenanbieter "{0}" konnte das Sicherheitstoken nicht erneuern.
es: El proveedor de token "{0}" no pudo renovar un token de seguridad.
fr: Le fournisseur de jetons '{0}' n'a pas pu renouveler le jeton de sécurité.
it: Il provider di token '{0}' non è riuscito a rinnovare il token di sicurezza.
ja: トークン プロバイダー '{0}' はセキュリティ トークンを更新できませんでした。
ko: 토큰 공급자 '{0}'에서 보안 토큰을 갱신하지 못했습니다.
pl: Dostawca tokenu „{0}” nie mógł odnowić tokenu zabezpieczającego.
pt_br: O provedor de token '{0}' não pôde renovar o token de segurança.
ru: Поставщику маркеров "{0}" не удалось возобновить маркер безопасности.
tr: '{0}' belirteç sağlayıcısı güvenlik belirtecini yenileyemedi.
zh_hans: 令牌提供程序“{0}”无法续订安全令牌。
zh_hant: 權杖提供者 '{0}' 無法更新安全性權杖。

# TokenRenewalNotSupported
source: The token provider '{0}' does not support token renewal.
cs: Poskytovatel tokenu {0} nepodporuje možnost obnovit token.
de: Der Tokenanbieter "{0}" unterstützt die Tokenerneuerung nicht.
es: El proveedor de token "{0}" no admite la renovación de token.
fr: Le fournisseur de jetons '{0}' ne prend pas en charge le renouvellement des jetons.
it: Il provider di token '{0}' non supporta il rinnovo dei token.
ja: トークン プロバイダー '{0}' はトークンの更新をサポートしていません。
ko: 토큰 공급자 '{0}'은(는) 토큰 갱신을 지원하지 않습니다.
pl: Dostawca tokenu „{0}” nie obsługuje odnowienia tokenu.
pt_br: O provedor de token '{0}' não dá suporte à renovação de token.
ru: Поставщик маркеров "{0}" не поддерживает возобновление маркеров.
tr: '{0}' belirteç sağlayıcısı, belirteç yenilemeyi desteklemiyor.
zh_hans: 令牌提供程序“{0}”不支持令牌续订。
zh_hant: 權杖提供者 '{0}' 不支援更新權杖。

# UnableToCreateTokenReference
source: Unable to create a security token reference.
cs: Nelze vytvořit odkaz tokenu zabezpečení.
de: Es konnte kein Sicherheitstokenverweis erstellt werden.
es: No se puede crear la referencia de token de seguridad.
fr: Impossible de créer une référence de jeton de sécurité.
it: Non è possibile creare un riferimento al token di sicurezza.
ja: セキュリティ トークン参照を作成できません。
ko: 보안 토큰 참조를 만들 수 없습니다.
pl: Nie można utworzyć odwołania do tokenu zabezpieczającego.
pt_br: Não é possível criar uma referência de token de segurança.
ru: Не удается создать ссылку на маркер безопасности.
tr: Güvenlik belirteci başvurusu oluşturulamıyor.
zh_hans: 无法创建安全令牌引用。
zh_hant: 無法建立安全性權杖參考。

# UnableToResolveKeyReference
source: The token resolver is unable to resolve the security key reference '{0}'.
cs: Překladač tokenů nemůže přeložit odkaz na klíč zabezpečení {0}.
de: Der Tokenresolver kann den Sicherheitsschlüsselverweis "{0}" nicht auflösen.
es: La resolución de tokens no puede resolver la referencia de la clave de seguridad "{0}".
fr: Le programme de résolution de jetons ne peut pas résoudre la référence de clé de sécurité '{0}'.
it: Il resolver dei token non riesce a risolvere il riferimento '{0}' alla chiave di sicurezza.
ja: トークン リゾルバーは、セキュリティ キーへの参照 '{0}' を解決できません。
ko: 토큰 확인자가 보안 키 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Program rozpoznawania tokenów nie może rozpoznać odwołania klucza zabezpieczającego „{0}”.
pt_br: O resolvedor de token não pode resolver a referência da chave de segurança '{0}'.
ru: Распознавателю маркеров не удается разрешить ссылку на ключ безопасности "{0}".
tr: Belirteç çözümleyici, '{0}' güvenlik anahtarı başvurusunu çözümleyemiyor.
zh_hans: 令牌解析程序无法解析安全密钥引用“{0}”。
zh_hant: 權杖解析程式無法解析安全性金鑰參考 '{0}'。

# UnableToResolveTokenReference
source: The token resolver is unable to resolve the token reference '{0}'.
cs: Překladač tokenů nemůže přeložit odkaz na token {0}.
de: Der Tokenresolver kann den Tokenverweis "{0}" nicht auflösen.
es: La resolución de tokens no puede resolver la referencia del token "{0}".
fr: Le programme de résolution de jetons ne peut pas résoudre la référence de jeton '{0}'.
it: Il resolver dei token non riesce a risolvere il riferimento '{0}' al token.
ja: トークン リゾルバーは、トークンへの参照 '{0}' を解決できません。
ko: 토큰 확인자가 토큰 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Program rozpoznawania tokenów nie może rozpoznać odwołania tokenu „{0}”.
pt_br: O resolvedor de token não pode resolver a referência de token '{0}'.
ru: Распознавателю маркеров не удается разрешить ссылку на маркер "{0}".
tr: Belirteç çözümleyici, '{0}' belirteç başvurusunu çözümleyemiyor.
zh_hans: 令牌解析程序无法解析令牌引用“{0}”。
zh_hant: 權杖解析程式無法解析權杖參考 '{0}'。

# UnboundPrefixInQName
source: An unbound prefix is used in the '{0}' qualified name.
cs: V kvalifikovaném názvu {0} je použita nevázaná předpona.
de: Im qualifizierten Namen "{0}" wurde ein ungebundenes Präfix verwendet.
es: El nombre completo "{0}" contiene un prefijo independiente.
fr: Un préfixe indépendant est utilisé dans le nom qualifié '{0}'.
it: Nel nome completo '{0}' è stato usato un prefisso non associato.
ja: バインドされていないプレフィックスが修飾名 '{0}' で使用されています。
ko: 바인딩되지 않은 접두사가 정규화된 이름 '{0}'에서 사용되었습니다.
pl: W kwalifikowanej nazwie „{0}” jest używany niepowiązany prefiks.
pt_br: Um prefixo não associado é usado no nome qualificado '{0}'.
ru: Несвязанный префикс используется в полном имени "{0}".
tr: '{0}' tam adında bağlı olmayan bir ön ek kullanılıyor.
zh_hans: “{0}”限定名称中使用了未绑定前缀。
zh_hant: '{0}' 限定名稱中使用了未繫結前置詞。

# UnexpectedXmlChildNode
source: XML child node {0} of type {1} is unexpected for element {2}.
cs: Podřízený uzel XML {0} typu {1} není pro element {2} očekáván.
de: Der untergeordnete XML-Knoten {0} vom Typ {1} wird für das Element {2} nicht erwartet.
es: No se espera el nodo secundario XML {0} de tipo {1} para el elemento {2}.
fr: Le nœud enfant XML {0} de type {1} est inattendu pour l'élément {2}.
it: Il nodo figlio XML {0} di tipo {1} non è previsto per l'elemento {2}.
ja: 型 {1} の XML 子ノード {0} は要素 {2} に対して予期されていません。
ko: {1} 형식의 XML 자식 노드 {0}은(는) 요소 {2}에 대해 예기치 않은 자식 노드입니다.
pl: Węzeł podrzędny XML {0} typu {1} jest nieoczekiwany dla elementu {2}.
pt_br: O nó filho XML {0} do tipo {1} é inesperado para o elemento {2}.
ru: Дочерний узел XML {0} типа {1} является неожиданным для элемента {2}.
tr: {2} öğesi için {1} türündeki {0} XML alt düğümü beklenmiyor.
zh_hans: 类型为 {1} 的 XML 子节点 {0} 不是元素 {2} 所预期的。
zh_hant: 類型為 {1} 的 XML 子節點 {0} 不是元素 {2} 所預期的項目。

# UnknownEncodingInKeyIdentifier
source: Unrecognized encoding while reading key identifier.
cs: Při čtení identifikátoru klíče se zjistilo nerozpoznané kódování.
de: Unbekannte Codierung beim Lesen des Schlüsselbezeichners.
es: Codificación no reconocida al leer el identificador de clave.
fr: Encodage non reconnu durant la lecture d'un identificateur de clé.
it: Codifica non riconosciuta durante la lettura dell'identificatore chiave.
ja: キー ID を読み取るときの不明なエンコードです。
ko: 키 식별자를 읽는 중 인식할 수 없는 인코딩을 발견했습니다.
pl: Nierozpoznane kodowanie podczas odczytywania identyfikatora klucza.
pt_br: Codificação não reconhecida ao ler o identificador de chave.
ru: Нераспознанное кодирование при считывании идентификатора ключа.
tr: Anahtar tanımlayıcısı okunurken kodlama tanınmadı.
zh_hans: 读取密钥标识符时出现无法识别的编码。
zh_hant: 讀取金鑰識別碼時出現無法辨識的編碼。

# UnsupportedKeyDerivationAlgorithm
source: The '{0}' key derivation algorithm is not supported.
cs: Algoritmus odvození klíče {0} není podporován.
de: Der Schlüsselableitungsalgorithmus "{0}" wird nicht unterstützt.
es: No se admite el algoritmo de derivación de clave "{0}".
fr: L'algorithme de dérivation de clé '{0}' n'est pas pris en charge.
it: L'algoritmo di derivazione della chiave '{0}' non è supportato.
ja: キー派生アルゴリズム '{0}' はサポートされていません。
ko: '{0}' 키 파생 알고리즘은 지원되지 않습니다.
pl: Algorytm wyprowadzania klucza „{0}” nie jest obsługiwany.
pt_br: Não há suporte para o algoritmo de derivação de chave '{0}'.
ru: Алгоритм формирования ключа "{0}" не поддерживается.
tr: '{0}' anahtar türetme algoritması desteklenmiyor.
zh_hans: 不支持“{0}”密钥派生算法。
zh_hant: 不支援 '{0}' 金鑰衍生演算法。

# UserNameCannotBeEmpty
source: The username cannot be empty.
cs: Uživatelské jméno nemůže být prázdné.
de: Der Benutzername darf nicht leer sein.
es: El nombre de usuario no puede estar vacío.
fr: Le nom d'utilisateur ne peut pas être vide.
it: Il nome utente non può essere vuoto.
ja: ユーザー名を空にすることはできません。
ko: 사용자 이름은 비워 둘 수 없습니다.
pl: Nazwa użytkownika nie może być pusta.
pt_br: O nome de usuário não pode estar vazio.
ru: Имя пользователя не может быть пустым.
tr: Kullanıcı adı boş olamaz.
zh_hans: 用户名不能为空。
zh_hant: 使用者名稱不可為空白。

# ValueMustBeGreaterThanZero
source: The value of this argument must be greater than 0.
cs: Hodnota tohoto argumentu musí být větší než 0.
de: Der Wert dieses Arguments muss größer als 0 sein.
es: El valor de este argumento debe ser mayor que 0.
fr: La valeur de cet argument doit être supérieure à 0.
it: Il valore di questo argomento deve essere maggiore di 0.
ja: この引数の値は、正の値である必要があります。
ko: 이 인수의 값은 0보다 커야 합니다.
pl: Wartość tego argumentu musi być większa niż 0.
pt_br: O valor deste argumento deve ser maior que 0.
ru: Значение этого аргумента должно быть больше 0.
tr: Bu bağımsız değişkenin değeri 0'dan büyük olmalıdır.
zh_hans: 此参数的值必须大于 0。
zh_hant: 此引數的值必須大於 0。

# ValueMustBeInRange
source: The value of this argument must fall within the range {0} to {1}.
cs: Hodnota tohoto argumentu musí být v rozsahu od {0} do {1}.
de: Der Wert dieses Arguments muss zwischen {0} und {1} liegen.
es: El valor de este argumento debe estar comprendido entre {0} y {1}.
fr: La valeur de cet argument doit être comprise entre {0} et {1}.
it: Il valore di questo argomento deve essere compreso tra {0} e {1}.
ja: この引数の値は、{0} から {1} の範囲内である必要があります。
ko: 이 인수의 값은 {0} - {1} 범위에 속해야 합니다.
pl: Wartość tego argumentu musi należeć do zakresu od {0} do {1}.
pt_br: O valor deste argumento deve estar no intervalo de {0} a {1}.
ru: Значение этого аргумента должно попадать в интервал от {0} до {1}.
tr: Bu bağımsız değişkenin değeri {0} - {1} aralığında olmalıdır.
zh_hans: 此参数的值必须介于 {0} 至 {1} 的范围内。
zh_hant: 此引數的值必須介於 {0} 到 {1} 之間。

# ValueMustBeNonNegative
source: The value of this argument must be non-negative.
cs: Hodnota tohoto argumentu nesmí být záporná.
de: Der Wert dieses Arguments darf keine negative Zahl sein.
es: El valor de este argumento no puede ser negativo.
fr: La valeur de cet argument doit être non négative.
it: Il valore di questo argomento non deve essere negativo.
ja: この引数の値は、負ではない値である必要があります。
ko: 이 인수의 값은 음수가 아니어야 합니다.
pl: Wartość tego argumentu nie może być ujemna.
pt_br: O valor deste argumento não deve ser negativo.
ru: Значение этого аргумента должно быть неотрицательным.
tr: Bu bağımsız değişkenin değeri negatif olmamalıdır.
zh_hans: 此参数的值必须为非负。
zh_hant: 此引數的值必須是非負數。

# X509ChainBuildFail
source: The X.509 certificate {0} chain building failed. The certificate that was used has a trust chain that cannot be verified. Replace the certificate or change the certificateValidationMode. {1}
cs: Vytvoření řetězce certifikátu X.509 {0} se nezdařilo. Použitý certifikát má řetězec certifikátů, který nemůže být ověřen. Nahraďte certifikát, nebo změňte certificateValidationMode. {1}
de: Fehler beim Erstellen der X.509-Zertifikatkette {0}. Die Vertrauenskette des verwendeten Zertifikats kann nicht überprüft werden. Ersetzen Sie das Zertifikat, oder ändern Sie den certificateValidationMode. {1}
es: No se pudo compilar la cadena {0} de certificado X.509. El certificado empleado dispone de una cadena de confianza que no se puede comprobar. Reemplace el certificado o cambie el valor de certificateValidationMode. {1}
fr: Échec de génération de la chaîne du certificat X.509 {0}. Le certificat utilisé comporte une chaîne d'approbation impossible à vérifier. Remplacez le certificat ou changez certificateValidationMode. {1}
it: Non è stato possibile creare la catena {0} di certificati X.509. Il certificato usato include una catena di certificati non verificabile. Sostituire il certificato o modificare l'elemento certificateValidationMode. {1}
ja: X.509 証明書 {0} のチェーンを構築できませんでした。使用された証明書には、検証できない信頼チェーンがあります。証明書を交換するか certificateValidationMode を変更してください。{1}
ko: X.509 인증서 {0} 체인을 만들지 못했습니다. 사용한 인증서에 확인할 수 없는 신뢰 체인이 포함되어 있습니다. 인증서를 바꾸거나 certificateValidationMode를 변경하세요. {1}
pl: Nie można utworzyć łańcucha certyfikatu X.509 {0}. Używany certyfikat ma łańcuch zaufania, którego nie można zweryfikować. Zastąp certyfikat lub zmień tryb certificateValidationMode. {1}
pt_br: Falha na compilação da cadeia de certificado X.509 {0}. O certificado usado tem uma cadeia confiável que não pode ser verificada. Substitua o certificado ou altere o certificateValidationMode. {1}
ru: Ошибка при создании цепочки {0} сертификатов X.509. Использованный сертификат имеет цепочку доверия, которую невозможно проверить. Замените сертификат или измените значение certificateValidationMode. {1}
tr: X.509 sertifikası {0} zincir oluşturma işlemi başarısız oldu. Kullanılan sertifika doğrulanamayan bir güven zincirine sahip. Sertifikayı yenisiyle değiştirin veya certificateValidationMode'u değiştirin. {1}
zh_hans: X.509 证书 {0} 链生成失败。所使用的证书具有无法验证的信任链。请替换证书或更改 certificateValidationMode。{1}
zh_hant: 建置 X.509 憑證 {0} 鏈結失敗。所用憑證使用了無法驗證的信任鏈結。 請更換憑證或變更 certificateValidationMode。{1}

# XDCannotFindValueInDictionaryString
source: The '{0}' value is not found in the dictionary string.
cs: Hodnota {0} nebyla nalezena v řetězci slovníku.
de: Der Wert "{0}" wurde nicht in der Wörterbuchzeichenfolge gefunden.
es: No se encuentra el valor '{0}' en la cadena de diccionario.
fr: La valeur '{0}' est introuvable dans la chaîne de dictionnaire.
it: Il valore '{0}' non è stato trovato nella stringa del dizionario.
ja: 辞書の文字列に '{0}' という値が見つかりません。
ko: '{0}' 값이 사전 문자열에 없습니다.
pl: W ciągu słownika nie znaleziono wartości „{0}”.
pt_br: O valor '{0}' não foi encontrado na cadeia de caracteres de dicionário.
ru: Значение "{0}" не найдено в строке словаря.
tr: '{0}' değeri, sözlük dizesinde bulunamadı.
zh_hans: 未在字典字符串中找到“{0}”值。
zh_hant: 在字典字串中找不到 '{0}' 值。

# XmlBufferInInvalidState
source: An internal error has occurred. The XML buffer is not in the correct state to perform the operation.
cs: Došlo k vnitřní chybě. Vyrovnávací paměť XML není ve správném stavu k provedení operace.
de: Ein interner Fehler ist aufgetreten. Der XML-Puffer befindet sich nicht im richtigen Zustand zum Ausführen des Vorgangs.
es: Error interno. El búfer XML no se encuentra en el estado correcto para llevar a cabo la operación.
fr: Une erreur interne s'est produite. La mémoire tampon XML n'est pas dans l'état approprié pour effectuer l'opération.
it: Si è verificato un errore interno. Lo stato del buffer XML non è corretto per eseguire l'operazione.
ja: 内部エラーが発生しました。XML バッファーがこの操作を実行するための適切な状態にありません。
ko: 내부 오류가 발생했습니다. XML 버퍼가 올바른 상태가 아니므로 작업을 수행할 수 없습니다.
pl: Wystąpił błąd wewnętrzny. Stan buforu XML nie pozwala na wykonanie operacji.
pt_br: Erro interno. O buffer XML não está no estado correto para realizar a operação.
ru: Произошла внутренняя ошибка. XML-буфер не находится в нужном состоянии, чтобы выполнить эту операцию.
tr: Bir iç hata oluştu. XML arabelleği bu işlemi gerçekleştirmek için doğru durumda değil.
zh_hans: 发生内部错误。XML 缓冲区未处于正确状态，无法执行操作。
zh_hant: 發生內部錯誤。XML 緩衝區的狀態不正確，無法執行該作業。

# XmlBufferQuotaExceeded
source: The size necessary to buffer the XML content exceeded the buffer quota.
cs: Velikost nutná k uložení obsahu XML do vyrovnávací paměti překročila její kvótu.
de: Die erforderliche Größe zum Puffern der XML-Inhalte überschreitet das Pufferkontingent.
es: El tamaño necesario para almacenar en búfer el contenido XML superó la cuota del búfer.
fr: La taille nécessaire à la mise en mémoire tampon du contenu XML a dépassé le quota de mémoire tampon.
it: Le dimensioni necessarie per memorizzare il contenuto XML nel buffer superano la quota del buffer.
ja: XML コンテンツのバッファリングに必要なサイズがバッファー クォータを超過しました。
ko: XML 콘텐츠를 버퍼링하는 데 필요한 크기가 버퍼 할당량을 초과했습니다.
pl: Rozmiar wymagany do buforowania zawartości XML przekroczył limit przydziału buforu.
pt_br: O tamanho necessário para armazenar em buffer o conteúdo XML excedeu a cota do buffer.
ru: Размер, необходимый для размещения в буфере содержимого XML, превысил квоту буфера.
tr: XML içeriğini ara belleğe almak için gerekli olan boyut, ara bellek kotasını aştı.
zh_hans: 缓冲处理 XML 内容所需的大小超出了缓冲区配额。
zh_hant: 用以緩衝 XML 內容所需的大小超過緩衝區配額。

# XmlLangAttributeMissing
source: The required xml:lang attribute is missing.
cs: Požadovaný atribut xml:lang nebyl nalezen.
de: Das erforderliche xml:lang-Attribut fehlt.
es: Falta el atributo xml:lang necesario.
fr: L'attribut xml:lang obligatoire est manquant.
it: Manca l'attributo obbligatorio xml:lang.
ja: 必要な xml:lang 属性が見つかりません。
ko: 필요한 xml:lang 특성이 없습니다.
pl: Brak wymaganego atrybutu xml:lang.
pt_br: O atributo xml:lang necessário está ausente.
ru: Отсутствует обязательный атрибут xml:lang.
tr: Gerekli xml:lang özniteliği eksik.
zh_hans: 必需的属性 xml:lang 缺失。
zh_hant: 遺漏必要的 xml:lang 屬性。
