Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/*_IdentityModel.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ProvidedNetworkCredentialsForKerberosHasInvalidUserName
source: The NetworkCredentials provided for the Kerberos Token does not have a valid UserName.
cs: Přihlašovací údaje NetworkCredentials, které byly zadány pro token protokolu Kerberos, neobsahují platné jméno UserName.
de: Die für das Kerberos-Token angegebenen NetworkCredentials enthalten keinen gültigen UserName.
es: El elemento NetworkCredentials proporcionado para el token de Kerberos no tiene un nombre de usuario válido.
fr: Le NetworkCredentials fourni pour le jeton Kerberos n'a aucun UserName valide.
it: Nelle credenziali di rete specificate per il token Kerberos non è presente un nome utente valido.
ja: Kerberos トークンに指定された NetworkCredentials に有効な UserName がありません。
ko: Kerberos 토큰에 제공된 NetworkCredentials에 유효한 UserName이 없습니다.
pl: Element NetworkCredentials podany dla tokenu protokołu Kerberos nie zawiera prawidłowej nazwy użytkownika.
pt_br: As NetworkCredentials fornecidas para o Token Kerberos não tem um UserName válido.
ru: Учетные данные NetworkCredentials, предоставленные для маркера Kerberos, не содержат допустимое имя пользователя.
tr: Kerberos Belirteci için sağlanan NetworkCredentials geçerli bir UserName değerine sahip değil.
zh_hans: 为 Kerberos 令牌提供的 NetworkCredentials 没有有效的用户名。
zh_hant: 為 Kerberos 權杖提供的 NetworkCredentials 未具備有效的 UserName。

# ReferenceListCannotBeEmpty
source: The ReferenceList element must have at least one DataReference or KeyReference.
cs: Element ReferenceList musí mít alespoň jeden odkaz DataReference nebo KeyReference.
de: Das ReferenceList-Element muss mindestens einen DataReference oder KeyReference enthalten.
es: El elemento ReferenceList debe tener al menos un valor de DataReference o KeyReference.
fr: L'élément ReferenceList doit avoir au moins un DataReference ou KeyReference.
it: L'elemento ReferenceList deve contenere almeno un elemento DataReference o KeyReference.
ja: ReferenceList 要素には、DataReference または KeyReference が少なくとも 1 つ必要です。
ko: ReferenceList 요소에는 DataReference 또는 KeyReference가 하나 이상 있어야 합니다.
pl: Element ReferenceList musi mieć co najmniej jeden element DataReference lub KeyReference.
pt_br: O elemento ReferenceList deve ter pelo menos uma DataReference ou KeyReference.
ru: Элемент ReferenceList должен содержать хотя бы один элемент DataReference или KeyReference.
tr: ReferenceList öğesinin en az bir DataReference ya da KeyReference öğesi olmalıdır.
zh_hans: ReferenceList 元素必须至少具有一个 DataReference 或 KeyReference。
zh_hant: ReferenceList 元素至少必須有一個 DataReference 或 KeyReference。

# RequiredAttributeMissing
source: Attribute '{0}' is required on element '{1}'.
cs: V elementu {1} je vyžadován atribut {0}.
de: Das Attribut "{0}" ist für das Element "{1}" erforderlich.
es: El elemento "{1}" requiere el atributo "{0}".
fr: L'attribut '{0}' est obligatoire sur l'élément '{1}'.
it: L'attributo '{0}' è obbligatorio nell'elemento '{1}'.
ja: 要素 '{1}' には属性 '{0}' が必要です。
ko: '{0}' 특성이 '{1}' 요소에서 필요합니다.
pl: Atrybut „{0}” jest wymagany w elemencie „{1}”.
pt_br: O atributo '{0}' é necessário no elemento '{1}'.
ru: Атрибут "{0}" обязателен для элемента "{1}".
tr: '{1}' öğesinde '{0}' özniteliği gerekiyor.
zh_hans: 元素“{1}”上需要特性“{0}”。
zh_hant: 元素 '{1}' 上需要屬性 '{0}'。

# SAMLAssertionIDIsInvalid
source: The 'assertionId' '{0}' for a SamlAssertion must start with a letter or '_'.
cs: Identifikátor assertionId {0} pro SamlAssertion musí začínat písmenem nebo znakem _.
de: Die assertionId "{0}" für eine SamlAssertion muss mit einem Buchstaben oder "_" beginnen.
es: El identificador 'assertionId' '{0}' de un elemento SamlAssertion debe empezar con una letra o '_'.
fr: Le 'assertionId' '{0}' de SamlAssertion doit commencer par une lettre ou par '_'.
it: L'elemento 'assertionId' '{0}' per SamlAssertion deve iniziare con una lettera o con il carattere di sottolineatura ('_').
ja: SamlAssertion の 'assertionId' '{0}' は、文字または '_' で始まる必要があります。
ko: SamlAssertion의 'assertionId' '{0}'은(는) 문자나 '_'로 시작해야 합니다.
pl: Element „assertionId” „{0}” dla elementu SamlAssertion musi zaczynać się od litery lub znaku „_”.
pt_br: A 'assertionId' '{0}' de uma SamlAssertion deve começar com uma letra ou com '_'.
ru: assertionId "{0}" для элемента SamlAssertion должен начинаться с буквы или "_".
tr: Bir SamlAssertion'ın '{0}' 'assertionId'si bir harfle ya da '_' ile başlamalıdır.
zh_hans: SamlAssertion 的 "assertionId"“{0}”必须以字母或 "_" 开头。
zh_hant: SamlAssertion 的 'assertionId' '{0}' 必須以字母或 '_' 開頭。

# SAMLAssertionIdRequired
source: The 'assertionId' for a SamlAssertion can not be null or empty.
cs: Identifikátor assertionId pro SamlAssertion nemůže být null ani prázdný.
de: Die "assertionId" für eine SamlAssertion kann nicht NULL oder leer sein.
es: El identificador 'assertionId' de un elemento SamlAssertion no puede ser nulo ni estar vacío.
fr: Le 'assertionId' de SamlAssertion ne peut pas avoir une valeur null ou être vide.
it: L'elemento 'assertionId' per SamlAssertion non può essere Null o vuoto.
ja: SamlAssertion の 'assertionId' は、null や空にはできません。
ko: SamlAssertion의 'assertionId'는 null이거나 비어 있을 수 없습니다.
pl: Element „assertionId” dla elementu SamlAssertion nie może mieć wartości null ani być pusty.
pt_br: A 'assertionId' de uma SamlAssertion não pode ser nula nem estar vazia.
ru: assertionId для элемента SamlAssertion не может быть пустым или иметь значение null.
tr: Bir SamlAssertion'ın 'assertionId'si null veya boş olamaz.
zh_hans: SamlAssertion 的 "assertionId" 不能为 null 或为空。
zh_hant: SamlAssertion 的 'assertionId' 不可為 Null 或空白。

# SAMLAssertionIssuerRequired
source: The 'Issuer' specified for a SamlAssertion cannot be null or empty.
cs: Hodnota Issuer zadaná pro SamlAssertion nemůže být null ani prázdná.
de: Der für eine SamlAssertion angegebene "Issuer" kann nicht NULL oder leer sein.
es: El elemento 'Issuer' especificado para la aserción SamlAssertion no puede ser nulo ni estar vacío.
fr: Le 'Issuer' spécifié pour SamlAssertion ne peut pas avoir une valeur null ou être vide.
it: L'elemento 'Issuer' specificato per un elemento SamlAssertion non può essere Null o vuoto.
ja: SamlAssertion に対して指定された 'Issuer' は、null や空にはできません。
ko: SamlAssertion에 대해 지정된 'Issuer'는 null이거나 비어 있을 수 없습니다.
pl: Element „Issuer” określony dla elementu SamlAssertion nie może mieć wartości null ani być pusty.
pt_br: O 'Emissor' especificado para uma SamlAssertion não pode ser nulo nem estar vazio.
ru: Элемент Issuer, указанный для SamlAssertion, не может быть пустым или иметь значение null.
tr: SamlAssertion için belirtilen 'Issuer' değeri null ya da boş olamaz.
zh_hans: 为 SamlAssertion 指定的 "Issuer" 不能为 null 或为空。
zh_hant: 為 SamlAssertion 指定的 'Issuer' 不可為 Null 或空白。

# SAMLAssertionMissingIssuerAttributeOnRead
source: The 'Issuer' for the SamlAssertion being read is missing or is of length 0.
cs: Čtená hodnota Issuer pro SamlAssertion chybí nebo její délka je 0.
de: Der "Issuer" für die gelesene SamlAssertion fehlt oder hat eine Länge von 0.
es: Falta el elemento 'Issuer' de la aserción SamlAssertion que se está leyendo o su longitud es 0.
fr: Le 'Issuer' du SamlAssertion lu est manquant, ou sa longueur est égale à 0.
it: Manca l'elemento 'Issuer' per l'elemento SamlAssertion da leggere oppure la lunghezza è pari a 0.
ja: 読み取り中の SamlAssertion の 'Issuer' が指定されていないか長さが 0 です。
ko: 읽는 중인 SamlAssertion의 'Issuer'가 없거나 길이가 0입니다.
pl: Brak elementu „Issuer” dla odczytywanego elementu SamlAssertion lub ma on długość 0.
pt_br: O 'Emissor' da SamlAssertion lida está ausente ou tem comprimento 0.
ru: Элемент Issuer для считываемого элемента SamlAssertion отсутствует или имеет нулевую длину.
tr: Okunan SamlAssertion için 'Issuer' değeri eksik ya da 0 uzunluğunda.
zh_hans: 正在读取的 SamlAssertion 的 "Issuer" 缺失或其长度为 0。
zh_hant: 遺漏所讀取之 SamlAssertion 的 'Issuer'，或長度為 0。

# SAMLAssertionMissingMajorVersionAttributeOnRead
source: The MajorVersion for the SamAssertion being read is missing or is of length 0.
cs: Čtená hodnota MajorVersion pro SamlAssertion chybí nebo její délka je 0.
de: Die MajorVersion für die gelesene SamlAssertion fehlt oder hat eine Länge von 0.
es: Falta el elemento MajorVersion de la aserción SamAssertion que se está leyendo o su longitud es 0.
fr: Le MajorVersion du SamAssertion lu est manquant, ou sa longueur est égale à 0.
it: Manca l'elemento MajorVersion per l'elemento SamAssertion da leggere oppure la lunghezza è pari a 0.
ja: 読み取り中の SamAssertion の MajorVersion が指定されていないか長さが 0 です。
ko: 읽는 중인 SamAssertion의 MajorVersion이 없거나 길이가 0입니다.
pl: Brak elementu MajorVersion dla odczytywanego elementu SamAssertion lub ma on długość 0.
pt_br: A MajorVersion da SamAssertion lida está ausente ou tem comprimento 0.
ru: Элемент MajorVersion для считываемого элемента SamlAssertion отсутствует или имеет нулевую длину.
tr: Okunan SamAssertion için MajorVersion değeri eksik ya da 0 uzunluğunda.
zh_hans: 正在读取的 SamAssertion 的 MajorVersion 缺失或其长度为 0。
zh_hant: 遺漏所讀取之 SamAssertion 的 MajorVersion，或長度為 0。

# SAMLAssertionMissingMinorVersionAttributeOnRead
source: TheMinorVersion for the SamlAssertion being read is missing or is of length 0.
cs: Čtená hodnota MinorVersion pro SamlAssertion chybí nebo její délka je 0.
de: Die MinorVersion für die gelesene SamlAssertion fehlt oder hat eine Länge von 0.
es: Falta el elemento MinorVersion de la aserción SamlAssertion que se está leyendo o su longitud es 0.
fr: Le MinorVersion du SamlAssertion lu est manquant, ou sa longueur est égale à 0.
it: Manca l'elemento MinorVersion per l'elemento SamlAssertion da leggere oppure la lunghezza è pari a 0.
ja: 読み取り中の SamlAssertion の MinorVersion が指定されていないか長さが 0 です。
ko: 읽는 중인 SamlAssertion의 MinorVersion이 없거나 길이가 0입니다.
pl: Brak elementu MinorVersion dla odczytywanego elementu SamlAssertion lub ma on długość 0.
pt_br: A MinorVersion da SamlAssertion lida está ausente ou tem comprimento 0.
ru: Элемент MinorVersion для считываемого элемента SamlAssertion отсутствует или имеет нулевую длину.
tr: Okunan SamlAssertion için MinorVersion değeri eksik ya da 0 uzunluğunda.
zh_hans: 正在读取的 SamlAssertion 的 MinorVersion 缺失或其长度为 0。
zh_hant: 遺漏所讀取之 SamlAssertion 的 MinorVersion，或長度為 0。

# SAMLAssertionRequireOneStatement
source: A SamlAssertion requires at least one statement. Ensure that you have added at least one SamlStatement to the SamlAssertion you are creating.
cs: SamlAssertion vyžaduje alespoň jeden příkaz. Ujistěte se, že jste do výrazu SamlAssertion, který vytváříte, přidali alespoň jeden příkaz SamlStatement.
de: Die SamlAssertion erfordert mindestens eine Anweisung. Stellen Sie sicher, dass Sie der erstellten SamlAssertion mindestens eine SamlStatement hinzugefügt haben.
es: El elemento SamlAssertion requiere como mínimo una instrucción. Asegúrese de agregar al menos una instrucción SamlStatement al elemento SamlAssertion que está creando.
fr: SamlAssertion nécessite au moins une instruction. Vérifiez que vous avez ajouté au moins un SamlStatement au SamlAssertion que vous créez.
it: Con un elemento SamlAssertion è richiesta almeno un'istruzione. Assicurarsi di aver aggiunto almeno un elemento SamlStatement all'elemento SamlAssertion da creare.
ja: SamlAssertion には少なくとも 1 つのステートメントが必要です。作成する SamlAssertion に少なくとも 1 つの SamlStatement を追加済みであることをご確認ください。
ko: SamlAssertion에는 문이 하나 이상 필요합니다. 만들려는 SamlAssertion에 SamlStatement를 하나 이상 추가했는지 확인하세요.
pl: Element SamlAssertion wymaga co najmniej jednej instrukcji. Upewnij się, że do tworzonego elementu SamlAssertion został dodany co najmniej jeden element SamlStatement.
pt_br: Uma SamlAssertion exige pelo menos uma instrução. Verifique se você adicionou pelo menos uma SamlStatement à SamlAssertion que está sendo criada.
ru: SamlAssertion должен содержать хотя бы один элемент Statement. Добавьте по крайней мере один SamlStatement в создаваемый элемент SamlAssertion.
tr: SamlAssertion en az bir deyim gerektirir. Oluşturmakta olduğunuz SamlAssertion'a en az bir SamlStatement eklediğinizden emin olun.
zh_hans: 一个 SamlAssertion 至少需要一个语句。请确保已向正在创建的 SamlAssertion 添加了至少一个 SamlStatement。
zh_hant: SamlAssertion 至少需要一個陳述式。請確定已為您建立的 SamlAssertion 至少新增了一個 SamlStatement。

# SAMLAssertionRequireOneStatementOnRead
source: The SamlAssertion being read did not contain any SamlStatement. A SamlAssertion must contain at least one SamlStatement.
cs: Čtený výraz SamlAssertion neobsahuje žádný příkaz SamlStatement. SamlAssertion musí obsahovat alespoň jeden výraz SamlStatement.
de: Die gelesene SamlAssertion enthielt keine SamlStatement. Eine SamlAssertion muss mindestens eine SamlStatement enthalten.
es: El elemento SamlAssertion que se está leyendo no contiene ninguna declaración SamlStatement. Los elementos SamlAssertion deben contener como mínimo una declaración SamlStatement.
fr: Le SamlAssertion lu ne contient aucun SamlStatement. SamlAssertion doit contenir au moins un SamlStatement.
it: L'elemento SamlAssertion da leggere non contiene alcun elemento SamlStatement. Un elemento SamlAssertion deve contenere almeno un elemento SamlStatement.
ja: 読み取り中の SamlAssertion に SamlStatement がありませんでした。SamlAssertion には 1 つ以上の SamlStatement が含まれている必要があります。
ko: 읽는 중인 SamlAssertion에 SamlStatement가 없습니다. SamlAssertion에 SamlStatement가 하나 이상 포함되어 있어야 합니다.
pl: Odczytywany element SamlAssertion nie zawiera żadnego elementu SamlStatement. Element SamlAssertion musi zawierać co najmniej jeden element SamlStatement.
pt_br: A SamlAssertion lida não continha nenhuma SamlStatement. Uma SamlAssertion deve conter pelo menos uma SamlStatement.
ru: Считываемый элемент SamlAssertion не содержит SamlStatement. SamlAssertion должен содержать хотя бы один SamlStatement.
tr: Okunan SamlAssertion hiç SamlStatement içermiyordu. Bir SamlAssertion en az bir SamlStatement içermelidir.
zh_hans: 正在读取的 SamlAssertion 不包含任何 SamlStatement。一个 SamlAssertion 必须包含至少一个 SamlStatement。
zh_hant: 所讀取的 SamlAssertion 並未包含任何 SamlStatement。SamlAssertion 至少必須包含一個 SamlStatement。

# SAMLElementNotRecognized
source: The {0} element is not supported.
cs: Element {0} není podporován.
de: Das {0}-Element wird nicht unterstützt.
es: El elemento "{0}" no es compatible.
fr: L'élément {0} n'est pas pris en charge.
it: L'elemento {0} non è supportato.
ja: 要素 {0} はサポートされていません。
ko: {0} 요소는 지원되지 않습니다.
pl: Element {0} nie jest obsługiwany.
pt_br: Não há suporte para o elemento {0}.
ru: Элемент "{0}" не поддерживается.
tr: {0} öğesi desteklenmiyor.
zh_hans: 不支持“{0}”元素。
zh_hant: 不支援 {0} 元素。

# SAMLEntityCannotBeNullOrEmpty
source: The SamlAssertion entity {0} cannot be null or empty.
cs: Entita SamlAssertion {0} nemůže být null ani prázdná.
de: Die SamlAssertion-Entität {0} darf nicht NULL oder leer sein.
es: La entidad SamlAssertion {0} no puede ser nula ni estar vacía.
fr: L'entité SamlAssertion {0} ne peut pas avoir une valeur null ou être vide.
it: L'entità {0} di SamlAssertion non può essere Null o vuota.
ja: SamlAssertion エンティティ {0} は null や空にできません。
ko: SamlAssertion 엔터티 {0}은(는) null이거나 비어 있을 수 없습니다.
pl: Jednostka SamlAssertion {0} nie może mieć wartości null ani być pusta.
pt_br: A entidade SamlAssertion {0} não pode ser nula nem estar vazia.
ru: Сущность SamlAssertion {0} не может быть пустой или равной NULL.
tr: SamlAssertion varlığı {0} null veya boş olamaz.
zh_hans: SamlAssertion 实体 {0} 不能为 null 或为空。
zh_hant: SamlAssertion 實體 {0} 不可為 null 或空白。

# SAMLSignatureAlreadyRead
source: The signature is already read in the SamlAssertion.
cs: Podpis už byl ve výrazu SamlAssertion přečten.
de: Die Signatur wurde bereits in der SamlAssertion gelesen.
es: La signatura ya está en el elemento SamlAssertion.
fr: La signature est déjà lue dans SamlAssertion.
it: La firma è già stata letta nell'elemento SamlAssertion.
ja: この署名は既に SamlAssertion に読み込まれています。
ko: SamlAssertion에서 시그니처를 이미 읽었습니다.
pl: Podpis został już odczytany w elemencie SamlAssertion.
pt_br: A assinatura já foi lida na SamlAssertion.
ru: Сигнатура уже считана в SamlAssertion.
tr: İmza zaten SamlAssertion içinde okunmuş.
zh_hans: 已读取 SamlAssertion 中的签名。
zh_hant: 已在 SamlAssertion 中讀取簽章。

# SAMLTokenNotSerialized
source: The SamlAssertion could not be serialized to XML. Please see inner exception for details.
cs: Výraz SamlAssertion nebylo možné serializovat na kód XML. Podrobnosti naleznete ve vnitřní výjimce.
de: Die SamlAssertion konnte nicht zu XML serialisiert werden. Weitere Informationen finden Sie in der inneren Ausnahme.
es: El elemento SamlAssertion no se pudo serializar como XML. Consulte la excepción interna para obtener más información.
fr: Impossible de sérialiser SamlAssertion en XML. Pour plus d'informations, consultez l'exception interne.
it: Non è stato possibile serializzare l'elemento SamlAssertion in XML. Per dettagli, vedere l'eccezione interna.
ja: SamlAssertion を XML にシリアル化できませんでした。詳細については、内部例外を参照してください。
ko: SamlAssertion을 XML로 직렬화할 수 없습니다. 자세한 내용은 내부 예외를 참조하세요.
pl: Elementu SamlAssertion nie można serializować do obiektu XML. Szczegóły można znaleźć w wyjątku wewnętrznym.
pt_br: Não foi possível serializar a SamlAssertion para XML. Veja a exceção interna para obter detalhes.
ru: SamlAssertion не удалось сериализовать в XML. Подробнее см. в описании внутреннего исключения.
tr: SamlAssertion, XML'ye serileştirilemedi. Ayrıntılar için lütfen iç özel duruma bakın.
zh_hans: SamlAssertion 无法序列化为 XML。有关详细信息，请参见内部异常。
zh_hant: SamlAssertion 無法序列化為 XML。請參閱內部例外狀況，以取得詳細資料。

# SAMLTokenVersionNotSupported
source: The major version {0} and minor version {1} are not supported. Versions supported are: Major {2} and Minor {3}.
cs: Hlavní verze {0} a podverze {1} nejsou podporovány. Podporované verze jsou: hlavní verze {2}, podverze {3}
de: Die angegebene Hauptversion {0} und Nebenversion {1} werden nicht unterstützt. Folgende Versionen werden unterstützt: Hauptversion {2} und Nebenversion {3}.
es: No se admiten la versión principal {0} y la versión secundaria {1}. Las versiones admitidas son la versión principal {2} y la versión secundaria {3}.
fr: La version principale {0} et la version mineure {1} ne sont pas prises en charge. Les versions prises en charge sont la version principale {2} et la version mineure {3}.
it: La versione principale {0} e la versione secondaria {1} non sono supportate. Le versioni supportate sono: versione principale {2} e versione secondaria {3}.
ja: メジャー バージョン {0} とマイナー バージョン {1} はサポートされていません。サポートされているバージョンは、メジャー {2} およびマイナー {3} です。
ko: 주 버전 {0} 및 부 버전 {1}은(는) 지원되지 않습니다. 지원되는 버전은 주 버전 {2} 및 부 버전 {3}입니다.
pl: Wersja główna {0} i wersja pomocnicza {1} nie są obsługiwane. Obsługiwane wersje to: główna {2} i pomocnicza {3}.
pt_br: Não há suporte para a versão principal {0} nem para a versão secundária {1}. As versões com suporte são: Principal {2} e Secundária {3}.
ru: Основной номер версии {0} и дополнительный номер версии {1} не поддерживаются. Поддерживаемые версии: основная {2} и дополнительная {3}.
tr: Ana sürüm {0} ve ara sürüm {1} desteklenmiyor. Desteklenen sürümler: Major {2} ve Minor {3}.
zh_hans: 不支持主版本 {0} 和次版本 {1}。支持的版本有: 主版本 {2} 和次版本 {3}。
zh_hant: 不支援主要版本 {0} 及次要版本 {1}。支援的版本為: 主要 {2} 及次要 {3}。

# SAMLUnableToLoadAdvice
source: Failed to load the <saml:advice> element.
cs: Nebylo možné načíst element <saml:advice>.
de: Fehler beim Laden des <saml:advice>-Elements.
es: No se pudo cargar el elemento <saml:advice>.
fr: Échec du chargement de l'élément <saml:advice>.
it: Non è stato possibile caricare l'elemento <saml:advice>.
ja: <saml:advice> 要素を読み込むことができませんでした。
ko: <saml:advice> 요소를 로드하지 못했습니다.
pl: Nie udało się załadować elementu <saml:advice>.
pt_br: Falha ao carregar o elemento <saml:advice>.
ru: Не удалось загрузить элемент <saml:advice>.
tr: <saml:advice> öğesi yüklenemedi.
zh_hans: 未能加载 <saml:advice> 元素。
zh_hant: 無法載入 <saml:advice> 元素。

# SAMLUnableToLoadAssertion
source: The <saml:assertion> element failed to load.
cs: Element <saml:assertion> nebylo možné načíst.
de: Fehler beim Laden des <saml:assertion>-Elements.
es: No se pudo cargar el elemento <saml:assertion>.
fr: Échec du chargement de l'élément <saml:assertion>.
it: Non è stato possibile caricare l'elemento <saml:assertion>.
ja: <saml:assertion> 要素を読み込むことができませんでした。
ko: <saml:assertion> 요소를 로드하지 못했습니다.
pl: Nie udało się załadować elementu <saml:assertion>.
pt_br: Falha ao carregar o elemento <saml:assertion>.
ru: Не удалось загрузить элемент <saml:assertion>.
tr: <saml:assertion> öğesi yüklenemedi.
zh_hans: 未能加载 <saml:assertion> 元素。
zh_hant: 無法載入 <saml:assertion> 元素。

# SAMLUnableToLoadCondtion
source: The <saml:conditions> element failed to load.
cs: Element <saml:conditions> nebylo možné načíst.
de: Fehler beim Laden des <saml:conditions>-Elements.
es: No se pudo cargar el elemento <saml:conditions>.
fr: Échec du chargement de l'élément <saml:conditions>.
it: Non è stato possibile caricare l'elemento <saml:conditions>.
ja: <saml:conditions> 要素を読み込むことができませんでした。
ko: <saml:conditions> 요소를 로드하지 못했습니다.
pl: Nie udało się załadować elementu <saml:conditions>.
pt_br: Falha ao carregar o elemento <saml:conditions>.
ru: Не удалось загрузить элемент <saml:conditions>.
tr: <saml:conditions> öğesi yüklenemedi.
zh_hans: 未能加载 <saml:conditions> 元素。
zh_hant: 無法載入 <saml:conditions> 元素。

# SAMLUnableToLoadCondtions
source: The <saml:conditions> element failed to load.
cs: Element <saml:conditions> nebylo možné načíst.
de: Fehler beim Laden des <saml:conditions>-Elements.
es: No se pudo cargar el elemento <saml:conditions>.
fr: Échec du chargement de l'élément <saml:conditions>.
it: Non è stato possibile caricare l'elemento <saml:conditions>.
ja: <saml:conditions> 要素を読み込むことができませんでした。
ko: <saml:conditions> 요소를 로드하지 못했습니다.
pl: Nie udało się załadować elementu <saml:conditions>.
pt_br: Falha ao carregar o elemento <saml:conditions>.
ru: Не удалось загрузить элемент <saml:conditions>.
tr: <saml:conditions> öğesi yüklenemedi.
zh_hans: 未能加载 <saml:conditions> 元素。
zh_hant: 無法載入 <saml:conditions> 元素。

# SAMLUnableToLoadStatement
source: Failed to load a SamlStatement.
cs: Nebylo možné načíst SamlStatement.
de: Fehler beim Laden einer SamlStatement.
es: No se pudo cargar un elemento SamlStatement.
fr: Échec du chargement de SamlStatement.
it: Non è stato possibile caricare un elemento SamlStatement.
ja: SamlStatement を読み込むことができませんでした。
ko: SamlStatement를 로드하지 못했습니다.
pl: Nie udało się załadować elementu SamlStatement.
pt_br: Falha ao carregar o elemento uma SamlStatement.
ru: Не удалось загрузить SamlStatement.
tr: Bir SamlStatement yüklenemedi.
zh_hans: 未能加载 SamlStatement。
zh_hant: 無法載入 SamlStatement。
