Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# ClientCredentialsUnableToCreateLocalTokenProvider
source: ClientCredentials cannot create a local token provider for token requirement {0}.
ru: ClientCredentials не может создать локального поставщика маркеров для требования к маркеру {0}.

# ClientRuntimeRequiresFormatter0
source: The ClientOperation '{0}' requires Formatter, since SerializeRequest and DeserializeReply are not both false.
ru: Для ClientOperation "{0}" требуется Formatter, так как параметры SerializeRequest и DeserializeReply не имеют одновременно значение false.

# ClientWebSocketFactory_CreateWebSocketFailed
source: An error occurred when creating the WebSocket with the factory of type '{0}'. See the inner exception for details.
ru: Произошла ошибка при создании соединения WebSocket с фабрикой типа "{0}". Подробные сведения см. в описании внутреннего исключения.

# ClientWebSocketFactory_InvalidSubProtocol
source: The WebSocket returned by the factory of type '{0}' has the SubProtocol '{1}' that doesn't match the requested SubProtocol value '{2}'.
ru: Соединение WebSocket, возвращенное фабрикой типа "{0}", имеет подпротокол "{1}", который не согласуется с требуемым значением SubProtocol "{2}".

# ClientWebSocketFactory_InvalidWebSocket
source: WebSocket creation failed. The '{0}' returned a WebSocket that is either null or not opened.
ru: Сбой создания WebSocket. Из "{0}" возвращено подключение WebSocket, которое имеет значение NULL или не открыто.

# CloneNotImplementedCorrectly
source: Clone() was not implemented properly by '{0}'. The cloned object was '{1}'.
ru: Clone() не был правильно реализован методом "{0}". Клонированным объектом был "{1}".

# CloseTimedOut
source: Close timed out after {0}. Increase the timeout value passed to the call to Close or increase the CloseTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: Истекло время ожидания закрытия после {0}. Увеличьте значение времени ожидания, передаваемое вызову для закрытия, или увеличьте значение CloseTimeout привязки. Время, выделенное для выполнения этой операции, может быть частью более длительного времени ожидания.

# CommunicationObjectAborted1
source: The communication object, {0}, cannot be used for communication because it has been Aborted.
ru: Объект связи {0} нельзя использовать для связи, так как его работа прервана.

# CommunicationObjectBaseClassMethodNotCalled
source: The communication object, {0}, has overridden the virtual function {1} but it does not call version defined in the base class.
ru: Объект связи {0} переопределил виртуальную функцию {1}, однако не вызвал версию, заданную в базовом классе.

# CommunicationObjectCannotBeModified
source: The communication object, {0}, cannot be modified unless it is in the Created state.
ru: Объект связи {0} можно изменять только в состоянии Created.

# CommunicationObjectCannotBeModifiedInState
source: The communication object, {0}, cannot be modified while it is in the {1} state.
ru: Объект связи {0} в состоянии {1} изменить нельзя.

# CommunicationObjectCannotBeUsed
source: The communication object, {0}, is in the {1} state. Communication objects cannot be used for communication unless they are in the Opened state.
ru: Объект связи {0} находится в состоянии {1}. Объекты связи можно использовать для связи только в состоянии Opened.

# CommunicationObjectFaulted1
source: The communication object, {0}, cannot be used for communication because it is in the Faulted state.
ru: Объект связи {0} нельзя использовать для связи, так как он находится в состоянии Faulted.

# CommunicationObjectInInvalidState
source: The communication object, {0}, is not part of WCF and is in an unsupported state '{1}'. This indicates an internal error in the implementation of that communication object.
ru: Объект связи {0} не является частью WCF и находится в неподдерживаемом состоянии "{1}". Это указывает на внутреннюю ошибку при реализации данного объекта связи.

# ConfigInvalidBindingConfigurationName
source: The {1} binding does not have a configured binding named '{0}'.
ru: В привязке {1} отсутствует настроенная привязка с именем "{0}".

# ConfigInvalidTransactionFlowProtocolValue
source: '{0}' is not a valid transaction protocol. Valid values are 'OleTransactions', 'WSAtomicTransactionOctober2004', and 'WSAtomicTransaction11'.
ru: "{0}" не является допустимым протоколом транзакций. Допустимые значения: OleTransactions, WSAtomicTransactionOctober2004 и WSAtomicTransaction11.

# ConfigurationFilesNotSupported
source: Configuration files are not supported.
ru: Файлы конфигурации не поддерживаются.

# ConfigurationSchemaContainsX509IssuerSerialReference
source: The wsdl schema that was used to create this configuration file contained a 'RequireIssuerSerialReference' assertion for a X509Token. This can not be represented in configuration, you will need to programatically adjust the appropriate X509SecurityTokenParameters.X509KeyIdentifierClauseType to X509KeyIdentifierClauseType.IssuerSerial. The default of X509KeyIdentifierClauseType.Thumbprint will be used, which may cause interop issues.
ru: Схема wsdl, использованная для создания этого файла конфигурации, содержит утверждение RequireIssuerSerialReference для маркера X509Token. Это не будет отображено в конфигурации, необходимо настроить соответствующее перечисление X509SecurityTokenParameters.X509KeyIdentifierClauseType для члена X509KeyIdentifierClauseType.IssuerSerial программным путем. Будет использовано значение по умолчанию для члена X509KeyIdentifierClauseType.Thumbprint, что может привести к проблемам взаимодействия.

# ConfigurationSchemaInsuffientForSecurityBindingElementInstance
source: The configuration schema is insufficient to describe the non-standard configuration of the following security binding element:
ru: Схема конфигурации недостаточна для описания нестандартной конфигурации следующего элемента привязки безопасности:

# ContentTypeMismatch
source: Content Type {0} was sent to a service expecting {1}. The client and service bindings may be mismatched.
ru: Тип Content Type {0} был отправлен службе, ожидающей {1}. Возможно несоответствие привязок клиента и службы.

# ContextBindingElementCannotProvideChannelFactory
source: ContextBindingElement cannot provide channel factory for the requested channel shape {0}.
ru: ContextBindingElement не может предоставить фабрику канала для запрошенной формы {0} канала.

# ContextBindingElementCannotProvideChannelListener
source: ContextBindingElement cannot provide channel listener for the requested channel shape {0}.
ru: ContextBindingElement не может предоставить прослушиватель канала для запрошенной формы {0} канала.

# ContractIsNotSelfConsistentItHasOneOrMore2
source: The contract '{0}' is not self-consistent -- it has one or more IsTerminating or non-IsInitiating operations, but it does not have the SessionMode property set to SessionMode.Required. The IsInitiating and IsTerminating attributes can only be used in the context of a session.
ru: Контракт "{0}" не является самосогласованным: он имеет одну или несколько операций IsTerminating или non-IsInitiating, однако свойству SessionMode не задано SessionMode.Required. Атрибуты IsInitiating и IsTerminating можно использовать только в контексте сеанса.

# ContractIsNotSelfConsistentWhenIsSessionOpenNotificationEnabled
source: The operation contract '{0}' is not self-consistent. When the '{1}' is set to '{2}', both '{3}' and '{4}' properties must be true, and the operation must not have any input parameters.
ru: Контракт операции "{0}" не является согласованным. Когда "{1}" задается значение "{2}", свойства "{3}" и "{4}" должны иметь значение true, а у операции не должно быть никаких входных параметров.

# CopyHttpHeaderFailed
source: Failed to copy the HTTP header '{0}' with value '{1}' to '{2}'.
ru: Не удалось скопировать заголовок HTTP "{0}" со значением "{1}" в "{2}".

# CouldNotFindNamespaceForPrefix
source: There is no namespace binding for prefix '{0}' in scope.
ru: Отсутствует привязка пространства имен для префикса "{0}" в области.

# CouldnTCreateChannelForChannelType2
source: Channel type '{1}' was requested, but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Тип канала "{1}" был зарегистрирован, однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# CouldnTCreateChannelForType2
source: Channel requirements cannot be met by the ChannelFactory for Binding '{0}' since the contract requires support for one of these channel types '{1}' but the binding doesn't support any of them.
ru: ChannelFactory для привязки "{0}" не может удовлетворить требования к каналу, так как данный контракт требует поддержки одного из этих типов канала "{1}", но привязка не поддерживает ни один из них.

# CreationTimeUtcIsAfterExpiryTime
source: Creation time must be before expiration time.
ru: Время создания должно быть раньше времени истечения срока.

# CredentialDisallowsNtlm
source: The NTLM authentication scheme was specified, but the target credential does not allow NTLM.
ru: Указана схема аутентификации NTLM, однако учетные данные для целевого объекта не разрешают NTLM.

# CustomBindingRequiresTransport
source: Binding '{0}' lacks a TransportBindingElement. Every binding must have a binding element that derives from TransportBindingElement. This binding element must appear last in the BindingElementCollection.
ru: В привязке "{0}" отсутствует элемент TransportBindingElement. Каждая привязка должна содержать элемент привязки, производный от TransportBindingElement. Этот элемент привязки указывается последним в коллекции BindingElementCollection.

source: (Default)
ru: (По умолчанию)

# DelegatingHandlerArrayFromFuncContainsNullItem
source: The '{0}' list created by the Func '{1}' is invalid because it contains one or more null items.
ru: Список "{0}", созданный функцией "{1}", недопустим, поскольку он содержит один или несколько элементов со значением null.

# DelegatingHandlerArrayHasNonNullInnerHandler
source: The '{0}' list is invalid because the property '{1}' of '{2}' is not null.
ru: Список "{0}" недопустим, поскольку свойство "{1}" для "{2}" содержит значение, отличное от NULL.

# DeliveryAssuranceRequired
source: The WS-RM policy under the namespace {0} requires the wsrmp:ExactlyOnce, wsrmp:AtLeastOnce, or wsrmp:AtMostOnce assertion. The {1} element under the {2} namespace was found.
ru: Для политики WS-RM под пространством имен {0} требуется утверждение wsrmp:ExactlyOnce, wsrmp:AtLeastOnce или wsrmp:AtMostOnce. Найден элемент {1} в пространстве имен {2}.

# DeliveryAssuranceRequiredNothingFound
source: The WS-RM policy under the namespace {0} requires the wsrmp:ExactlyOnce, wsrmp:AtLeastOnce, or wsrmp:AtMostOnce assertion. Nothing was found.
ru: Для политики WS-RM в пространстве имен {0} требуется утверждение wsrmp:ExactlyOnce, wsrmp:AtLeastOnce или wsrmp:AtMostOnce. Ничего не найдено.

# DerivedKeyInvalidGenerationSpecified
source: The received derived key token has a invalid generation value specified. Value: {0}. The value should be greater than or equal to zero.
ru: В полученном маркере производного ключа указано недопустимое значение поколения. Значение: {0}. Значение должно быть больше или равно нулю.

# DerivedKeyInvalidOffsetSpecified
source: The received derived key token has a invalid offset value specified. Value: {0}. The value should be greater than or equal to zero.
ru: Для полученного маркера производного ключа указано недопустимое значение смещения. Значение: {0}. Значение должно быть больше или равно нулю.

# DerivedKeyNotInitialized
source: The derived key has not been computed for the security token.
ru: Производный ключ для маркера безопасности не вычислен.

# DerivedKeyTokenGenerationAndLengthTooHigh
source: The derived key's generation ('{0}') and length ('{1}' bytes) result in a key derivation offset that is greater than the maximum offset ('{2}' bytes) allowed.
ru: Поколение ("{0}") и длина ("{1}" байт) производного ключа приводят к смещению формирования ключа, превышающему максимально разрешенное смещение ("{2}" байт).

# DerivedKeyTokenLabelTooLong
source: The length ('{0}' bytes) of the derived key's Label exceeds the maximum length ('{1}' bytes) allowed.
ru: Длина ("{0}" байт) параметра Label производного ключа превышает максимально разрешенную длину ("{1}" байт).

# DerivedKeyTokenNonceTooLong
source: The length ('{0}' bytes) of the derived key's Nonce exceeds the maximum length ('{1}' bytes) allowed.
ru: Длина ("{0}" байт) параметра Nonce производного ключа превышает максимально разрешенную длину ("{1}" байт).

# DerivedKeyTokenOffsetTooHigh
source: The derived key's Offset ('{0}' bytes) exceeds the maximum offset ('{1}' bytes) allowed.
ru: Смещение ("{0}" байт) производного ключа превышает максимально разрешенное смещение ("{1}" байт).

# DerivedKeyTokenRequiresTokenReference
source: DerivedKeyToken requires a reference to a token.
ru: DerivedKeyToken требует ссылку на маркер.

# DispatchRuntimeRequiresFormatter0
source: The DispatchOperation '{0}' requires Formatter, since DeserializeRequest and SerializeReply are not both false.
ru: Для DispatchOperation "{0}" требуется Formatter, так как DeserializeRequest и SerializeReply не имеют одновременно значение false.

# DnsIdentityCheckFailedForIncomingMessage
source: Identity check failed for incoming message. The expected DNS identity of the remote endpoint was '{0}' but the remote endpoint provided DNS claim '{1}'. If this is a legitimate remote endpoint, you can fix the problem by explicitly specifying DNS identity '{1}' as the Identity property of EndpointAddress when creating channel proxy.
ru: Ошибка идентификации входящего сообщения. Ожидаемое удостоверение удаленной конечной точки в DNS ({0}) не соответствует указанному удаленной конечной точкой требованию DNS({1}). Если это надежная удаленная конечная точка, то проблему можно устранить, явно указав удостоверение DNS "{1}" в свойстве Identity элемента EndpointAddress при создании прокси для канала.

# DnsIdentityCheckFailedForIncomingMessageLackOfDnsClaim
source: The Identity check failed for the incoming message. The remote endpoint did not provide a domain name system (DNS) claim and therefore did not satisfied DNS identity '{0}'. This may be caused by lack of DNS or CN name in the remote endpoint X.509 certificate's distinguished name.
ru: Ошибка идентификации входящего сообщения. Удаленная конечная точка не указала требование DNS и поэтому не соответствует удостоверению DNS "{0}". Это может быть вызвано отсутствием DNS-имени или CN-имени в различающемся имени сертификата X.509 удаленной конечной точки.

# DnsIdentityCheckFailedForOutgoingMessage
source: Identity check failed for outgoing message. The expected DNS identity of the remote endpoint was '{0}' but the remote endpoint provided DNS claim '{1}'. If this is a legitimate remote endpoint, you can fix the problem by explicitly specifying DNS identity '{1}' as the Identity property of EndpointAddress when creating channel proxy.
ru: Ошибка идентификации входящего сообщения. Ожидаемое удостоверение удаленной конечной точки в DNS ({0}) не соответствует указанному удаленной конечной точкой требованию DNS ({1}). Если это надежная удаленная конечная точка, то проблему можно устранить, явно указав удостоверение в DNS "{1}" в свойстве Identity элемента EndpointAddress при создании прокси для канала.

# DnsIdentityCheckFailedForOutgoingMessageLackOfDnsClaim
source: The Identity check failed for the outgoing message. The remote endpoint did not provide a domain name system (DNS) claim and therefore did not satisfied DNS identity '{0}'. This may be caused by lack of DNS or CN name in the remote endpoint X.509 certificate's distinguished name.
ru: Ошибка идентификации входящего сообщения. Удаленная конечная точка не указала требование DNS и поэтому не соответствует удостоверению DNS "{0}" . Это может быть вызвано отсутствием DNS-имени или CN-имени в различающемся имени сертификата X.509 удаленной конечной точки.

# DnsResolveFailed
source: No DNS entries exist for host {0}.
ru: Нет никаких записей DNS для узла {0}.

# DownlevelNameCannotMapToUpn
source: Cannot map Windows user '{0}' to a UserPrincipalName that can be used for S4U impersonation.
ru: Не удается сопоставить пользователя Windows "{0}" с именем UserPrincipalName, которое может использоваться для олицетворения S4U.

# DuplexChannelAbortedDuringOpen
source: Duplex channel to {0} was aborted during the open process.
ru: Дуплексный канал к {0} был разорван во время процесса открытия.

# DuplicateBehavior1
source: The value could not be added to the collection, as the collection already contains an item of the same type: '{0}'. This collection only supports one instance of each type.
ru: Не удалось добавить значение в коллекцию, так как в этой коллекции уже существует объект того же типа: "{0}". Эта коллекция поддерживает только по одному экземпляру каждого типа.

# DuplicateContractQNameNameOnExport
source: Duplicate contract XmlQualifiedNames are not supported.\r\nAnother ContractDescription with the Name: {0} and Namespace: {1} has already been exported.
ru: Дублирование имен XmlQualifiedNames контракта не поддерживается.\r\nДругое описание ContractDescription с именем {0} и пространством имен {1} уже было экспортировано.

# DuplicateMessageProperty
source: A property with the name '{0}' already exists.
ru: Свойство с именем "{0}" уже существует.

# DuplicatePolicyDocumentSkipped
source: A policy document was ignored because a policy expression with that ID has already been imported.\r\nPolicy ID:{0}
ru: Документ политики был проигнорирован, так как выражение политики с таким идентификатором уже было импортировано.\r\nИД политики: {0}

# DuplicatePolicyInWsdlSkipped
source: A policy expression was ignored because another policy expression with that ID has already been read in this document.\r\nXPath:{0}
ru: Выражение политики было проигнорировано, так как из данного документа уже считано другое выражение политики с таким идентификатором.\r\nXPath: {0}

# EffectiveGreaterThanExpiration
source: The valid from time is greater than the valid to time.
ru: Значение даты начала действия больше даты окончания действия.

# ElementFound
source: The {0}:{1} element requires a {2}:{3} child element but has the {4} child element under the {5} namespace.
ru: Элемент {0}:{1} требует дочернего элемента {2}:{3}, но содержит дочерний элемент {4} в пространстве имен {5}.

# ElementRequired
source: The {0}:{1} element requires a {2}:{3} child element but has no child elements.
ru: Элемент {0}:{1} требует дочернего элемента {2}:{3}, но не имеет дочерних элементов.

# EmptyBase64Attribute
source: An empty value was found for the required base-64 attribute name '{0}', namespace '{1}'.
ru: Найдено пустое значение для имени требуемого атрибута "{0}" в кодировке base64, пространство имен "{1}".

# EmptyXmlElementError
source: Element {0} cannot be empty.
ru: Элемент {0} не может быть пустым.

# EncoderBadContentType
source: Cannot process contentType.
ru: Невозможно обработать contentType.

# EncoderEnvelopeVersionMismatch
source: The envelope version of the incoming message ({0}) does not match that of the encoder ({1}). Make sure the binding is configured with the same version as the expected messages.
ru: Версия конверта входящего сообщения ({0}) не совпадает с версией кодировщика ({1}). Убедитесь, что привязка настроена с использованием той же версии, что и ожидаемые сообщения.

# EncoderMessageVersionMismatch
source: The message version of the outgoing message ({0}) does not match that of the encoder ({1}). Make sure the binding is configured with the same version as the message.
ru: Версия исходящего сообщения ({0}) не совпадает с версией кодировщика ({1}). Убедитесь, что привязка настроена с использованием той же версии, что и сообщения.

# EncoderUnrecognizedCharSet
source: Unrecognized charSet '{0}' in contentType.
ru: Неопознанный набор символов "{0}" в contentType.

# EncoderUnrecognizedContentType
source: Unrecognized contentType ({0}). Expected: {1}.
ru: Неопознанный contentType ({0}). Ожидается: {1}.

# EncodingBindingElementDoesNotHandleReaderQuotas
source: Unable to obtain XmlDictionaryReaderQuotas from the Binding. If you have specified a custom EncodingBindingElement, verify that the EncodingBindingElement can handle XmlDictionaryReaderQuotas in its GetProperty<T>() method.
ru: Невозможно получить XmlDictionaryReaderQuotas из Binding. Если указан особый элемент EncodingBindingElement, убедитесь, что EncodingBindingElement может обработать XmlDictionaryReaderQuotas с помощью своего метода GetProperty<T>().

# EncryptedKeyWasNotEncryptedWithTheRequiredEncryptingToken
source: The EncryptedKey clause was not wrapped with the required encryption token '{0}'.
ru: Конструкция EncryptedKey не была скрыта требуемым маркером шифрования "{0}".

# EndMethodsCannotBeDecoratedWithOperationContractAttribute
source: When using the IAsyncResult design pattern, the End method cannot be decorated with OperationContractAttribute. Only the corresponding Begin method can be decorated with OperationContractAttribute; that attribute will apply to the Begin-End pair of methods. Method '{0}' in type '{1}' violates this.
ru: При использовании конструктивного шаблона IAsyncResult метод End не может быть снабжен атрибутом OperationContractAttribute. Только соответствующий метод Begin может быть снабжен атрибутом OperationContractAttribute. Этот атрибут применяется к паре методов Begin-End. Метод "{0}" в типе "{1}" нарушает это правило.

# EndpointListenerRequirementsCannotBeMetBy3
source: ChannelDispatcher requirements cannot be met by the IChannelListener for Binding '{0}' since the contract requires support for one of these channel types '{1}' but the binding only supports these channel types '{2}'.
ru: IChannelListener для привязки "{0}" не может удовлетворить требования к ChannelDispatcher, так как данный контракт требует поддержки одного из этих типов канала "{1}", но привязка поддерживает только типы каналов "{2}".

# EndpointNotFound
source: There was no endpoint listening at {0} that could accept the message. This is often caused by an incorrect address or SOAP action. See InnerException, if present, for more details.
ru: Прослушивание по {0} не выполняла ни одна конечная точка, которая могла бы принять сообщение. Среди прочих причин это могло быть вызвано неправильным адресом или действием SOAP. Подробнее см. в описании InnerException (если имеется).

# EndpointsMustHaveAValidBinding1
source: The ServiceEndpoint with name '{0}' could not be exported to WSDL because the Binding property is null. To fix this, set the Binding property to a valid Binding instance.
ru: Не удалось экспортировать ServiceEndpoint с именем "{0}" в WSDL, так как свойство Binding имеет значение null. Для исправления ошибки задайте для свойства Binding допустимый экземпляр привязки.

# EntropyModeCannotHaveComputedKey
source: The issuer cannot provide a computed key in key entropy mode '{0}'.
ru: Поставщик не может предоставить вычисленный ключ в режиме энтропии ключа "{0}".

# EntropyModeCannotHaveProofTokenOrIssuerEntropy
source: The issuer cannot provide key entropy or a proof token in key entropy mode '{0}'.
ru: Поставщик не может предоставить энтропию ключа или маркер проверки в режиме энтропии ключа "{0}".

# EntropyModeCannotHaveRequestorEntropy
source: The client cannot provide key entropy in key entropy mode '{0}'.
ru: Клиент не может предоставить энтропию ключа в режиме энтропии ключа "{0}".

# EntropyModeRequiresComputedKey
source: The issuer must provide a computed key in key entropy mode '{0}'.
ru: Поставщик должен предоставить вычисленный ключ в режиме энтропии ключа "{0}".
