Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# SFxDocExt_NoMetadataSection1
source: This is a Windows&#169; Communication Foundation service.<BR/><BR/><B>Metadata publishing for this service is currently disabled.</B><BR/><BR/>If you have access to the service, you can enable metadata publishing by completing the following steps to modify your web or application configuration file:<BR/><BR/>1. Create the following service behavior configuration, or add the &lt;serviceMetadata&gt; element to an existing service behavior configuration:
ru: Это служба Windows&#169; Communication Foundation.<BR/><BR/><B>Публикация метаданных для этой службы в настоящее время отключена.</B><BR/><BR/>Если имеется доступ к службе, можно включить публикацию метаданных, выполнив следующие шаги для изменения веб-файла или файла конфигурации приложения.<BR/><BR/>1. Создайте следующую конфигурацию поведения службы или добавьте элемент &lt;serviceMetadata&gt; в существующую конфигурацию поведения службы:

# SFxDocExt_NoMetadataSection2
source: 2. Add the behavior configuration to the service:
ru: 2. Добавьте конфигурацию поведения в службу:

# SFxDocExt_NoMetadataSection3
source: Note: the service name must match the configuration name for the service implementation.<BR/><BR/>3. Add the following endpoint to your service configuration:
ru: Примечание. Для реализации службы имя службы должно соответствовать имени конфигурации.<BR/><BR/>3. Добавьте следующую конечную точку в конфигурацию службы:

# SFxDocExt_NoMetadataSection4
source: Note: your service must have an http base address to add this endpoint.<BR/><BR/>The following is an example service configuration file with metadata publishing enabled:
ru: Примечание. Для добавления этой конечной точки служба должна иметь базовый адрес HTTP.<BR/><BR/>Ниже приведен пример конфигурации службы с включенной публикацией метаданных:

# SFxDocExt_NoMetadataSection5
source: For more information on publishing metadata please see the following documentation: <a href=\"http://go.microsoft.com/fwlink/?LinkId=65455\">http://go.microsoft.com/fwlink/?LinkId=65455</a>.
ru: Дополнительные сведения о публикации метаданных см. в следующей документации: <a href=\"http://go.microsoft.com/fwlink/?LinkId=65455\">http://go.microsoft.com/fwlink/?LinkId=65455</a>.

# SFxDuplicateMessageParts
source: Message part {0} in namespace {1} appears more than once in Message.
ru: Часть сообщения {0} в пространстве имен {1} появляется в сообщении несколько раз.

# SFxEndpointDispatcherDifferentChannelDispatcher0
source: This EndpointDispatcher is not currently attached to the provided ChannelDispatcher.
ru: В настоящее время этот диспетчер EndpointDispatcher не закреплен за предоставленным ChannelDispatcher.

# SFxEndpointDispatcherMultipleChannelDispatcher0
source: Cannot add EndpointDispatcher to more than one ChannelDispatcher.
ru: Не удается добавить EndpointDispatcher к нескольким ChannelDispatcher.

# SFxErrorDeserializingFault
source: Server returned an invalid SOAP Fault. Please see InnerException for more details.
ru: Сервер вернул недопустимое сообщение об ошибке SOAP. Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorDeserializingHeader
source: There was an error in deserializing one of the headers in message {0}. Please see InnerException for more details.
ru: Ошибка десериализации одного из заголовков сообщения {0}. Подробнее см. в описании внутреннего исключения.

# SFxErrorDeserializingReplyBody
source: Error in deserializing body of reply message for operation '{0}'.
ru: Ошибка десериализации текста ответного сообщения для операции "{0}".

# SFxErrorDeserializingReplyBodyMore
source: Error in deserializing body of reply message for operation '{0}'. {1}
ru: Ошибка десериализации текста ответного сообщения для операции "{0}". {1}

# SFxErrorDeserializingRequestBody
source: Error in deserializing body of request message for operation '{0}'.
ru: Ошибка десериализации текста сообщения запроса для операции "{0}".

# SFxErrorDeserializingRequestBodyMore
source: Error in deserializing body of request message for operation '{0}'. {1}
ru: Ошибка десериализации текста сообщения запроса для операции "{0}". {1}

# SFxErrorReflectingOnMethod3
source: An error occurred while loading attribute '{0}' on method '{1}' in type '{2}'. Please see InnerException for more details.
ru: Ошибка при загрузке атрибута "{0}" метода "{1}" в типе "{2}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorReflectingOnParameter4
source: An error occurred while loading attribute '{0}' on parameter {1} of method '{2}' in type '{3}'. Please see InnerException for more details.
ru: Ошибка при загрузке атрибута "{0}" параметра "{1}" метода "{2}" в типе "{3}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorReflectingOnType2
source: An error occurred while loading attribute '{0}' on type '{1}'. Please see InnerException for more details.
ru: Ошибка при загрузке атрибута "{0}" типа "{1}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorReflectionOnUnknown1
source: An error occurred while loading attribute '{0}'. Please see InnerException for more details.
ru: Ошибка загрузки атрибута "{0}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorSerializingBody
source: There was an error in serializing body of message {0}: '{1}'. Please see InnerException for more details.
ru: Ошибка сериализации текста сообщения {0}: "{1}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxErrorSerializingHeader
source: There was an error in serializing one of the headers in message {0}: '{1}'. Please see InnerException for more details.
ru: Ошибка сериализации одного из заголовков сообщения {0}: "{1}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxExceptionDetailEndOfInner
source: --- End of inner ExceptionDetail stack trace ---
ru: --- Конец внутренней записи изменений стека ExceptionDetail ---

# SFxExceptionDetailFormat
source: An ExceptionDetail, likely created by IncludeExceptionDetailInFaults=true, whose value is:
ru: ExceptionDetail, возможно созданный параметром IncludeExceptionDetailInFaults=true, имеющим следующее значение:

# SFxExportMustHaveType
source: The specified ContractDescription could not be exported to WSDL because the Type property of the MessagePartDescription with name '{1}' in the OperationDescription with name '{0}' is not set. The Type property must be set in order to create WSDL.
ru: Не удалось экспортировать в WSDL указанное описание ContractDescription, так как не задано свойство Type описания MessagePartDescription с именем "{1}" в описании OperationDescription с именем "{0}". Необходимо задать свойство Type, чтобы создать WSDL.

# SFxFaultCannotBeImported
source: Fault named {0} in operation {1} cannot be imported. {2}
ru: Не удается импортировать ошибку с именем {0} в операции {1}. {2}

# SFxFaultContractDuplicateDetailType
source: In operation {0}, more than one fault is declared with detail type {1}
ru: В операции {0} объявлено несколько ошибок с типом сведений {1}.

# SFxFaultContractDuplicateElement
source: In operation {0}, more than one fault is declared with element name {1} in namespace {2}
ru: В операции {0} объявлено несколько ошибок с именем элемента {1} в пространстве имен {2}.

# SFxFaultExceptionToString3
source: {0}: {1} (Fault Detail is equal to {2}).
ru: {0}: {1} (дополнительные сведения об ошибке — {2}).

# SFxFaultReason
source: The creator of this fault did not specify a Reason.
ru: Создатель этой ошибки не указал причину.

# SFxFaultTypeAnonymous
source: In operation {0}, the schema type corresponding to the fault detail type {1} is anonymous. Please set Fault name explicitly to export anonymous types.
ru: В операции {0} указан анонимный тип схемы, соответствующей типу сведений об ошибке {1}. Укажите явное имя ошибки, чтобы экспортировать анонимные типы.

# SFxGetChannelDispatcherDoesNotSupportScheme
source: Only a '{0}' using '{1}' or '{2}' is supported in this scenario.
ru: Только "{0}", использующий "{1}" или "{2}", поддерживается в этом сценарии.

# SFxHeaderNameMismatchInMessageContract
source: Header name mismatch in member {1} of type {0}. The header name found in the description is {2}. The element name deduced by the formatter is {3}. This mismatch can happen if the ElementName specified in XmlElementAttribute or XmlArrayAttribute does not match the name specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the member name.
ru: Несоответствие имени заголовка в члене {1} типа {0}. Найденное в описании имя заголовка — {2}. Выведенное модулем форматирования имя элемента — {3}. Подобное несоответствие возможно, если имя ElementName, указанное в атрибуте XmlElementAttribute или XmlArrayAttribute, не соответствует имени, указанному в атрибуте MessageHeaderAttribute или MessageHeaderArrayAttribute, либо имени члена.

# SFxHeaderNameMismatchInOperation
source: Header name mismatch in operation {0} from contract {1}:{2}. The header name found in the description is {3}. The element name deduced by the formatter is {4}. This mismatch can happen if the ElementName specified in XmlElementAttribute or XmlArrayAttribute does not match the name specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the member name.
ru: Несоответствие имени заголовка в операции {0} из контракта {1}:{2}. Найденное в описании имя заголовка — {3}. Выведенное модулем форматирования имя элемента — {4}. Подобное несоответствие возможно, если имя ElementName, указанное в атрибуте XmlElementAttribute или XmlArrayAttribute, не соответствует имени, указанному в атрибуте MessageHeaderAttribute или MessageHeaderArrayAttribute, либо имени члена.

# SFxHeaderNamespaceMismatchInMessageContract
source: Header namespace mismatch in member {1} of type {0}. The header namespace found in the description is {2}. The element namespace deduced by the formatter is {3}. This mismatch can happen if the Namespace specified in XmlElementAttribute or XmlArrayAttribute does not match the namespace specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the contract namespace.
ru: Несоответствие пространства имен заголовка в члене {1} типа {0}. Найденное в описании пространство имен заголовка — {2}. Выведенное модулем форматирования пространство имен элемента — {3}. Подобное несоответствие возможно, если пространство имен Namespace, указанное в атрибуте XmlElementAttribute или XmlArrayAttribute, не соответствует пространству имен, указанному в атрибуте MessageHeaderAttribute или MessageHeaderArrayAttribute, либо пространству имен контракта.

# SFxHeaderNamespaceMismatchInOperation
source: Header namespace mismatch in operation {0} from contract {1}:{2}. The header namespace found in the description is {3}. The element namespace deduced by the formatter is {4}. This mismatch can happen if the Namespace specified in XmlElementAttribute or XmlArrayAttribute does not match the namespace specified in the MessageHeaderAttribute or MessageHeaderArrayAttribute or the contract namespace.
ru: Несоответствие пространства имен заголовка в операции {0} из контракта {1}:{2}. Найденное в описании пространство имен заголовка — {3}. Выведенное модулем форматирования пространство имен элемента — {4}. Подобное несоответствие возможно, если пространство имен Namespace, указанное в атрибуте XmlElementAttribute или XmlArrayAttribute, не соответствует пространству имен, указанному в атрибуте MessageHeaderAttribute или MessageHeaderArrayAttribute, либо пространству имен контракта.

# SFxHeaderNotUnderstood
source: The header '{0}' from the namespace '{1}' was not understood by the recipient of this message, causing the message to not be processed. This error typically indicates that the sender of this message has enabled a communication protocol that the receiver cannot process. Please ensure that the configuration of the client's binding is consistent with the service's binding.
ru: Получатель данного сообщения не понял заголовок "{0}" из пространства имен "{1}". В результате сообщение не было обработано. Эта ошибка обычно указывает, что отправитель сообщения включил протокол связи, который не может быть обработан получателем. Необходимо обеспечить совместимость конфигурации привязки клиента с привязкой службы.

# SFxImmutableChannelFactoryBehavior0
source: This value cannot be changed after the ChannelFactory has opened.
ru: Это значение нельзя изменить после открытия ChannelFactory.

# SFxImmutableServiceHostBehavior0
source: This value cannot be changed after the ServiceHost has opened.
ru: Это значение нельзя изменить после открытия ServiceHost.

# SFxInconsistentBindingBodyParts
source: Operation {0} binding {1} has extra part {2} that is not present in other bindings
ru: Привязка {1} операции {0} имеет дополнительную часть {2}, которая отсутствует в других привязках.

# SFxInconsistentWsdlOperationStyleInHeader
source: Style {1} on header {0} does not match expected style {2}.
ru: Стиль {1} заголовка {0} не соответствует ожидаемому стилю {2}.

# SFxInconsistentWsdlOperationStyleInMessageParts
source: All parts of message in operation {0} must either contain type or element.
ru: Все части сообщения в операции {0} должны содержать тип или элемент.

# SFxInconsistentWsdlOperationStyleInOperationMessages
source: Style {1} inferred from messages in operation {0} does not match expected style {2} specified via bindings.
ru: Стиль {1}, полученный из сообщений в операции {0}, не соответствует ожидаемому стилю {2}, указанному с помощью привязок.

# SFxInconsistentWsdlOperationUseAndStyleInBinding
source: Bindings for operation {0} cannot specify different use and style values. Binding {1} specifies use {2} and style {3} while binding {4} specifies use {5} and style {6}.
ru: Привязки для операции {0} не могут указать разные значения использования и стиля. Привязка {1} указывает характер использования {2} и стиль {3}, а привязка {4} — характер использования {5} и стиль {6}.

# SFxInconsistentWsdlOperationUseInBindingExtensions
source: Extensions for operation {0} in binding {1} cannot specify different use values.
ru: Расширения для операции {0} в привязке {1} не могут указывать разные значения использования.

# SFxInconsistentWsdlOperationUseInBindingFaults
source: Fault bindings for operation {0} in binding {1} cannot specify different use values.
ru: Привязки ошибок для операции {0} в привязке {1} не могут указывать разные значения использования.

# SFxInconsistentWsdlOperationUseInBindingMessages
source: Message bindings for operation {0} in binding {1} cannot specify different use values.
ru: Привязки сообщений для операции {0} в привязке {1} не могут указывать разные значения использования.

# SFxInitializationUIDisallowed
source: AllowInitializationUI was set to false for this channel, but the channel is configured to use the '{0}' as an interactive initializer.
ru: Для свойства AllowInitializationUI этого канала задано значение false, однако канал настроен на использование "{0}" в качестве интерактивного инициализатора.

# SFxInitializationUINotCalled
source: The channel is configured to use interactive initializer '{0}', but the channel was Opened without calling DisplayInitializationUI. Call DisplayInitializationUI before calling Open or other methods on this channel.
ru: Этот канал настроен на использование интерактивного инициализатора "{0}", однако канал был открыт без вызова DisplayInitializationUI. Перед вызовом Open или других методов канала необходимо вызвать DisplayInitializationUI.

# SFxInputParametersToServiceInvalid
source: Service implementation object invoked with wrong number of input parameters, operation expects {0} parameters but was called with {1} parameters.
ru: Объект реализации службы вызван с неверным количеством входных параметров. Операция ожидает {0} параметров, но была вызвана с {1} параметрами.

# SFxInputParametersToServiceNull
source: Service implementation object invoked with null input parameters, but operation expects {0} parameters.
ru: Объект реализации службы вызван без входных параметров, но операция ожидает {0} параметров.

# SFxInstanceNotInitialized
source: The InstanceContext has no provider for creating Service implementation objects.
ru: InstanceContext не имеет поставщика для создания объектов реализации службы.

# SFxInterleavedContextScopes0
source: This OperationContextScope is being disposed out of order.
ru: Этот элемент OperationContextScope находится в процессе ликвидации вне очереди.

# SFxInternalCallbackError
source: The client was unable to process the callback request due to an internal error. For more information about the error, either turn on IncludeExceptionDetailInFaults (either from CallbackBehaviorAttribute or from the <clientDebug> configuration behavior) on the client in order to send the exception information back to the server, or turn on tracing as per the Microsoft .NET Framework SDK documentation and inspect the client trace logs.
ru: Клиент не смог обработать запрос обратного вызова в связи с внутренней ошибкой. Для получения дополнительных сведений об ошибке включите IncludeExceptionDetailInFaults (с помощью атрибута CallbackBehaviorAttribute или через поведение <clientDebug>) на клиенте, чтобы отправить информацию об исключении обратно на сервер, или включите трассировку согласно документации пакета SDK для Microsoft .NET Framework и проверьте записи журнала трассировки клиента.

# SFxInternalServerError
source: The server was unable to process the request due to an internal error. For more information about the error, either turn on IncludeExceptionDetailInFaults (either from ServiceBehaviorAttribute or from the <serviceDebug> configuration behavior) on the server in order to send the exception information back to the client, or turn on tracing as per the Microsoft .NET Framework SDK documentation and inspect the server trace logs.
ru: Сервер не смог обработать запрос в связи с внутренней ошибкой. Для получения дополнительных сведений об ошибке включите IncludeExceptionDetailInFaults (с помощью атрибута ServiceBehaviorAttribute или через поведение <serviceDebug>) на сервере, чтобы отправить информацию об исключении обратно на клиент, или включите трассировку согласно документации пакета SDK для Microsoft .NET Framework и проверьте записи журнала трассировки клиента.

# SFxInvalidAsyncResultState0
source: IAsyncResult's State must be the state argument passed to your Begin call.
ru: Состояние объекта IAsyncResult должно быть аргументом состояния, переданным вызову метода Begin.

# SFxInvalidCallbackContractType
source: The CallbackContract {0} is invalid because it is not an interface type.
ru: Недопустимый CallbackContract {0}, так как он не является типом интерфейса.

# SFxInvalidCallbackIAsyncResult
source: IAsyncResult not provided or of wrong type.
ru: Объект IAsyncResult не предоставлен или имеет неправильный тип.

# SFxInvalidChannelToOperationContext
source: Invalid IContextChannel passed to OperationContext. Must be either a server dispatching channel or a client proxy channel.
ru: Недопустимый элемент IContextChannel передан контексту OperationContext. Это должен быть либо диспетчерский канал сервера, либо прокси-канал клиента.

# SFxInvalidMessageBody
source: OperationFormatter encountered an invalid Message body. Expected to find node type 'Element' with name '{0}' and namespace '{1}'. Found node type '{2}' with name '{3}' and namespace '{4}'
ru: OperationFormatter обнаружил недопустимый текст сообщения. Ожидался тип узла Element с именем "{0}" и пространством имен "{1}". Найден тип узла "{2}" с именем "{3}" и пространством имен "{4}".

# SFxInvalidMessageBodyEmptyMessage
source: The OperationFormatter could not deserialize any information from the Message because the Message is empty (IsEmpty = true).
ru: OperationFormatter не удалось десериализовать какую-либо информацию из данного сообщения, так как сообщение пустое (IsEmpty = true).

# SFxInvalidMessageBodyErrorDeserializingParameter
source: There was an error while trying to deserialize parameter {0}:{1}. Please see InnerException for more details.
ru: Ошибка десериализации параметра {0}:{1}. Дополнительные сведения см. в описании исключения InnerException.

# SFxInvalidMessageBodyErrorDeserializingParameterMore
source: There was an error while trying to deserialize parameter {0}:{1}. The InnerException message was '{2}'. Please see InnerException for more details.
ru: Ошибка десериализации параметра {0}:{1}. Сообщение исключения InnerException: "{2}". Дополнительные сведения см. в описании исключения InnerException.

# SFxInvalidMessageBodyErrorSerializingParameter
source: There was an error while trying to serialize parameter {0}:{1}. The InnerException message was '{2}'. Please see InnerException for more details.
ru: Ошибка сериализации параметра {0}:{1}. Сообщение InnerException: "{2}". Дополнительные сведения см. в описании внутреннего исключения.

# SFxInvalidMessageContractSignature
source: The operation {0} either has a parameter or a return type that is attributed with MessageContractAttribute. In order to represent the request message using a Message Contract, the operation must have a single parameter attributed with MessageContractAttribute. In order to represent the response message using a Message Contract, the operation's return value must be a type that is attributed with MessageContractAttribute and the operation may not have any out or ref parameters.
ru: Операция {0} имеет некоторые параметры или возвращенный тип с атрибутом MessageContractAttribute. Чтобы представить сообщение запроса с помощью MessageContract, операция должна иметь один параметр с атрибутом MessageContractAttribute. Чтобы представить ответное сообщение с помощью MessageContract, возвращенное значение операции должно быть типом, имеющим атрибут MessageContractAttribute, а операция не должна иметь параметров out или ref.

# SFxInvalidReplyAction
source: Outgoing reply message for operation '{0}' specified Action='{1}', but contract for that operation specifies ReplyAction='{2}'. The Action specified in the Message must match the ReplyAction in the contract, or the operation contract must specify ReplyAction='*'.
ru: Исходящее ответное сообщение для операции "{0}" указало Action="{1}", однако контракт для этой операции указывает ReplyAction="{2}". Action, указанное в сообщении, должно соответствовать ReplyAction, указанному в контракте, или контракт операции должен указать ReplyAction="*".

# SFxInvalidRequestAction
source: Outgoing request message for operation '{0}' specified Action='{1}', but contract for that operation specifies Action='{2}'. The Action specified in the Message must match the Action in the contract, or the operation contract must specify Action='*'.
ru: Исходящее сообщение запроса для операции "{0}" указало Action="{1}", однако контракт для этой операции указывает Action="{2}". Action, указанное в сообщении, должно соответствовать Action, указанному в контракте, или контракт операции должен указать Action="*".

# SFxInvalidStaticOverloadCalledForDuplexChannelFactory1
source: The static CreateChannel method cannot be used with the contract {0} because that contract defines a callback contract. Please try using one of the static CreateChannel overloads on DuplexChannelFactory<TChannel>.
ru: Нельзя использовать статический метод CreateChannel с контрактом {0}, так как контракт определяет контракт обратного вызова. Воспользуйтесь одной из статических перегрузок CreateChannel для DuplexChannelFactory<TChannel>.

# SFxInvalidStreamInRequest
source: For request in operation {0} to be a stream the operation must have a single parameter whose type is Stream.
ru: Чтобы запрос в операции {0} был потоком, операция должна иметь один параметр с типом Stream.
