Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# SFxServerDidNotReply
source: The server did not provide a meaningful reply; this might be caused by a contract mismatch, a premature session shutdown or an internal server error.
ru: Сервер не предоставил значащий ответ. Это может быть вызвано несоответствием контракта, преждевременным завершением сеанса или внутренней ошибкой сервера.

# SFxServiceChannelCannotBeCalledBecauseIsSessionOpenNotificationEnabled
source: The operation '{0}' could not be invoked because the property '{1}' on the OperationContract is set to '{2}'. To invoke this operation on the server, call the '{3}' method on the client proxy instead.
ru: Операцию "{0}" не удалось запустить, поскольку свойство "{1}" в OperationContract имеет значение "{2}". Чтобы запустить эту операцию на сервере, вызовите метод "{3}" в прокси клиента.

# SFxServiceChannelIdleAborted
source: The operation '{0}' could not be completed because the sessionful channel timed out waiting to receive a message. To increase the timeout, either set the receiveTimeout property on the binding in your configuration file, or set the ReceiveTimeout property on the Binding directly.
ru: Не удалось завершить операцию "{0}", так как канал сеанса закрылся по истечении времени ожидания при ожидании получения сообщения. Чтобы увеличить время ожидания, измените свойство привязки receiveTimeout в файле конфигурации или установите значение ReceiveTimeout напрямую в Binding.

# SFxSetEnableFaultsOnChannelDispatcher0
source: This property sets EnableFaults on the client. To set EnableFaults on the server, use ChannelDispatcher's EnableFaults.
ru: Это свойство задает EnableFaults на клиенте. Чтобы задать EnableFaults на сервере, используйте EnableFaults диспетчера ChannelDispatcher.

# SFxSetManualAddresssingOnChannelDispatcher0
source: This property sets ManualAddressing on the client. To set ManualAddressing on the server, use ChannelDispatcher's ManualAddressing.
ru: Это свойство задает ManualAddressing на клиенте. Чтобы задать ManualAddressing на сервере, воспользуйтесь элементом ManualAddressing диспетчера ChannelDispatcher.

# SFxStaticMessageHeaderPropertiesNotAllowed
source: Header properties cannot be set in MessageHeaderAttribute of {0} as its type is MessageHeader<T>.
ru: Свойства заголовка не могут быть заданы в атрибуте MessageHeaderAttribute объекта {0}, так как его тип — MessageHeader<T>.

# SFxStreamIOException
source: An exception has been thrown when reading the stream.
ru: При чтении потока было вызвано исключение.

# SFxStreamRequestMessageClosed
source: The message containing this stream has been closed. Note that request streams cannot be accessed after the service operation returns.
ru: Сообщение, содержащее этот поток, закрыто. Учтите, что потоки запросов становятся недоступными после возвращения операции службы.

# SFxStreamResponseMessageClosed
source: The message containing this stream has been closed.
ru: Сообщение, содержащее этот поток, было закрыто.

# SFxTimeoutOutOfRange0
source: Timeout must be greater than or equal to TimeSpan.Zero. To disable timeout, specify TimeSpan.MaxValue.
ru: Время ожидания должно быть не менее TimeSpan.Zero. Чтобы отключить время ожидания, укажите TimeSpan.MaxValue.

# SFxTimeoutOutOfRangeTooBig
source: Timeouts larger than Int32.MaxValue TotalMilliseconds (approximately 24 days) cannot be honored. To disable timeout, specify TimeSpan.MaxValue.
ru: Время ожидания, превышающее Int32.MaxValue TotalMilliseconds (приблизительно 24 дня), не учитывается. Чтобы отключить время ожидания, укажите TimeSpan.MaxValue.

# SFxTooManyPartsWithSameName
source: Cannot create a unique part name for {0}.
ru: Не удается создать уникальное имя части для {0}.

# SFxTypedMessageCannotBeNull
source: Internal Error: The instance of the MessageContract cannot be null in {0}.
ru: Внутренняя ошибка: экземпляр MessageContract не может иметь значение null в {0}.

# SFxTypedMessageCannotBeRpcLiteral
source: The operation '{0}' could not be loaded because it specifies \"rpc-style\" in \"literal\" mode, but uses message contract types or the System.ServiceModel.Channels.Message. This combination is disallowed -- specify a different value for style or use parameters other than message contract types or System.ServiceModel.Channels.Message.
ru: Не удалось загрузить операцию "{0}", так как в ней указан режим literal для rpc-style, но используются типы контрактов сообщений или System.ServiceModel.Channels.Message. Такая комбинация запрещена — укажите другое значение для стиля или используйте параметры, отличные от типов контрактов сообщений или System.ServiceModel.Channels.Message.

# SFxTypedOrUntypedMessageCannotBeMixedWithParameters
source: The operation '{0}' could not be loaded because it has a parameter or return type of type System.ServiceModel.Channels.Message or a type that has MessageContractAttribute and other parameters of different types. When using System.ServiceModel.Channels.Message or types with MessageContractAttribute, the method must not use any other types of parameters.
ru: Не удалось загрузить операцию "{0}", так как она содержит параметр или тип возвращаемого значения типа System.ServiceModel.Channels.Message или содержит тип, имеющий атрибут MessageContractAttribute и другие параметры разных типов. При использовании System.ServiceModel.Channels.Message или типов с атрибутом MessageContractAttribute метод не должен использовать другие типы параметров.

# SFxTypedOrUntypedMessageCannotBeMixedWithVoidInRpc
source: When using the rpc-encoded style, message contract types or the System.ServiceModel.Channels.Message type cannot be used if the operation has no parameters or has a void return value. Add a blank message contract type as a parameter or return type to operation '{0}'.
ru: При использовании стиля с rpc-кодировкой нельзя использовать типы контрактов сообщений или тип System.ServiceModel.Channels.Message, если операция не имеет никаких параметров или имеет возвращаемое значение void. Добавьте к операции "{0}" пустой тип контракта сообщения в качестве параметра или возвращаемого значения.

# SFxUnknownFaultNoMatchingTranslation1
source: This fault did not provide a matching translation: {0}
ru: Эта ошибка не предоставила соответствующее преобразование: {0}

# SFxUnknownFaultNullReason0
source: This fault did not provide a reason (MessageFault.Reason was null).
ru: Эта ошибка не предоставила объяснение причины (MessageFault.Reason имел значение null).

# SFxUnknownFaultZeroReasons0
source: This fault did not provide a reason (MessageFault.Reason.Translations.Count was 0).
ru: Эта ошибка не предоставила объяснение причины (утверждение MessageFault.Reason.Translations.Count имело значение 0).

# SFxVersionMismatchInOperationContextAndMessage2
source: Cannot add outgoing headers to message as MessageVersion in OperationContext.Current '{0}' does not match with the header version of message being processed '{1}'.
ru: Невозможно добавить к сообщению исходящие заголовки, так как версия MessageVersion в OperationContext.Current "{0}" не соответствует версии заголовка обрабатываемого сообщения "{1}".

# SFxWrapperNameCannotBeEmpty
source: Wrapper element name cannot be empty.
ru: Имя элемента оболочки не может быть пустым.

# SFxWrapperTypeHasMultipleNamespaces
source: Wrapper type for message {0} cannot be projected as a data contract type since it has multiple namespaces. Consider using the XmlSerializer
ru: Тип оболочки сообщения {0} не может быть защищен как тип контракта данных, так как он имеет несколько пространств имен. Используйте XmlSerializer.

# SFxWsdlMessageDoesNotContainPart3
source: Service description message '{1}' from target namespace '{2}' does not contain part named '{0}'.
ru: В сообщении описания службы "{1}" из целевого пространства имен "{2}" отсутствует часть с именем "{0}".

# SFxWsdlOperationFaultNeedsMessageAttribute2
source: The wsdl operation {0} in portType {1} contains a fault that does not reference a message. This is either because the message attribute is missing or empty.
ru: Операция wsdl {0} в portType {1} содержит ошибку без ссылки на сообщение. Возможно, отсутствует атрибут сообщения или он пустой.

# SFxWsdlOperationInputNeedsMessageAttribute2
source: The wsdl operation input {0} in portType {1} does not reference a message. This is either because the message attribute is missing or empty.
ru: На входе операции wsdl {0} в portType {1} отсутствует ссылка на сообщение. Возможно, отсутствует атрибут сообщения или он пустой.

# SFxWsdlOperationOutputNeedsMessageAttribute2
source: The wsdl operation output {0} in portType {1} does not reference a message. This is either because the message attribute is missing or empty.
ru: На выходе операции wsdl {0} в portType {1} отсутствует ссылка на сообщение. Возможно, отсутствует атрибут сообщения или он пустой.

# SFxWsdlPartMustHaveElementOrType
source: WSDL part {0} in message {1} from namespace {2} must have either an element or a type name
ru: WSDL-часть {0} в сообщении {1} из пространства имен {2} должна иметь либо элемент, либо имя типа

# SFxXmlArrayNotAllowedForMultiple
source: XmlArrayAttribute cannot be used in repeating part {1}:{0}.
ru: XmlArrayAttribute не может использоваться в повторяющейся части {1}:{0}.

# SFxXmlSerializerIsNotFound
source: Could not find XmlSerializer for type {0}.
ru: Не удается найти XmlSerializer для типа {0}.

# SPS_InvalidAsyncResult
source: The asynchronous result object used to end this operation was not the object that was returned when the operation was initiated.
ru: Объект асинхронного результата, использовавшийся для завершения этой операции, не совпадает с объектом, возвращенным в начале операции.

# SPS_SeekNotSupported
source: Seek is not supported on this stream.
ru: Поиск в этом потоке не поддерживается.

# SchemaValidationError
source: There was a validation error on a schema generated during export:\r\n Source: {0}\r\n Line: {1} Column: {2}\r\n Validation Error: {3}
ru: Ошибка проверки в схеме, сгенерированной во время экспорта.\r\n Источник: {0}\r\n Строка: {1}, столбец: {2}\r\n Ошибка проверки: {3}

# SecureConversationBootstrapCannotUseSecureConversation
source: Cannot create security binding element based on configuration data. The secure conversation bootstrap requires another secure conversation which is not supported.
ru: Не удается создать элемент привязки безопасности на основе данных конфигурации. Для загрузки защищенного диалога требуется другой защищенный диалог, что не поддерживается.

# SecureConversationDriverVersionDoesNotSupportSession
source: The configured SecureConversation version does not support sessions. Use WSSecureConversationFeb2005 or above.
ru: Настроенная версия SecureConversation не поддерживает сеансы. Используйте WsSecureConversationFeb2005 или более позднюю версию.

# SecureConversationNeedsBootstrapSecurity
source: Cannot create security binding element based on the configuration data. When secure conversation authentication mode is selected, the secure conversation bootstrap binding element must also be specified.
ru: Не удается создать элемент привязки безопасности на основе данных конфигурации. Если выбран режим аутентификации защищенного диалога, то элемент привязки загрузки защищенного диалога также должен быть указан.

# SecureConversationRequiredByReliableSession
source: Cannot establish a reliable session without secure conversation. Enable secure conversation.
ru: Невозможно установить надежный сеанс без защищенного диалога. Включите поддержку защищенного диалога.

# SecureConversationSecurityTokenParametersRequireBootstrapBinding
source: Security channel or listener factory creation failed. Secure conversation security token parameters do not specify the bootstrap security binding element.
ru: Сбой создания защищенного канала или фабрики прослушивателя. В параметрах маркера безопасности защищенного диалога не указан элемент привязки безопасности загрузки.

# SecurityAuditPlatformNotSupported
source: Writing audit messages to the Security log is not supported by the current platform. You must write audit messages to the Application log.
ru: На текущей платформе не поддерживается запись сообщений аудита в журнал безопасности. Сообщения аудита следует записывать в журнал приложений.

# SecurityBindingElementCannotBeExpressedInConfig
source: A security policy was imported for the endpoint. The security policy contains requirements that cannot be represented in a Windows Communication Foundation configuration. Look for a comment about the SecurityBindingElement parameters that are required in the configuration file that was generated. Create the correct binding element with code. The binding configuration that is in the configuration file is not secure.
ru: Импортирована политика безопасности для данной конечной точки. В этой политике безопасности содержатся требования, которые не могут быть представлены в конфигурации Windows Communication Foundation. Найдите описание обязательных параметров SecurityBindingElement в сгенерированном файле конфигурации. Создайте правильный элемент привязки с помощью кода. Конфигурация привязки, внесенная в файл конфигурации, не защищена.

# SecurityCapabilitiesMismatched
source: The security capabilities of binding '{0}' do not match those of the generated runtime object. Most likely this means the binding contains a StreamSecurityBindingElement, but lacks a TransportBindingElement that supports Stream Security (such as TCP or Named Pipes). Either remove the unused StreamSecurityBindingElement or use a transport that supports this element.
ru: Возможности защиты, предусмотренные в привязке "{0}", не соответствуют требованиям созданного объекта времени выполнения. Скорее всего, это означает, что привязка содержит элемент StreamSecurityBindingElement, однако в ней отсутствует элемент TransportBindingElement, который поддерживает безопасность потока (например, TCP или именованные каналы). Удалите неиспользуемый элемент StreamSecurityBindingElement или пользуйтесь транспортом, поддерживающим этот элемент.

# SecurityContextNotRegistered
source: The SecurityContextSecurityToken with context-id={0} (key generation-id={1}) is not registered.
ru: SecurityContextSecurityToken с context-id={0} (ключ с generation-id={1}) не зарегистрирован.

# SecurityProtocolCannotDoReplayDetection
source: The security protocol '{0}' cannot do replay detection.
ru: Протокол безопасности "{0}" не может выполнять определение ответов.

# SecurityServerTooBusy
source: Server '{0}' sent back a fault indicating it is too busy to process the request. Please retry later. Please see the inner exception for fault details.
ru: Сервер "{0}" отправил обратно сообщение об ошибке, указывающее, что он перегружен и не может обработать запрос. Повторите попытку позже. Дополнительные сведения об ошибке см. в описании внутреннего исключения.

# SecurityStateEncoderDecodingFailure
source: The DataProtectionSecurityStateEncoder is unable to decode the byte array. Ensure that a 'UserProfile' is loaded, if this is a 'web farm scenario' ensure all servers are running as the same user with the roaming profiles or provide a custom SecurityStateEncoder'.
ru: Объект DataProtectionSecurityStateEncoder не может расшифровать байтовый массив. Убедитесь, что загружен "Профиль_пользователя". Если это "веб-сценарий_фермы", то убедитесь, что все серверы запущены для одного пользователя с перемещаемыми профилями, или предоставьте пользовательский объект SecurityStateEncoder.

# SecurityStateEncoderEncodingFailure
source: The DataProtectionSecurityStateEncoder is unable to encode the byte array. Ensure that a 'UserProfile' is loaded, if this is a 'web farm scenario' ensure all servers are running as the same user with the roaming profiles or provide a custom SecurityStateEncoder'.
ru: Объект DataProtectionSecurityStateEncoder не может зашифровать байтовый массив. Убедитесь, что загружен "Профиль_пользователя". Если это "веб-сценарий_фермы", то убедитесь, что все серверы запущены для одного пользователя с перемещаемыми профилями, или предоставьте пользовательский объект SecurityStateEncoder.

# SecurityTokenManagerCannotCreateAuthenticatorForRequirement
source: The security token manager cannot create a token authenticator for requirement '{0}'.
ru: Диспетчеру маркеров безопасности не удалось создать средство проверки подлинности маркеров для требования "{0}".

# SecurityTokenManagerCannotCreateProviderForRequirement
source: The security token manager cannot create a token provider for requirement '{0}'.
ru: Диспетчеру маркеров безопасности не удалось создать поставщика маркера для требования "{0}".

# SecurityTokenParametersCloneInvalidResult
source: The CloneCore method of {0} type returned an invalid result.
ru: Метод CloneCore типа {0} вернул недопустимый результат.

# SecurityTokenRequirementDoesNotContainProperty
source: The token requirement does not contain a property '{0}'.
ru: Требование к маркеру не содержит свойство "{0}".

# SecurityTokenRequirementHasInvalidTypeForProperty
source: The token requirement has an unexpected type '{1}' for property '{0}'. The expected property type is '{2}'.
ru: Требование к маркеру содержит непредвиденный тип "{1}" для свойства "{0}". Ожидаемый тип свойства "{2}".

# SendCannotBeCalledAfterCloseOutputSession
source: You cannot Send messages on a channel after CloseOutputSession has been called.
ru: Нельзя отправить сообщения по каналу после вызова CloseOutputSession.

# SendToViaTimedOut
source: Sending to via {0} timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
ru: После {1} истекло время ожидания для отправки через {0}. Время, назначенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# ServerRejectedSessionPreamble
source: The server at {0} rejected the session-establishment request.
ru: Сервер в {0} отклонил запрос на установление сеанса.

# ServerRejectedUpgradeRequest
source: The server rejected the upgrade request.
ru: Сервер отклонил запрос на обновление.

# ServerTooBusy
source: Server '{0}' is too busy to process this request. Try again later.
ru: Сервер "{0}" слишком занят, чтобы обработать этот запрос. Повторите попытку позже.

# ServiceOperationsMarkedWithIsOneWayTrueMust0
source: Operations marked with IsOneWay=true must not declare output parameters, by-reference parameters or return values.
ru: Операции с пометкой IsOneWay=true не должны объявлять выходные параметры, параметры ссылок или возвращаемые значения.

# ServicesWithoutAServiceContractAttributeCan2
source: The {0} declared on method '{1}' in type '{2}' is invalid. {0}s are only valid on methods that are declared in a type that has ServiceContractAttribute. Either add ServiceContractAttribute to type '{2}' or remove {0} from method '{1}'.
ru: Элемент {0}, объявленный в методе "{1}" типа "{2}", недопустим. Элементы {0} допустимы только в методах, объявленных в типе, имеющем атрибут ServiceContractAttribute. Добавьте атрибут ServiceContractAttribute в тип "{2}" или удалите элемент {0} из метода "{1}".

# SessionValueInvalid
source: The Session value '{0}' is invalid. Please specify 'CurrentSession','ServiceSession' or a valid non-negative Windows Session Id.
ru: Значение сеанса "{0}" недопустимо. Укажите значение CurrentSession, ServiceSession или допустимый неотрицательный идентификатор сеанса Windows.

# SfxCallbackTypeCannotBeNull
source: In order to use the contract '{0}' with DuplexChannelFactory, the contract must specify a valid callback contract. If your contract does not have a callback contract, consider using ChannelFactory instead of DuplexChannelFactory.
ru: Для использования контракта "{0}" с DuplexChannelFactory в контракте должен быть указан допустимый контракт обратного вызова. Если в контракте не указан контракт обратного вызова, используйте ChannelFactory вместо DuplexChannelFactory.

# SfxCloseTimedOutWaitingForDispatchToComplete
source: Close process timed out waiting for service dispatch to complete.
ru: Процесс закрытия прерван по истечении времени ожидания в ожидании завершения отправки службы.

# SfxNoTypeSpecifiedForParameter
source: There was no CLR type specified for parameter {0}, preventing the operation from being generated.
ru: Не удалось найти тип CLR для параметра {0}, что помешало создать операцию.

# SfxUseTypedMessageForCustomAttributes
source: Parameter '{0}' requires additional schema information that cannot be captured using the parameter mode. The specific attribute is '{1}'.
ru: Параметр "{0}" требует дополнительной информации о схеме, которую невозможно получить в режиме параметров. Указан атрибут "{1}".

# Sharing_ConnectionDispatchFailed
source: The message could not be dispatched to the service at address '{0}'. Refer to the server Event Log for more details
ru: Сообщение не удалось отправить службе по адресу "{0}". Дополнительную информацию можно найти в журнале событий сервера.

# Sharing_EndpointUnavailable
source: The message could not be dispatched because the service at the endpoint address '{0}' is unavailable for the protocol of the address.
ru: Сообщение не удалось отправить, так как адрес конечной точки "{0}" недоступен для протокола адреса.

# SignatureConfirmationNotSupported
source: The configured SecurityVersion does not support signature confirmation. Use WsSecurity11 or above.
ru: Настроенный параметр SecurityVersion не поддерживает подтверждение сигнатуры. Используйте WsSecurity11 или более позднюю версию.

# SigningTokenHasNoKeys
source: The signing token {0} has no keys. The security token is used in a context that requires it to perform cryptographic operations, but the token contains no cryptographic keys. Either the token type does not support cryptographic operations, or the particular token instance does not contain cryptographic keys. Check your configuration to ensure that cryptographically disabled token types (for example, UserNameSecurityToken) are not specified in a context that requires cryptographic operations (for example, an endorsing supporting token).
ru: Маркер подписывания {0} не имеет ключей. Маркер безопасности используется в контексте выполнения криптографических операций, однако этот маркер не содержит криптографических ключей. Возможно, тип маркера не поддерживает криптографические операции либо конкретный экземпляр маркера не содержит криптографических ключей. Проверьте свою конфигурацию, чтобы убедиться в том, что криптографически отключенные типы маркеров (например, UserNameSecurityToken) не указаны в контексте, требующем криптографические операции (например, поддерживающий маркер подтверждения).

# SigningTokenHasNoKeysSupportingTheAlgorithmSuite
source: The signing token {0} has no key that supports the algorithm suite {1}.
ru: Маркер подписывания {0} не имеет ключа, поддерживающего набор алгоритмов {1}.

# SizeExceedsRemainingBufferSpace
source: The specified size exceeds the remaining buffer space ({0} bytes).
ru: Указанный размер превышает оставшееся буферное пространство ({0} байт).

# SocketAbortedReceiveTimedOut
source: The socket was aborted because an asynchronous receive from the socket did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Работа сокета была прервана, так как асинхронный прием через сокет не был завершен в течение указанного периода ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.
