Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# SFxBadMetadataReference
source: Metadata contains a reference that cannot be resolved: '{0}'.
ru: Метаданные содержат ссылку, которую невозможно разрешить: "{0}".

# SFxBindingDoesNotHaveATransportBindingElement
source: The binding specified to do metadata exchange does not contain a TransportBindingElement.
ru: Указанная привязка для обмена метаданными не содержит элемент TransportBindingElement.

# SFxBindingMustContainTransport2
source: The binding (Name={0}, Namespace={1}) does not contain a TransportBindingElement.
ru: Привязка (имя={0}, пространство имен={1}) не содержит элемент TransportBindingElement.

# SFxBindingNotSupportedForMetadataHttpGet
source: The binding associated with ServiceMetadataBehavior or ServiceDebugBehavior is not supported. The inner binding elements used by this binding must support IReplyChannel. Verify that HttpGetBinding/HttpsGetBinding (on ServiceMetadataBehavior) and HttpHelpPageBinding/HttpsHelpPageBinding (on ServiceDebugBehavior) are supported.
ru: Не поддерживается привязка, связанная с ServiceMetadataBehavior или ServiceDebugBehavior. Внутренние элементы привязки, используемые этой привязкой, должны поддерживать IReplyChannel. Убедитесь, что поддерживаются HttpGetBinding/HttpsGetBinding (для ServiceMetadataBehavior) и HttpHelpPageBinding/HttpsHelpPageBinding (для ServiceDebugBehavior).

# SFxBodyCannotBeNull
source: Body object cannot be null in message {0}
ru: В сообщении {0} объект текста не может иметь значение null.

# SFxCallbackBehaviorAttributeOnlyOnDuplex
source: CallbackBehaviorAttribute can only be run as a behavior on an endpoint with a duplex contract. Contract '{0}' is not duplex, as it contains no callback operations.
ru: Атрибут CallbackBehaviorAttribute может запускаться только как поведение на конечной точке с дуплексным контрактом. Контракт "{0}" не является дуплексным, так как не содержит операций обратного вызова.

# SFxCallbackRequestReplyInOrder1
source: This operation would deadlock because the reply cannot be received until the current Message completes processing. If you want to allow out-of-order message processing, specify ConcurrencyMode of Reentrant or Multiple on {0}.
ru: Возможна взаимоблокировка этой операции, так как ответ невозможно получить до завершения обработки текущего сообщения. Если необходимо разрешить неупорядоченную обработку сообщений, задайте для ConcurrencyMode значение Reentrant или Multiple в {0}.

# SFxCannotActivateCallbackInstace
source: The dispatch instance for duplex callbacks cannot be activated - you must provide an instance.
ru: Не удается активировать отправку экземпляра для дуплексных обратных вызовов. Необходимо предоставить экземпляр.

# SFxCannotCallAutoOpenWhenExplicitOpenCalled
source: Cannot make a call on this channel because a call to Open() is in progress.
ru: Не удалось произвести вызов по этому каналу, так как выполняется вызов Open().

# SFxCannotGetMetadataFromLocation
source: The MetadataExchangeClient can only get metadata from http and https MetadataLocations. It cannot get metadata from '{0}'.
ru: Клиент MetadataExchangeClient может получить метаданные только из MetadataLocations HTTP и HTTPS. Он не может получить метаданные из "{0}".

# SFxCannotGetMetadataFromRelativeAddress
source: The MetadataExchangeClient can only get metadata from absolute addresses. It cannot get metadata from '{0}'.
ru: Клиент MetadataExchangeClient может получить метаданные только из абсолютных адресов. Он не может получить метаданные из "{0}".

# SFxCannotHaveDifferentTransactionProtocolsInOneBinding
source: The configured policy specifies more than one TransactionProtocol across the operations. A single TransactionProtocol for each endpoint must be specified.
ru: Настроенные параметры политики среди других операций содержат различные значения параметра TransactionProtocol. Необходимо указать только по одному параметру TransactionProtocol на каждую конечную точку.

# SFxCannotHttpGetMetadataFromAddress
source: The MetadataExchangeClient can only get metadata from http or https addresses when using MetadataExchangeClientMode HttpGet. It cannot get metadata from '{0}'.
ru: Клиент MetadataExchangeClient может получить метаданные только из адресов HTTP или HTTPS при использовании режима MetadataExchangeClientMode HttpGet. Он не может получить метаданные из "{0}".

# SFxCannotImportAsParameters_Bare
source: Generating message contract since the operation {0} is neither RPC nor document wrapped.
ru: Создание контракта сообщения, так как операция {0} не является ни RPC, ни упакованным документом.

# SFxCannotImportAsParameters_DifferentWrapperName
source: Generating message contract since the wrapper name ({1}) of message {0} does not match the default value ({2})
ru: Создание контракта сообщения, так как имя упаковщика ({1}) сообщения {0} не соответствует значению по умолчанию ({2}).

# SFxCannotImportAsParameters_DifferentWrapperNs
source: Generating message contract since the wrapper namespace ({1}) of message {0} does not match the default value ({2})
ru: Создание контракта сообщения, так как пространство имен упаковщика ({1}) сообщения {0} не соответствует значению по умолчанию ({2}).

# SFxCannotImportAsParameters_ElementIsNotNillable
source: Generating message contract since element name {0} from namespace {1} is not marked nillable
ru: Создание контракта сообщения, так как имя элемента {0} из пространства имен {1} не отмечено как обнуляемое.

# SFxCannotImportAsParameters_HeadersAreIgnoredInEncoded
source: Headers are not supported in RPC encoded format. Headers are ignored in message {0}.
ru: Формат с кодировкой RPC не поддерживает заголовки. В сообщении {0} заголовки игнорируются.

# SFxCannotImportAsParameters_HeadersAreUnsupported
source: Generating message contract since message {0} has headers
ru: Создание контракта сообщения, так как сообщение {0} имеет заголовки.

# SFxCannotImportAsParameters_Message
source: Generating message contract since the operation {0} has untyped Message as argument or return type
ru: Создание контракта сообщения, так как операция {0} имеет нетипизированное сообщение в качестве аргумента или типа возвращаемого значения.

# SFxCannotImportAsParameters_MessageHasProtectionLevel
source: Generating message contract since message {0} requires protection.
ru: Создание контракта сообщения, так как сообщение {0} требует защиты.

# SFxCannotImportAsParameters_NamespaceMismatch
source: Generating message contract since message part namespace ({0}) does not match the default value ({1})
ru: Создается контракт сообщения, так как пространство имен частей сообщения ({0}) не соответствует значению по умолчанию ({1}).

# SFxCannotImportAsParameters_OutputParameterAndTask
source: Generating message contract since the operation has multiple return values.
ru: Создается контракт сообщения, так как операция имеет много возвращаемых значений.

# SFxCannotSetExtensionsByIndex
source: This collection does not support setting extensions by index. Please consider using the InsertItem or RemoveItem methods.
ru: Данная коллекция не поддерживает задание расширений по индексу. Используйте методы InsertItem или RemoveItem.

# SFxChannelDispatcherNoMessageVersion
source: Cannot open ChannelDispatcher because it is does not have a MessageVersion set.
ru: Не удается открыть ChannelDispatcher, так как в нем отсутствует набор MessageVersion.

# SFxChannelDispatcherUnableToOpen1
source: The ChannelDispatcher at '{0}' is unable to open its IChannelListener as there are no endpoints for the ChannelDispatcher.
ru: ChannelDispatcher в "{0}" не может открыть свой IChannelListener, так как для ChannelDispatcher не указаны конечные точки.

# SFxChannelDispatcherUnableToOpen2
source: The ChannelDispatcher at '{0}' with contract(s) '{1}' is unable to open its IChannelListener.
ru: ChannelDispatcher в "{0}" с контрактом (контрактами) "{1}" не может открыть свой IChannelListener.

# SFxChannelFactoryCannotCreateFactoryWithoutDescription
source: CreateFactory requires that the Endpoint property be initialized. Either provide a valid ServiceEndpoint in the CreateDescription method or override the CreateFactory method to provide an alternative implementation.
ru: CreateFactory требует инициализации свойства Endpoint. Либо предоставьте допустимый элемент ServiceEndpoint в методе CreateDescription, либо измените настройку так, чтобы метод CreateFactory обеспечивал альтернативную реализацию.

# SFxChannelFactoryEndpointAddressUri
source: The Address property on ChannelFactory.Endpoint was null. The ChannelFactory's Endpoint must have a valid Address specified.
ru: Свойство Address в ChannelFactory.Endpoint имело значение null. Для конечной точки ChannelFactory необходимо указать допустимый адрес.

# SFxChannelFactoryNoBindingFoundInConfig1
source: The underlying channel factory could not be created because no binding information was found in the configuration file for endpoint with name '{0}'. Please check the endpoint configuration section with name '{0}' to ensure that binding information is present and correct.
ru: Не удалось создать фабрику выделенного канала, так как не найдена информация о привязке в файле конфигурации для конечной точки с именем "{0}". Проверьте раздел конфигурации конечной точки с именем "{0}" и обеспечьте наличие правильной информации о привязке.

# SFxChannelFactoryNoBindingFoundInConfigOrCode
source: The underlying channel factory could not be created because no Binding was passed to the ChannelFactory. Please supply a valid Binding instance via the ChannelFactory constructor.
ru: Не удалось создать фабрику выделенного канала, так как не был передан Binding в ChannelFactory. Передайте допустимый экземпляр Binding через конструктор ChannelFactory.

# SFxChannelFactoryTypeMustBeInterface
source: The type argument passed to the generic ChannelFactory class must be an interface type.
ru: Аргумент типа, переданный универсальному классу ChannelFactory, должен являться типом интерфейса.

# SFxClientOutputSessionAutoClosed
source: This channel can no longer be used to send messages as the output session was auto-closed due to a server-initiated shutdown. Either disable auto-close by setting the DispatchRuntime.AutomaticInputSessionShutdown to false, or consider modifying the shutdown protocol with the remote server.
ru: Данный канал больше не может использоваться для отправки сообщений, так как выходной сеанс был закрыт автоматически в результате отключения, инициированного сервером. Либо выключите режим автоматического закрытия, установив DispatchRuntime.AutomaticInputSessionShutdown на false, либо измените протокол отключения с удаленным сервером.

# SFxCloseTimedOut1
source: The ServiceHost close operation timed out after {0}. This could be because a client failed to close a sessionful channel within the required time. The time allotted to this operation may have been a portion of a longer timeout.
ru: Операция закрытия ServiceHost прервана по истечении времени ожидания {0}. Это может быть вызвано тем, что клиенту не удалось закрыть канал сеанса в течение отпущенного времени. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# SFxCollectionDoesNotSupportSet0
source: This collection does not support setting items by index.
ru: Эта коллекция не поддерживает задание объектов по индексу.

# SFxCollectionReadOnly
source: This operation is not supported because the collection is read-only.
ru: Эта операция не поддерживается, так как коллекция предназначена только для чтения.

# SFxCollectionWrongType2
source: The collection of type {0} does not support values of type {1}.
ru: Коллекция типа {0} не поддерживает значения типа {1}.

# SFxConfigurationNameCannotBeEmpty
source: The ConfigurationName property must be a non-empty string.
ru: Свойство ConfigurationName должно быть непустой строкой.

# SFxConflictingGlobalElement
source: Top level XML element with name {0} in namespace {1} cannot reference {2} type because it already references a different type ({3}). Use a different operation name or MessageBodyMemberAttribute to specify a different name for the Message or Message parts.
ru: XML-элемент верхнего уровня с именем {0} в пространстве имен {1} не может ссылаться на тип {2}, так как он уже ссылается на другой тип ({3}). Используйте другое имя операции или атрибут MessageBodyAttribute, чтобы указать другое имя для сообщения или частей сообщения.

# SFxConflictingGlobalType
source: Duplicate top level XML Schema type with name {0} in namespace {1}.
ru: Повторяющийся тип XML-схемы верхнего уровня с именем {0} в пространстве имен {1}.

# SFxContextModifiedInsideScope0
source: The value of OperationContext.Current is not the OperationContext value installed by this OperationContextScope.
ru: Значение конструкции OperationContext.Current не равно значению OperationContext, заданному этим элементом OperationContextScope.

# SFxContractDescriptionNameCannotBeEmpty
source: ContractDescription's Name must be a non-empty string.
ru: Имя элемента ContractDescription должно быть непустой строкой.

# SFxContractHasZeroInitiatingOperations
source: ContractDescription '{0}' has zero IsInitiating=true operations; a contract must have at least one IsInitiating=true operation.
ru: В ContractDescription "{0}" нет операций IsInitiating=true. Контракт должен иметь не менее одной операции IsInitiating=true.

# SFxContractHasZeroOperations
source: ContractDescription '{0}' has zero operations; a contract must have at least one operation.
ru: В ContractDescription "{0}" нет операций. Контракт должен иметь не менее одной операции.

# SFxContractInheritanceRequiresInterfaces
source: The service class of type {0} both defines a ServiceContract and inherits a ServiceContract from type {1}. Contract inheritance can only be used among interface types. If a class is marked with ServiceContractAttribute, it must be the only type in the hierarchy with ServiceContractAttribute. Consider moving the ServiceContractAttribute on type {1} to a separate interface that type {1} implements.
ru: Класс службы типа {0} одновременно определяет ServiceContract и наследует ServiceContract от типа {1}. Наследование контракта можно использовать только между типами интерфейсов. Если класс имеет атрибут ServiceContractAttribute, то он должен быть в иерархии единственным типом с ServiceContractAttribute. Перенесите атрибут ServiceContractAttribute типа {1} в отдельный интерфейс, который реализуется типом {1}.

# SFxContractInheritanceRequiresInterfaces2
source: The service class of type {0} both defines a ServiceContract and inherits a ServiceContract from type {1}. Contract inheritance can only be used among interface types. If a class is marked with ServiceContractAttribute, then another service class cannot derive from it.
ru: Класс службы типа {0} одновременно определяет ServiceContract и наследует ServiceContract от типа {1}. Наследование контракта можно использовать только между типами интерфейсов. Если класс имеет атрибут ServiceContractAttribute, то другой класс службы не может быть производным от него.

# SFxCopyToRequiresICollection
source: SynchronizedReadOnlyCollection's CopyTo only works if the underlying list implements ICollection.
ru: Элемент CopyTo коллекции SynchronizedReadOnlyCollection работает, если базовый список реализует ICollection.

# SFxCreateDuplexChannel1
source: The callback contract of contract {0} either does not exist or does not define any operations. If this is not a duplex contract, consider using ChannelFactory instead of DuplexChannelFactory.
ru: Контракт обратного вызова контракта {0} не существует или не определяет ни одной операции. Если он не является дуплексным контрактом, используйте ChannelFactory вместо DuplexChannelFactory.

# SFxCreateDuplexChannelBadCallbackUserObject
source: The InstanceContext provided to the ChannelFactory contains a UserObject that does not implement the CallbackContractType '{0}'.
ru: InstanceContext, предоставленный в ChannelFactory, содержит UserObject, который не реализует CallbackContractType "{0}".

# SFxCreateDuplexChannelNoCallback
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the DuplexChannelFactory was not initialized with an InstanceContext. Please call the CreateChannel overload that takes an InstanceContext.
ru: Перегрузка CreateChannel не может быть вызвана этим экземпляром DuplexChannelFactory, так как DuplexChannelFactory не был инициализирован с контекстом InstanceContext. Вызовите перегрузку CreateChannel, которая допускает InstanceContext.

# SFxCreateDuplexChannelNoCallback1
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the DuplexChannelFactory was initialized with a Type and no valid InstanceContext was provided. Please call the CreateChannel overload that takes an InstanceContext.
ru: Перегрузка CreateChannel не может быть вызвана этим экземпляром DuplexChannelFactory, так как DuplexChannelFactory был инициализирован с некоторым типом, но без предоставления допустимого контекста InstanceContext. Вызовите перегрузку CreateChannel, которая допускает InstanceContext.

# SFxCreateDuplexChannelNoCallbackUserObject
source: This CreateChannel overload cannot be called on this instance of DuplexChannelFactory, as the InstanceContext provided to the DuplexChannelFactory does not contain a valid UserObject.
ru: Перегрузка CreateChannel не может быть вызвана этим экземпляром DuplexChannelFactory, так как контекст InstanceContext, предоставленный DuplexChannelFactory, не содержит допустимый объект UserObject.

# SFxCreateNonDuplexChannel1
source: ChannelFactory does not support the contract {0} as it defines a callback contract with one or more operations. Please consider using DuplexChannelFactory instead of ChannelFactory.
ru: ChannelFactory не поддерживает контракт {0}, так как он определяет контракт обратного вызова с одной или несколькими операциями. Используйте DuplexChannelFactory вместо ChannelFactory.

# SFxCustomBindingNeedsTransport1
source: The CustomBinding on the ServiceEndpoint with contract '{0}' lacks a TransportBindingElement. Every binding must have at least one binding element that derives from TransportBindingElement.
ru: В привязке CustomBinding из ServiceEndpoint с контрактом "{0}" отсутствует элемент TransportBindingElement. Каждая привязка должна иметь по меньшей мере один элемент, производный от TransportBindingElement.

# SFxDataContractSerializerDoesNotSupportBareArray
source: DataContractSerializer does not support collection specified on element '{0}'
ru: DataContractSerializer не поддерживает коллекцию, указанную в элементе "{0}".

# SFxDataContractSerializerDoesNotSupportEncoded
source: Invalid OperationFormatUse specified in the OperationFormatStyle of operation {0}, DataContractSerializer supports only Literal.
ru: В OperationFormatStyle операции {0} указан недопустимый OperationFormatUse. DataContractSerializer поддерживает только Literal.

# SFxDeserializationFailed1
source: The formatter threw an exception while trying to deserialize the message: {0}
ru: Модуль форматирования вызвал исключение при попытке десериализовать сообщение: {0}

# SFxDisallowedAttributeCombination
source: The type or member named '{0}' could not be loaded because it has two incompatible attributes: '{1}' and '{2}'. To fix the problem, remove one of the attributes from the type or member.
ru: Не удалось загрузить тип или член с именем "{0}", так как он имеет два несовместимых атрибута: "{1}" и "{2}". Для устранения неполадки удалите один из атрибутов типа или члена.

# SFxDispatchRuntimeMessageCannotBeNull
source: In operation '{0}', cannot return null from methods that return Message.
ru: В операции "{0}" не удается вернуть значение null из методов, возвращающих сообщение.

# SFxDocEncodedFaultNotSupported
source: Fault could not be loaded as the Use setting is Encoded and it references a schema definition using Element attribute. To fix the problem, change the Use setting to Literal.
ru: Не удалось загрузить ошибку, поскольку параметр Use имеет значение Encoded и ссылается на определение схемы, используя атрибут Element. Чтобы устранить проблему, измените значение параметра Use на Literal.

# SFxDocEncodedNotSupported
source: Operation '{0}' could not be loaded as it uses an unsupported combination of Use and Style settings: Document with Encoded. To fix the problem, change the Use setting to Literal or change the Style setting to Rpc.
ru: Не удалось загрузить операцию "{0}", так как в ней используется неподдерживаемая комбинация параметров Use и Style: зашифрованный документ не поддерживается. Для устранения неполадки измените Use на Literal или Style на Rpc.

# SFxDocExt_Error
source: The service encountered an error.
ru: Служба обнаружила ошибку.

# SFxDocExt_MainPageComment
source: Use the 'client' variable to call operations on the service.
ru: Используйте переменную client, чтобы вызвать операции из службы.

# SFxDocExt_MainPageComment2
source: Always close the client.
ru: Всегда закрывать клиент.

# SFxDocExt_MainPageIntro1a
source: You have created a service.<P class='intro'>To test this service, you will need to create a client and use it to call the service. You can do this using the svcutil.exe tool from the command line with the following syntax:</P>
ru: Служба создана.<P class='intro'>Чтобы протестировать эту службу, необходимо создать клиент и воспользоваться им для вызова службы. Это можно сделать, запустив программу svcutil.exe из командной строки со следующим синтаксисом:</P>

# SFxDocExt_MainPageIntro1b
source: You have created a service.<P class='intro'>To test this service, you will need to create a client and use it to call the service; however, metadata publishing via ?WSDL is currently disabled. This can be enabled via the service's configuration file. </P>
ru: Служба создана.<P class='intro'>Чтобы протестировать эту службу, необходимо создать клиент и воспользоваться им для вызова службы. Однако публикация метаданных через ?WSDL в настоящее время отключена. Ее можно включить в файле конфигурации данной службы. </P>

# SFxDocExt_MainPageIntro2
source: This will generate a configuration file and a code file that contains the client class. Add the two files to your client application and use the generated client class to call the Service. For example:<BR/>
ru: Это ведет к созданию файла конфигурации и файла кода, содержащего класс клиента. Добавьте эти два файла в клиентское приложение и используйте сгенерированный класс клиента для вызова службы. Например:<BR/>

# SFxDocExt_MainPageIntroSingleWsdl
source: You can also access the service description as a single file:
ru: Доступ к описанию службы также можно получить как к одному файлу:

# SFxDocExt_MainPageTitle
source: {0} Service
ru: Служба {0}

# SFxDocExt_MainPageTitleNoServiceName
source: Service
ru: Служба

# SFxDocExt_NoMetadataConfigComment1
source: Note: the service name must match the configuration name for the service implementation.
ru: Примечание. Для реализации службы имя службы должно соответствовать имени конфигурации.

# SFxDocExt_NoMetadataConfigComment2
source: Add the following endpoint.
ru: Добавьте следующую конечную точку.

# SFxDocExt_NoMetadataConfigComment3
source: Note: your service must have an http base address to add this endpoint.
ru: Примечание. Для добавления этой конечной точки служба должна иметь базовый адрес http.

# SFxDocExt_NoMetadataConfigComment4
source: Add the following element to your service behavior configuration.
ru: Добавьте следующий элемент в конфигурацию поведения службы.
