Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# TheServiceMetadataExtensionInstanceCouldNot3_0
source: The ServiceMetadataExtension instance could not be removed from the ServiceHost instance because it has not been added to any ServiceHost instance.
ru: Экземпляр ServiceMetadataExtension не удалось удалить из экземпляра ServiceHost, так как он не был добавлен ни к какому экземпляру ServiceHost.

# TheServiceMetadataExtensionInstanceCouldNot4_0
source: The ServiceMetadataExtension instance could not be removed from the ServiceHost instance because it has already been added to a different ServiceHost instance.
ru: Экземпляр ServiceMetadataExtension не удалось удалить из экземпляра ServiceHost, так как он был добавлен к другому экземпляру ServiceHost.

source: TimeSpan must be greater than TimeSpan.Zero.
ru: Интервал TimeSpan должен быть больше интервала TimeSpan.Zero.

# TimeStampHasCreationAheadOfExpiry
source: The security timestamp is invalid because its creation time ('{0}') is greater than or equal to its expiration time ('{1}').
ru: Метка времени безопасности недействительна, так как ее время создания ("{0}") больше или равно времени истечения срока ее действия ("{1}").

# TimeStampHasCreationTimeInFuture
source: The security timestamp is invalid because its creation time ('{0}') is in the future. Current time is '{1}' and allowed clock skew is '{2}'.
ru: Метка времени безопасности недействительна, так как ее время создания ("{0}") относится к будущему. Текущее время: "{1}", допустимая разница в показаниях часов: "{2}".

# TimeStampHasExpiryTimeInPast
source: The security timestamp is stale because its expiration time ('{0}') is in the past. Current time is '{1}' and allowed clock skew is '{2}'.
ru: Метка времени безопасности недействительна, так как время истечения срока ее действия ("{0}") относится к прошлому. Текущее время: "{1}", допустимая разница в показаниях часов: "{2}".

# TimeStampWasCreatedTooLongAgo
source: The security timestamp is stale because its creation time ('{0}') is too far back in the past. Current time is '{1}', maximum timestamp lifetime is '{2}' and allowed clock skew is '{3}'.
ru: Метка времени безопасности просрочена, так как с ее времени создания ("{0}") прошло слишком много времени. Текущее время: "{1}", максимальное время жизни метки времени: "{2}", допустимая разница в показаниях часов: "{3}".

# TimeoutOnClose
source: The close operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Операция закрытия не была завершена в течение выделенного времени ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TimeoutOnOpen
source: The open operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Операция открытия не завершилась в течение указанного периода ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TimeoutOnOperation
source: The operation did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Не удалось выполнить операцию за выделенное время ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TimeoutServiceChannelConcurrentOpen1
source: Opening the channel timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Открытие канала прекращено после истечения времени ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TimeoutServiceChannelConcurrentOpen2
source: Opening the {0} channel timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Открытие канала {0} прекращено после истечения времени ожидания {1}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TokenCancellationNotSupported
source: The token provider '{0}' does not support token cancellation.
ru: Поставщик маркеров "{0}" не поддерживает отмену маркеров.

# TokenCannotCreateSymmetricCrypto
source: A symmetric crypto could not be created from token '{0}'.
ru: Не удалось создать симметричное шифрование на основе маркера "{0}".

# TokenDoesNotSupportKeyIdentifierClauseCreation
source: '{0}' does not support '{1}' creation.
ru: "{0}" не поддерживает создание "{1}".

# TokenProviderUnableToGetToken
source: The token provider '{0}' was unable to provide a security token.
ru: Поставщику маркеров "{0}" не удалось предоставить маркер безопасности.

# TokenProviderUnableToRenewToken
source: The token provider '{0}' was unable to renew the security token.
ru: Поставщику маркеров "{0}" не удалось возобновить маркер безопасности.

# TokenRenewalNotSupported
source: The token provider '{0}' does not support token renewal.
ru: Поставщик маркеров "{0}" не поддерживает возобновление маркеров.

# TokenRequirementDoesNotSpecifyTargetAddress
source: The token requirement '{0}' does not specify the target address. This is required by the token manager for creating the corresponding security token provider.
ru: Требование к маркеру "{0}" не определяет конечный адрес. Это требуется диспетчеру маркеров для создания соответствующего поставщика маркеров безопасности.

# TraceCodeCannotBeImportedInCurrentFormat
source: The given schema cannot be imported in this format.
ru: Данная схема не может быть импортирована в этом формате.

# TraceCodeConnectionPoolIdleTimeoutReached
source: A connection has exceeded the idle timeout of this connection pool ({0}) and been closed.
ru: Подключение превысило время ожидания простоя этого пула подключений ({0}) и было закрыто.

# TraceCodeConnectionPoolLeaseTimeoutReached
source: A connection has exceeded the connection lease timeout of this connection pool ({0}) and been closed.
ru: Подключение превысило время ожидания аренды подключения этого пула подключений ({0}) и было закрыто.

# TraceCodeConnectionPoolMaxOutboundConnectionsPerEndpointQuotaReached
source: MaxOutboundConnectionsPerEndpoint quota ({0}) has been reached, so connection was closed and not stored in this connection pool.
ru: Квота MaxOutboundConnectionsPerEndpoint ({0}) достигнута. Поэтому подключение было закрыто без сохранения в данном пуле подключений.

# TraceCodeMetadataExchangeClientReceiveReply
source: The MetadataExchangeClient received a reply.
ru: Клиент MetadataExchangeClient получил ответ.

# TraceCodeMetadataExchangeClientSendRequest
source: The MetadataExchangeClient is sending a request for metadata.
ru: Клиент MetadataExchangeClient отправляет запрос на метаданные.

# TraceCodeSecurity
source: A failure occured while performing a security related operation.
ru: При осуществлении операции, связанной с безопасностью, произошла ошибка.

# TransactionFlowBadOption
source: Invalid TransactionFlowOption value.
ru: Недопустимое значение TransactionFlowOption.

# TransactionFlowRequiredIssuedTokens
source: In order to flow a transaction, flowing issued tokens must also be supported.
ru: Чтобы обеспечить потоковую передачу транзакции, также должны поддерживаться выданные маркеры потока.

# TransferModeNotSupported
source: Transfer mode {0} is not supported by {1}.
ru: {1} не поддерживает режим передачи {0}.

# TransportBindingElementMustBeLast
source: In Binding '{0}', TransportBindingElement '{1}' does not appear last in the BindingElementCollection. Please change the order of elements such that the TransportBindingElement is last.
ru: В привязке "{0}" элемент TransportBindingElement "{1}" не появляется в коллекции BindingElementCollection последним. Измените порядок расположения элементов, чтобы элемент TransportBindingElement появлялся последним.

# TransportBindingElementNotFound
source: The binding does not contain a TransportBindingElement.
ru: В привязке отсутствует элемент TransportBindingElement.

# TransportDoesNotSupportCompression
source: The transport configured on this binding does not appear to support the CompressionFormat specified ({0}) on the message encoder. To resolve this issue, set the CompressionFormat on the {1} to '{2}' or use a different transport.
ru: Транспорт, настроенный для этой привязки, по-видимому, не поддерживает указанный формат CompressionFormat ({0}) в модуле шифрования сообщений. Для разрешения этой проблемы задайте формату CompressionFormat для {1} значение "{2}" или используйте другой транспорт.

# TrustDriverIsUnableToCreatedNecessaryAttachedOrUnattachedReferences
source: Unable to create Attached or Unattached reference for '{0}'.
ru: Не удается создать вложенную или невложенную ссылку для "{0}".

# TrustDriverVersionDoesNotSupportIssuedTokens
source: The configured WS-Trust version does not support issued tokens. WS-Trust February 2005 or later is required.
ru: Настроенная версия WS-Trust не поддерживает выпущенные маркеры. Используйте WS-Trust February 2005 или более позднюю версию.

# TrustDriverVersionDoesNotSupportSession
source: The configured Trust version does not support sessions. Use WSTrustFeb2005 or above.
ru: Настроенная версия Trust не поддерживает сеансы. Используйте WSTrustFeb2005 или более позднюю версию.

# TrustFailure
source: Could not establish trust relationship for the SSL/TLS secure channel with authority '{0}'.
ru: Не удалось установить отношения доверия для защищенного канала SSL/TLS с полномочиями "{0}".

# UnImportedAssertionList
source: XPath:{0}\r\n Assertions:
ru: XPath:{0}\r\n Утверждения:

# UnableToCreateKeyTypeElementForUnknownKeyType
source: Unable to create Key Type element for the Key Type '{0}'. This might be due to a wrong version of MessageSecurityVersion set on the SecurityBindingElement.
ru: Невозможно создать элемент Key Type для типа ключа "{0}". Это может быть вызвано неправильной версией набора MessageSecurityVersion в SecurityBindingElement.

source: Unable to create token reference.
ru: Не удается создать ссылку на маркер.

# UnableToFindPolicyWithId
source: A policy reference was ignored because the policy with ID '{0}' could not be found.
ru: Ссылка на политику была проигнорирована, так как не удалось найти политику с идентификатором "{0}".

# UnableToLocateOperation2
source: Cannot locate operation {0} in Contract {1}.
ru: Не удается найти операцию {0} в контракте {1}.

# UnableToObtainIssuerMetadata
source: Obtaining metadata from issuer '{0}' failed with error '{1}'.
ru: При получении метаданных от издателя "{0}" произошла ошибка "{1}".

# UnableToResolveHost
source: Cannot resolve the host name of URI \"{0}\" using DNS.
ru: Не удается разрешить имя узла URI \"{0}\" с помощью DNS.

# UnableToResolveKeyInfoForUnwrappingToken
source: Cannot resolve KeyInfo for unwrapping key: KeyInfo '{0}', available tokens '{1}'.
ru: Не удается разрешить KeyInfo для ключа развертывания: KeyInfo "{0}", доступные маркеры "{1}".

# UnableToResolveKeyReference
source: The token resolver is unable to resolve the security key reference '{0}'.
ru: Распознавателю маркеров не удается разрешить ссылку на ключ безопасности "{0}".

# UnableToResolveTokenReference
source: The token resolver is unable to resolve the token reference '{0}'.
ru: Распознавателю маркеров не удается разрешить ссылку на маркер "{0}".

# UnabletoImportPolicy
source: The following Policy Assertions were not Imported:\r\n
ru: Не были импортированы следующие утверждения политики:\r\n

# UnauthorizedAccess_MemStreamBuffer
source: MemoryStream's internal buffer cannot be accessed.
ru: Не удалось получить доступ к внутреннему буферу MemoryStream.

# UnboundPrefixInQName
source: Unbound prefix used in qualified name '{0}'.
ru: В проверенном имени "{0}" использован неограниченный префикс.

# UnexpectedBinarySecretType
source: Expected binary secret of type {0} but got secret of type {1}.
ru: Ожидался двоичный секрет типа {0}, однако получен секрет типа {1}.

# UnexpectedDuplicateElement
source: '{0}' from namespace '{1}' is not expected to appear more than once
ru: Появление "{0}" из пространства имен "{1}" не ожидается более одного раза.

# UnexpectedElementExpectingElement
source: '{0}' from namespace '{1}' is not expected. Expecting element '{2}' from namespace '{3}'
ru: "{0}" из пространства имен "{1}" не ожидается. Ожидается элемент "{2}" из пространства имен "{3}".

# UnexpectedEmptyElementExpectingClaim
source: The '{0}' from the '{1}' namespace is empty and does not specify a valid identity claim.
ru: "{0}" из пространства имен "{1}" пуст и не указывает допустимого требования удостоверения.

source: Unexpected end of file.
ru: Непредусмотренный конец файла.

# UnexpectedHttpResponseCode
source: The remote server returned an unexpected response: ({0}) {1}.
ru: Удаленный сервер вернул неожиданный ответ: ({0}) {1}.

# UnexpectedXmlChildNode
source: XML child node {0} of type {1} is unexpected for element {2}.
ru: Дочерний узел XML {0} типа {1} является неожиданным для элемента {2}.

# UnknownComputedKeyAlgorithm
source: The computed key algorithm '{0}' is not supported.
ru: Алгоритм вычисляемого ключа "{0}" не поддерживается.

# UnknownEncodingInBinarySecurityToken
source: Unrecognized encoding occurred while reading the binary security token.
ru: Нераспознанное кодирование при считывании двоичного маркера безопасности.

# UnknownListenerType1
source: The listener at Uri '{0}' could not be initialized because it was created for an unrecognized channel type.
ru: Инициализация прослушивателя на Uri "{0}" невозможна, так как он был создан для неопознанного типа канала.

# UnknownWSDLExtensionIgnored
source: An unrecognized WSDL extension of Type '{0}' was not handled.
ru: Нераспознанное расширение WSDL типа "{0}" не было обработано.

# UnrecognizedClaimTypeForIdentity
source: The ClaimType '{0}' is not recognized. Expected ClaimType '{1}'.
ru: ClaimType "{0}" не распознан. Ожидался ClaimType "{1}".

# UnrecognizedIdentityPropertyType
source: Unrecognized identity property type: '{0}'.
ru: Нераспознанный тип свойства удостоверения: "{0}".

# UnrecognizedIdentityType
source: Unrecognized identity type Name='{0}', Namespace='{1}'.
ru: Нераспознанный тип удостоверения, имя="{0}", пространство имен="{1}".

# UnrecognizedPolicyDocumentNamespace
source: The \"{0}\" namespace is not a recognized WS-Policy namespace.
ru: Пространство имен \"{0}\" является нераспознанным пространством имен WS-Policy.

# UnrecognizedPolicyElementInNamespace
source: Unrecognized policy element {0} in namespace {1}.
ru: Нераспознанный элемент политики {0} в пространстве имен {1}.

# UnsupportedBinaryEncoding
source: Binary encoding {0} is not supported.
ru: Двоичное кодирование {0} не поддерживается.

# UnsupportedBindingElementClone
source: The '{0}' binding element does not support cloning.
ru: Элемент привязки "{0}" не поддерживает клонирование.

# UnsupportedBindingProperty
source: The value '{1}' is not supported in this context for the binding property '{0}'.
ru: Значение "{1}" не поддерживается в этом контексте для свойства привязки "{0}".

# UnsupportedBooleanAttribute
source: Cannot import the policy. The value of the attribute '{0}' must be either 'true', 'false', '1' or '0'. The following error occurred: '{1}'.
ru: Невозможно импортировать политику. Значение атрибута "{0}" должно быть true, false, 1 или 0. Произошла следующая ошибка: "{1}".

# UnsupportedEnvelopeVersion
source: The {0} binding element requires envelope version '{1}' It doesn't support '{2}'.
ru: Элемент привязки {0} требует версию конверта "{1}" и не поддерживает "{2}".

# UnsupportedIssuerEntropyType
source: Issuer entropy is not BinarySecretSecurityToken or WrappedKeySecurityToken.
ru: Энтропия издателя не BinarySecretSecurityToken или WrappedKeySecurityToken.

# UnsupportedKeyDerivationAlgorithm
source: Key derivation algorithm '{0}' is not supported.
ru: Алгоритм формирования ключа "{0}" не поддерживается.

# UnsupportedPasswordType
source: The '{0}' username token has an unsupported password type.
ru: Неподдерживаемый тип пароля в маркере имени пользователя "{0}".

# UnsupportedPolicyDocumentRoot
source: \"{0}\" is not a supported WS-Policy document root element.
ru: \"{0}\" не поддерживается корневым элементом документа WS-Policy.

# UnsupportedSecureConversationBootstrapProtectionRequirements
source: Cannot import the security policy. The protection requirements for the secure conversation bootstrap binding are not supported. Protection requirements for the secure conversation bootstrap must require both the request and the response to be signed and encrypted.
ru: Не удается импортировать политику безопасности. Требования защиты для привязки загрузки защищенного диалога не поддерживаются. Согласно требованиям защиты для привязки загрузки защищенного диалога как запрос, так и ответ должны быть подписаны и зашифрованы.

# UnsupportedSecurityPolicyAssertion
source: An unsupported security policy assertion was detected during the security policy import: {0}
ru: Обнаружено утверждение неподдерживаемой политики безопасности при импорте политики безопасности: {0}

# UnsupportedSecuritySetting
source: The value '{1}' is not supported in this context for the binding security property '{0}'.
ru: Значение "{1}" не поддерживается в этом контексте для свойства безопасности привязки "{0}".

# UnsupportedSslProtectionLevel
source: The protection level '{0}' was specified, yet SSL transport security only supports EncryptAndSign.
ru: Указан уровень защиты "{0}", однако защита транспорта SSL поддерживает только EncryptAndSign.

# UnsupportedTokenImpersonationLevel
source: The value '{1}' for the '{0}' property is not supported in Windows Store apps.
ru: Значение "{1}" не поддерживается в приложениях из Магазина Windows для свойства "{0}".

# UnsupportedUpgradeAcceptor
source: The StreamUpgradeAcceptor specified ({0}) is not supported by this IStreamUpgradeChannelBindingProvider implementation. The most likely cause of this is passing a StreamUpgradeAcceptor that was not created by the StreamUpgradeProvider associated with this IStreamUpgradeChannelBindingProvider implementation.
ru: Указанный объект StreamUpgradeAcceptor ({0}) не поддерживается в данной реализации интерфейса IStreamUpgradeChannelBindingProvider. Вероятной причиной этого может быть передача объекта StreamUpgradeAcceptor, который был создан не поставщиком StreamUpgradeProvider, связанным с данной реализацией интерфейса IStreamUpgradeChannelBindingProvider.

# UnsupportedUpgradeInitiator
source: The StreamUpgradeInitiator specified ({0}) is not supported by this IStreamUpgradeChannelBindingProvider implementation. The most likely cause of this is passing a StreamUpgradeInitiator that was not created by the StreamUpgradeProvider associated with the current IStreamUpgradeChannelBindingProvider implementation.
ru: Указанный объект StreamUpgradeInitiator ({0}) не поддерживается в данной реализации интерфейса IStreamUpgradeChannelBindingProvider. Вероятной причиной этого может быть передача объекта StreamUpgradeInitiator, который был создан не поставщиком StreamUpgradeProvider, связанным с текущей реализацией интерфейса IStreamUpgradeChannelBindingProvider.

# UnsupportedWSDLOnlyOneMessage
source: Unsupported WSDL, only one message part is supported for fault messages. This fault message references zero or more than one message part. If you have edit access to the WSDL file, you can fix the problem by removing the extra message parts such that fault message references just one part.
ru: Неподдерживаемый WSDL, для сообщений об ошибках поддерживается только одна часть сообщения. Это сообщение об ошибке ссылается на нуль или на несколько частей сообщения. Если возможен доступ к файлу WSDL с правом редактирования, то можно устранить неполадку путем удаления дополнительных частей сообщения, чтобы сообщение об ошибке ссылалось только на одну часть.

# UnsupportedWSDLTheFault
source: Unsupported WSDL, the fault message part must reference an element. This fault message does not reference an element. If you have edit access to the WSDL document, you can fix the problem by referencing a schema element using the 'element' attribute.
ru: Неподдерживаемый WSDL, часть сообщения об ошибке должна ссылаться на некоторый элемент. Данное сообщение об ошибке не ссылается на элемент. Если возможен доступ к файлу WSDL с правом редактирования, то можно устранить неполадку ссылкой на элемент схемы, используя атрибут element.

# UriGeneratorSchemeMustNotBeEmpty
source: The scheme parameter must not be empty.
ru: Этот параметр схемы не должен быть пустым.

# UriMustBeAbsolute
source: The given URI must be absolute.
ru: Данный URI должен быть абсолютным.

# UserNameCannotBeEmpty
source: The username cannot be empty.
ru: Имя пользователя не может быть пустым.

# UserNamePasswordNotProvidedOnClientCredentials
source: The username is not provided. Specify username in ClientCredentials.
ru: Имя пользователя не предоставлено. Укажите имя пользователя в ClientCredentials.

# ValueMustBeGreaterThanZero
source: The value of this argument must be greater than 0.
ru: Значение этого аргумента должно быть больше 0.

# ValueMustBeInRange
source: The value of this argument must fall within the range {0} to {1}.
ru: Значение этого аргумента должно попадать в интервал от {0} до {1}.

# ValueMustBeNonNegative
source: The value of this argument must be non-negative.
ru: Значение этого аргумента должно быть неотрицательным.

# ValueMustBePositive
source: The value of this argument must be positive.
ru: Значение этого аргумента должно быть положительным.

# WSHttpDoesNotSupportRMWithHttps
source: Binding validation failed because the WSHttpBinding does not support reliable sessions over transport security (HTTPS). The channel factory or service host could not be opened. Use message security for secure reliable messaging over HTTP.
ru: Ошибка проверки привязки, так как WSHttpBinding не поддерживает надежные сеансы с режимом защиты транспорта (HTTPS). Не удалось открыть фабрику канала или узел службы. Для надежного обмена сообщениями по HTTP используйте режим безопасности сообщений.

# WaitForMessageTimedOut
source: WaitForMessage timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: WaitForMessage закрыто после истечения времени ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# WarnDuplicateBindingQNameNameOnExport
source: Similar ServiceEndpoints were exported. The WSDL export process was forced to suffix wsdl:binding names to avoid naming conflicts.\r\n Similar ServiceEndpoints means different binding instances having the Name: {0} and Namespace: {1} and either the same ContractDescription or at least the same contract Name: {2}.
ru: Экспортированы похожие конечные точки ServiceEndpoints. Процесс экспорта WSDL был вынужден добавлять суффикс wsdl:binding к именам, чтобы избежать конфликта имен.\r\n Похожие конечные точки ServiceEndpoints означают наличие разных экземпляров привязки с именем {0} и пространством имен {1} и одним элементом ContractDescription или по крайней мере одним именем контракта {2}.
