Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# IgnoreSoapFaultBinding3
source: Ignoring invalid SOAP fault extension in wsdl:operation name='{0}' from targetNamespace='{1}'. Reason: {2}
ru: Игнорируется недопустимое расширение ошибки SOAP в wsdl:operation name="{0}" из targetNamespace="{1}". Причина: {2}

# IgnoreSoapHeaderBinding3
source: Ignoring invalid SOAP header extension in wsdl:operation name='{0}' from targetNamespace='{1}'. Reason: {2}
ru: Игнорируется недопустимое расширение заголовка SOAP в wsdl:operation name="{0}" в targetNamespace="{1}". Причина: {2}

# ImpersonationLevelNotSupported
source: The authentication modes using Kerberos do not support the impersonation level '{0}'. Specify identification or impersonation.
ru: Режимы аутентификации с помощью Kerberos не поддерживают уровень олицетворения "{0}". Укажите идентификацию или олицетворение.

# InAContractInheritanceHierarchyIfParentHasCallbackChildMustToo
source: Because base ServiceContract '{0}' has a CallbackContract '{1}', derived ServiceContract '{2}' must also specify either '{1}' or a derived type as its CallbackContract.
ru: Так как базовый контракт ServiceContract "{0}" имеет CallbackContract "{1}", производный контракт ServiceContract "{2}" также должен указывать в качестве CallbackContract "{1}" или производный тип.

# InAContractInheritanceHierarchyTheServiceContract3_2
source: In a contract inheritance hierarchy, the ServiceContract's CallbackContract must be a subtype of the CallbackContracts of all of the CallbackContracts of the ServiceContracts inherited by the original ServiceContract, Types {0} and {1} violate this rule.
ru: В иерархии наследования контрактов CallbackContract контракта ServiceContract должен быть подтипом CallbackContract всех контрактов CallbackContracts контракта ServiceContracts, наследованных исходным контрактом ServiceContract, Типы {0} и {1} нарушают это правило.

# InValidateId
source: Expecting all chars - c - of id to be in set [Char.IsLetter(c), Char.IsNumber(c), '.', '_', '-'], found '{0}'.
ru: Ожидается, что все символы - c - в идентификаторе будут в наборе [Char.IsLetter(c), Char.IsNumber(c), ".", "_", "-"], обнаружено "{0}".

# InValidateIdPrefix
source: Expecting first char - c - to be in set [Char.IsLetter(c) && c == '_'], found '{0}'.
ru: Ожидается, что первый символ ("c") будет относиться к набору [Char.IsLetter(c) && c == '_'], но найден "{0}".

# IncorrectBinaryNegotiationValueType
source: Incoming binary negotiation has invalid ValueType {0}.
ru: Входящее двоичное согласование имеет недопустимый тип ValueType {0}.

# InnerChannelFactoryWasNotSet
source: Cannot open ChannelFactory as the inner channel factory was not set during the initialization process.
ru: Невозможно открыть ChannelFactory, так как в ходе инициализации не была задана фабрика внутренних каналов.

# InputTypeListEmptyError
source: The input handler list cannot be empty.
ru: Список входных обработчиков не может быть пустым.

# InsufficentMemory
source: Insufficient memory avaliable to complete the operation.
ru: Недостаточно памяти для завершения операции.

# InternalError
source: An unexpected error has occurred.
ru: Произошла непредвиденная ошибка.

# InvalidAsyncBeginMethodSignatureForMethod2
source: Invalid async Begin method signature for method {0} in ServiceContract type {1}. Your begin method must take an AsyncCallback and an object as the last two arguments and return an IAsyncResult.
ru: Недопустимая сигнатура асинхронного метода Begin для метода {0} в типе ServiceContract {1}. Метод Begin должен принимать AsyncCallback и объект в качестве последних двух аргументов и вернуть IAsyncResult.

# InvalidAsyncEndMethodSignatureForMethod2
source: Invalid async End method signature for method {0} in ServiceContract type {1}. Your end method must take an IAsyncResult as the last argument.
ru: Недопустимая подпись асинхронного метода End для метода {0} в типе ServiceContract {1}. Метод End должен принимать IAsyncResult в качестве последнего аргумента.

# InvalidBindingScheme
source: The TransportBindingElement of type '{0}' in this CustomBinding returned a null or empty string for the Scheme. TransportBindingElement's Scheme must be a non-empty string.
ru: Элемент TransportBindingElement типа "{0}" в этой привязке CustomBinding вернул null или пустую строку для Scheme. Схема элемента TransportBindingElement должна быть непустой строкой.

source: Invalid decoder state machine.
ru: Недопустимый конечный автомат декодера.

# InvalidEnumArgument
source: The value of argument '{0}' ({1}) is invalid for Enum type '{2}'.
ru: Значение аргумента "{0}" ({1}) не является допустимым для перечисляемого типа "{2}".

# InvalidEnumValue
source: Unexpected internal enum value: {0}.
ru: Неожиданное внутреннее значение перечисления: {0}.

# InvalidIdentityElement
source: Cannot read the Identity element. The Identity type is not supported or the Identity element is empty.
ru: Не удается прочитать элемент Identity. Возможно, тип Identity неподдерживаемый или элемент Identity пустой.

# InvalidKeyLengthRequested
source: The key length '{0}' requested is invalid.
ru: Запрошенная длина ключа "{0}" является недопустимой.

# InvalidMessageState
source: An internal error has occurred. Invalid MessageState.
ru: Произошла внутренняя ошибка. Недопустимый MessageState.

# InvalidQName
source: The QName is invalid.
ru: Параметр QName недопустим.

# InvalidReaderPositionOnCreateMessage
source: The XmlReader used for the body of the message must be positioned on an element.
ru: XmlReader, примененный к тексту сообщения, должен быть установлен на некотором элементе.

# InvalidTokenProvided
source: The token provider of type '{0}' did not return a token of type '{1}'. Check the credential configuration.
ru: Поставщик маркера типа "{0}" не возвратил маркер типа "{1}". Проверьте конфигурацию учетных данных.

# InvalidTypedProxyMethodHandle
source: The specified method handle is incorrect for the proxy of type '{0}'
ru: Указанный дескриптор метода неверен для прокси типа "{0}".

# InvalidUriScheme
source: The provided URI scheme '{0}' is invalid; expected '{1}'.
ru: Указанная схема URI "{0}" недопустима. Ожидалась "{1}".

# InvalidUriValue
source: Value '{0}' provided for '{1}' from namespace '{2}' is an invalid absolute URI.
ru: Значение "{0}", указанное для "{1}" из пространства имен "{2}", является недопустимым абсолютным URI.

# InvalidX509RawData
source: Invalid binary representation of an X.509 certificate.
ru: Недопустимое двоичное представление сертификата X.509.

# InvalidXmlQualifiedName
source: Expected XML qualified name, found '{0}'.
ru: Ожидалось проверенное имя XML, найдено "{0}".

# IssuedTokenAuthenticationModeRequiresSymmetricIssuedKey
source: The IssuedToken security authentication mode requires the issued token to contain a symmetric key.
ru: Защищенный режим аутентификации IssuedToken требует, чтобы выданный маркер содержал симметричный ключ.

# ItemAvailableInDeserializedRSTOnly
source: {0} is only available in a deserialized RequestSecurityToken.
ru: {0} является единственно доступным в десериализованном RequestSecurityToken.

# ItemAvailableInDeserializedRSTROnly
source: {0} is only available in a deserialized RequestSecurityTokenResponse.
ru: {0} является единственно доступным в десериализованном RequestSecurityTokenResponse.

# ItemDoesNotExistInSynchronizedKeyedCollection0
source: Item does not exist in SynchronizedKeyedCollection.
ru: Объект отсутствует в коллекции SynchronizedKeyedCollection.

# ItemNotAvailableInDeserializedRST
source: {0} is not available in deserialized RequestSecurityToken.
ru: {0} недоступен в десериализованном RequestSecurityToken.

# ItemNotAvailableInDeserializedRSTR
source: {0} is not available in deserialized RequestSecurityTokenResponse.
ru: {0} недоступен в десериализованном RequestSecurityTokenResponse.

# KeyIdentifierCannotCreateKey
source: This SecurityKeyIdentifier does not have any clause that can create a key.
ru: Этот идентификатор SecurityKeyIdentifier не содержит предложения, которые могут создавать ключ.

# KeyIdentifierClauseDoesNotSupportKeyCreation
source: This SecurityKeyIdentifierClause does not support key creation.
ru: Этот SecurityKeyIdentifierClause не поддерживает создание ключей.

# KeyLengthMustBeMultipleOfEight
source: Key length '{0}' is not a multiple of 8 for symmetric keys.
ru: Длина ключа "{0}" не кратна 8, как полагается для симметричных ключей.

# KeyLifetimeNotWithinTokenLifetime
source: The key effective and expiration times must be bounded by the token effective and expiration times.
ru: Время начала и конца действия ключа должно быть ограничено временем начала и конца действия маркера.

# LastMessageNumberExceeded
source: A message was received with a sequence number higher than the sequence number of the last message in this sequence. This is a violation of the sequence number protocol. The reliable session was faulted.
ru: Получено сообщение, порядковый номер которого выше порядкового номера последнего сообщения в данной последовательности, что является нарушением протокола порядковых номеров. Это привело к сбою надежного сеанса.

# LengthMustBeGreaterThanZero
source: The length of this argument must be greater than 0.
ru: Длина этого аргумента должна быть больше 0.

# LocalIdCannotBeEmpty
source: The localId cannot be empty. Specify a valid 'localId'.
ru: Идентификатор localId не может быть пустым. Укажите допустимый localId.

# LockTimeoutExceptionMessage
source: Cannot claim lock within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Не удается затребовать блокировку в выделенный интервал времени {0}. Время, отведенное для этой операции, может входить в более длительный интервал времени ожидания.

# ManualAddressingNotSupported
source: Binding validation failed because the TransportBindingElement's ManualAddressing property was set to true on a binding that is configured to create reliable sessions. This combination is not supported and the channel factory or service host was not opened.
ru: Ошибка при проверке привязки, поскольку для свойства ManualAddressing элемента TransportBindingElement было задано значение true в привязке, которая настроена для создания надежных сеансов. Такая комбинация не поддерживается, поэтому фабрика канала или узел службы не открыты.

# ManualAddressingRequiresAddressedMessages
source: Manual addressing is enabled on this factory, so all messages sent must be pre-addressed.
ru: Для этой фабрики включена ручная адресация. Поэтому для всех отправляемых сообщений необходимо заранее указать адрес.

# MaxBufferSizeMustMatchMaxReceivedMessageSize
source: For TransferMode.Buffered, MaxReceivedMessageSize and MaxBufferSize must be the same value.
ru: Для TransferMode.Buffered параметры MaxReceivedMessageSize и MaxBufferSize должны иметь одно и то же значение.

source: MaxBufferSize must not exceed MaxReceivedMessageSize.
ru: Значение параметра MaxBufferSize не должно превышать значения параметра MaxReceivedMessageSize.

# MaxReceivedMessageSizeExceeded
source: The maximum message size quota for incoming messages ({0}) has been exceeded. To increase the quota, use the MaxReceivedMessageSize property on the appropriate binding element.
ru: Превышена квота на максимальный размер сообщения для входящих сообщений ({0}). Чтобы увеличить квоту, воспользуйтесь свойством MaxReceivedMessageSize соответствующего элемента привязки.

# MaxReceivedMessageSizeMustBeInIntegerRange
source: This factory buffers messages, so the message sizes must be in the range of an integer value.
ru: Эта фабрика помещает сообщения в буфер, поэтому размер сообщений должен быть целым числом.

# MaxSentMessageSizeExceeded
source: The maximum message size quota for outgoing messages ({0}) has been exceeded.
ru: Превышена квота на максимальный размер сообщения для исходящих сообщений ({0}).

# MaximumPolicyRedirectionsExceeded
source: The recursive policy fetching limit has been reached. Check to determine if there is a loop in the federation service chain.
ru: Достигнут предел выборки рекурсивной политики. Проверьте наличие петли в цепочке служб федерации.

# MessageBodyIsStream
source: ... stream ...
ru: …поток…

# MessageBodyMissing
source: A body element was not found inside the message envelope.
ru: Элемент body не найден в конверте сообщения.

# MessageBodyReaderInvalidReadState
source: The body reader is in ReadState '{0}' and cannot be consumed.
ru: Модуль чтения текста сообщения находится в состоянии ReadState "{0}" и не может быть использован.

# MessageBodyToStringError
source: ... Error reading body: {0}: {1} ...
ru: ... Ошибка при чтении текста сообщения: {0}: {1} ...

source: MessageBuffer is closed.
ru: Буфер MessageBuffer закрыт.

# MessageClosed
source: Message is closed.
ru: Сообщение закрыто.

# MessageHasBeenCopied
source: This message cannot support the operation because it has been copied.
ru: Это сообщение не поддерживает данную операцию, так как оно уже скопировано.

# MessageHasBeenRead
source: This message cannot support the operation because it has been read.
ru: Это сообщение не поддерживает данную операцию, так как оно уже прочитано.

# MessageHasBeenWritten
source: This message cannot support the operation because it has been written.
ru: Это сообщение не поддерживает данную операцию, так как оно уже записано.

# MessageHeaderIsNull0
source: The value of the addressHeaders argument is invalid because the collection contains null values. Null is not a valid value for the AddressHeaderCollection.
ru: Значение аргумента addressHeaders недопустимо, так как коллекция содержит нулевые значения. Null не является допустимым значением для AddressHeaderCollection.

# MessageHeaderVersionMismatch
source: The version of the header(s) ({0}) differs from the version of the message ({1}).
ru: Версия заголовков ({0}) отличается от версии сообщения ({1}).

# MessageHeaderVersionNotSupported
source: The '{0}' header cannot be added because it does not support the specified message version '{1}'.
ru: Не удается добавить заголовок "{0}", так как он не поддерживает указанную версию сообщения "{1}".

# MessageIsEmpty
source: The body of the message cannot be read because it is empty.
ru: Невозможно прочитать текст сообщения, так как оно пустое.

# MessageNumberRollover
source: The maximum message number for this sequence has been exceeded. The reliable session was faulted.
ru: Для данной последовательности превышено максимальное число сообщений. Это привело к сбою надежного сеанса.

# MessagePropertiesArraySize0
source: The array passed does not have enough space to hold all the properties contained by this collection.
ru: Переданный массив не имеет достаточно места для размещения всех свойств, принадлежащих этой коллекции.

# MessagePropertyNotFound
source: A property with the name '{0}' is not present.
ru: Отсутствует свойство с именем "{0}".

# MessagePropertyReturnedNullCopy
source: The IMessageProperty could not be copied. CreateCopy returned null.
ru: Не удалось скопировать IMessageProperty. CreateCopy вернул null.

# MessageSecurityVersionOutOfRange
source: SecurityVersion must be WsSecurity10 or WsSecurity11.
ru: Версия SecurityVersion должна быть WsSecurity10 или WsSecurity11.

# MessageSizeMustBeInIntegerRange
source: This Factory buffers messages, so the message sizes must be in the range of a int value.
ru: Эта фабрика помещает сообщения в буфер, поэтому размеры сообщений должны быть представлены целочисленными значениями.

# MessageTextEncodingNotSupported
source: The text encoding '{0}' used in the text message format is not supported.
ru: Кодировка текста "{0}", использованная в формате текстового сообщения, не поддерживается.

# MessageVersionMissingFromBinding
source: None of the binding elements in binding '{0}' define a message version. At least one binding element must define a message version and return it from the GetProperty<MessageVersion> method.
ru: Ни один элемент привязки в привязке "{0}" не определяет версию сообщения. По меньшей мере один элемент привязки должен определить версию сообщения и вернуть ее из метода GetProperty<MessageVersion>.

# MessageVersionUnknown
source: Unrecognized message version.
ru: Неизвестная версия сообщения.

# MessageXmlProtocolError
source: There is a problem with the XML that was received from the network. See inner exception for more details.
ru: Имеется проблема в XML-данных, полученных из сети. Подробнее см. в описании внутреннего исключения.

# MillisecondsNotConvertibleToBindingRange
source: The {0} assertion's Milliseconds attribute does not fall within the range this binding uses. The ReliableSessionBindingElement could not be created.
ru: Значение атрибута Milliseconds утверждения {0} не попадает в диапазон, используемый этой привязкой. Не удалось создать элемент ReliableSessionBindingElement.

# MissingContentType
source: The receiver returned an error indicating that the content type was missing on the request to {0}. See the inner exception for more information.
ru: Получатель вернул ошибку с указанием, что в запросе на {0} отсутствует тип содержимого. Подробнее см. в описании внутреннего исключения.

# MissingCustomCertificateValidator
source: X509CertificateValidationMode.Custom requires a CustomCertificateValidator. Specify the CustomCertificateValidator property.
ru: X509CertificateValidationMode.Custom требует CustomCertificateValidator. Укажите свойство CustomCertificateValidator.

# MissingKeyInfoInEncryptedKey
source: The KeyInfo clause is missing or empty in EncryptedKey.
ru: Конструкция KeyInfo в EncryptedKey отсутствует или пуста.

# MissingMessageID
source: Request Message is missing a MessageID header. One is required to correlate a reply.
ru: В сообщении запроса отсутствует заголовок MessageID. Этот заголовок требуется для корреляции ответа.

# MoreThanOneEndMethodFoundForAsyncBeginMethod3
source: OperationContract method '{0}' in type '{1}' does not properly implement the async pattern, as more than one corresponding method '{2}' was found. When using the async pattern, exactly one end method must be provided. Either remove or rename one or more of the '{2}' methods such that there is just one, or set the AsyncPattern property on method '{0}' to false.
ru: Метод OperationContract "{0}" в типе "{1}" не реализует должным образом асинхронный шаблон, поскольку было найдено несколько соответствующих методов "{2}". При использовании асинхронного шаблона требуется предоставить только один метод End. Удалите или переименуйте один или несколько методов "{2}", чтобы оставить только один, или установите для свойства AsyncPattern в методе "{0}" значение false.

# MtomEncoderBadMessageVersion
source: MessageVersion '{0}' not supported by MTOM encoder.
ru: Версия MessageVersion "{0}" не поддерживается шифратором MTOM.

# MultipleCallsToExportContractWithSameContract
source: Calling IWsdlExportExtension.ExportContract twice with the same ContractDescription is not supported.
ru: Не поддерживается двойной вызов IWsdlExportExtension.ExportContract с одним и тем же параметром ContractDescription.

# MultipleIdentities
source: The extensions cannot contain an Identity if one is supplied as a constructor argument.
ru: Расширения не могут содержать удостоверение, если оно предоставлено как аргумент конструктора.

# MultipleIssuerEndpointsFound
source: Policy for multiple issuer endpoints was retrieved from '{0}' but the relying party's policy does not specify which issuer endpoint to use. One of the endpoints was selected as the issuer endpoint to use. If you are using svcutil, the other endpoints will be available in commented form in the configuration as <alternativeIssuedTokenParameters>. Check the configuration to ensure that the right issuer endpoint was selected.
ru: Политика для нескольких конечных точек поставщиков извлечена из "{0}", но в политике зависимой стороны не указывается используемая конечная точка поставщика. Одна из данных конечных точек была выбрана в качестве используемой конечной точки поставщика. При использовании svcutil остальные конечные точки будут доступны в конфигурации в закомментированном виде, <alternativeIssuedTokenParameters>. Проверьте конфигурацию, чтобы убедиться в выборе правильного поставщика.

# MultipleMebesInParameters
source: More than one MessageEncodingBindingElement was found in the BindingParameters of the BindingContext. This usually is caused by having multiple MessageEncodingBindingElements in a CustomBinding. Remove all but one of these elements.
ru: Обнаружено несколько элементов MessageEncodingBindingElement в BindingParameters контекста BindingContext. Это обычно связано с наличием нескольких элементов MessageEncodingBindingElements в CustomBinding. Удалите все элементы, кроме одного.

# MultipleMessageHeaders
source: Multiple headers with name '{0}' and namespace '{1}' found.
ru: Найдено несколько заголовков с именем "{0}" и пространством имен "{1}".

# MultipleMessageHeadersWithActor
source: Multiple headers with name '{0}' and namespace '{1}' and role '{2}' found.
ru: Найдено несколько заголовков с именем "{0}", пространством имен "{1}" и ролью "{2}".

# MultipleRelatesToHeaders
source: Multiple RelatesTo headers with relationship '{0}' found. Only one is allowed per relationship.
ru: Найдено несколько заголовков RelatesTo с отношением "{0}". Для каждого соотношения разрешается только один заголовок.

# MultipleSecurityCredentialsManagersInChannelBindingParameters
source: The ClientCredentials cannot be added to the binding parameters because the binding parameters already contains a SecurityCredentialsManager '{0}'. If you are configuring custom credentials for the channel, please first remove any existing ClientCredentials from the behaviors collection before adding the custom credential.
ru: Невозможно добавить ClientCredentials к параметрам привязки, так как в параметрах привязки уже содержится SecurityCredentialsManager "{0}". Если выполняется настройка особых учетных данных для канала, сначала удалите все существующие ClientCredentials из коллекции поведений, а затем добавьте особые учетные данные.

# MultipleStreamUpgradeProvidersInParameters
source: More than one IStreamUpgradeProviderElement was found in the BindingParameters of the BindingContext. This usually is caused by having multiple IStreamUpgradeProviderElements in a CustomBinding. Remove all but one of these elements.
ru: Найдено несколько элементов IStreamUpgradeProviderElement в BindingParameters контекста BindingContext. Это обычно связано с наличием нескольких элементов IStreamUpgradeProviderElements в CustomBinding. Удалите все элементы, кроме одного.
