Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# SocketAbortedSendTimedOut
source: The socket connection was aborted because an asynchronous send to the socket did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Подключение к сокету прервано, так как асинхронная отправка через сокет не завершилась в течение указанного периода ожидания {0}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# SocketCloseReadReceivedData
source: A graceful close was attempted on the socket, but the other side ({0}) is still sending data.
ru: Произведена попытка мягкого закрытия сокета, однако другая сторона ({0}) продолжает отправку данных.

# SocketCloseReadTimeout
source: The remote endpoint of the socket ({0}) did not respond to a close request within the allotted timeout ({1}). It is likely that the remote endpoint is not calling Close after receiving the EOF signal (null) from Receive. The time allotted to this operation may have been a portion of a longer timeout.
ru: Удаленная конечная точка сокета ({0}) не ответила на запрос закрытия в течение установленного времени ожидания ({1}). Возможно, удаленная конечная точка не вызывает Close после получения сигнала конца файла EOF (null) от Receive. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# SocketConnectionDisposed
source: The socket connection has been disposed.
ru: Подключение к сокету было ликвидировано.

# SpaceNeededExceedsMessageFrameOffset
source: The space needed for encoding ({0} bytes) exceeds the message frame offset.
ru: Пространство, необходимое для кодирования ({0} байт), превышает смещение кадров сообщения.

# StandardsManagerCannotWriteObject
source: The token Serializer cannot serialize '{0}'. If this is a custom type you must supply a custom serializer.
ru: Cериализатор маркеров не может сериализовать "{0}". Если используется особый тип, необходимо предоставить особый сериализатор.

# StreamDoesNotSupportTimeout
source: TimeoutStream requires an inner Stream that supports timeouts; its CanTimeout property must be true.
ru: TimeoutStream требует внутреннего потока, поддерживающего значения времени ожидания. Его свойство CanTimeout должно иметь значение true.

# StreamError
source: An error occurred while transmitting data.
ru: Ошибка при передаче данных.

# StreamMutualAuthNotSatisfied
source: The remote server did not satisfy the mutual authentication requirement.
ru: Удаленный сервер не удовлетворяет требованию взаимной аутентификации.

# StreamUpgradeUnsupportedChannelBindingKind
source: The StreamUpgradeProvider {0} does not support the specified ChannelBindingKind ({1}).
ru: Поставщик StreamUpgradeProvider {0} не поддерживает указанное перечисление ChannelBindingKind ({1}).

# SuiteDoesNotAcceptAlgorithm
source: The algorithm '{0}' is not accepted for operation '{1}' by algorithm suite {2}.
ru: Алгоритм "{0}" не принят для операции "{1}" набором алгоритмов {2}.

# SuppliedMessageIsNotAReplyItHasNoRelatesTo0
source: A reply message was received without a valid RelatesTo header. This may have been caused by a missing RelatesTo header or a RelatesTo header with an invalid WS-Addressing Relationship type.
ru: Принято ответное сообщение без допустимого заголовка RelatesTo. Возможно, это вызвано тем, что заголовок RelatesTo отсутствует или для него указан недопустимый тип отношения WS-Addressing.

# SupportedAddressingModeNotSupported
source: The '{0}' addressing mode is not supported.
ru: Режим адресации "{0}" не поддерживается.

# SymmetricKeyLengthTooShort
source: The length of the symmetric key specified is too short ({0} bytes).
ru: Указанный симметричный ключ слишком короткий ({0} байт).

# SymmetricSecurityBindingElementNeedsProtectionTokenParameters
source: SymmetricSecurityBindingElement cannot build a channel or listener factory. The ProtectionTokenParameters property is required but not set. Binding element configuration: {0}
ru: SymmetricSecurityBindingElement не может создать фабрику каналов или прослушивателей. Свойство ProtectionTokenParameters необходимо, но не задано. Конфигурация элемента привязки: {0}

# SyncAsyncMatchConsistency_Attributes6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, any additional attributes must be declared on the synchronous OperationContract method. In this case, the asynchronous OperationContract method '{2}' has one or more attributes of type '{5}'. To fix it, remove the '{5}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" в типе "{1}" был связан с асинхронными методами OperationContract "{2}" и "{3}", так как они имеют одно и то же имя операции "{4}". Если синхронный метод OperationContract связан с парой асинхронных методов OperationContract, все дополнительные атрибуты должны быть объявлены в синхронном методе OperationContract. В этом случае асинхронный метод OperationContract "{2}" имеет один или более атрибутов типа "{5}". Чтобы устранить неполадку, удалите атрибут или атрибуты "{5}" из метода "{2}". Кроме того, можно изменить имя одного из методов, чтобы предотвратить возникновение соответствия между ними.

# SyncAsyncMatchConsistency_Parameters5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" в типе "{1}" был связан с асинхронными методами OperationContract "{2}" и "{3}", так как они имеют одно и то же имя операции "{4}". Если синхронный метод OperationContract связан с парой асинхронных методов OperationContract, оба метода OperationContract должны определить одинаковое количество и тип параметров. В этом случае некоторые аргументы отличаются друг от друга. Чтобы устранить неполадку, обеспечьте определение методами OperationContract одинакового количества и типов аргументов, расположенных в одинаковом порядке. Кроме того, можно изменить имя одного из методов, чтобы предотвратить возникновение соответствия между ними.

# SyncAsyncMatchConsistency_Property6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must have the same value for the '{5}' property. In this case, the values are different. To fix it, change the '{5} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" в типе "{1}" был связан с асинхронными методами OperationContract "{2}" и "{3}", так как они имеют одно и то же имя операции "{4}". Если синхронный метод OperationContract связан с парой асинхронных методов OperationContract, оба метода OperationContract должны иметь одно и то же значение для свойства "{5}". В этом случае значения отличаются. Чтобы устранить неполадку, измените значение свойства "{5}" в одном из методов в соответствии со значением в другом методе. Кроме того, можно изменить имя одного из методов, чтобы предотвратить возникновение соответствия между ними.

# SyncAsyncMatchConsistency_ReturnType5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{3}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" в типе "{1}" был связан с асинхронными методами OperationContract "{2}" и "{3}", так как они имеют одно и то же имя операции "{4}". Если синхронный метод OperationContract связан с парой асинхронных методов OperationContract, оба метода OperationContract должны определить один и тот же тип возвращаемого значения. В этом случае типы возвращаемых значений отличаются. Чтобы устранить неполадку, обеспечьте одинаковые типы возвращаемого значения в методах "{0}" и "{3}". Кроме того, можно изменить имя одного из методов, чтобы предотвратить возникновение соответствия между ними.

# SyncTaskMatchConsistency_Attributes6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, any additional attributes must be declared on the synchronous OperationContract method. In this case, the task-based asynchronous OperationContract method '{2}' has one or more attributes of type '{4}'. To fix it, remove the '{4}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" класса "{1}" был сопоставлен с асинхронным методом OperationContract на основе задачи "{2}", поскольку они используют одно и то же имя операции "{3}". Если синхронный метод OperationContract сопоставлен с асинхронным методом OperationContract на основе задачи, любые дополнительные атрибуты должны быть определены в синхронном методе OperationContract. В этом случае асинхронный метод на основе задачи OperationContract "{2}" имеет один или несколько атрибутов типа "{4}". Чтобы разрешить эту проблему, удалите атрибут или атрибуты "{4}" из метода "{2}". Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# SyncTaskMatchConsistency_Parameters5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" класса "{1}" был сопоставлен с асинхронным методом OperationContract на основе задачи "{2}", поскольку они используют одно и то же имя операции "{3}". Если синхронный метод OperationContract сопоставлен с асинхронным методом OperationContract на основе задачи, эти два контракта OperationContract должны определять одинаковое количество параметров одних и тех же типов. В данном случае некоторые аргументы отличаются. Чтобы разрешить эту проблему, убедитесь, что контракты OperationContract определяют одинаковое количество аргументов одних и тех же типов и в одном и том же порядке. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# SyncTaskMatchConsistency_Property6
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must have the same value for the '{4}' property. In this case, the values are different. To fix it, change the '{4} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" класса "{1}" был сопоставлен с асинхронным методом OperationContract на основе задачи "{2}", поскольку они используют одно и то же имя операции "{3}". Если синхронный метод OperationContract сопоставлен с асинхронным методом OperationContract на основе задачи, эти два контракта OperationContract должны иметь одинаковое значение свойства "{4}". В данном случае эти значения различны. Чтобы разрешить эту проблему, измените свойство "{4}" одного из контрактов OperationContract так, чтобы они соответствовали друг другу. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# SyncTaskMatchConsistency_ReturnType5
source: The synchronous OperationContract method '{0}' in type '{1}' was matched with the task-based asynchronous OperationContract method '{2}' because they have the same operation name '{3}'. When a synchronous OperationContract method is matched to a task-based asynchronous OperationContract method, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{2}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
ru: Синхронный метод OperationContract "{0}" класса "{1}" был сопоставлен с асинхронным методом OperationContract на основе задачи "{2}", поскольку они используют одно и то же имя операции "{3}". Если синхронный метод OperationContract сопоставлен с асинхронным методом OperationContract на основе задачи, эти два контракта OperationContract должны определять одинаковый тип возвращаемого значения. В данном случае типы возвращаемого значения различны. Чтобы разрешить эту проблему, убедитесь, что метод "{0}" и метод "{2}" имеют один и тот же тип возвращаемого значения. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# SynchronizedCollectionWrongType1
source: A value of type '{0}' cannot be added to the generic collection, because the collection has been parameterized with a different type.
ru: Невозможно добавить значение типа "{0}" в универсальную коллекцию, так как коллекция параметризована другим типом.

# SynchronizedCollectionWrongTypeNull
source: A null value cannot be added to the generic collection, because the collection has been parameterized with a value type.
ru: Невозможно добавить значение null в универсальную коллекцию, так как коллекция параметризована типом значения.

# TaskAsyncMatchConsistency_Attributes6
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, any additional attributes must be declared on the task-based asynchronous OperationContract method. In this case, the asynchronous OperationContract method '{2}' has one or more attributes of type '{5}'. To fix it, remove the '{5}' attribute or attributes from method '{2}'. Alternatively, changing the name of one of the methods will prevent matching.
ru: Асинхронный метод на основе задачи OperationContract "{0}" типа "{1}" был сопоставлен с асинхронными методами OperationContract "{2}" и "{3}", поскольку они имеют одно и то же имя операции "{4}". Если асинхронный метод OperationContract на основе задачи сопоставлен с парой асинхронных методов OperationContract, любые дополнительные атрибуты должны быть определены в асинхронном методе OperationContract на основе задачи. В данном случае асинхронный метод OperationContract "{2}" имеет один или несколько атрибутов типа "{5}". Чтобы разрешить эту проблему, удалите атрибут или атрибуты "{5}" из метода "{2}". Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# TaskAsyncMatchConsistency_Parameters5
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same number and types of parameters. In this case, some of the arguments are different. To fix it, ensure that the OperationContracts define the same number and types of arguments, in the same order. Alternatively, changing the name of one of the methods will prevent matching.
ru: Асинхронный метод на основе задачи OperationContract "{0}" типа "{1}" был сопоставлен с асинхронными методами OperationContract "{2}" и "{3}", поскольку они имеют одно и то же имя операции "{4}". Если асинхронный метод OperationContract сопоставлен с парой асинхронных методов OperationContract, эти два контракта OperationContract должны определять одинаковое количество параметров одних и тех же типов. В данном случае некоторые аргументы отличаются. Чтобы разрешить эту проблему, убедитесь, что контракты OperationContract определяют одинаковое количество аргументов одних и тех же типов и в одном и том же порядке. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# TaskAsyncMatchConsistency_Property6
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a task-based asynchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must have the same value for the '{5}' property. In this case, the values are different. To fix it, change the '{5} property of one of the OperationContracts to match the other. Alternatively, changing the name of one of the methods will prevent matching.
ru: Асинхронный метод на основе задачи OperationContract "{0}" типа "{1}" был сопоставлен с асинхронными методами OperationContract "{2}" и "{3}", поскольку они имеют одно и то же имя операции "{4}". Если асинхронный метод OperationContract на основе задачи сопоставлен с парой асинхронных методов OperationContract, эти два контракта OperationContract должны иметь одинаковое значение свойства "{5}". В данном случае эти значения различны. Чтобы разрешить эту проблему, измените свойство "{5}" одного из контрактов OperationContract так, чтобы они соответствовали друг другу. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# TaskAsyncMatchConsistency_ReturnType5
source: The task-based asynchronous OperationContract method '{0}' in type '{1}' was matched with the asynchronous OperationContract methods '{2}' and '{3}' because they have the same operation name '{4}'. When a synchronous OperationContract method is matched to a pair of asynchronous OperationContract methods, the two OperationContracts must define the same return type. In this case, the return types are different. To fix it, ensure that method '{0}' and method '{3}' have the same return type. Alternatively, changing the name of one of the methods will prevent matching.
ru: Асинхронный метод на основе задачи OperationContract "{0}" типа "{1}" был сопоставлен с асинхронными методами OperationContract "{2}" и "{3}", поскольку они имеют одно и то же имя операции "{4}". Если синхронный метод OperationContract сопоставлен с парой асинхронных методов OperationContract, эти два контракта OperationContract должны определять одинаковый тип возвращаемого значения. В данном случае типы возвращаемого значения различны. Чтобы разрешить эту проблему, убедитесь, что метод "{0}" и метод "{3}" имеют один и тот же тип возвращаемого значения. Можно также изменить имя одного из методов, чтобы предотвратить совпадение.

# TcpConnectError
source: Could not connect to {0}. TCP error code {1}: {2}.
ru: Не удалось подключиться к {0}. Код ошибки TCP {1}: {2}.

# TcpConnectErrorWithTimeSpan
source: Could not connect to {0}. The connection attempt lasted for a time span of {3}. TCP error code {1}: {2}.
ru: Не удалось подключиться к {0}. Попытки подключения выполнялись в течение интервала времени {3}. Код ошибки TCP {1}: {2}.

# TcpConnectNoBufs
source: Insufficient winsock resources available to complete socket connection initiation.
ru: Недостаточно доступных ресурсов Winsock для завершения инициации подключения через сокет.

# TcpConnectingToViaTimedOut
source: Connecting to via {0} timed out after {1}. Connection attempts were made to {2} of {3} available addresses ({4}). Check the RemoteAddress of your channel and verify that the DNS records for this endpoint correspond to valid IP Addresses. The time allotted to this operation may have been a portion of a longer timeout.
ru: Завершение подключения к {0} по истечении времени ожидания {1}. Были выполнены попытки подключения к {2} из {3} доступных адресов ({4}). Проверьте RemoteAddress канала и убедитесь, что записи DNS для этой конечной точки соответствуют допустимым IP-адресам. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TcpConnectionResetError
source: The socket connection was aborted. This could be caused by an error processing your message or a receive timeout being exceeded by the remote host, or an underlying network resource issue. Local socket timeout was '{0}'.
ru: Подключение к сокету было прервано. Возможно, это вызвано ошибкой обработки сообщения, превышением времени ожидания на удаленном узле или проблемой с выделенным сетевым ресурсом. Время ожидания локального сокета: "{0}".

# TcpConnectionTimedOut
source: The socket transfer timed out after {0}. You have exceeded the timeout set on your binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: После {0} истекло время ожидания передачи через сокет. Превышен период ожидания, установленный в привязке. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# TcpLocalConnectionAborted
source: The socket connection was aborted by your local machine. This could be caused by a channel Abort(), or a transmission error from another thread using this socket.
ru: Подключение через сокет прервано локальным компьютером. Это может быть вызвано обрывом канала или ошибкой передачи от другого потока через этот сокет.

# TcpTransferError
source: A TCP error ({0}: {1}) occurred while transmitting data.
ru: Ошибка TCP ({0}: {1}) при передаче данных.

# TheServiceMetadataExtensionInstanceCouldNot2_0
source: The ServiceMetadataExtension instance could not be added to the ServiceHost instance because it has already been added to another ServiceHost instance.
ru: Экземпляр ServiceMetadataExtension не удалось добавить к экземпляру ServiceHost, так как он уже добавлен к другому экземпляру ServiceHost.
