Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# EntropyModeRequiresIssuerEntropy
source: The issuer must provide key entropy in key entropy mode '{0}'.
ru: Поставщик должен предоставить энтропию ключа в режиме энтропии ключа "{0}".

# EntropyModeRequiresProofToken
source: The issuer must provide a proof token in key entropy mode '{0}'.
ru: Поставщик должен предоставить маркер проверки в режиме энтропии ключа "{0}".

# EntropyModeRequiresRequestorEntropy
source: The client must provide key entropy in key entropy mode '{0}'.
ru: Клиент должен предоставить энтропию ключа в режиме энтропии ключа "{0}".

# EnvelopeVersionNotSupported
source: Envelope Version '{0}' is not supported.
ru: Версия конверта "{0}" не поддерживается.

# EnvelopeVersionUnknown
source: Unrecognized envelope version: {0}.
ru: Нераспознанная версия конверта: {0}.

# ErrorDeserializingKeyIdentifierClauseFromTokenXml
source: There was an error creating the security key identifier clause from the security token XML. Please see the inner exception for more details.
ru: Ошибка при создании конструкции идентификатора ключа безопасности из XML маркера безопасности. Подробнее см. во внутреннем исключении.

# ErrorDeserializingTokenXml
source: There was an error deserializing the security token XML. Please see the inner exception for more details.
ru: Ошибка при десериализации XML маркера безопасности. Подробнее см. во внутреннем исключении.

# ErrorImportingIssuerMetadata
source: Importing metadata from issuer '{0}' failed with error '{1}'.
ru: При импортировании метаданных от поставщика "{0}" произошла ошибка "{1}".

# ErrorInLine
source: Error in line {0} position {1}.
ru: Ошибка в строке {0}, позиция {1}.

# ErrorSerializingSecurityToken
source: There was an error serializing the security token. Please see the inner exception for more details.
ru: Ошибка при сериализации маркера безопасности. Подробнее см. во внутреннем исключении.

# ExceededMaxPolicyComplexity
source: The policy expression was not fully imported because it exceeded the maximum allowable complexity. The import stopped at element '{0}' '{1}'.
ru: Выражение политики было импортировано не полностью, так как оно превысило максимально допустимую сложность. Импорт остановлен на элементе "{0}" "{1}".

# ExceededMaxPolicySize
source: The policy expression was not fully imported because its normalized form was too large.
ru: Выражение политики было импортировано не полностью, так как его нормализованная форма была слишком большой.

# ExpectedElementMissing
source: Element '{0}' with namespace '{1}' not found.
ru: Элемент "{0}" с пространством имен "{1}" не найден.

# ExpectedOneOfTwoElementsFromNamespace
source: Expected element '{0}' or element '{1}' (from namespace '{2}').
ru: Ожидаемый элемент "{0}" или "{1}" (из пространства имен "{2}").

source: Security policy export failed. The binding contains a TransportSecurityBindingElement but no transport binding element that implements ITransportTokenAssertionProvider. Policy export for such a binding is not supported. Make sure the transport binding element in the binding implements the ITransportTokenAssertionProvider interface.
ru: Ошибка экспорта политики безопасности. Привязка содержит TransportSecurityBindingElement, но отсутствует элемент привязки транспорта, реализующий ITransportTokenAssertionProvider. Экспорт политики для такой привязки не поддерживается. Убедитесь, что элемент привязки транспорта в данной привязке реализует интерфейс ITransportTokenAssertionProvider.

# ExtendedProtectionNotSupported
source: Extended protection is not supported on this platform. Please install the appropriate patch or change the ExtendedProtectionPolicy on the Binding or BindingElement to a value with a PolicyEnforcement value of \"Never\" or \"WhenSupported\".
ru: Расширенная защита для этой платформы не поддерживается. Установите соответствующее обновление или измените значение политики ExtendedProtectionPolicy для Binding или BindingElement на значение PolicyEnforcement Never или WhenSupported.

# ExtraContentIsPresentInFaultDetail
source: Additional XML content is present in the fault detail element. Only a single element is allowed.
ru: Дополнительное XML-содержимое представлено в элементе с информацией об ошибке. Разрешается только один элемент.

# FailedToCreateTypedProxy
source: Failed to create a typed proxy for type '{0}'
ru: Не удалось создать типизированный прокси для типа "{0}".

# FaultConverterCreatedException
source: {0} returned false from OnTryCreateException, but returned a non-null Exception (See InnerException for details).
ru: {0} вернул значение false от OnTryCreateException, а также ненулевое исключение (подробнее см. во внутреннем исключении).

# FaultConverterCreatedFaultMessage
source: {0} returned false from OnTryCreateFaultMessage, but returned a non-null fault message.
ru: {0} вернул значение false от OnTryCreateFaultMessage, а также ненулевое сообщение об ошибке.

# FaultConverterDidNotCreateException
source: {0} returned true from OnTryCreateException, but did not return an Exception.
ru: {0} вернул значение true от OnTryCreateException, но не вернул исключение.

# FaultConverterDidNotCreateFaultMessage
source: {0} returned true from OnTryCreateFaultMessage, but did not return a fault message.
ru: {0} вернул значение true от OnTryCreateFaultMessage, но не вернул сообщение об ошибке.

# FaultDoesNotHaveAnyDetail
source: The fault does not have detail information.
ru: В сообщении об ошибке не содержится подробная информация.

# FoundMultipleCerts
source: Found multiple X.509 certificates using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'. Provide a more specific find value.
ru: Несколько сертификатов X.509 найдено с помощью условий StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}". Укажите более точное значение.

# FoundMultipleCertsForTarget
source: Found multiple X.509 certificates using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' for target '{4}'. Provide a more specific find value.
ru: Несколько сертификатов X.509 найдено с помощью условий StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}" для целевого объекта "{4}". Укажите более точное значение.

# FramingAtEnd
source: An attempt was made to decode a value after the framing stream was ended.
ru: После завершения потока кадрирования была предпринята попытка декодировать значение.

# FramingContentTypeMismatch
source: Content Type {0} was not supported by service {1}. The client and service bindings may be mismatched.
ru: Тип содержимого {0} не поддерживается службой {1}. Это может быть вызвано несоответствием привязок клиента и службы.

# FramingContentTypeTooLong
source: The framing content type size ({0}) exceeds the quota.
ru: Размер типа содержимого кадрирования ({0}) превысил установленную квоту.

# FramingContentTypeTooLongFault
source: Content type '{0}' is too long to be processed by the remote host. See the server logs for more details.
ru: Тип содержимого "{0}" является слишком длинным, чтобы быть обработанным удаленным узлом. Подробнее см. в журналах сервера.

# FramingError
source: Error while reading message framing format at position {0} of stream (state: {1})
ru: Ошибка при чтении формата кадрирования сообщения в позиции {0} потока (состояние: {1}).

# FramingFaultTooLong
source: The framing fault size ({0}) exceeds the quota.
ru: Размер ошибки кадрирования ({0}) превышает квоту.

# FramingFaultUnrecognized
source: Server faulted with code '{0}'.
ru: Сбой сервера с кодом "{0}".

# FramingMaxMessageSizeExceeded
source: The maximum message size quota for incoming messages has been exceeded for the remote channel. See the server logs for more details.
ru: Превышена квота максимального размера сообщения для удаленного канала. Подробнее см. в журналах сервера.

# FramingModeNotSupported
source: Framing mode {0} is not supported.
ru: Режим кадрирования {0} не поддерживается.

# FramingModeNotSupportedFault
source: The .Net Framing mode being used is not supported by '{0}'. See the server logs for more details.
ru: "{0}" не поддерживает используемый режим .Net Framing. Подробнее см. в журналах сервера.

# FramingPrematureEOF
source: More data was expected, but EOF was reached.
ru: Ожидалось большее количество данных, однако был достигнут конец файла.

# FramingRecordTypeMismatch
source: Expected record type '{0}', found '{1}'.
ru: Ожидался тип записи "{0}", найден "{1}".

# FramingSizeTooLarge
source: Specified size is too large for this implementation.
ru: Указанный размер слишком велик для данной реализации.

# FramingUpgradeInvalid
source: The requested upgrade is not supported by '{0}'. This could be due to mismatched bindings (for example security enabled on the client and not on the server).
ru: "{0}" не поддерживает запрошенное обновление. Это может быть вызвано несоответствием привязок (например, защита включена на клиенте, но не на сервере).

# FramingValueNotAvailable
source: The value cannot be accessed because it has not yet been fully decoded.
ru: Нет доступа к значению, так как оно еще не полностью декодировалось.

# FramingVersionNotSupported
source: Framing major version {0} is not supported.
ru: Основная версия кадрирования {0} не поддерживается.

# FramingVersionNotSupportedFault
source: The .Net Framing version being used is not supported by '{0}'. See the server logs for more details.
ru: "{0}" не поддерживает используемую версию .Net Framing. Подробнее см. в журналах сервера.

# FramingViaNotUri
source: The framing via ({0}) is not a valid URI.
ru: Кадрирование следующего прыжка ({0}) не является допустимым URI.

# FramingViaTooLong
source: The framing via size ({0}) exceeds the quota.
ru: Размер кадрирования следующего прыжка ({0}) превышает квоту.

# FramingViaTooLongFault
source: Via '{0}' is too long to be processed by the remote host. See the server logs for more details.
ru: Размер прыжка "{0}" слишком велик для обработки удаленным узлом. Подробнее см. в журналах сервера.

# GeneralSchemaValidationError
source: There was an error verifying some XML Schemas generated during export:\r\n{0}
ru: Ошибка при проверке некоторых схем XML, сгенерированных во время экспорта:\r\n{0}

# HeaderAlreadyNotUnderstood
source: The message header with name '{0}' and namespace '{1}' is not present in the set of understood headers.
ru: Заголовок сообщения с именем "{0}" и пространством имен "{1}" отсутствует в наборе изученных заголовков.

# HeaderAlreadyUnderstood
source: The message header with name '{0}' and namespace '{1}' is already present in the set of understood headers.
ru: Заголовок сообщения с именем "{0}" и пространством имен "{1}" уже присутствует в наборе изученных заголовков.

# HeaderNotFound
source: There is not a header with name {0} and namespace {1} in the message.
ru: В данном сообщении нет заголовка с именем {0} и пространством имен {1}.

# HeadersCannotBeAddedToEnvelopeVersion
source: Envelope Version '{0}' does not support adding Message Headers.
ru: Версия конверта "{0}" не поддерживает добавление заголовков сообщений.

# Hosting_ServiceActivationFailed
source: The requested service, '{0}' could not be activated. See the server's diagnostic trace logs for more information.
ru: Не удается активировать запрошенную службу "{0}". Дополнительные сведения см. в журналах диагностического отслеживания сервера.

# HttpAddressingNoneHeaderOnWire
source: The incoming message contains a SOAP header representing the WS-Addressing '{0}', yet the HTTP transport is configured with AddressingVersion.None. As a result, the message is being dropped. If this is not desired, then update your HTTP binding to support a different AddressingVersion.
ru: Входящее сообщение содержит SOAP-заголовок, представляющий WS-Addressing "{0}", однако транспорт HTTP настроен с версией адресации AddressingVersion.None. В результате сообщение отбрасывается. Если это нежелательно, обновите привязку HTTP для поддержки другой версии адресации AddressingVersion.

# HttpAuthDoesNotSupportRequestStreaming
source: HTTP request streaming cannot be used in conjunction with HTTP authentication. Either disable request streaming or specify anonymous HTTP authentication.
ru: Потоки запросов HTTP нельзя использовать совместно с аутентификацией HTTP. Отключите поток запросов или укажите анонимную аутентификацию HTTP.

# HttpAuthSchemeCannotBeNone
source: The value specified for the AuthenticationScheme property on the HttpTransportBindingElement ('{0}') is not allowed when building a ChannelFactory. If you used a standard binding, ensure the ClientCredentialType is not set to HttpClientCredentialType.InheritedFromHost, a value which is invalid on a client. If you set the value to '{0}' directly on the HttpTransportBindingElement, please set it to Digest, Negotiate, NTLM, Basic, or Anonymous.
ru: Указанное значение свойства AuthenticationScheme элемента HttpTransportBindingElement ("{0}") не разрешено при построении фабрики ChannelFactory. Если используется стандартная привязка, убедитесь, что свойству ClientCredentialType не задано значение HttpClientCredentialType.InheritedFromHost, которое недопустимо для клиента. Если значение для "{0}" задается непосредственно в элементе HttpTransportBindingElement, используйте значение "Дайджест", "Согласование", NTLM, "Обычная" или "Анонимная".

# HttpAuthorizationFailed
source: The HTTP request is unauthorized with client authentication scheme '{0}'. The authentication header received from the server was '{1}'.
ru: Запрос HTTP не разрешен для схемы аутентификации клиента "{0}". От сервера получен заголовок аутентификации "{1}".

# HttpAuthorizationForbidden
source: The HTTP request was forbidden with client authentication scheme '{0}'.
ru: Запрос HTTP запрещен для схемы аутентификации клиентов "{0}".

# HttpClientCredentialTypeInvalid
source: ClientCredentialType '{0}' can only be used on the server side, not the client side. Please use one of the following values instead 'None, Basic, Client, Digest, Ntlm, Windows'.
ru: Тип ClientCredentialType "{0}" может использоваться на стороне сервера, но не клиента. Используйте вместо этого одно из следующих значений: None, Basic, Client, Digest, Ntlm, Windows.

# HttpContentLengthIncorrect
source: The number of bytes available is inconsistent with the HTTP Content-Length header. There may have been a network error or the client may be sending invalid requests.
ru: Количество доступных байт несовместимо с HTTP-заголовком Content-Length. Возможно, произошла сетевая ошибка или клиент отправляет недопустимые запросы.

# HttpContentTypeFormatException
source: An error ({0}) occurred while parsing the content type of the HTTP request. The content type was: {1}.
ru: Произошла ошибка ({0}) при разборе типа содержимого запроса HTTP. Тип содержимого: {1}.

# HttpContentTypeHeaderRequired
source: An HTTP Content-Type header is required for SOAP messaging and none was found.
ru: Не найден HTTP-заголовок Content-Type, требуемый для обмена сообщениями SOAP.

# HttpCookieContextExchangeMechanismNotCompatibleWithTransportCookieSetting
source: ContextBindingElement of binding {0}:{1} is configured with ContextExchangeMode.HttpCookie but the configuration of this binding's HttpTransportBindingElement prevents upper channel layers from managing cookies. Please set the HttpTransportBindingElement.AllowCookies property to false or change the ContextExchangeMechanism of ContextBindingElement to SoapHeader.
ru: ContextBindingElement привязки {0}:{1} настроен с ContextExchangeMode.HttpCookie, но конфигурация HttpTransportBindingElement этой привязки препятствует управлению файлами cookie верхними уровнями канала. Установите для свойства HttpTransportBindingElement.AllowCookies значение false или измените ContextExchangeMechanism для ContextBindingElement в SoapHeader.

# HttpCookieContextExchangeMechanismNotCompatibleWithTransportType
source: Binding {1}:{2} is configured with ContextExchangeMechanism.HttpCookie which is not compatible with the transport type {0}. Please modify the ContextExchangeMechanism or use HTTP or HTTPS transport.
ru: Привязка {1}:{2} настроена с параметром ContextExchangeMechanism.HttpCookie, что несовместимо с типом {0} транспорта. Измените параметр ContextExchangeMechanism или используйте транспорт HTTP или HTTPS.

# HttpIfModifiedSinceParseError
source: The value specified, '{0}', for the If-Modified-Since header does not parse into a valid date. Check the property value and ensure that it is of the proper format.
ru: Указанное для заголовка If-Modified-Since значение "{0}" не удается проанализировать как допустимые данные. Проверьте данное значение свойства и убедитесь в том, что оно имеет правильный формат.

# HttpMaxPendingAcceptsTooLargeError
source: The value of MaxPendingAccepts should not be larger than {0}.
ru: Значение MaxPendingAccepts не должно превышать {0}.

# HttpMessageHandlerTypeNotSupported
source: Invalid type: '{0}'. It must inherit from base type '{1}', cannot be abstract, and must expose a public default constructor.
ru: Недопустимый тип: "{0}". Он должен наследовать свойства базового типа "{1}", не может быть абстрактным и должен предоставлять общий конструктор по умолчанию.

# HttpPipelineNotSupportedOnClientSide
source: The property '{0}' is not supported when building a ChannelFactory. The property value must be null when calling BuildChannelFactory.
ru: Свойство "{0}" не поддерживается при создании новой фабрики ChannelFactory. Значение этого свойства при вызове метода BuildChannelFactory должно быть нулевым.

# HttpReceiveFailure
source: An error occurred while receiving the HTTP response to {0}. This could be due to the service endpoint binding not using the HTTP protocol. This could also be due to an HTTP request context being aborted by the server (possibly due to the service shutting down). See server logs for more details.
ru: Ошибка при получении ответа HTTP на {0}. Возможно, это вызвано тем, что привязка конечной точки службы не использует протокол HTTP. Это может быть также вызвано тем, что контекст запроса HTTP прерван сервером (возможно, из-за отключения службы). Подробнее см. в журналах сервера.

# HttpRequestTimedOut
source: The HTTP request to '{0}' has exceeded the allotted timeout of {1}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Во время запроса HTTP в "{0}" было превышено выделенное время ожидания для {1}. Время, выделенное для выполнения этой операции, может быть частью более длительного времени ожидания.

# HttpRequiresSingleAuthScheme
source: The '{0}' authentication scheme has been specified on the HTTP factory. However, the factory only supports specification of exactly one authentication scheme. Valid authentication schemes are Digest, Negotiate, NTLM, Basic, or Anonymous.
ru: Схема аутентификации "{0}" указана в фабрике HTTP. Однако эта фабрика поддерживает спецификации только одной схемы аутентификации. Допустимые схемы аутентификации: дайджест, согласование, NTLM, обычная и анонимная.

# HttpResponseTimedOut
source: The HTTP request to '{0}' has exceeded the allotted timeout of {1} while reading the response. The time allotted to this operation may have been a portion of a longer timeout.
ru: Во время HTTP-запроса в "{0}" было превышено выделенное время ожидания для {1} при чтении ответа. Время, назначенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# HttpServerTooBusy
source: The HTTP service located at {0} is unavailable. This could be because the service is too busy or because no endpoint was found listening at the specified address. Please ensure that the address is correct and try accessing the service again later.
ru: Служба HTTP, расположенная по адресу {0}, недоступна. Это может быть вызвано тем, что служба перегружена либо не обнаружено ни одной конечной точки, прослушивающей указанный адрес. Убедитесь в правильности адреса и попробуйте обратиться к службе позже.

# HttpSoapActionMismatch
source: The SOAP action specified on the message, '{0}', does not match the action specified on the HttpRequestMessageProperty, '{1}'.
ru: Указанное в сообщении действие SOAP, "{0}", не соответствует действию, указанному в свойстве HttpRequestMessageProperty, "{1}".

# HttpSoapActionMismatchContentType
source: The SOAP action specified on the message, '{0}', does not match the action specified in the content-type of the HttpRequestMessageProperty, '{1}'.
ru: Указанное в сообщении действие SOAP, "{0}", не соответствует действию, указанному в заголовке Content-Type свойства HttpRequestMessageProperty, "{1}".

# HttpToMustEqualVia
source: The binding specified requires that the to and via URIs must match because the Addressing Version is set to None. The to URI specified was '{0}'. The via URI specified was '{1}'.
ru: Указанная привязка требует согласования входящих и транзитных URI, так как задана версия адресации None. Указан входящий URI "{0}". Указан транзитный URI "{1}".

# HttpTransportCannotHaveMultipleAuthenticationSchemes
source: The policy being imported for contract '{0}:{1}' contains multiple HTTP authentication scheme assertions. Since at most one such assertion is allowed, policy import has failed. This may be resolved by updating the policy to contain no more than one HTTP authentication scheme assertion.
ru: Политика, импортируемая для контракта "{0}:{1}", содержит несколько утверждений для схемы аутентификации HTTP. Произошел сбой при импорте политики, так как разрешается только одно такое утверждение. Это можно исправить путем обновления политики, чтобы она содержала только одно утверждение для схемы аутентификации HTTP.

# HttpsServerCertThumbprintMismatch
source: The server certificate with name '{0}' failed identity verification because its thumbprint ('{1}') does not match the one specified in the endpoint identity ('{2}'). As a result, the current HTTPS request has failed. Please update the endpoint identity used on the client or the certificate used by the server.
ru: Не удалось проверить подлинность сертификата сервера с именем "{0}", так как его отпечаток ("{1}") не соответствует отпечатку, указанному в удостоверении конечной точки ("{2}"). В результате текущий запрос HTTPS не был обслужен. Необходимо обновить удостоверение конечной точки, используемое клиентом, или сертификат, используемый сервером.

# ID0023
source: ID0023: Failed to create an instance of '{0}' from configuration. A custom configuration element was specified, but the method LoadCustomConfiguration was not implemented. Override LoadCustomConfiguration to handle custom configuration loading.
ru: ID0023: не удалось создать экземпляр "{0}" из конфигурации. Указан настраиваемый элемент конфигурации, но метод LoadCustomConfiguration не реализован. Переопределите LoadCustomConfiguration для обработки загрузки настраиваемых конфигураций.

# IdentityCheckFailedForIncomingMessage
source: The identity check failed for the incoming message. The expected identity is '{0}' for the '{1}' target endpoint.
ru: Сбой проверки удостоверения входящего сообщения. Ожидаемое удостоверение — "{0}" для целевой конечной точки "{1}".

# IdentityCheckFailedForOutgoingMessage
source: The identity check failed for the outgoing message. The expected identity is '{0}' for the '{1}' target endpoint.
ru: Сбой проверки удостоверения исходящего сообщения. Ожидаемое удостоверение — "{0}" для целевой конечной точки "{1}".

# IgnoreMessagePart3
source: Ignoring invalid part in wsdl:message name='{0}' from targetNamespace='{1}'. Reason: {2}
ru: Игнорируется недопустимая часть в wsdl:message name="{0}" из targetNamespace="{1}". Причина: {2}
