Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# MultipleSupportingAuthenticatorsOfSameType
source: Multiple supporting token authenticators with the token parameter type equal to '{0}' cannot be specified. If more than one Supporting Token of the same type is expected in the response, then configure the supporting token collection with just one entry for that SecurityTokenParameters. The SecurityTokenAuthenticator that gets created from the SecurityTokenParameters will be used to authenticate multiple tokens. It is not possible to add SecurityTokenParameters of the same type in the SupportingTokenParameters collection or repeat it across EndpointSupportingTokenParameters and OperationSupportingTokenParameters.
ru: Невозможно указать несколько удостоверений поддерживающих маркеров с типом параметра маркера "{0}". Если в ответе ожидается несколько поддерживающих маркеров одного типа, настройте коллекцию поддерживающих маркеров с одной записью для SecurityTokenParameters. Удостоверение SecurityTokenAuthenticator, создаваемое из SecurityTokenParameters, будет использовано для идентификации нескольких маркеров. Невозможно добавить параметры SecurityTokenParameters одного типа в коллекцию SupportingTokenParameters или повторить их в EndpointSupportingTokenParameters и OperationSupportingTokenParameters.

# MultipleVersionsFoundInPolicy
source: More than one version of the {0} assertion was found. The ReliableSessionBindingElement could not be created.
ru: Найдено несколько версий утверждения {0}. Не удалось создать ReliableSessionBindingElement.

# NegotiationFailedIO
source: Transport security negotiation failed due to an underlying IO error: {0}.
ru: Сбой согласования режима защиты транспорта из-за базовой ошибки ввода-вывода: {0}.

# NoAppliesToPresent
source: No AppliesTo element is present in the deserialized RequestSecurityToken/RequestSecurityTokenResponse.
ru: В десериализованном объекте RequestSecurityToken или RequestSecurityTokenResponse нет ни одного элемента AppliesTo.

# NoChannelBuilderAvailable
source: The binding (Name={0}, Namespace={1}) cannot be used to create a ChannelFactory or a ChannelListener because it appears to be missing a TransportBindingElement. Every binding must have at least one binding element that derives from TransportBindingElement.
ru: Невозможно использовать привязку (имя={0}, пространство имен={1}) для создания ChannelFactory или ChannelListener, так как, по-видимому, в ней пропущен элемент TransportBindingElement. В каждой привязке должен присутствовать по меньшей мере один элемент привязки, производный от TransportBindingElement.

# NoCookieInSct
source: The SecurityContextSecurityToken does not have a cookie.
ru: В SecurityContextSecurityToken отсутствует файл cookie.

# NoEndMethodFoundForAsyncBeginMethod3
source: OperationContract method '{0}' in type '{1}' does not properly implement the async pattern, as no corresponding method '{2}' could be found. Either provide a method called '{2}' or set the AsyncPattern property on method '{0}' to false.
ru: Метод OperationContract "{0}" в типе "{1}" не реализует должным образом асинхронный шаблон, поскольку не удалось найти соответствующий метод "{2}". Необходимо предоставить метод с именем "{2}" либо установить значение false для свойства AsyncPattern в методе "{0}".

# NoIPEndpointsFoundForHost
source: No IPEndpoints were found for host {0}.
ru: Для узла {0} точки IPEndpoints не найдены.

# NoKeyIdentifierClauseFound
source: No clause of type '{0}' was found in the SecurityKeyIdentifier.
ru: Предложение типа "{0}" не найдено в SecurityKeyIdentifier.

# NoLicenseXml
source: RequestedSecurityToken not specified in RequestSecurityTokenResponse.
ru: RequestedSecurityToken не указан в RequestSecurityTokenResponse.

# NoMatchingTranslationFoundForFaultText
source: The fault reason does not contain any text translations.
ru: Причина ошибки не содержит каких-либо текстовых переводов.

# NoNullTranslations
source: The translation set cannot contain nulls.
ru: Набор переводов не может содержать пустые элементы.

# NoRequestSecurityTokenResponseElements
source: No RequestSecurityTokenResponse elements were found.
ru: Элементы RequestSecurityTokenResponse не найдены.

# NoSecurityContextIdentifier
source: The SecurityContextSecurityToken does not have a context-id.
ru: SecurityContextSecurityToken не имеет context-id.

# NoTransportTokenAssertionProvided
source: The security policy expert failed. The provided transport token assertion of type '{0}' did not create a transport token assertion to include the sp:TransportBinding security policy assertion.
ru: Сбой экспорта политики безопасности. Предоставленное утверждение маркера транспорта типа "{0}" не создало утверждение маркера транспорта для включения в утверждение политики безопасности sp:TransportBinding.

# NoUsablePolicyAssertions
source: Cannot find usable policy alternatives.
ru: Невозможно найти альтернативные политики, которые можно использовать.

# NoUserNameTokenProvided
source: The required UserNameSecurityToken was not provided.
ru: Не был предоставлен требуемый элемент UserNameSecurityToken.

# NoValue0
source: No value.
ru: Нет значения.

# NonceLengthTooShort
source: The specified nonce is too short. The minimum required nonce length is 4 bytes.
ru: Указанный элемент nonce слишком короткий. Минимально требуемая длина nonce равна 4 байтам.

# NoncesCachedInfinitely
source: The ReplayWindow and ClockSkew cannot be the maximum possible value when replay detection is enabled.
ru: ReplayWindow и ClockSkew не могут иметь максимально возможное значение, если включено определение ответов.

# NotAllBindingElementsBuilt
source: Some of the binding elements in this binding were not used when building the ChannelFactory / ChannelListener. This may be have been caused by the binding elements being misordered. The recommended order for binding elements is: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Note that the TransportBindingElement must be last. The following binding elements were not built: {0}.
ru: Некоторые элементы в этой привязке не были использованы при создании ChannelFactory или ChannelListener. Возможно, это связано с неправильным порядком расположения элементов привязки. Рекомендуется следующий порядок расположения элементов привязки: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport. Учтите, что элемент TransportBindingElement должен быть последним. Не были созданы следующие элементы привязки: {0}.

# ObjectDisposed
source: The {0} object has been disposed.
ru: Объект {0} ликвидирован.

source: Object is read-only.
ru: Объект доступен только для чтения.

# OffsetExceedsBufferBound
source: The specified offset exceeds the upper bound of the buffer ({0}).
ru: Указанное смещение превышает верхнюю границу буфера ({0}).

# OffsetExceedsBufferSize
source: The specified offset exceeds the buffer size ({0} bytes).
ru: Заданное смещение превышает размер буфера ({0} байт).

# OneWayAndFaultsIncompatible2
source: The method '{1}' in type '{0}' is marked IsOneWay=true and declares one or more FaultContractAttributes. One-way methods cannot declare FaultContractAttributes. To fix it, change IsOneWay to false or remove the FaultContractAttributes.
ru: Метод "{1}" в типе "{0}" отмечен как IsOneWay=true и декларирует один или более атрибутов FaultContractAttributes. Односторонние методы не могут декларировать атрибуты FaultContractAttributes. Для устранения ошибки измените значение IsOneWay на false или удалите атрибуты FaultContractAttributes.

# OneWayOperationReturnedFault
source: The one-way operation returned a fault message. The reason for the fault was '{0}'.
ru: Односторонняя операция вернула сообщение об ошибке. Причина сбоя: "{0}".

# OneWayOperationReturnedLargeFault
source: The one-way operation returned a fault message with Action='{0}'.
ru: Односторонняя операция вернула сообщение об ошибке с Action="{0}".

# OneWayOperationReturnedMessage
source: The one-way operation returned a non-null message with Action='{0}'.
ru: Односторонняя операция вернула ненулевое сообщение с Action="{0}".

# OneWayOperationShouldNotSpecifyAReplyAction1
source: One way operation {0} cannot not specify a reply action.
ru: Односторонняя операция {0} не может указать ответное действие.

# OnlyBodyReturnValuesSupported
source: Only body return values are supported currently for protection, MessagePartDescription was specified.
ru: В текущий момент поддерживается защита только для возвращенных значений текста, для которых было указано описание MessagePartDescription.

# OpenTimedOutEstablishingTransportSession
source: Open timed out after {0} while establishing a transport session to {1}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Операция открытия прервана по времени ожидания после {0} во время установления сеанса транспорта с {1}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# OperationAbortedDuringConnectionEstablishment
source: Operation was aborted while establishing a connection to {0}.
ru: Операция была прервана во время установления подключения к {0}.

# OperationCannotBeDoneAfterProcessingIsStarted
source: This operation cannot be done after processing is started.
ru: Эта операция не может быть выполнена после начала обработки.

# OperationInvalidBeforeSecurityNegotiation
source: This operation is not valid until security negotiation is complete.
ru: Эта операция недопустима до завершения согласования режима безопасности.

# OperationPropertyIsRequiredForAttributeGeneration
source: Operation property of OperationAttributeGenerationContext is required to generate an attribute based on settings.
ru: Свойство операции OperationAttributeGenerationContext требуется, чтобы на основе настроек сгенерировать атрибут.

# OptionalWSDLExtensionIgnored
source: The optional WSDL extension element '{0}' from namespace '{1}' was not handled.\r\nXPath: {2}
ru: Необязательный элемент расширения WSDL "{0}" из пространства имен "{1}" не был обработан.\r\nXPath: {2}

# PolicyDocumentMustHaveIdentifier
source: A metadata section containing policy did not have an identifier so it cannot be referenced.
ru: В разделе метаданных, содержащем политику, отсутствует идентификатор, поэтому на него нельзя сослаться.

# PolicyExtensionExportError
source: An exception was thrown in a call to a policy export extension.\r\nExtension: {0}\r\nError: {1}
ru: При вызове расширения экспорта политики возникло исключение.\r\nРасширение: {0}\r\nОшибка: {1}

# PolicyExtensionImportError
source: An exception was thrown in a call to a policy import extension.\r\nExtension: {0}\r\nError: {1}
ru: При вызове расширения импорта политики возникло исключение.\r\nРасширение: {0}\r\nОшибка: {1}

# PolicyImportContextBindingElementCollectionIsNull
source: ContextBindingElementImporter cannot import policy because PolicyImportContext.BindingElements collection is null.
ru: Объект ContextBindingElementImporter не может импортировать политику, поскольку коллекция элементов PolicyImportContext.BindingElements имеет значение null.

# PolicyInWsdlMustHaveFragmentId
source: Unreachable policy detected.\r\nA WS-Policy element embedded in WSDL is missing a fragment identifier. This policy cannot be referenced by any WS-PolicyAttachment mechanisms.\r\nXPath:{0}
ru: Обнаружена недоступная политика.\r\nВ элементе WS-Policy, вложенном в WSDL, пропущен идентификатор фрагмента. На эту политику не может сослаться ни один механизм WS-PolicyAttachment.\r\nXPath: {0}

# PolicyReferenceInvalidId
source: A policy reference was ignored because the URI of the reference was empty.
ru: Ссылка на политику была проигнорирована, так как в качестве URI ссылки использовалась пустая строка.

# PolicyReferenceMissingURI
source: A policy reference was ignored because the required {0} attribute was missing.
ru: Ссылка на политику была проигнорирована, так как отсутствует требуемый атрибут {0}.

# PolicyRequiresConfidentialityWithoutIntegrity
source: Message security policy for the '{0}' action requires confidentiality without integrity. Confidentiality without integrity is not supported.
ru: Политика безопасности сообщений требует для действия "{0}" конфиденциальности без целостности. Конфиденциальность без целостности не поддерживается.

# PreambleAckIncorrect
source: You have tried to create a channel to a service that does not support .Net Framing.
ru: Сделана попытка создать канал к службе, не поддерживающей .Net Framing.

# PreambleAckIncorrectMaybeHttp
source: You have tried to create a channel to a service that does not support .Net Framing. It is possible that you are encountering an HTTP endpoint.
ru: Сделана попытка создать канал к службе, не поддерживающей .Net Framing. Возможно, идет обнаружение конечных точек HTTP.

# PrivacyNoticeElementVersionAttributeInvalid
source: PrivacyNotice element Version attribute must have an integer value.
ru: Атрибут Version элемента PrivacyNotice должен быть целым числом.

# ProofTokenXmlUnexpectedInRstr
source: The proof token XML element is not expected in the response.
ru: В ответе не ожидается XML-элемент маркера проверки.

# PropertySettingErrorOnProtocolFactory
source: The required '{0}' property on the '{1}' security protocol factory is not set or has an invalid value.
ru: Требуемое свойство "{0}" в фабрике протокола безопасности "{1}" не задано или имеет недопустимое значение.

# ProtocolFactoryCouldNotCreateProtocol
source: The protocol factory cannot create a protocol.
ru: Фабрике протокола не удалось создать протокол.

# ProvidedNetworkCredentialsForKerberosHasInvalidUserName
source: The NetworkCredentials provided for the Kerberos Token does not have a valid UserName.
ru: Учетные данные NetworkCredentials, предоставленные для маркера Kerberos, не содержат допустимое имя пользователя.

# Psha1KeyLengthInvalid
source: The PSHA1 key length '{0}' is invalid.
ru: Недопустимая длина ключа PSHA1 "{0}".

# ReceiveContextFaulted
source: The receive context, {0}, cannot be used for sending delayed acks because it is in the Faulted state.
ru: Невозможно использовать контекст приема ({0}) для отправки отложенных подтверждений приема (ACK), так как он находится в состоянии Faulted (сбой).

# ReceiveShutdownReturnedFault
source: The channel received an unexpected fault input message while closing. The fault reason given is: '{0}'
ru: Во время закрытия канала получено неожиданное входящее сообщение об ошибке. Указанная причина ошибки: "{0}"

# ReceiveShutdownReturnedLargeFault
source: The channel received an unexpected fault input message with Action = '{0}' while closing. You should only close your channel when you are not expecting any more input messages.
ru: Во время закрытия канала получено неожиданное входящее сообщение об ошибке с действием "{0}". Канал можно закрыть, только если больше не ожидаются входящие сообщения.

# ReceiveShutdownReturnedMessage
source: The channel received an unexpected input message with Action '{0}' while closing. You should only close your channel when you are not expecting any more input messages.
ru: Во время закрытия канал получил неожиданное входящее сообщение с действием "{0}". Канал можно закрыть, только если больше не ожидаются входящие сообщения.

# ReceiveTimedOut
source: Receive on local address {0} timed out after {1}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Получение локального адреса {0} прервано по истечении времени ожидания {1}. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# ReceiveTimedOut2
source: Receive timed out after {0}. The time allotted to this operation may have been a portion of a longer timeout.
ru: Получение прервано по истечении времени ожидания {0}. Время, назначенное для выполнения этой операции, может быть составной частью более длинного времени ожидания.

# RemoteIdentityFailedVerification
source: The following remote identity failed verification: '{0}'.
ru: Не удалось проверить следующее удаленное удостоверение: "{0}".

# ReplyAlreadySent
source: A reply has already been sent from this RequestContext.
ru: Ответ уже отправлен из этого RequestContext.

# RequestChannelSendTimedOut
source: The request channel timed out attempting to send after {0}. Increase the timeout value passed to the call to Request or increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: Истекло время ожидания канала запроса при попытке отправки по истечении {0}. Увеличьте значение времени ожидания, передаваемое при вызове Request, или значение SendTimeout в Binding. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# RequestChannelWaitForReplyTimedOut
source: The request channel timed out while waiting for a reply after {0}. Increase the timeout value passed to the call to Request or increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: Истекло время ожидания канала запроса при ожидании ответа по истечении {0}. Увеличьте значение времени ожидания, передаваемое при вызове Request, или значение SendTimeout в Binding. Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания.

# RequestContextAborted
source: The requestContext has been aborted.
ru: Выполнение requestContext прервано.

# RequestMessageDoesNotHaveAMessageID
source: A reply message cannot be created because the request message does not have a MessageID.
ru: Не удается создать ответное сообщение, так как сообщение запроса не имеет MessageID.

# RequiredAttributeIsMissing
source: The required {0} attribute is missing from the {1} element in the {2} assertion. The ReliableSessionBindingElement could not be created.
ru: Обязательный атрибут {0} пропущен в элементе {1} из утверждения {2}. Не удалось создать элемент ReliableSessionBindingElement.

# RequiredAttributeMissing
source: Attribute '{0}' is required on element '{1}'.
ru: Атрибут "{0}" обязателен для элемента "{1}".

# RequiredMillisecondsAttributeIncorrect
source: The {0} assertion's required Milliseconds attribute is not schema compliant. Milliseconds must be convertible to an unsigned long. The ReliableSessionBindingElement could not be created.
ru: Обязательный атрибут Milliseconds утверждения {0} несовместим со схемой. Атрибут Milliseconds должен поддерживать преобразование в длинное целое без знака. Не удалось создать элемент ReliableSessionBindingElement.

# RequiredWSDLExtensionIgnored
source: The required WSDL extension element '{0}' from namespace '{1}' was not handled.
ru: Не был обработан обязательный элемент расширения WSDL "{0}" из пространства имен "{1}".

# ResponseContentTypeMismatch
source: The content type {0} of the response message does not match the content type of the binding ({1}). If using a custom encoder, be sure that the IsContentTypeSupported method is implemented properly. The first {2} bytes of the response were: '{3}'.
ru: Тип содержимого {0} ответного сообщения не соответствует типу содержимого привязки ({1}). При использовании особого кодировщика необходимо правильно реализовать метод IsContentTypeSupported. Первые {2} байт ответного сообщения: "{3}".

# RstrHasMultipleIssuedTokens
source: The RequestSecurityTokenResponse has multiple RequestedSecurityToken elements.
ru: RequestSecurityTokenResponse имеет несколько элементов RequestedSecurityToken.

# RstrHasMultipleProofTokens
source: The RequestSecurityTokenResponse has multiple RequestedProofToken elements.
ru: RequestSecurityTokenResponse имеет несколько элементов RequestedProofToken.

# RstrKeySizeNotProvided
source: KeySize element not present in RequestSecurityTokenResponse.
ru: Элемент KeySize не представлен в RequestSecurityTokenResponse.

# RuntimeRequiresInvoker0
source: DispatchOperation requires Invoker.
ru: DispatchOperation требует Invoker.

# SFXBindingNameCannotBeNullOrEmpty
source: Binding name cannot be null or empty.
ru: Имя привязки не может быть пустым или иметь значение null.

# SFXEndpointBehaviorUsedOnWrongSide
source: The IEndpointBehavior '{0}' cannot be used on the server side; this behavior can only be applied to clients.
ru: IEndpointBehavior "{0}" нельзя использовать на стороне сервера; данное поведение применимо только к клиентам.

# SFXHeaderNameCannotBeNullOrEmpty
source: Header name cannot be null or empty.
ru: Имя заголовка не может иметь значение null или быть пустым.

# SFXUnvalidNamespaceParam
source: Parameter value '{0}' is an invalid URI.
ru: Значение параметра "{0}" является недопустимым URI.

# SFXUnvalidNamespaceValue
source: Value '{0}' provided for {1} property is an invalid URI.
ru: Значение "{0}", предоставленное для свойства {1}, является недопустимым URI.

# SFxActionDemuxerDuplicate
source: The operations {0} and {1} have the same action ({2}). Every operation must have a unique action value.
ru: Операции {0} и {1} имеют одно и то же действие ({2}). Каждая операция должна иметь уникальное значение для действия.

# SFxAnonymousTypeNotSupported
source: Part {1} in message {0} cannot be exported with RPC or encoded since its type is anonymous.
ru: Часть {1} в сообщении {0} нельзя экспортировать службой RPC или закодировать, так как она имеет анонимный тип.

# SFxBadByReferenceParameterMetadata
source: Method '{0}' in class '{1}' has bad parameter metadata: a pass-by-reference parameter is marked with the 'in' but not the 'out' parameter mode.
ru: Метод "{0}" в классе "{1}" имеет неверные метаданные параметров: параметр передачи по ссылке отмечен меткой in, а не режимом параметра out.

# SFxBadByValueParameterMetadata
source: Method '{0}' in class '{1}' has bad parameter metadata: a pass-by-value parameter is marked with the 'out' parameter mode.
ru: Метод "{0}" в классе "{1}" имеет неверные метаданные параметров: параметры передачи по значению помечены классом параметров out.

# SFxBadMetadataDialect
source: There was a problem reading the MetadataSet argument: a MetadataSection instance with identifier '{0}' and dialect '{1}' has a Metadata property whose type does not match the dialect. The expected Metadata type for this dialect is '{2}' but was found to be '{3}'.
ru: Возникла проблема при чтении аргумента MetadataSet: экземпляр MetadataSection с идентификатором "{0}" и диалектом "{1}" имеет свойство Metadata, тип которого несовместим с диалектом. Ожидаемый тип Metadata для этого диалекта — "{2}", однако был найден "{3}".

# SFxBadMetadataLocationNoAppropriateBaseAddress
source: The URL supplied to ServiceMetadataBehavior via the ExternalMetadataLocation property or the externalMetadataLocation attribute in the serviceMetadata section in config was a relative URL and there is no base address with which to resolve it. '{0}' was specified.
ru: URL-адрес, указанный для ServiceMetadataBehavior посредством свойства ExternalMetadataLocation или атрибута externalMetadataLocation в разделе serviceMetadata конфигурации, является относительным URL-адресом, и нет базового адреса для его разрешения. Был указан "{0}".

# SFxBadMetadataMustBePolicy
source: When calling the CreateFromPolicy method, the policy argument must be an XmlElement instance with LocalName '{1}' and NamespaceUri '{0}'. This XmlElement has LocalName '{3}' and NamespaceUri '{2}'.
ru: При вызове метода CreateFromPolicy аргумент политики должен быть представлен экземпляром XmlElement с LocalName "{1}" и NamespaceUri "{0}". Этот элемент XmlElement имеет LocalName "{3}" и NamespaceUri "{2}".
