Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# AChannelServiceEndpointSBindingIsNull0
source: A Channel/Service endpoint's Binding is null.
ru: Привязка конечной точки канала/службы равна NULL.

# AChannelServiceEndpointSContractIsNull0
source: A Channel/Service endpoint's Contract is null.
ru: Контракт конечной точки канала/службы равен NULL.

# AChannelServiceEndpointSContractSNameIsNull0
source: A Channel/Service endpoint's Contract's name is null or empty.
ru: Имя контракта конечной точки канала/службы равно NULL или пусто.

# AChannelServiceEndpointSContractSNamespace0
source: A Channel/Service endpoint's Contract's namespace is null.
ru: Пространство имен контракта конечной точки канала/службы равно NULL.

# AccessDenied
source: Access is denied.
ru: Отказано в доступе.

# ActivityCallback
source: Executing user callback.
ru: Выполняется обратный вызов пользователя.

# ActivityClose
source: Close '{0}'.
ru: Закрытие "{0}".

# ActivityCloseClientBase
source: Close ClientBase. Contract type: '{0}'.
ru: Закрыть ClientBase. Тип контракта: "{0}".

# ActivityConstructChannelFactory
source: Construct ChannelFactory. Contract type: '{0}'.
ru: Создать ChannelFactory. Тип контракта: "{0}".

# ActivityExecuteMethod
source: Execute '{0}.{1}'.
ru: Выполнение "{0}.{1}".

# ActivityOpen
source: Open '{0}'.
ru: Открытие "{0}".

# ActivityOpenClientBase
source: Open ClientBase. Contract type: '{0}'.
ru: Открыть ClientBase. Тип контракта: "{0}".

# ActivityProcessAction
source: Process action '{0}'.
ru: Обработка действия "{0}".

# AddressingExtensionInBadNS
source: The element '{0}' in namespace '{1}' is not valid. This either means that element '{0}' is a duplicate element, or that it is not a legal extension because extension elements cannot be in the addressing namespace.
ru: Недопустимый элемент "{0}" в пространстве имен "{1}". Это означает, что элемент "{0}" является дублирующим элементом или представляет собой недопустимое расширение, так как пространство имен адресации не может содержать элементы расширения.

# AddressingHeadersCannotBeAddedToAddressingVersion
source: Addressing Version '{0}' does not support adding WS-Addressing headers.
ru: Версия адресации "{0}" не поддерживает добавление заголовков WS-Addressing.

# AddressingVersionNotSupported
source: Addressing Version '{0}' is not supported.
ru: Версия адресации "{0}" не поддерживается.

# AnonymousLogonsAreNotAllowed
source: The service does not allow you to log on anonymously.
ru: Эта служба не разрешает анонимный вход.

# ArgumentCannotBeEmptyString
source: The argument must be a non-empty string.
ru: Аргумент должен быть непустой строкой.

# ArgumentOutOfMinRange
source: Specified argument was out of the range of valid values. The value must be at least {0}.
ru: Указанный аргумент выходит за пределы диапазона допустимых значений. Значение должно быть не меньше {0}.

# ArgumentOutOfRange
source: value must be >= {0} and <= {1}.
ru: значение должно быть >= {0} и <= {1}.

# AssertionNotSupported
source: The {0}:{1} assertion is not supported.
ru: Утверждение {0}:{1} не поддерживается.

# AsymmetricSecurityBindingElementNeedsInitiatorTokenParameters
source: AsymmetricSecurityBindingElement cannot build a channel or listener factory. The InitiatorTokenParameters property is required but not set. Binding element configuration: {0}
ru: AsymmetricSecurityBindingElement не может создать фабрику каналов или прослушивателей. Свойство InitiatorTokenParameters необходимо, но не задано. Конфигурация элемента привязки: {0}

# AsymmetricSecurityBindingElementNeedsRecipientTokenParameters
source: AsymmetricSecurityBindingElement cannot build a channel or listener factory. The RecipientTokenParameters property is required but not set. Binding element configuration: {0}
ru: AsymmetricSecurityBindingElement не может создать фабрику каналов или прослушивателей. Свойство RecipientTokenParameters необходимо, но не задано. Конфигурация элемента привязки: {0}

source: Async End called on wrong channel.
ru: Асинхронный метод End вызван на неверном канале.

# AsyncEndCalledWithAnIAsyncResult
source: Async End called with an IAsyncResult from a different Begin method.
ru: Асинхронный метод End вызван с результатом IAsyncResult из другого метода Begin.

source: At least one fault reason must be specified.
ru: Необходимо указать хотя бы одну причину сбоя.

# AttemptedToGetContractTypeForButThatTypeIs1
source: Attempted to get contract type for {0}, but that type is not a ServiceContract, nor does it inherit a ServiceContract.
ru: Была предпринята попытка получить тип контракта для {0}, однако этот тип не ServiceContract и не наследует ServiceContract.

# AuthFailed
source: Authentication failed.
ru: Сбой проверки подлинности.

# BadEncryptionState
source: The EncryptedData or EncryptedKey is in an invalid state for this operation.
ru: EncryptedData или EncryptedKey находятся в недопустимом для этой операции состоянии.

# BadIssuedTokenType
source: The issued token is of unexpected type '{0}'. Expected token type '{1}'.
ru: Выданный маркер имеет неожиданный тип "{0}". Ожидаемый тип маркера — "{1}".

# BadKeyEncryptionAlgorithm
source: Invalid key encryption algorithm {0}.
ru: Неверный алгоритм шифрования ключей {0}.

# BaseAddressCannotHaveFragment
source: A base address cannot contain a Uri fragment.
ru: Базовый адрес не может содержать фрагмент Uri.

# BaseAddressCannotHaveQuery
source: A base address cannot contain a Uri query string.
ru: Базовый адрес не может содержать строку запроса Uri.

# BaseAddressCannotHaveUserInfo
source: A base address cannot contain a Uri user info section.
ru: Базовый адрес не может содержать раздел с информацией о пользователе Uri.

# BaseAddressDuplicateScheme
source: This collection already contains an address with scheme {0}. There can be at most one address per scheme in this collection. If your service is being hosted in IIS you can fix the problem by setting 'system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled' to true or specifying 'system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters'.
ru: Эта коллекция уже содержит адрес со схемой {0}. В эту коллекцию может входить не более одного адреса на каждую схему. Если служба размещается в службах IIS, то проблему можно устранить, установив для параметра system.serviceModel/serviceHostingEnvironment/multipleSiteBindingsEnabled значение true или указав system.serviceModel/serviceHostingEnvironment/baseAddressPrefixFilters.

# BaseAddressMustBeAbsolute
source: Only an absolute Uri can be used as a base address.
ru: Только абсолютный URI можно использовать в качестве базового адреса.

# BasicHttpMessageSecurityRequiresCertificate
source: BasicHttp binding requires that BasicHttpBinding.Security.Message.ClientCredentialType be equivalent to the BasicHttpMessageCredentialType.Certificate credential type for secure messages. Select Transport or TransportWithMessageCredential security for UserName credentials.
ru: Для обеспечения безопасности сообщений привязка BasicHttp требует эквивалентности BasicHttpBinding.Security.Message.ClientCredentialType и типа учетных данных BasicHttpMessageCredentialType.Certificate. Выберите уровень защиты Transport или TransportWithMessageCredential для учетных данных UserName.

# BearerKeyIncompatibleWithWSFederationHttpBinding
source: Bearer Key Type is not supported with WSFederationHttpBinding. Please use WS2007FederationHttpBinding.
ru: Тип ключа носителя не поддерживается с помощью WSFederationHttpBinding. Используйте WS2007FederationHttpBinding.

# BearerKeyTypeCannotHaveProofKey
source: A Proof Token was found in the response that was returned by the Security Token Service for a Bearer Key Type token request. Note that Proof Tokens should not be generated when a Bearer Key Type request is made.
ru: Найден маркер проверки в ответе службы маркеров безопасности на запрос маркера типа ключа носителя. Обратите внимание, что маркеры проверки не должны создаваться во время выполнения запроса типа ключа носителя.

# BehaviorRequiresContextProtocolSupportInBinding
source: Service behavior {0} requires that the binding associated with endpoint {1} listening on {2} supports the context protocol, because the contract associated with this endpoint may require a session. Currently configured binding for this endpoint does not support the context protocol. Please modify the binding to add support for the context protocol or modify the SessionMode on the contract to NotAllowed.
ru: Поведение службы {0} требует, чтобы привязка, соответствующая прослушиванию конечной точки {1} на {2}, поддерживала протокол контекста, поскольку для контракта, связанного с этой конечной точкой, может требоваться сеанс. Настроенная в настоящее время привязка для этой конечной точки не поддерживает протокол контекста. Измените привязку, чтобы добавить поддержку для протокола контекста, или измените параметр SessionMode контракта на NotAllowed.

# BinaryEncoderSessionInvalid
source: The binary encoder session is not valid. There was an error decoding a previous message.
ru: Недопустимый сеанс двоичного кодировщика. Ошибка декодирования предыдущего сообщения.

# BinaryEncoderSessionMalformed
source: The binary encoder session information is not properly formed.
ru: Информация о сеансе двоичного кодировщика сформирована неправильно.

# BinaryEncoderSessionTooLarge
source: The binary encoder session information exceeded the maximum size quota ({0}). To increase this quota, use the MaxSessionSize property on the BinaryMessageEncodingBindingElement.
ru: Данные о сеансе двоичного кодировщика превышают квоту максимального размера ({0}). Для увеличения квоты используйте свойство MaxSessionSize элемента BinaryMessageEncodingBindingElement.

# BindingDoesnTSupportAnyChannelTypes1
source: Binding '{0}' doesn't support creating any channel types. This often indicates that the BindingElements in a CustomBinding have been stacked incorrectly or in the wrong order. A Transport is required at the bottom of the stack. The recommended order for BindingElements is: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.
ru: Привязка "{0}" не поддерживает создание типов каналов. Нередко это указывает на то, что элементы BindingElements в CustomBinding установлены неправильно или в неверном порядке. Элемент Transport необходим в нижней части стека. Рекомендуемый порядок для BindingElements: TransactionFlow, ReliableSession, Security, CompositeDuplex, OneWay, StreamSecurity, MessageEncoding, Transport.

# BindingDoesnTSupportDuplexButContractRequires1
source: Contract requires Duplex, but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Контракту требуется свойство Duplex, однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# BindingDoesnTSupportOneWayButContractRequires1
source: Contract requires OneWay, but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Контракту требуется свойство OneWay, однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# BindingDoesnTSupportRequestReplyButContract1
source: Contract requires Request/Reply, but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Контракту требуется свойство Request или Reply, однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# BindingDoesnTSupportSessionButContractRequires1
source: Contract requires Session, but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Контракту требуется свойство Session, однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# BindingDoesnTSupportTwoWayButContractRequires1
source: Contract requires TwoWay (either request-reply or duplex), but Binding '{0}' doesn't support it or isn't configured properly to support it.
ru: Контракту требуется свойство TwoWay (типа "запрос-ответ" либо дуплексное), однако привязка "{0}" его не поддерживает или этого не позволяет неправильная настройка.

# BindingDoesntSupportDatagramButContractRequires
source: Contract does not allow Session, but Binding '{0}' does not support Datagram or is not configured properly to support it.
ru: Сеанс не разрешен контрактом, однако привязка "{0}" не поддерживает свойство Datagram или этого не позволяет неправильная настройка.

# BodyWriterCanOnlyBeWrittenOnce
source: The body writer does not support writing more than once because it is not buffered.
ru: Объект, производящий запись содержимого сообщения, не поддерживает многократную запись, так как для него не выполняется буферизация.

# BodyWriterReturnedIsNotBuffered
source: The body writer returned from OnCreateBufferedCopy was not buffered.
ru: Объект, производящий запись содержимого сообщения, возвращен из OnCreateBufferedCopy без помещения в буфер.

# BufferQuotaExceededReadingBase64
source: Unable to finish reading Base64 data as the given buffer quota has been exceeded. Buffer quota: {0}. Consider increasing the MaxReceivedMessageSize quota on the TransportBindingElement. Please note that a very high value for MaxReceivedMessageSize will result in buffering a large message and might open the system to DOS attacks.
ru: Не удалось завершить чтение данных Base64 из-за превышения заданной квоты буфера. Квота буфера: {0}. Увеличьте квоту MaxReceivedMessageSize элемента TransportBindingElement. Учтите, что слишком высокое значение для MaxReceivedMessageSize сделает возможным буферизацию длинных сообщений и откроет систему для DOS-атак.

# CacheQuotaReached
source: The item cannot be added. The maximum cache size is ({0} items).
ru: Не удается добавить элемент. Максимальный размер кэша — {0} эл.

# CannotAddTwoItemsWithTheSameKeyToSynchronizedKeyedCollection0
source: Cannot add two items with the same key to SynchronizedKeyedCollection.
ru: Невозможно добавить два элемента с одинаковым ключом в SynchronizedKeyedCollection.

# CannotDetectAddressingVersion
source: Cannot detect WS-Addressing version. EndpointReference does not start with an Element.
ru: Не удалось обнаружить версию WS-Addressing. В начале EndpointReference отсутствует Element.

# CannotDetermineSPNBasedOnAddress
source: Client cannot determine the Service Principal Name based on the identity in the target address '{0}' for the purpose of SspiNegotiation/Kerberos. The target address identity must be a UPN identity (like acmedomain\\alice) or SPN identity (like host/bobs-machine).
ru: Клиент не может определить основное имя службы на основании имени в конечном адресе "{0}" для SspiNegotiation/Kerberos. Имя, соответствующее целевому адресу, должно быть представлено в виде имени участника-пользователя (пример: acmedomain\\alice) или имени субъекта-службы (пример: host/bobs-machine).

# CannotFindCert
source: Cannot find the X.509 certificate using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}'.
ru: Не удается найти сертификат X.509 с помощью следующих условий поиска: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}".

# CannotFindCertForTarget
source: Cannot find The X.509 certificate using the following search criteria: StoreName '{0}', StoreLocation '{1}', FindType '{2}', FindValue '{3}' for target '{4}'.
ru: Не удается найти сертификат X.509 с помощью следующих условий поиска: StoreName "{0}", StoreLocation "{1}", FindType "{2}", FindValue "{3}" для целевого объекта "{4}".

# CannotHaveTwoOperationsWithTheSameElement5
source: The {0}.{1} operation references a message element [{2}] that has already been exported from the {3}.{4} operation. You can change the name of one of the operations by changing the method name or using the Name property of OperationContractAttribute. Alternatively, you can control the element name in greater detail using the MessageContract programming model.
ru: Операция {0}.{1} ссылается на элемент сообщения [{2}], который уже был экспортирован из операции {3}.{4}. Можно изменить имя одной из операций путем изменения имени метода или с помощью свойства Name атрибута OperationContractAttribute. Кроме того, можно управлять именем элемента более детально, используя модель программирования MessageContract.

# CannotHaveTwoOperationsWithTheSameName3
source: Cannot have two operations in the same contract with the same name, methods {0} and {1} in type {2} violate this rule. You can change the name of one of the operations by changing the method name or by using the Name property of OperationContractAttribute.
ru: Не допускается наличие двух операций с одним и тем же именем в одном контракте, методы {0} и {1} в типе {2} нарушают это правило. Можно изменить имя одной из этих операций посредством изменения имени метода или использования свойства Name атрибута OperationContractAttribute.

# CannotImportPrivacyNoticeElementWithoutVersionAttribute
source: PrivacyNotice element must have a Version attribute.
ru: Элемент PrivacyNotice должен иметь атрибут Version.

# CannotImportProtectionLevelForContract
source: The policy to import a process cannot import a binding for contract ({0},{1}). The protection requirements for the binding are not compatible with a binding already imported for the contract. You must reconfigure the binding.
ru: Политике импорта процессов не удалось импортировать привязку для контракта ({0},{1}). Это вызвано несовместимостью требований защиты привязки с требованиями ранее импортированной привязки для данного контракта. Требуется повторная настройка привязки.

# CannotImportSupportingTokensForOperationWithoutRequestAction
source: Security policy import failed. The security policy contains supporting token requirements at the operation scope. The contract description does not specify the action for the request message associated with this operation.
ru: Сбой импорта политики безопасности. Политика безопасности включает в область определения операции требования к поддерживающему маркеру, однако в описании контракта не указано действие для сообщения запроса, связанного с этой операцией.

# CannotInheritTwoOperationsWithTheSameName3
source: Cannot inherit two different operations with the same name, operation '{0}' from contracts '{1}' and '{2}' violate this rule. You can change the name of one of the operations by changing the method name or by using the Name property of OperationContractAttribute.
ru: Невозможно наследовать две разные операции с одинаковым именем. Операция "{0}" из контрактов "{1}" и "{2}" нарушает это правило. Можно изменить имя одной из операций путем изменения имени метода или с помощью свойства Name атрибута OperationContractAttribute.

# CannotReadToken
source: Cannot read the token from the '{0}' element with the '{1}' namespace for BinarySecretSecurityToken, with a '{2}' ValueType. If this element is expected to be valid, ensure that security is configured to consume tokens with the name, namespace and value type specified.
ru: Невозможно считать маркер из элемента "{0}" с пространством имен "{1}" для маркера BinarySecretSecurityToken с типом параметра ValueType "{2}". Чтобы этот элемент был допустимым, безопасность должна быть настроена на использование маркеров с указанным именем, пространством имен и типом параметра.

# CannotValidateSecurityTokenType
source: The security token authenticator '{0}' cannot validate a token of type '{1}'.
ru: Средству проверки подлинности маркеров безопасности "{0}" не удается проверить маркер типа "{1}".

# CantCreateChannelWithManualAddressing
source: Cannot create channel for a contract that requires request/reply and a binding that requires manual addressing but only supports duplex communication.
ru: Не удается создать канал для контракта, который требует запрос/ответ и привязку с ручной адресацией, но поддерживает только дуплексную связь.

# CantInferReferenceForToken
source: Can't infer an external reference for '{0}' token type.
ru: Не удается вывести внешнюю ссылку для типа маркера "{0}".

# CertificateUnsupportedForHttpTransportCredentialOnly
source: Certificate-based client authentication is not supported in TransportCredentialOnly security mode. Select the Transport security mode.
ru: Аутентификация клиентов на основе сертификатов не поддерживается в режиме безопасности TransportCredentialOnly. Выберите режим безопасности Transport.

# ChannelDemuxerBindingElementNotFound
source: The binding does not contain a ChannelDemuxerBindingElement.
ru: В привязке отсутствует элемент ChannelDemuxerBindingElement.

# ChannelFactoryCannotBeUsedToCreateChannels
source: A call to IChannelFactory.CreateChannel made on an object of type {0} failed because Open has not been called on this object.
ru: Не удалось вызвать IChannelFactory.CreateChannel для объекта типа {0}, так как для этого объекта не был вызван Open.

# ChannelInitializationTimeout
source: A newly accepted connection did not receive initialization data from the sender within the configured ChannelInitializationTimeout ({0}). As a result, the connection will be aborted. If you are on a highly congested network, or your sending machine is heavily loaded, consider increasing this value or load-balancing your server.
ru: Принятое подключение не получило от отправителя данных инициализации в течение заданного времени ожидания ChannelInitializationTimeout ({0}). Поэтому подключение будет прервано. Если имеет место перегрузка сети или отправляющего компьютера, рекомендуется увеличить это значение или включить балансировку нагрузки сервера.

# ChannelParametersCannotBeModified
source: Cannot modify channel parameters because the {0} is in the {1} state. This operation is only supported in the Created state.
ru: Невозможно изменить параметры канала, так как {0} находится в состоянии {1}. Данная операция поддерживается только в состоянии Created.

# ChannelParametersCannotBePropagated
source: Cannot propagate channel parameters because the {0} is in the {1} state. This operation is only supported in the Opening or Opened state when the collection is locked.
ru: Распространение параметров канала невозможно, так как {0} находится в состоянии {1}. Данная операция поддерживается только в состоянии Opening или Opened, когда коллекция заблокирована.

# ChannelTypeNotSupported
source: The specified channel type {0} is not supported by this channel manager.
ru: Указанный тип канала {0} не поддерживается данным диспетчером каналов.

# ChildNodeTypeMissing
source: The XML element {0} does not have a child of type {1}.
ru: XML-элемент {0} не имеет дочернего элемента типа {1}.

# ClaimTypeCannotBeEmpty
source: The claimType cannot be an empty string.
ru: сlaimType не может быть пустой строкой.

# ClientCertificateNotProvided
source: The certificate for the client has not been provided. The certificate can be set on the ClientCredentials or ServiceCredentials.
ru: Сертификат клиента не предоставлен. Сертификат можно задать в ClientCredentials или ServiceCredentials.

# ClientCertificateNotProvidedOnClientCredentials
source: The client certificate is not provided. Specify a client certificate in ClientCredentials.
ru: Сертификат клиента не предоставлен. Укажите сертификат клиента в ClientCredentials.

# ClientCredentialTypeMustBeSpecifiedForMixedMode
source: ClientCredentialType.None is not valid for the TransportWithMessageCredential security mode. Specify a message credential type or use a different security mode.
ru: ClientCredentialType.None недопустим в режиме безопасности TransportWithMessageCredential. Укажите тип учетных данных сообщения или используйте другой режим безопасности.
