Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# WarnSkippingOpertationWithSessionOpenNotificationEnabled
source: An operation was skipped during export because the property '{0}' is set to '{1}'. This operation should be used for server only and should not be exposed from WSDL. \r\nContract Name:{2}\r\nContract Namespace:{3}\r\nOperation Name:{4}
ru: Операция была пропущена во время экспорта, поскольку свойству "{0}" задано значение "{1}". Эту операцию следует использовать только для сервера, ее не следует предоставлять из WSDL. \r\nИмя контракта: {2}\r\nПространство имен контракта: {3}\r\nИмя операции: {4}

# WarnSkippingOpertationWithWildcardAction
source: An operation was skipped during export because it has a wildcard action. This is not supported in WSDL.\r\nContract Name:{0}\r\nContract Namespace:{1}\r\nOperation Name:{2}
ru: Операция была пропущена во время экспорта, поскольку она имеет действие-шаблон. Оно не поддерживается в языке WSDL.\r\nИмя контракта: {0}\r\nПространство имен контракта: {1}\r\nИмя операции: {2}

# WebSocketCannotCreateRequestClientChannelWithCertainWebSocketTransportUsage
source: HttpChannelFactory cannot create the channel with shape '{0}' when the {1} of {2} was set as '{3}'.
ru: Фабрика HttpChannelFactory не может создать канал с формой "{0}", если режим "{1}" в параметрах "{2}" задан как "{3}".

# WebSocketInvalidProtocolContainsMultipleSubProtocolString
source: The value specified ('{0}') contains more than one subprotocol which is not supported.
ru: Указанное значение ("{0}") содержит более одного подпротокола, что не поддерживается.

# WebSocketInvalidProtocolEmptySubprotocolString
source: Empty string is not a valid subprotocol value. Please use \"null\" to specify no value.
ru: Пустая строка не является допустимым значением подпротокола. Используйте NULL для задания значения.

# WebSocketInvalidProtocolInvalidCharInProtocolString
source: The subprotocol '{0}' is invalid because it contains the invalid character '{1}'.
ru: Подпротокол "{0}" недопустим, так как содержит недопустимый символ "{1}".

# WebSocketOperationTimedOut
source: The '{0}' operation timed out after '{1}'. The time allotted to this operation may have been a portion of a longer timeout.
ru: Превышено время ожидания операции "{0}" после "{1}". Время, выделенное на эту операцию, может быть составной частью более продолжительного времени ожидания.

# WebSocketReceiveTimedOut
source: The Receive operation timed out after '{0}'. For duplex sessionful channels, the receive timeout is also the idle timeout for the channel, so consider setting a suitably large value for the ReceiveTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: Превышено время ожидания операции Receive после "{0}". Для дуплексных каналов сеансов время ожидания получения представляет собой также время ожидания простоя для канала, поэтому рекомендуется задать достаточно большое значение для ReceiveTimeout в объекте Binding. Время, выделенное на эту операцию, может быть составной частью более продолжительного времени ожидания.

# WebSocketSendTimedOut
source: The Send operation timed out after '{0}'. Increase the SendTimeout value on the Binding. The time allotted to this operation may have been a portion of a longer timeout.
ru: Превышено время ожидания операции Send после "{0}". Увеличьте значение SendTimeout в объекте Binding. Время, выделенное на эту операцию, может быть составной частью более продолжительного времени ожидания.

# WebSocketStreamWriteCalledAfterEOMSent
source: Cannot write to the stream because the end of the stream marker was already written.
ru: Не удалось осуществить запись в поток, так как уже записан маркер конца потока.

# WebSocketSubProtocolMismatchFromServer
source: The server didn't accept the connection request. It is possible that the WebSocket subprotocol sent by your client is not supported by the server. Protocol(s) supported by the server are '{0}'.
ru: Сервер не принял запрос на подключение. Возможно, подпротокол WebSocket, отправленный клиентом, не поддерживается сервером. Протоколами, поддерживаемыми сервером, являются "{0}".

# WebSocketTransportPolicyAssertionInvalid
source: The name of the policy being imported for contract '{0}:{1}' is invalid:'{2}'. It should be either '{3}', '{4}' or '{5}'.
ru: Имя политики, импортируемой для контракта "{0}:{1}", недопустимо: "{2}". Таковым должно быть "{3}", "{4}" или "{5}".

# WebSocketUnexpectedCloseMessageError
source: Unexpected WebSocket close message received when receiving a message.
ru: При получении сообщения получено непредвиденное сообщение о закрытии WebSocket.

# WebSocketVersionMismatchFromServer
source: The server didn't accept the connection request. It is possible that the WebSocket protocol version on your client doesn't match the one on the server('{0}').
ru: Сервер не принял запрос на подключение. Возможно, версия протокола WebSocket на клиенте не согласуется с таковой на сервере ("{0}").

# WmiGetObject
source: WMI GetObject Query: {0}
ru: Запрос WMI GetObject: {0}

# WmiPutInstance
source: WMI PutInstance Class: {0}
ru: Класс WMI PutInstance: {0}

# WsdlExporterIsFaulted
source: A previous call to this WsdlExporter left it in a faulted state. It is no longer usable.
ru: После предыдущего вызова WsdlExporter остался в состоянии сбоя. Он больше не может использоваться.

# WsdlExtensionBeforeImportError
source: A WSDL import extension threw an exception during the BeforeImport call: {0}\r\nError: {1}
ru: Расширение импорта WSDL вызвало исключение во время вызова BeforeImport: {0}\r\nОшибка: {1}

# WsdlExtensionContractExportError
source: An exception was thrown in a call to a WSDL export extension: {0}\r\n contract: {1}
ru: Возникло исключение при вызове расширения экспорта WSDL: {0}\r\n Контракт: {1}

# WsdlExtensionEndpointExportError
source: An exception was thrown in a call to a WSDL export extension: {0}\r\n Endpoint: {1}
ru: Возникло исключение при вызове расширения экспорта WSDL: {0}\r\n Конечная точка: {1}

# WsdlExtensionImportError
source: An exception was thrown while running a WSDL import extension: {0}\r\nError: {1}
ru: Вызвано исключение во время запуска расширения импорта WSDL: {0}\r\nОшибка: {1}

# WsdlImportErrorDependencyDetail
source: There was an error importing a {0} that the {1} is dependent on.\r\nXPath to {0}: {2}
ru: Ошибка импорта {0}, от которого зависит {1}.\r\nXPath к {0}: {2}

# WsdlImportErrorMessageDetail
source: Cannot import {0}\r\nDetail: {2}\r\nXPath to Error Source: {1}
ru: Невозможно импортировать {0}\r\nСведения: {2}\r\nXPath к источнику ошибки: {1}

# WsdlImporterContractMustBeInKnownContracts
source: The ContractDescription argument to ImportEndpoints must be contained in the KnownContracts collection.
ru: Аргумент ContractDescription для ImportEndpoints должен содержаться в коллекции KnownContracts.

# WsdlImporterIsFaulted
source: A previous call to this WsdlImporter left it in a faulted state. It is no longer usable.
ru: После предыдущего вызова WsdlImporter остался в состоянии сбоя. Он больше не может использоваться.

# WsdlItemAlreadyFaulted
source: A previous attempt to import this {0} already failed.
ru: Предыдущая попытка импортировать этот {0} уже закончилась ошибкой.

# X509ChainBuildFail
source: The X.509 certificate {0} chain building failed. The certificate that was used has a trust chain that cannot be verified. Replace the certificate or change the certificateValidationMode. {1}
ru: Ошибка при создании цепочки {0} сертификатов X.509. Использованный сертификат имеет цепочку доверия, которую невозможно проверить. Замените сертификат или измените значение certificateValidationMode. {1}

# XDCannotFindValueInDictionaryString
source: Cannot find '{0}' value in dictionary string.
ru: В строке словаря не удается найти значение "{0}".

source: \"XPath Unavailable\"
ru: \"Путь XPath недоступен.\"

# XmlBufferInInvalidState
source: An internal error has occurred. The XML buffer is not in the correct state to perform the operation.
ru: Произошла внутренняя ошибка. XML-буфер не находится в нужном состоянии, чтобы выполнить эту операцию.

# XmlBufferQuotaExceeded
source: The size necessary to buffer the XML content exceeded the buffer quota.
ru: Размер, необходимый для размещения в буфере содержимого XML, превысил квоту буфера.

# XmlFoundComment
source: comment '{0}'
ru: комментарий "{0}"

# XmlFoundElement
source: element '{0}' from namespace '{1}'
ru: элемент "{0}" из пространства имен "{1}"

# XmlFoundEndElement
source: end element '{0}' from namespace '{1}'
ru: конечный элемент "{0}" из пространства имен "{1}"

# XmlFoundEndOfFile
source: end of file
ru: конец файла

# XmlFoundNodeType
source: node {0}
ru: узел {0}

# XmlFoundText
source: text '{0}'
ru: текст "{0}"

# XmlInvalidConversion
source: The value '{0}' cannot be parsed as the type '{1}'.
ru: Значение "{0}" не может интерпретироваться как тип "{1}".

# XmlInvalidStream
source: Stream returned by OperationStreamProvider cannot be null.
ru: Поток, возвращенный поставщиком OperationStreamProvider, не может иметь значение null.

# XmlLangAttributeMissing
source: Required xml:lang attribute value is missing.
ru: Отсутствует обязательное значение атрибута xml:lang.

# XmlLineInfo
source: Line {0}, position {1}.
ru: Строка {0}, позиция {1}.

# XmlStartElementExpected
source: Start element expected. Found {0}.
ru: Ожидался начальный элемент. Найден {0}.

# XsdMissingRequiredAttribute1
source: Missing required '{0}' attribute.
ru: Отсутствует обязательный атрибут "{0}".

# channelDoesNotHaveADuplexSession0
source: The current channel does not support closing the output session as this channel does not implement ISessionChannel<IDuplexSession>.
ru: Текущий канал не поддерживает закрытие выходных сеансов, так как канал не реализует ISessionChannel<IDuplexSession>.

# channelIsNotAvailable0
source: Internal Error: The InnerChannel property is null.
ru: Внутренняя ошибка: свойство InnerChannel имеет значение null.

# couldnTFindRequiredAttributeOfTypeOn2
source: Couldn't find required attribute of type {0} on {1}.
ru: Не удалось найти обязательный атрибут типа {0} в {1}.

# tooManyAttributesOfTypeOn2
source: Too many attributes of type {0} on {1}.
ru: Слишком много атрибутов типа {0} в {1}.
