Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/FrameworkFork/System.ServiceModel/Resources/xlf/SRServiceModel.*.xlf
Languages: ru

# SFxInvalidStreamInResponse
source: For response in operation {0} to be a stream the operation must have a single out parameter or return value whose type is Stream.
ru: Чтобы ответ в операции {0} был потоком, операция должна иметь один выходной параметр или возвращенное значение с типом Stream.

# SFxInvalidStreamInTypedMessage
source: In order to use Streams with the MessageContract programming model, the type {0} must have a single member with MessageBodyMember attribute and the member type must be Stream.
ru: Чтобы использовать потоки в программной модели MessageContract, тип {0} должен иметь один член с атрибутом MessageBodyMember, а тип члена должен быть Stream.

# SFxInvalidStreamOffsetLength
source: Buffer size must be at least {0} bytes.
ru: Размер буфера должен быть не менее {0} байт.

# SFxInvalidUseOfPrimitiveOperationFormatter
source: The PrimitiveOperationFormatter was given a parameter or return type which it does not support.
ru: Объекту PrimitiveOperationFormatter предоставлен параметр или возвращаемый тип, который он не поддерживает.

# SFxInvalidWsdlBindingOpMismatch2
source: The WSDL binding named {0} is not valid because no match for operation {1} was found in the corresponding portType definition.
ru: Привязка WSDL с именем {0} недопустима, так как в соответствующем определении portType не найдено соответствие для операции {1}.

# SFxInvalidWsdlBindingOpNoName
source: The WSDL binding named {0} is not valid because an operation binding doesn't have a name specified.
ru: Привязка WSDL с именем {0} недопустима, так как для привязки операции не указано имя.

# SFxInvalidXmlAttributeInBare
source: XmlSerializer attribute {0} is not valid in {1}. Only XmlElement, XmlArray, XmlArrayItem and XmlAnyElement attributes are supported in MessageContract when IsWrapped is false.
ru: Атрибут XmlSerializer {0} не является допустимым в {1}. Если IsWrapped имеет значение false, то в MessageContract поддерживаются только атрибуты Only XmlElement, XmlArray, XmlArrayItem и XmlAnyElement.

# SFxInvalidXmlAttributeInWrapped
source: XmlSerializer attribute {0} is not valid in {1}. Only XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute and XmlAnyElement attributes are supported when IsWrapped is true.
ru: Атрибут XmlSerializer {0} не является допустимым в {1}. Если IsWrapped имеет значение true, то поддерживаются только атрибуты Only XmlElement, XmlArray, XmlArrayItem, XmlAnyAttribute и XmlAnyElement.

# SFxKnownTypeAttributeInvalid1
source: {0} must contain either a single ServiceKnownTypeAttribute that refers to a method or a set of ServiceKnownTypeAttributes, each specifying a valid type
ru: {0} должен содержать либо атрибут ServiceKnownTypeAttribute, ссылающийся на некоторый метод, либо набор атрибутов ServiceKnownTypeAttributes, каждый из которых определяет допустимый тип.

# SFxKnownTypeAttributeReturnType3
source: The return type of method {1} in type {2} must be IEnumerable<Type> to be used by ServiceKnownTypeAttribute in {0}
ru: Возвращаемый тип метода {1} в типе {2} должен быть IEnumerable<Type>, чтобы использоваться атрибутом ServiceKnownTypeAttribute в {0}.

# SFxKnownTypeAttributeUnknownMethod3
source: ServiceKnownTypeAttribute in {0} refers to a method {1} that does not exist in type {2}
ru: Атрибут ServiceKnownTypeAttribute в {0} ссылается на метод {1}, который не существует в типе {2}.

# SFxKnownTypeNull
source: KnownType cannot be null in operation {0}
ru: KnownType не может иметь значение null в операции {0}.

# SFxMaximumResolvedReferencesOutOfRange
source: The MaximumResolvedReferences property of MetadataExchangeClient must be greater than or equal to one. '{0}' was specified.
ru: Свойство MaximumResolvedReferences клиента MetadataExchangeClient должно быть больше или равно единице. Указано значение "{0}".

# SFxMessageContractBaseTypeNotValid
source: The type {1} defines a MessageContract but also derives from a type {0} that does not define a MessageContract. All of the objects in the inheritance hierarchy of {1} must defines a MessageContract.
ru: Тип {1} определяет MessageContract, но он также является производным от типа {0}, который не определяет MessageContract. Все объекты в иерархии наследования {1} должны определить MessageContract.

# SFxMessageContractRequiresDefaultConstructor
source: The message cannot be deserialized into MessageContract type {0} since it does not have a default (parameterless) constructor.
ru: Сообщение нельзя десериализовать в MessageContract типа {0}, так как оно не имеет конструктора по умолчанию (без параметров).

# SFxMessagePartDescriptionMissingType
source: Instance of MessagePartDescription Name='{0}' Namespace='{1}' cannot be used in this context: required 'Type' property was not set.
ru: Экземпляр MessagePartDescription имя="{0}" пространство имен="{1}" не может быть использован в данном контексте: не задано требуемое свойство Type.

# SFxMetadataExchangeClientCouldNotCreateChannelFactory
source: The MetadataExchangeClient could not create an IChannelFactory for: address='{0}', dialect='{1}', and identifier='{2}'.
ru: Клиенту MetadataExchangeClient не удалось создать IChannelFactory для следующего объекта: адрес="{0}", диалект="{1}", идентификатор="{2}".

# SFxMetadataExchangeClientCouldNotCreateChannelFactoryBadScheme
source: The MetadataExchangeClient instance could not be initialized because no Binding is available for scheme '{0}'. You can supply a Binding in the constructor, or specify a configurationName.
ru: Не удалось инициализировать экземпляр клиента MetadataExchangeClient, так как для схемы "{0}" нет доступной привязки. Можно предоставить привязку в конструкторе или указав имя конфигурации.

# SFxMetadataExchangeClientCouldNotCreateWebRequest
source: The MetadataExchangeClient could not create an HttpWebRequest for: address='{0}', dialect='{1}', and identifier='{2}'.
ru: Клиенту MetadataExchangeClient не удалось создать HttpWebRequest для следующего объекта: адрес="{0}", диалект="{1}", идентификатор="{2}".

# SFxMetadataExchangeClientNoMetadataAddress
source: The MetadataExchangeClient was not supplied with a MetadataReference or MetadataLocation from which to get metadata. You must supply one to the constructor, to the GetMetadata method, or to the BeginGetMetadata method.
ru: Клиенту MetadataExchangeClient не предоставлен адрес MetadataReference или MetadataLocation для получения метаданных. Необходимо указать этот адрес в конструкторе, в методе GetMetadata или в методе BeginGetMetadata.

# SFxMetadataReferenceInvalidLocation
source: The value '{0}' is not valid for the Location property. The Location property must be a valid absolute or relative URI.
ru: Значение {0} недопустимо для свойства Location. Свойство Location должно быть допустимым абсолютным или относительным URI.

# SFxMethodNotSupported1
source: Method {0} is not supported on this proxy, this can happen if the method is not marked with OperationContractAttribute or if the interface type is not marked with ServiceContractAttribute.
ru: Метод {0} для этого прокси не поддерживается. Это может произойти, если метод не помечен атрибутом OperationContractAttribute или если тип интерфейса не помечен атрибутом ServiceContractAttribute.

# SFxMethodNotSupportedOnCallback1
source: Callback method {0} is not supported, this can happen if the method is not marked with OperationContractAttribute or if its interface type is not the target of the ServiceContractAttribute's CallbackContract.
ru: Метод обратного вызова {0} не поддерживается. Это может произойти, если метод не помечен атрибутом OperationContractAttribute или если тип интерфейса не является целью CallbackContract атрибута ServiceContractAttribute.

# SFxMismatchedOperationParent
source: A DispatchOperation (or ClientOperation) can only be added to its parent DispatchRuntime (or ClientRuntime).
ru: Элемент DispatchOperation (или ClientOperation) можно только добавить к своему родительскому элементу DispatchRuntime (или ClientRuntime).

# SFxMissingActionHeader
source: No Action header was found with namespace '{0}' for the given message.
ru: В данном сообщении не удалось найти заголовок Action с пространством имен "{0}".

# SFxMultipleCallbackFromAsyncOperation
source: The callback passed to operation '{0}' was called more than once. This indicates an internal error in the implementation of that operation.
ru: Обратный вызов, переданный операции "{0}", был использован несколько раз. Это указывает на внутреннюю ошибку при реализации этой операции.

# SFxMultipleCallbackFromSynchronizationContext
source: Calling Post() on '{0}' resulted in multiple callbacks. This indicates a problem in '{0}'.
ru: Вызов Post() для "{0}" привел к множественным обратным вызовам. Это указывает на неполадки в "{0}".

# SFxMultipleContractStarOperations0
source: A ServiceContract has more the one operation with an Action of \"*\". A ServiceContract can have at most one operation an Action = \"*\".
ru: ServiceContract имеет несколько операций с действием \"*\". Каждый ServiceContract может иметь не более одной операции с Action =\ "*\".

# SFxMultipleUnknownHeaders
source: Method {0} in type {1} has more than one header part of type array of XmlElement.
ru: Метод {0} в типе {1} имеет несколько частей заголовка из массива типов элемента XmlElement.

# SFxNameCannotBeEmpty
source: The Name property must be a non-empty string.
ru: Свойство Name должно быть непустой строкой.

# SFxNeedProxyBehaviorOperationSelector2
source: Cannot handle invocation of {0} on interface {1} because the OperationSelector on ClientRuntime is null.
ru: Не удается обработать вызов {0} в интерфейсе {1}, так как OperationSelector в ClientRuntime имеет значение null.

# SFxNoDefaultConstructor
source: The service type provided could not be loaded as a service because it does not have a default (parameter-less) constructor. To fix the problem, add a default constructor to the type, or pass an instance of the type to the host.
ru: Не удалось загрузить предоставленный тип службы в качестве службы, так как он не имеет конструктора по умолчанию (без параметров). Для устранения неполадки добавьте к типу конструктор по умолчанию или передайте в узлу экземпляр типа.

# SFxNoEndpointMatchingAddress
source: The message with To '{0}' cannot be processed at the receiver, due to an AddressFilter mismatch at the EndpointDispatcher. Check that the sender and receiver's EndpointAddresses agree.
ru: Сообщение с заголовком To "{0}" невозможно обработать на стороне получателя из-за несоответствия AddressFilter на EndpointDispatcher. Проверьте согласованность адресов EndpointAddress на стороне отправителя и получателя.

# SFxNoEndpointMatchingAddressForConnectionOpeningMessage
source: The message with Action '{0}' cannot be processed at the receiver because this Action is reserved for the connection opening messages only and cannot be sent from client to server. To invoke this operation on the server, call the '{1}' method on the client proxy instead.
ru: Сообщение с заголовком Action "{0}" невозможно обработать на получателе, поскольку это действие зарезервировано для сообщений об открытии соединений и не может отправляться от клиента серверу. Чтобы запустить эту операцию на сервере, вызовите метод "{1}" в прокси клиента.

# SFxNoEndpointMatchingContract
source: The message with Action '{0}' cannot be processed at the receiver, due to a ContractFilter mismatch at the EndpointDispatcher. This may be because of either a contract mismatch (mismatched Actions between sender and receiver) or a binding/security mismatch between the sender and the receiver. Check that sender and receiver have the same contract and the same binding (including security requirements, e.g. Message, Transport, None).
ru: Сообщение с заголовком Action "{0}" невозможно обработать на стороне получателя из-за несоответствия ContractFilter на EndpointDispatcher. Возможно, это связано с несоответствием контрактов (несогласованность действий на стороне отправителя и получателя) или несоответствием привязки/защиты на стороне отправителя и получателя. Убедитесь, что отправитель и получатель имеют один и тот же контракт и одинаковые привязки (включая требования к защите, например Message, Transport или None).

# SFxNoMostDerivedContract
source: The contract specified by type '{0}' is ambiguous. The type derives from at least two different types that each define its own service contract. For this type to be used as a contract type, exactly one of its inherited contracts must be more derived than any of the others.
ru: Контракт, указанный в типе "{0}", неоднозначен. Этот тип является производным от не менее двух разных типов, каждый из которых определяет собственный контракт службы. Чтобы использовать этот тип в качестве типа контракта, один из наследуемых контрактов должен иметь большую глубину наследования, чем все другие.

# SFxNoServiceObject
source: The service implementation object was not initialized or is not available.
ru: Объект реализации службы не инициализирован или недоступен.

# SFxNonExceptionThrown
source: An object that is not an exception was thrown.
ru: Вызван объект, который не является исключением.

# SFxNonInitiatingOperation1
source: The operation '{0}' cannot be the first operation to be called because IsInitiating is false.
ru: Операция "{0}" не может быть первой вызываемой операцией, так как атрибут IsInitiating имеет значение false.

# SFxNone2004
source: The WS-Addressing \"none\" value is not valid for the August 2004 version of WS-Addressing.
ru: Значение WS-Addressing none недопустимо для версии WS-Addressing August 2004.

# SFxNullReplyFromFormatter2
source: Formatter {0} returned a null reply message for call to operation '{1}'.
ru: Модуль форматирования {0} вернул нулевое ответное сообщение для вызова операции "{1}".

# SFxOneWayMessageToTwoWayMethod0
source: The incoming message with action could not be processed because it is targeted at a request-reply operation, but cannot be replied to as the MessageId property is not set.
ru: Не удалось обработать входящее сообщение с указанием действия, так как оно ориентировано на операцию типа "запрос-ответ", однако невозможно отправить ответ, поскольку не задан идентификатор MessageId.

# SFxOperationContractOnNonServiceContract
source: Method '{0}' has OperationContractAttribute, but enclosing type '{1}' does not have ServiceContractAttribute. OperationContractAttribute can only be used on methods in ServiceContractAttribute types or on their CallbackContract types.
ru: Метод "{0}" имеет атрибут OperationContractAttribute, но включающий тип "{1}" не имеет атрибута ServiceContractAttribute. Атрибут OperationContractAttribute применим только к методам в типах ServiceContractAttribute или к их типам CallbackContract.

# SFxOperationContractProviderOnNonServiceContract
source: Method '{1}' has {0}, but enclosing type '{2}' does not have ServiceContractAttribute. {0} can only be used on methods in ServiceContractAttribute types.
ru: Метод "{1}" имеет элемент {0}, но содержащий его тип "{2}" не имеет атрибута ServiceContractAttribute. Элемент {0} может использоваться в методах только в типах ServiceContractAttribute.

# SFxOperationDescriptionNameCannotBeEmpty
source: OperationDescription's Name must be a non-empty string.
ru: Имя элемента OperationDescription должно быть непустой строкой.

# SFxOperationMustHaveOneOrTwoMessages
source: OperationDescription '{0}' is invalid because its Messages property contains an invalid number of MessageDescription instances. Each OperationDescription must have one or two messages.
ru: Элемент OperationDescription "{0}" недопустим, так как его свойство Messages содержит неверное количество экземпляров MessageDescription. Каждый элемент OperationDescription должен иметь одно или два сообщения.

# SFxParameterCountMismatch
source: There was a mismatch between the number of supplied arguments and the number of expected arguments. Specifically, the argument '{0}' has '{1}' elements while the argument '{2}' has '{3}' elements.
ru: Несоответствие между числом предоставленных аргументов и количеством ожидаемых аргументов. В частности, аргумент "{0}" имеет "{1}" элементов, а аргумент "{2}" — "{3}" элементов.

# SFxParameterMustBeArrayOfOneElement
source: The 'parameters' argument must be an array of one element.
ru: Аргумент parameters должен быть массивом из одного элемента.

# SFxParameterMustBeMessage
source: The 'parameters' argument must be an array that contains a single Message object.
ru: Аргумент parameters должен быть массивом, содержащим один объект Message.

# SFxParameterNameCannotBeNull
source: All parameter names used in operations that make up a service contract must not be null.
ru: Все имена параметров, используемых в операциях, составляющих контракт службы, не должны иметь значение null.

# SFxParametersMustBeEmpty
source: The 'parameters' argument must be either null or an empty array.
ru: Аргумент parameters должен быть представлен значением null или пустым массивом.

# SFxPartNameMustBeUniqueInRpc
source: Message part name {0} is not unique in an RPC Message.
ru: Имя части сообщения {0} не уникально в RPC Message.

# SFxProxyRuntimeMessageCannotBeNull
source: In operation '{0}', cannot pass null to methods that take Message as input parameter.
ru: В операции "{0}" не удается передать значение null методам, которые принимают объект Message в качестве входного параметра.

# SFxReplyActionMismatch3
source: A reply message was received for operation '{0}' with action '{1}'. However, your client code requires action '{2}'.
ru: Получено ответное сообщение для операции "{0}" с действием "{1}". Однако код клиента требует действия "{2}".

# SFxRequestHasInvalidFaultToOnClient
source: The request message has FaultTo='{0}' but IContextChannel.LocalAddress is '{1}'. When ManualAddressing is false, these values must be the same, null, or EndpointAddress.AnonymousAddress. Enable ManualAddressing or avoid setting FaultTo on the message.
ru: В сообщении запроса FaultTo="{0}", однако адрес IContextChannel.LocalAddress имеет значение "{1}". Если для ManualAddressing установлено значение false, эти значения должны быть одинаковыми — null или EndpointAddress.AnonymousAddress. Включите ManualAddressing или не устанавливайте значение FaultTo в сообщении.

# SFxRequestHasInvalidReplyToOnClient
source: The request message has ReplyTo='{0}' but IContextChannel.LocalAddress is '{1}'. When ManualAddressing is false, these values must be the same, null, or EndpointAddress.AnonymousAddress. Enable ManualAddressing or avoid setting ReplyTo on the message.
ru: В сообщении запроса ReplyTo="{0}", однако адрес IContextChannel.LocalAddress имеет значение "{1}". Если для ManualAddressing установлено значение false, эти значения должны быть одинаковыми — null или EndpointAddress.AnonymousAddress. Включите ManualAddressing или не устанавливайте значение ReplyTo в сообщении.

# SFxRequestReplyNone
source: A message was received with a WS-Addressing ReplyTo or FaultTo header targeted at the \"None\" address. These values are not valid for request-reply operations. Please consider using a one-way operation or enabling ManualAddressing if you need to support ReplyTo or FaultTo values of \"None.\"
ru: Получено сообщение с указанием адреса None в заголовке WS-Addressing ReplyTo или FaultTo. Эти значения недопустимы для операций запроса-ответа. Используйте одностороннюю операцию или включите ManualAddressing, если требуется поддерживать ReplyTo или FaultTo со значением None.

# SFxRequestTimedOut1
source: This request operation did not receive a reply within the configured timeout ({0}). The time allotted to this operation may have been a portion of a longer timeout. This may be because the service is still processing the operation or because the service was unable to send a reply message. Please consider increasing the operation timeout (by casting the channel/proxy to IContextChannel and setting the OperationTimeout property) and ensure that the service is able to connect to the client.
ru: Во время операции запроса ответ не получен в течение настроенного времени ожидания ({0}). Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания. Это может быть связано с тем, что служба продолжает обрабатывать операцию, или с тем, что службе не удалось отправить ответное сообщение. Увеличьте значение времени ожидания операции (путем приведения канала/прокси к IContextChannel и изменения свойства OperationTimeout), а также убедитесь, что служба способна подключиться к клиенту.

# SFxRequestTimedOut2
source: This request operation sent to {0} did not receive a reply within the configured timeout ({1}). The time allotted to this operation may have been a portion of a longer timeout. This may be because the service is still processing the operation or because the service was unable to send a reply message. Please consider increasing the operation timeout (by casting the channel/proxy to IContextChannel and setting the OperationTimeout property) and ensure that the service is able to connect to the client.
ru: Во время операции запроса в {0} ответ не был получен в течение настроенного времени ожидания ({1}). Время, выделенное для выполнения этой операции, может быть составной частью более длительного времени ожидания. Это может быть связано с тем, что служба продолжает обработать операцию, или с тем, что службе не удалось отправить ответное сообщение. Увеличьте значение времени ожидания операции (путем приведения канала/прокси к IContextChannel и изменения свойства OperationTimeout), а также убедитесь, что служба способна подключиться к клиенту.

# SFxResolvedMaxResolvedReferences
source: The MetadataExchangeClient has resolved more than MaximumResolvedReferences.
ru: MetadataExchangeClient разрешил больше, чем MaximumResolvedReferences.

# SFxResultMustBeMessage
source: The 'result' argument must be of type Message.
ru: Аргумент result должен иметь тип Message.

# SFxRpcMessageBodyPartNameInvalid
source: RPC Message {1} in operation {0} has an invalid body name {2}. It must be {3}
ru: Сообщение RPC {1} в операции {0} имеет недопустимое имя текста {2}. Оно должно быть {3}.

# SFxSchemaDoesNotContainElement
source: There was a problem loading the XSD documents provided: a reference to a schema element with name '{0}' and namespace '{1}' could not be resolved because the element definition could not be found in the schema for targetNamespace '{1}'. Please check the XSD documents provided and try again.
ru: Не удается загрузить предоставленные документы XSD: не удалось разрешить ссылку на элемент схемы с именем "{0}" и пространством имен "{1}", так как невозможно найти определение элемента в схеме для целевого пространства имен targetNamespace "{1}". Проверьте предоставленные документы XSD и повторите попытку.

# SFxSchemaDoesNotContainType
source: There was a problem loading the XSD documents provided: a reference to a schema type with name '{0}' and namespace '{1}' could not be resolved because the type definition could not be found in the schema for targetNamespace '{1}'. Please check the XSD documents provided and try again.
ru: Не удается загрузить предоставленные документы XSD: не удалось разрешить ссылку на тип схемы с именем "{0}" и пространством имен "{1}", так как невозможно найти определение типа в схеме для целевого пространства имен targetNamespace "{1}". Проверьте предоставленные документы XSD и повторите попытку.

# SFxSchemaNotFound
source: Schema with target namespace '{0}' could not be found.
ru: Не удалось найти схему с целевым пространством имен "{0}".
