Repository: dotnet/wcf
Catalog: src/System.ServiceModel.NetNamedPipe/src/Resources/xlf/strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ChannelTypeNotSupported
source: The specified channel type {0} is not supported by this channel manager.
cs: Určený typ kanálu {0} není tímto správcem kanálů podporován.
de: Der angegebene Kanaltyp {0} wird von diesem Kanal-Manager nicht unterstützt.
es: Este administrador de canales no admite el tipo de canal especificado {0}.
fr: Le type de canal {0} spécifié n'est pas pris en charge par ce gestionnaire de canaux.
it: Il tipo di canale specificato {0} non è supportato da questo gestore canali.
ja: このチャネル マネージャーでは、指定されたチャネルの型 {0} をサポートしていません。
ko: 지정된 채널 형식 {0}이(가) 이 채널 관리자에서 지원되지 않습니다.
pl: Określony typ kanału {0} jest nieobsługiwany przez tego menedżera kanałów.
pt_br: O tipo de canal especificado {0} não tem suporte deste gerenciador de canais.
ru: Указанный тип канала {0} не поддерживается данным диспетчером каналов.
tr: Belirtilen kanal türü {0}, bu kanal yöneticisi tarafından desteklenmiyor.
zh_hans: 此通道管理器不支持指定的通道类型 {0}。
zh_hant: 此通道管理員不支援指定的通道類型 {0}。

# EndpointNotFound
source: There was no endpoint listening at {0} that could accept the message. This is often caused by an incorrect address or SOAP action. See InnerException, if present, for more details.
cs: Na {0} neposlouchal žádný koncový bod, který by mohl přijmout zprávu. To je často způsobeno nesprávnou adresou nebo akcí SOAP. Další informace zjistíte podle hodnoty vlastnosti InnerException (je-li přítomna).
de: Es war kein an {0} lauschender Endpunkt vorhanden, der die Nachricht akzeptieren konnte. Dies wird häufig durch eine fehlerhafte Adresse oder SOAP-Aktion verursacht. Weitere Details finden Sie unter "InnerException" (sofern vorhanden).
es: No había ningún punto de conexión escuchando en {0} que pudiera aceptar el mensaje. La causa suele ser una dirección o una acción SOAP incorrecta. Consulte InnerException, si está presente, para obtener más información.
fr: Il n'existait pas de point de terminaison à l'écoute sur {0} pouvant accepter le message. Ceci est souvent dû à une adresse ou une action SOAP incorrecte. S'il est présent, consultez InnerException pour plus d'informations.
it: Non è disponibile alcun endpoint in ascolto su {0} in grado di accettare il messaggio. Questo problema dipende spesso da un'azione SOAP o da un indirizzo non corretto. Per maggiori dettagli, vedere InnerException, se presente.
ja: メッセージを受信できる {0} でリッスンしているエンドポイントがありませんでした。これは一般に、アドレスまたは SOAP アクションが正しくない場合に発生します。詳細については、InnerException を参照してください (もしあれば)。
ko: 메시지를 수락할 수 있는 {0}에서 수신 대기 중인 엔드포인트가 없습니다. 이것은 흔히 잘못된 주소나 SOAP 동작으로 인해 발생합니다. 자세한 내용은 InnerException(있을 경우)을 참조하세요.
pl: W elemencie {0} brak nasłuchującego punktu końcowego, który mógłby odebrać komunikat. Jest to często spowodowane niepoprawnym adresem lub akcją SOAP. Sprawdź właściwość InnerException (jeśli jest obecna), aby uzyskać więcej szczegółowych informacji.
pt_br: Não havia nenhum ponto de extremidade em escuta em {0} capaz de aceitar a mensagem. Em geral, isso é causado por endereço ou ação de SOAP incorretos. Consulte InnerException, se presente, para obter mais detalhes.
ru: Прослушивание по {0} не выполняла ни одна конечная точка, которая могла бы принять сообщение. Среди прочих причин это могло быть вызвано неправильным адресом или действием SOAP. Подробнее см. в описании InnerException (если имеется).
tr: {0} konumunda dinleme yapan, iletiyi kabul edebilecek uç nokta yoktu. Bunun nedeni genellikle hatalı bir adres ya da SOAP eylemidir. Ayrıntılar için varsa InnerException öğesine bakın.
zh_hans: 没有终结点在侦听可以接受消息的 {0}。这通常是由于不正确的地址或者 SOAP 操作导致的。如果存在此情况，请参见 InnerException 以了解详细信息。
zh_hant: 沒有任何在 {0} 上進行接聽的端點可以接受該訊息。這通常是由不正確位址或 SOAP 動作所造成。若有 InnerException，可參閱以取得詳細資訊。

# PipeAlreadyClosing
source: The pipe cannot be written to or read from because it is already in the process of being closed.
cs: Do kanálu nelze zapisovat ani z něj číst, protože již probíhá proces jeho uzavírání.
de: Schreiben in oder Lesen aus der Pipe ist nicht möglich, da die Pipe bereits geschlossen wird.
es: No se puede escribir ni leer en la canalización porque ya está en proceso de cerrarse.
fr: Le canal n'est pas accessible en lecture et en écriture car il est déjà en cours de fermeture.
it: Impossibile scrivere sulla pipe o leggere da essa perché è già in fase di chiusura.
ja: このパイプは既にクローズ処理に入っているため、書き込みも読み取りもできません。
ko: 파이프를 이미 닫는 중이기 때문에 파이프에 쓰거나 파이프에서 읽을 수 없습니다.
pl: Nie można odczytać z potoku ani zapisać do niego, ponieważ trwa zamykanie potoku.
pt_br: Não é possível gravar no pipe ou ler a partir do pipe porque ele já está no processo de fechamento.
ru: Невозможно выполнить запись или чтение из канала, так как он уже находится в процессе закрытия.
tr: Kanala zaten kapatma işlemi uygulandığından kanala yazılamıyor ya da buradan okuma yapılamıyor.
zh_hans: 无法写入或读取管道，因为它已在正在被关闭的进程中。
zh_hant: 管道正在關閉中，因此無法寫入或讀取。

# PipeAlreadyShuttingDown
source: The pipe cannot be written to because it is already in the process of shutting down.
cs: Do kanálu nelze zapisovat, protože již probíhá proces jeho vypínání.
de: Die Pipe befindet sich im Prozess des Herunterfahrens. Daher kann nicht in die Pipe geschrieben werden.
es: No se puede escribir en la canalización porque ya está en proceso de cerrarse.
fr: Le canal n'est pas accessible en écriture car il est déjà en cours d'arrêt.
it: Impossibile scrivere sulla pipe perché è già in fase di arresto.
ja: このパイプは既にシャットダウン処理に入っているため、書き込みできません。
ko: 파이프를 이미 종료하는 중이기 때문에 파이프에 쓸 수 없습니다.
pl: Nie można zapisać potoku, ponieważ trwa jego zamykanie.
pt_br: Não é possível gravar no pipe porque ele já está no processo de desligamento.
ru: Невозможно выполнить запись в канал, так как он уже находится в процессе отключения.
tr: Kanala zaten kapatma işlemi uygulandığından kanala yazılamıyor.
zh_hans: 无法写入管道，因为它已在关机进程中。
zh_hant: 管道正在關機中，因此無法寫入。

# PipeCantCloseWithPendingWrite
source: The pipe cannot be closed while a write to the pipe is pending.
cs: Kanál nelze uzavřít, pokud čeká na vyřízení zápis do kanálu.
de: Die Pipe kann nicht geschlossen werden, während ein Schreibvorgang in die Pipe aussteht.
es: No se puede cerrar la canalización mientras haya una escritura pendiente en ella.
fr: Le canal ne peut pas être fermé alors qu'une écriture sur le canal est en attente.
it: Impossibile chiudere la pipe quando un processo di scrittura sulla pipe è in sospeso.
ja: パイプへの書き込み処理中はパイプを閉じることはできません。
ko: 파이프에 쓰기가 보류 중인 상태에서 파이프를 닫을 수 없습니다.
pl: Nie można zamknąć potoku podczas oczekiwania na zapis do niego.
pt_br: Não será possível fechar o pipe enquanto houver uma gravação pendente nesse pipe.
ru: Канал не может быть закрыт, пока ожидается запись в канал.
tr: Kanala yazma beklemedeyken kanal kapatılamaz.
zh_hans: 当管道的写入操作挂起时，无法关闭该管道。
zh_hant: 寫入管道為擱置中狀態時，無法關閉管道。

# PipeCloseFailed
source: The pipe could not close gracefully. This may be caused by the application on the other end of the pipe exiting.
cs: Kanál nelze řádně uzavřít. To je pravděpodobně způsobeno aplikací na druhém konci existujícího kanálu.
de: Die Pipe konnte nicht ordnungsgemäß geschlossen werden. Dies kann darauf zurückzuführen sein, dass die Anwendung am anderen Ende der Pipe beendet wird.
es: La canalización no se pudo cerrar correctamente. La causa puede ser el cierre de la aplicación del otro extremo de la canalización.
fr: Le canal ne peut pas être fermé normalement. La raison peut en être la fermeture de l'application à l'autre extrémité du canal.
it: Impossibile chiudere normalmente la pipe. Ciò può essere causato dalla chiusura dell'applicazione dall'altra parte della pipe.
ja: パイプを正常に閉じられませんでした。この原因としては、パイプの反対側のアプリケーションが終了していることが考えられます。
ko: 파이프를 적절하게 닫을 수 없습니다. 이것은 파이프의 다른 끝에 있는 응용 프로그램이 종료하는 중이기 때문일 수 있습니다.
pl: Nie można bezpiecznie zamknąć potoku. Ta sytuacja może być spowodowana zakończeniem pracy aplikacji po drugiej stronie potoku.
pt_br: Não foi possível fechar o pipe corretamente. Isso pode ter sido causado pelo encerramento do aplicativo na outra extremidade do pipe.
ru: Не удалось мягко закрыть канал. Возможно, это вызвано выходом из приложения на другом конце канала.
tr: Kanal düzgün kapatılamadı. Bu, uygulamadan kanalın öbür tarafında çıkış yapılması nedeniyle gerçekleşmiş olabilir.
zh_hans: 无法正常关闭管道。这可能是因为管道另一端上的应用程序退出所导致的。
zh_hant: 管道無法依正常程序關閉。這可能是因為管道另一端的應用程式結束所造成。

# PipeClosed
source: The operation cannot be completed because the pipe was closed. This may have been caused by the application on the other end of the pipe exiting.
cs: Operaci nelze dokončit, protože kanál byl uzavřen. To je pravděpodobně způsobeno aplikací na druhém konci existujícího kanálu.
de: Der Vorgang kann nicht abgeschlossen werden, weil die Pipe geschlossen wurde. Dies kann darauf zurückzuführen sein, dass die Anwendung am anderen Ende der Pipe beendet wird.
es: La operación no se puede completar porque se cerró la canalización. La causa puede haber sido el cierre de la aplicación del otro extremo de la canalización.
fr: L'opération ne peut pas être terminée car le canal était fermé. La raison peut en être la fermeture de l'application à l'autre extrémité du canal.
it: Impossibile completare l'operazione perché la pipe è stata chiusa. Ciò può essere causato dalla chiusura dell'applicazione nell'altra parte.
ja: パイプが閉じられているため、操作を完了できません。この原因としては、パイプの反対側のアプリケーションが終了していることが考えられます。
ko: 파이프가 닫혔기 때문에 작업을 완료할 수 없습니다. 이것은 파이프의 다른 끝에 있는 응용 프로그램이 종료하는 중이기 때문일 수 있습니다.
pl: Nie można zakończyć operacji, ponieważ potok został zamknięty. Ta sytuacja może być spowodowana zakończeniem pracy aplikacji po drugiej stronie potoku.
pt_br: Não é possível concluir a operação porque o pipe estava fechado. Isso pode ter sido causado pelo encerramento do aplicativo na outra extremidade do pipe.
ru: Операция не может быть завершена, так как канал закрыт. Возможно, это вызвано выходом из приложения на другом конце канала.
tr: Kanal kapatıldığından işlem tamamlanamıyor. Bu, uygulamadan kanalın öbür tarafında çıkış yapılması nedeniyle gerçekleşmiş olabilir.
zh_hans: 无法完成操作，因为管道已关闭。这可能是因为管道另一端上的应用程序退出所导致的。
zh_hant: 管道關閉，因此無法完成作業。這可能是因為管道另一端的應用程式結束所造成。

# PipeConnectAddressFailed
source: A pipe endpoint exists for '{0}', but the connect failed: {1}
cs: Koncový bod kanálu pro {0} existuje, ale připojení se nezdařilo: {1}
de: Es ist ein Pipeendpunkt für "{0}" vorhanden, aber Fehler beim Herstellen einer Verbindung: {1}
es: Existe un extremo de canalización para '{0}', pero se produjo un error en la conexión: {1}
fr: Un point de terminaison de canal existe pour '{0}', mais la connexion a échoué : {1}
it: Endpoint di pipe esistente per '{0}', ma la connessione non è riuscita: {1}
ja: '{0}' のパイプ エンドポイントは存在していますが、接続は失敗しました。{1}
ko: '{0}'에 대한 파이프 끝점이 있지만 연결에 실패했습니다. {1}
pl: Punkt końcowy potoku istnieje dla elementu „{0}”, ale nie można nawiązać połączenia: {1}.
pt_br: Existe um ponto de extremidade de pipe para '{0}', mas houve uma falha na conexão: {1}
ru: Для "{0}" существует конечная точка канала, подключиться не удалось: {1}
tr: '{0}' için bir kanal bitiş noktası var, ancak bağlanma başarısız oldu: {1}
zh_hans: “{0}”的管道终结点存在，但连接失败: {1}
zh_hant: '{0}' 的管道端點存在，但連線失敗: {1}

# PipeConnectFailed
source: Cannot connect to endpoint '{0}'.
cs: Nelze se připojit ke koncovému bodu {0}.
de: Es konnte keine Verbindung mit dem Endpunkt „{0}“ hergestellt werden.
es: No se puede conectar con el punto de conexión '{0}'.
fr: Nous n’avons pas pu vous connecter au point de terminaison '{0}'.
it: Non è possibile connettersi all'endpoint'{0}'.
ja: エンドポイント '{0}' に接続できません。
ko: 엔드포인트 '{0}'에 연결할 수 없습니다.
pl: Nie można nawiązać połączenia z punktem końcowym „{0}”.
pt_br: Não é possível conectar-se ao ponto de extremidade '{0}'.
ru: Не удается подключиться к конечной точке "{0}".
tr: '{0}' uç noktasına bağlanılamıyor.
zh_hans: 无法连接到终结点“{0}”。
zh_hant: 無法連線至端點 '{0}'。

# PipeConnectTimedOut
source: Cannot connect to endpoint '{0}' within the allotted timeout of {1}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Nelze se připojit ke koncovému bodu {0} v přiděleném časovém limitu {1}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Es konnte keine Verbindung mit Endpunkt "{0}" innerhalb des zugewiesenen Zeitlimits von {1} hergestellt werden. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: No se puede conectar al extremo '{0}' en el tiempo de espera asignado de {1}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Impossible de se connecter au point de terminaison '{0}' dans le délai d'attente alloué de {1}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Impossibile stabilire la connessione all'endpoint '{0}' entro il timeout assegnato {1}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {1} 内にエンドポイント '{0}' に接続できません。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한 {1} 이내에 끝점 '{0}'에 연결할 수 없습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Nie udało się nawiązać połączenia z punktem końcowym „{0}” w przydzielonym limicie czasu {1}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: Não é possível conectar-se ao ponto de extremidade '{0}' dentro do tempo limite determinado de {1}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
ru: Не удается подключиться к конечной точке "{0}" в течение выделенного времени ожидания {1}. Время, назначенное для выполнения этой операции, может быть составной частью более длинного тайм-аута.
tr: '{0}' bitiş noktasına ayrılan zaman aşımı süresi ({1}) içinde bağlanılamıyor. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 无法在分配的超时 {1} 内连接到终结点“{0}”。分配给此操作的时间可能比超时长。
zh_hant: 無法在分配的逾時 {1} 內連線至端點 '{0}'。分配給此作業的時間可能是較長逾時的一部分。

# PipeConnectTimedOutServerTooBusy
source: Cannot connect to endpoint '{0}' within the allotted timeout of {1}. The server has likely reached the MaxConnections quota and is too busy to accept new connections. The time allotted to this operation may have been a portion of a longer timeout.
cs: Nelze se připojit ke koncovému bodu {0} v přiděleném časovém limitu {1}. Server pravděpodobně dosáhl kvóty MaxConnections a je příliš zaneprázdněn a nemůže přijmout nová připojení. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Es konnte keine Verbindung mit Endpunkt "{0}" innerhalb des zugewiesenen Zeitlimits von {1} hergestellt werden. Der Server hat möglicherweise das MaxConnections-Kontingent erreicht und ist zu stark ausgelastet, um neue Verbindungen anzunehmen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: No se puede conectar al extremo '{0}' en el tiempo de espera asignado de {1}. El servidor probablemente alcanzó la cuota de MaxConnections y está demasiado ocupado para aceptar nuevas conexiones. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: Impossible de se connecter au point de terminaison '{0}' dans le délai d'attente alloué de {1}. Le serveur a probablement atteint le quota MaxConnections et est trop occupé pour accepter de nouvelles connexions. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Impossibile stabilire la connessione all'endpoint '{0}' entro il timeout assegnato {1}. Probabilmente il server ha raggiunto la quota MaxConnections ed è troppo occupato per accettare nuove connessioni. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {1} 内にエンドポイント '{0}' に接続できません。サーバーが MaxConnections のクォータに達し、ビジー状態のため新しい接続を受け入れられない可能性があります。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한 {1} 이내에 끝점 '{0}'에 연결할 수 없습니다. 서버가 MaxConnections 할당량에 도달하여 새 연결을 수락하기에 사용량이 너무 많은 것 같습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Nie udało się nawiązać połączenia z punktem końcowym „{0}” w przydzielonym limicie czasu {1}. Prawdopodobnie serwer osiągnął limit przydziału dla elementu MaxConnections i jest zbyt zajęty, aby akceptować nowe połączenia. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: Não é possível conectar-se ao ponto de extremidade '{0}' dentro do tempo limite determinado de {1}. É provável que o servidor tenha atingido sua cota de MaxConnections e esteja muito ocupado para aceitar novas conexões. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
ru: Не удается подключиться к конечной точке "{0}" в течение выделенного времени ожидания {1}. Возможно, на сервере исчерпана квота MaxConnections и он слишком занят, чтобы принять новые подключения. Время, назначенное для выполнения этой операции, может быть составной частью более длинного тайм-аута.
tr: '{0}' bitiş noktasına ayrılan zaman aşımı süresi ({1}) içinde bağlanılamıyor. Sunucu büyük olasılıkla MaxConnections kotasına ulaştı ve yeni bağlantı kabul etmek için çok meşgul durumda. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 无法在分配的超时 {1} 内连接到终结点“{0}”。服务器可能已达到 MaxConnections 配额，因为太忙而不能接受新连接。分配给此操作的时间可能比超时长。
zh_hant: 無法在分配的逾時 {1} 內連線至端點 '{0}'。伺服器可能已達 MaxConnections 配額且過於忙碌，無法接受新連線。分配給此作業的時間可能是較長逾時的一部分。

# PipeConnectionAbortedReadTimedOut
source: The pipe connection was aborted because an asynchronous read from the pipe did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Připojení kanálu bylo přerušeno, protože asynchronní čtení z kanálu nebylo dokončeno v přiděleném časovém limitu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die Pipeverbindung wurde abgebrochen, da ein asynchroner Lesevorgang von der Pipe nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen wurde. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La conexión de canalización se anuló porque una lectura asincrónica de la canalización no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La connexion du canal a été abandonnée car une lecture asynchrone du canal ne s'est pas terminée dans le délai d'attente alloué de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Connessione pipe interrotta. Un'operazione di lettura asincrona dalla pipe non è stata completata entro il timeout assegnato di {0}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内にパイプからの非同期読み取りが完了しなかったため、パイプ接続は中止されました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한 {0} 이내에 파이프에서 비동기 읽기가 완료되지 않았기 때문에 파이프 연결이 중단되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Połączenie z potokiem zostało przerwane, ponieważ asynchroniczny odczyt z potoku nie zakończył się w przydzielonym limicie czasu {0}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A conexão do pipe foi anulada porque uma leitura assíncrona a partir desse pipe não foi concluída dentro do tempo limite determinado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
ru: Подключение по каналу прервано, так как асинхронное чтение из канала не завершилось в течение указанного времени ожидания {0}. Время, назначенное для выполнения этой операции, может быть составной частью более длинного тайм-аута.
tr: Zaman uyumsuz bir kanal okuması ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadığı için kanal bağlantısı iptal edildi. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 管道连接被中止，因为在分配的超时 {0} 内管道的异步读取未完成。分配给此操作的时间可能比超时长。
zh_hant: 未在分配的逾時 {0} 內完成非同步讀取管道，因此管道連線中止。分配給此作業的時間可能是較長逾時的一部分。

# PipeConnectionAbortedWriteTimedOut
source: The pipe connection was aborted because an asynchronous write to the pipe did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Připojení kanálu bylo přerušeno, protože asynchronní zápis do kanálu nebyl dokončen v přiděleném časovém limitu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Die Pipeverbindung wurde abgebrochen, da ein asynchroner Schreibvorgang in die Pipe nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen wurde. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La conexión de canalización se anuló porque una escritura asincrónica en la canalización no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: La connexion du canal a été abandonnée car une écriture asynchrone sur le canal ne s'est pas terminée dans le délai d'attente alloué de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Connessione pipe interrotta. Un'operazione di scrittura asincrona sulla pipe non è stata completata entro il timeout assegnato di {0}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間 {0} 内にパイプへの非同期書き込みが完了しなかったため、パイプ接続は中止されました。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한 {0} 이내에 파이프에 비동기 쓰기가 완료되지 않았기 때문에 파이프 연결이 중단되었습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Połączenie z potokiem zostało przerwane, ponieważ asynchroniczny zapis do potoku nie zakończył się w przydzielonym limicie czasu {0}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A conexão do pipe foi anulada porque uma gravação assíncrona nesse pipe não foi concluída dentro do tempo limite determinado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
ru: Подключение по каналу прервано, так как асинхронная запись в канал не завершилось в течение указанного времени ожидания {0}. Время, назначенное для выполнения этой операции, может быть составной частью более длинного тайм-аута.
tr: Zaman uyumsuz bir kanal yazması ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadığı için kanal bağlantısı iptal edildi. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 管道连接被中止，因为在分配的超时 {0} 内管道的异步写入未完成。分配给此操作的时间可能比超时长。
zh_hant: 未在分配的逾時 {0} 內完成非同步寫入管道，因此管道連線中止。分配給此作業的時間可能是較長逾時的一部分。

# PipeEndpointNotFound
source: The pipe endpoint '{0}' could not be found on your local machine.
cs: Koncový bod kanálu {0} nebylo možné v tomto místním počítači nalézt.
de: Der Pipe-Endpunkt „{0}“ wurde nicht auf dem lokalen Computer gefunden.
es: No se encontró el extremo de canalización '{0}' en el equipo local.
fr: Le point de terminaison du canal '{0}' est introuvable sur la machine locale.
it: Non è stato possibile trovare l'endpoint di pipe '{0}' nel computer locale.
ja: パイプ エンドポイント '{0}' が、ローカル コンピューター上で見つかりませんでした。
ko: 파이프 엔드포인트 '{0}'을(를) 로컬 컴퓨터에서 찾을 수 없습니다.
pl: Nie można odnaleźć punktu końcowego potoku „{0}” na maszynie lokalnej.
pt_br: O ponto final do canal '{0}' não foi encontrado em seu computador local.
ru: Не удалось найти конечную точку канала "{0}" на локальном компьютере.
tr: '{0}' kanal uç noktası yerel makinenizde bulunamadı.
zh_hans: 在本地计算机上找不到管道终结点“{0}”。
zh_hant: 在本機電腦上找不到管道端點 '{0}'。
