Repository: dotnet/wcf
Catalog: src/System.ServiceModel.NetNamedPipe/src/Resources/xlf/strings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# PipeModeChangeFailed
source: The pipe was not able to be set to message mode: {0}
cs: Nebylo možné nastavit kanál na režim zprávy: {0}
de: Die Pipe konnte nicht auf den Nachrichtenmodus festgelegt werden: {0}
es: No se pudo establecer la canalización en el modo de mensaje: {0}
fr: Le canal n'a pas pu être défini sur le mode de message : {0}
it: Impossibile impostare la pipe in modalità messaggio: {0}
ja: パイプをメッセージ モード {0} に設定できませんでした。
ko: 파이프를 메시지 모드로 설정할 수 없습니다. {0}
pl: Nie można ustawić trybu komunikatu dla potoku: {0}
pt_br: O pipe não pôde ser definido para o modo de mensagem: {0}
ru: Не удалось перевести канал в состояние сообщения: {0}
tr: Kanal ileti moduna ayarlanamadı: {0}
zh_hans: 不能将管道设置为消息模式: {0}
zh_hant: 無法將管道設為訊息模式: {0}

# PipeNameCanNotBeAccessed
source: The pipe name could not be obtained for the pipe URI: {0}
cs: Nebylo možné získat název kanálu pro identifikátor URI kanálu: {0}
de: Der Pipename konnte für den Pipe-URI nicht abgerufen werden: {0}
es: No se pudo obtener el nombre de la canalización para el URI de canalización: {0}
fr: Impossible d'obtenir le nom du canal pour l'URI de canal : {0}
it: Impossibile ottenere il nome di pipe per l'URI di pipe: {0}
ja: 次のパイプ URI のパイプ名を取得できませんでした: {0}
ko: 파이프 URI에 대한 파이프 이름을 가져올 수 없습니다. {0}
pl: Nie można uzyskać nazwy potoku dla identyfikatora URI potoku: {0}
pt_br: O nome do pipe não pode ser obtido para o URI de pipe: {0}
ru: Для URI канала не удалось получить имя канала: {0}
tr: Kanal adı, kanal URI için alınamadı: {0}
zh_hans: 无法获取管道 URI 的管道名称: {0}。
zh_hant: 無法取得管道 URI 的管道名稱: {0}

# PipeNameCanNotBeAccessed2
source: The pipe name could not be obtained for {0}.
cs: Nebylo možné získat název kanálu pro {0}.
de: Der Pipename konnte für "{0}" nicht abgerufen werden.
es: No se pudo obtener el nombre de la canalización para {0}.
fr: Impossible d'obtenir le nom du canal pour {0}.
it: Impossibile ottenere il nome di pipe per {0}.
ja: {0} 用のパイプ名を取得できませんでした。
ko: {0}에 대한 파이프 이름을 가져올 수 없습니다.
pl: Nie można uzyskać nazwy potoku dla elementu {0}.
pt_br: O nome do pipe não pôde ser obtido para {0}.
ru: Не удалось получить имя канала для {0}.
tr: {0} için kanal adı alınamadı.
zh_hans: 无法获取 {0} 的管道名称。
zh_hant: 無法取得 {0} 的管道名稱。

# PipeReadPending
source: There is already a read in progress for the pipe. Wait for the first operation to complete before attempting to read again.
cs: U tohoto kanálu již probíhá čtení. Než budete opakovat pokus o čtení, počkejte na dokončení první operace.
de: Es läuft bereits ein Lesevorgang für die Pipe. Warten Sie, bis der erste Vorgang abgeschlossen ist, bevor der Lesevorgang wiederholt wird.
es: Ya hay una lectura en curso para la canalización. Espere a que se complete la primera operación antes de intentar leer de nuevo.
fr: Il existe déjà une lecture en cours pour le canal. Attendez que la première opération se termine avant de tenter à nouveau une lecture.
it: Operazione di lettura già in corso per la pipe. Attendere il completamento della prima operazione prima di tentare nuovamente la lettura.
ja: このパイプでは別の読み取り操作を既に実行中です。最初の操作が完了してから読み取りを再試行してください。
ko: 파이프에 대한 읽기가 이미 진행 중입니다. 읽기를 다시 시도하기 전에 첫 번째 작업이 완료할 때까지 기다리십시오.
pl: Trwa operacja odczytu z potoku. Przed ponowieniem próby odczytu poczekaj na zakończenie pierwszej operacji.
pt_br: Já existe uma leitura em andamento para o pipe. Aguarde a conclusão da primeira operação antes de tentar fazer uma nova leitura.
ru: Чтение из канала уже выполняется. Перед повторной попыткой чтения дождитесь завершения первой операции.
tr: Kanalda zaten bir okuma işlemi sürüyor. Yeniden okumayı denemeden önce ilk işlemin tamamlanmasını bekleyin.
zh_hans: 已经存在一个正在进行的管道读取操作。再次尝试读取前，请等待第一个操作完成。
zh_hant: 管道已有進行中的讀取作業。請等待第一項作業完成後，再嘗試讀取。

# PipeShutdownReadError
source: The shutdown indicator was not received from the pipe. The application on the other end of the pipe may not have sent it. The pipe will still be closed.
cs: Z kanálu nebyl přijat indikátor vypnutí. Aplikace na druhém konci kanálu jej pravděpodobně neodeslala. Kanál bude stále uzavřen.
de: Der Indikator zum Herunterfahren wurde nicht von der Pipe empfangen. Möglicherweise hat die Anwendung am anderen Ende der Pipe den Indikator nicht gesendet. Die Pipe wird dennoch geschlossen.
es: No se recibió el indicador de apagado de la canalización. Es posible que la aplicación del otro extremo de la canalización no lo haya enviado. La canalización se cerrará de todas formas.
fr: L'indicateur d'arrêt n'a pas été reçu par le canal. L'application à l'autre extrémité du canal peut ne pas l'avoir envoyé. Le canal sera néanmoins fermé.
it: Indicatore di arresto non ricevuto dalla pipe. Potrebbe non essere stato inviato dall'applicazione dall'altra parte della pipe. La pipe verrà comunque chiusa.
ja: パイプから shutdown インジケーターを受信できませんでした。パイプの反対側のアプリケーションがこのインジケーターを送信していない可能性があります。この場合でもパイプは閉じられます。
ko: 종료 표시기가 파이프에서 수신되지 않았습니다. 파이프의 다른 끝에 있는 응용 프로그램이 종료 표시기를 보내지 않았을 수 있습니다. 파이프가 계속 닫혀 있습니다.
pl: Nie otrzymano sygnału zamknięcia z potoku. Być może aplikacja po drugiej stronie potoku nie wysłała go. Potok pozostanie zamknięty.
pt_br: O indicador de desligamento não foi recebido a partir do pipe. O aplicativo na outra extremidade do pipe talvez não o tenha enviado. O pipe ainda será fechado.
ru: Индикатор отключения канала не был получен из канала. Возможно, он не был отправлен приложением на другом конце канала. Несмотря на это, канал будет закрыт.
tr: Kanaldan kapatma göstergesi alınamadı. Kanalın diğer ucundaki uygulama, bunu göndermemiş olabilir. Kanal yine de kapatılacak.
zh_hans: 没有从管道接收到关机指示符。位于管道另一端上的应用程序可能没有发送它。管道仍将被关闭。
zh_hant: 未從管道收到關閉指示器。管道另一端的應用程式可能未傳送。管道仍將關閉。

# PipeShutdownWriteError
source: The shutdown indicator could not be written to the pipe. The application on the other end of the pipe may not be listening for it. The pipe will still be closed.
cs: Indikátor vypnutí nelze zapsat do kanálu.. Aplikace na druhém konci kanálu jej pravděpodobně neposlouchá. Kanál bude stále uzavřen.
de: Der Indikator zum Herunterfahren konnte nicht in die Pipe geschrieben werden. Möglicherweise hat die Anwendung am anderen Ende der Pipe nicht für den Indikator gelauscht. Die Pipe wird dennoch geschlossen.
es: No se pudo escribir el indicador de apagado en la canalización. Es posible que la aplicación del otro extremo de la canalización no esté escuchando. La canalización se cerrará de todas formas.
fr: L'indicateur d'arrêt n'a pas pu être écrit sur le canal. L'application à l'autre extrémité du canal peut ne pas être à l'écoute de celui-ci. Le canal sera néanmoins fermé.
it: Impossibile scrivere l'indicatore di arresto sulla pipe. L'applicazione dall'altra parte della pipe potrebbe non essere in ascolto. La pipe verrà comunque chiusa.
ja: パイプに shutdown インジケーターを書き込めませんでした。パイプの反対側のアプリケーションがこのインジケーターをリッスンしていない可能性があります。この場合でもパイプは閉じられます。
ko: 종료 표시기를 파이프에 쓸 수 없습니다. 파이프의 다른 끝에 있는 응용 프로그램이 종료 표시기를 수신 대기하는 중이 아닐 수 있습니다. 파이프가 계속 닫혀 있습니다.
pl: Nie można zapisać do potoku sygnału zamknięcia. Być może aplikacja po drugiej stronie potoku nie nasłuchuje tego sygnału. Potok pozostanie zamknięty.
pt_br: Não foi possível gravar o indicador de desligamento no pipe. O aplicativo na outra extremidade do pipe talvez não o esteja escutando. O pipe ainda será fechado.
ru: Не удалось записать в канал индикатор отключения канала. Возможно, приложение на другом конце канала не прослушивает его. Несмотря на это, канал будет закрыт.
tr: Kapatma göstergesi kanala yazılamadı. Kanalın diğer ucundaki uygulama, bunu dinlemiyor olabilir. Kanal yine de kapatılacak.
zh_hans: 无法将关闭指示器写入管道。管道另一端上的应用程序可能未对其进行侦听。管道仍将关闭。
zh_hant: 關閉指示器無法寫入管道。管道另一端的應用程式可能未接聽。管道仍將關閉。

# PipeSignalExpected
source: The read from the pipe expected just a signal, but received actual data.
cs: Čtení z kanálu očekávalo pouze signál, ale přijalo skutečná data.
de: Der Lesevorgang aus der Pipe hat nur ein Signal erwartet, es wurden jedoch aktuelle Daten empfangen.
es: La lectura de la canalización sólo esperaba una señal, pero recibió datos reales.
fr: La lecture du canal attendait seulement un signal, mais elle reçu des données réelles.
it: La lettura dalla pipe prevedeva solo un segnale, ma ha ricevuto dati effettivi.
ja: 信号のみがパイプから読み取られる予定でしたが、実際のデータを受け取りました。
ko: 파이프에서 읽기에 단지 신호가 필요하지만 실제 데이터를 수신했습니다.
pl: Podczas odczytu potoku oczekiwano tylko sygnału, a otrzymano rzeczywiste dane.
pt_br: A leitura a partir do pipe esperava apenas um sinal, mas recebeu dados reais.
ru: Во время чтения из канала ожидался сигнал, однако были получены реальные данные.
tr: Kanal okuması yalnızca bir sinyal bekliyor olabilir, ancak gerçek veriler aldı.
zh_hans: 应仅从管道读取信号，但收到实际数据。
zh_hant: 讀取管道時僅預期收到訊號，但卻收到實際資料。

# PipeUriSchemeWrong
source: URIs used with pipes must use the scheme: 'net.pipe'.
cs: Identifikátory URI používané u kanálů musejí používat schéma: net.pipe.
de: Für Pipes verwendete URIs müssen dieses Schema verwenden: "net.pipe".
es: Los URI usados con las canalizaciones deben usar el esquema 'net.pipe'.
fr: Les URI utilisés avec des canaux doivent utiliser le modèle 'net.pipe'.
it: Gli URI utilizzato con le pipe devono utilizzare lo schema: 'net.pipe'.
ja: パイプに使用する URI は、'net.pipe' スキーマを使用する必要があります。
ko: 파이프와 함께 사용되는 URI는 'net.pipe' 구성표를 사용해야 합니다.
pl: W identyfikatorach URI używanych w potokach musi być stosowany schemat: „net.pipe”.
pt_br: URIs usados com pipes devem usar o esquema: 'net.pipe'.
ru: Идентификаторы URI, использованные вместе с каналами, должны использовать схему: "net.pipe".
tr: Kanallarla kullanılan URI değerlerinin kullanması gereken düzen: 'net.pipe'.
zh_hans: 与管道一起使用的 URI 必须使用方案: "net.pipe"。
zh_hant: 用於管道的 URI 必須使用配置: 'net.pipe'。

# PipeWritePending
source: There is already a write in progress for the pipe. Wait for the first operation to complete before attempting to write again.
cs: U tohoto kanálu již probíhá zápis. Než budete opakovat pokus o zápis, počkejte na dokončení první operace.
de: Es läuft bereits ein Schreibvorgang für die Pipe. Warten Sie, bis der erste Vorgang abgeschlossen ist, bevor der Schreibvorgang wiederholt wird.
es: Ya hay una escritura en curso para la canalización. Espere a que se complete la operación antes de intentar escribir de nuevo.
fr: Il existe déjà une écriture en cours pour le canal. Attendez que la première opération se termine avant de tenter à nouveau une écriture.
it: Scrittura già in corso per la pipe. Attendere il completamento della prima operazione prima di tentare nuovamente la scrittura.
ja: このパイプでは別の書き込み操作を既に実行中です。最初の操作が完了してから書き込みを再試行してください。
ko: 파이프에 대한 쓰기가 이미 진행 중입니다. 쓰기를 다시 시도하기 전에 첫 번째 작업이 완료될 때까지 기다리십시오.
pl: Trwa operacja zapisu dla tego potoku. Przed ponowieniem próby zapisu poczekaj na zakończenie pierwszej operacji.
pt_br: Já existe uma gravação em andamento para o pipe. Aguarde a conclusão da primeira operação antes de tentar fazer uma nova gravação.
ru: Запись в канал уже выполняется. Перед повторной попыткой записи дождитесь завершения первой операции.
tr: Kanalda zaten bir yazma işlemi sürüyor. Yeniden yazmayı denemeden önce ilk işlemin tamamlanmasını bekleyin.
zh_hans: 已经正在对管道进行写入。尝试再次写入之前，请等待第一个操作完成。
zh_hant: 管道已有進行中的寫入作業。請等待第一項作業完成後，再嘗試寫入。

# PipeWriteTimedOut
source: The write to the pipe did not complete within the allotted timeout of {0}. The time allotted to this operation may have been a portion of a longer timeout.
cs: Zápis do kanálu nebyl dokončen v přiděleném časovém limitu {0}. Čas přidělený této operaci byl pravděpodobně částí delšího časového limitu.
de: Das Schreiben in die Pipe wurde nicht innerhalb des zugewiesenen Zeitlimits von {0} abgeschlossen. Der für diesen Vorgang zugewiesene Zeitraum war möglicherweise ein Teil eines längeren Timeouts.
es: La escritura en la canalización no se completó en el tiempo de espera asignado de {0}. El tiempo asignado a esta operación puede haber sido una parte de un tiempo de espera mayor.
fr: L'écriture sur le canal ne s'est pas terminée dans le délai d'attente alloué de {0}. Le temps alloué à cette opération fait peut-être partie d'un délai d'attente plus long.
it: Scrittura sulla pipe non completata entro il timeout assegnato di {0}. È possibile che la durata consentita per l'operazione fosse una porzione di un timeout più lungo.
ja: 割り当てられたタイムアウト時間である {0} 内にパイプへの書き込みが完了しませんでした。この操作に割り当てられた時間は、より長いタイムアウト時間の一部であった可能性があります。
ko: 할당된 시간 제한 {0} 이내에 파이프에 쓰기가 완료되지 않았습니다. 이 작업에 할당된 시간이 보다 긴 시간 제한의 일부일 수 있습니다.
pl: Operacja zapisu do potoku nie została zakończona w przydzielonym limicie czasu {0}. Czas przydzielony tej operacji mógł być częścią dłuższego limitu czasu.
pt_br: A gravação no pipe não foi concluída dentro do tempo limite determinado de {0}. O tempo alocado para essa operação pode ter sido uma parte de um tempo limite maior.
ru: Запись в канал не завершилась в течение указанного времени ожидания: {0}. Время, назначенное для выполнения этой операции, может быть составной частью более длинного тайм-аута.
tr: Kanala yazma, ayrılan zaman aşımı süresi ({0}) içinde tamamlanmadı. Bu işlem için ayrılan süre daha uzun bir zaman aşımı değerinin bir bölümü olabilir.
zh_hans: 在分配的 {0} 超时内未完成对管道的写入。分配给此操作的时间可能已经是更长超时的一部分。
zh_hant: 未在分配的逾時 {0} 內完成寫入管道。分配給此作業的時間可能是較長逾時的一部分。

# PlatformNotSupported_NetNamedPipe
source: NetNamedPipe is not supported on this platform.
cs: NetNamedPipe se na této platformě nepodporuje.
de: „NetNamedPipe“ wird auf dieser Plattform nicht unterstützt.
es: La propiedad NetNamedPipe no se admite en esta plataforma.
fr: NetNamedPipe n’est pas pris en charge sur cette plateforme
it: NetNamedPipe non è supportato in questa piattaforma.
ja: NetNamedPipe はこのプラットフォームではサポートされていません。
ko: 이 플랫폼에서는 NetNamedPipe가 지원되지 않습니다.
pl: Program NetNamedPipe nie jest obsługiwany na tej platformie.
pt_br: Não há suporte para NetNamedPipe nesta plataforma.
ru: NetNamedPipe не поддерживается на этой платформе.
tr: NetNamedPipe bu platformda desteklenmiyor.
zh_hans: 此平台不支持 NetNamedPipe。
zh_hant: NetNamedPipe 此平台上不受支援。

# SFxTimeoutOutOfRange0
source: Timeout must be greater than or equal to TimeSpan.Zero. To disable timeout, specify TimeSpan.MaxValue.
cs: Časový limit musí být větší než nula nebo se rovnat hodnotě TimeSpan.Zero. Pokud chcete časový limit zakázat, zadejte hodnotu TimeSpan.MaxValue.
de: Das Zeitlimit muss größer oder gleich TimeSpan.Zero sein. Geben Sie den TimeSpan.MaxValue an, um das Zeitlimit zu deaktivieren.
es: El tiempo de espera debe ser mayor o igual que TimeSpan.Zero. Para deshabilitar el tiempo de espera, especifique TimeSpan.MaxValue.
fr: Le délai d'expiration doit être supérieur ou égal à TimeSpan.Zero. Pour désactiver le délai d'expiration, spécifiez TimeSpan.MaxValue.
it: Il valore del timeout deve essere maggiore o uguale a TimeSpan.Zero. Per disabilitare il timeout, specificare TimeSpan.MaxValue.
ja: タイムアウトは TimeSpan.Zero 以上の値にする必要があります。タイムアウトを無効にするには、TimeSpan.MaxValue を指定してください。
ko: 제한 시간은 TimeSpan.Zero보다 크거나 같아야 합니다. 제한 시간을 사용하지 않도록 설정하려면 TimeSpan.MaxValue를 지정하세요.
pl: Limit czasu musi być większy lub równy wartości TimeSpan.Zero. Aby wyłączyć limit czasu, określ wartość TimeSpan.MaxValue.
pt_br: O tempo limite deve ser maior ou igual a TimeSpan.Zero. Para desabilitar o tempo limite, especifique TimeSpan.MaxValue.
ru: Время ожидания должно быть не менее TimeSpan.Zero. Чтобы отключить время ожидания, укажите TimeSpan.MaxValue.
tr: Zaman aşımı değeri, TimeSpan.Zero değerinden büyük ya da ona eşit olmalıdır. Zaman aşımını devre dışı bırakmak için TimeSpan.MaxValue değeri belirtin.
zh_hans: 超时必须大于或等于 TimeSpan.Zero。要禁用超时，请指定 TimeSpan.MaxValue。
zh_hant: Timeout 必須大於或等於 TimeSpan.Zero。若要停用逾時，請指定 TimeSpan.MaxValue。

# SFxTimeoutOutOfRangeTooBig
source: Timeouts larger than Int32.MaxValue TotalMilliseconds (approximately 24 days) cannot be honored. To disable timeout, specify TimeSpan.MaxValue.
cs: Časový limit větší než hodnota Int32.MaxValue TotalMilliseconds (přibližně 24 dní) nelze akceptovat. Pokud chcete časový limit zakázat, zadejte hodnotu TimeSpan.MaxValue.
de: Zeitlimits, die größer als Int32.MaxValue TotalMilliseconds (ca. 24 Tage) sind, können nicht akzeptiert werden. Geben Sie den TimeSpan.MaxValue an, um das Zeitlimit zu deaktivieren.
es: No se pueden aceptar valores de tiempo de espera mayores que Int32.MaxValue TotalMilliseconds (aproximadamente 24 días). Para deshabilitar el tiempo de espera, especifique TimeSpan.MaxValue.
fr: Les délais d'expiration supérieurs à Int32.MaxValue TotalMilliseconds (soit environ 24 jours) ne peuvent pas être appliqués. Pour désactiver le délai d'expiration, spécifiez TimeSpan.MaxValue.
it: Non è possibile rispettare i timeout in cui il valore di TotalMilliseconds è maggiore di Int32.MaxValue (circa 24 giorni). Per disabilitare il timeout, specificare TimeSpan.MaxValue.
ja: Int32.MaxValue TotalMilliseconds (約 24 日) よりも大きな値のタイムアウトは受け付けられません。タイムアウトを無効にするには、TimeSpan.MaxValue を指定してください。
ko: Int32.MaxValue TotalMilliseconds(약 24일)보다 큰 시간 제한은 허용되지 않습니다. 시간 제한을 사용하지 않으려면 TimeSpan.MaxValue를 지정하세요.
pl: Limity czasu większe niż Int32.MaxValue TotalMilliseconds (około 24 dni) nie mogą być uwzględniane. Aby wyłączyć limit czasu, określ wartość TimeSpan.MaxValue.
pt_br: Os tempos limites maiores que Int32.MaxValue TotalMilliseconds (aproximadamente 24 dias) não podem ser honrados. Para desabilitar o tempo limite, especifique TimeSpan.MaxValue.
ru: Время ожидания, превышающее Int32.MaxValue TotalMilliseconds (приблизительно 24 дня), не учитывается. Чтобы отключить время ожидания, укажите TimeSpan.MaxValue.
tr: Int32.MaxValue TotalMilliseconds (yaklaşık 24 gün) değerinden büyük zaman aşımı değerleri dikkate alınmaz. Zaman aşımını devre dışı bırakmak için TimeSpan.MaxValue değeri belirtin.
zh_hans: 无法处理大于 Int32.MaxValue TotalMilliseconds (大约 24 天)的超时。要禁用超时，请指定 TimeSpan.MaxValue。
zh_hant: 無法遵循大於 Int32.MaxValue TotalMilliseconds (大約等於 24 天) 的逾時。若要停用逾時，請指定 TimeSpan.MaxValue。

# TraceCodeFailedPipeConnect
source: An attempt to connect to the named pipe endpoint at '{1}' failed. Another attempt will be made with {0} remaining in the overall timeout.
cs: Pokus o připojení ke koncovému bodu pojmenovaného kanálu na {1} se nezdařil. Bude proveden další pokus s celkovým časovým limitem {0}.
de: Fehler beim Versuch, eine Verbindung mit dem Named Pipe-Endpunkt "{1}" herzustellen. Es wird ein weiterer Versuch unternommen. Im Gesamtzeitlimit verbleiben {0}.
es: Error al intentar conectar al extremo de canalización con nombre en '{1}'. Se realizará otro intento con {0} de tiempo de espera global restante.
fr: Une tentative de connexion au point de terminaison du canal nommé à '{1}' a échoué. Une autre tentative sera effectuée avec {0} restants dans le délai d'attente globale.
it: Tentativo di connessione all'endpoint della named pipe su '{1}' non riuscito. Verrà effettuato un altro tentativo con {0} rimanenti nel timeout complessivo.
ja: '{1}' の名前付きパイプ エンドポイントに接続しようとして失敗しました。合計タイムアウト時間の残りの {0} で再試行します。
ko: '{1}'의 명명된 파이프 끝점에 연결할 수 없습니다. 전체 시간 제한에서 남아 있는 {0} 동안 다시 시도됩니다.
pl: Próba połączenia się z punktem końcowym nazwanego potoku na „{1}” nie powiodła się. Zostanie podjęta kolejna próba z {0} pozostałych w ogólnym limicie czasu.
pt_br: Falha de uma tentativa de conectar ao ponto de extremidade de pipe nomeado em '{1}'. Outra tentativa será feita com {0} restante no tempo limite geral.
ru: Ошибка при попытке подключения к конечной точке "{1}" именованного канала. Следующая попытка будет выполнена при остатке {0} от общего тайм-аута.
tr: '{1}' konumunda adlandırılan kanal bitiş noktasına bağlanma denemesi başarısız oldu. Genel zaman aşımında {0} kaldığında başka bir deneme yapılacak.
zh_hans: 尝试连接到位于“{1}”的已命名管道终结点失败。总计超时剩余{0}时，将再次进行尝试。
zh_hant: 嘗試在 '{1}' 連接到具名管道端點已失敗。在整體逾時之前還可以嘗試 {0} 次。

# TraceCodeInitiatingNamedPipeConnection
source: Initiating Named Pipe connection.
cs: Inicializace připojení pojmenovaného kanálu.
de: Eine Named Pipe-Verbindung wird eingeleitet.
es: Se está iniciando una conexión de canalización con nombre.
fr: Lancement de la connexion de canal nommé.
it: Avvio connessione named pipe.
ja: 名前付きパイプ接続を初期化しています。
ko: 명명된 파이프 연결을 시작하는 중입니다.
pl: Inicjowanie połączenia nazwanego potoku.
pt_br: Iniciando conexão Pipe Nomeado.
ru: Инициализация подключения именованного канала.
tr: Named Pipe bağlantısı başlatılıyor.
zh_hans: 正在初始化命名管道连接。
zh_hant: 正在初始化具名管道連線。

# TraceCodePipeConnectionAbort
source: PipeConnection aborted
cs: Připojení PipeConnection se přerušilo
de: „PipeConnection“ abgebrochen
es: Se anuló PipeConnection
fr: PipeConnection abandonné
it: PipeConnection interrotta
ja: PipeConnection が中止されました
ko: PipeConnection이 중단됨
pl: Przerwano połączenie potokowe
pt_br: PipeConnection anulado
ru: Прервано подключение PipeConnection
tr: PipeConnection iptal edildi
zh_hans: PipeConnection 已中止
zh_hant: PipeConnection 已中止

# ValueMustBeNonNegative
source: The value of this argument must be non-negative.
cs: Hodnota tohoto argumentu nesmí být záporná.
de: Der Wert dieses Arguments darf keine negative Zahl sein.
es: El valor de este argumento no puede ser negativo.
fr: La valeur de cet argument doit être non négative.
it: Il valore di questo argomento non deve essere negativo.
ja: この引数の値は、負ではない値である必要があります。
ko: 이 인수의 값은 음수가 아니어야 합니다.
pl: Wartość tego argumentu nie może być ujemna.
pt_br: O valor deste argumento não deve ser negativo.
ru: Значение этого аргумента должно быть неотрицательным.
tr: Bu bağımsız değişkenin değeri negatif olmamalıdır.
zh_hans: 此参数的值必须为非负。
zh_hant: 此引數的值必須是非負數。
