Repository: dotnet/wcf
Catalog: src/dotnet-svcutil/lib/src/Metadata/xlf/MetadataResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# EnableMetadataHelpMessage
source: If this is a Windows (R) Communication Foundation service to which you have access, please check that you have enabled metadata publishing at the specified address. For help enabling metadata publishing, please refer to the MSDN documentation at http://go.microsoft.com/fwlink/?LinkId=65455.
cs: Pokud je toto služba Windows (R) Communication Foundation, ke které máte přístup, zkontrolujte prosím, jestli jste povolili publikování metadat na zadané adrese. Nápovědu pro povolení publikování metadat najdete v dokumentaci MSDN na http://go.microsoft.com/fwlink/?LinkId=65455.
de: Wenn es sich hierbei um einen Windows (R) Communication Foundation-Dienst handelt, auf den Sie Zugriff haben, prüfen Sie, ob die Metadatenveröffentlichung für die angegebene Adresse aktiviert ist. Informationen zum Aktivieren der Metadatenveröffentlichung finden Sie in der MSDN-Dokumentation unter http://go.microsoft.com/fwlink/?LinkId=65455.
es: Si este es un servicio de Windows (R) Communication Foundation al que tiene acceso, compruebe que ha habilitado la publicación de metadatos en la dirección especificada. Para obtener ayuda acerca de cómo habilitar la publicación de metadatos, consulte la documentación de MSDN en http://go.microsoft.com/fwlink/?LinkId=65455.
fr: S'il s'agit d'un service Windows (R) Communication Foundation auquel vous avez accès, vérifiez que vous avez activé la publication des métadonnées à l'adresse spécifiée. Pour obtenir de l'aide sur l'activation de la publication des métadonnées, consultez la documentation MSDN à l'adresse http://go.microsoft.com/fwlink/?LinkId=65455.
it: Se si tratta di un servizio di Windows (R) Communication Foundation a cui si ha accesso, verificare che sia abilitata la pubblicazione dei metadati all'indirizzo specificato. Per informazioni sull'abilitazione della pubblicazione dei metadati, vedere la documentazione MSDN disponibile all'indirizzo http://go.microsoft.com/fwlink/?LinkId=65455.
ja: これがアクセス権のある Windows (R) Communication Foundation サービスである場合、指定したアドレスでメタデータの公開が有効になっていることを確認してください。メタデータ公開の有効化のヘルプについては、MSDN ドキュメント (http://go.microsoft.com/fwlink/?LinkId=65455) をご覧ください。
ko: 액세스 권한이 있는 Windows (R) Communication Foundation 서비스일 경우 지정한 주소에서 메타데이터 게시를 사용하도록 설정했는지 확인하세요. 메타데이터 게시 설정에 대한 도움말을 보려면 http://go.microsoft.com/fwlink/?LinkId=65455의 MSDN 설명서를 참조하세요.
pl: Jeśli masz dostęp do usługi Windows (R) Communication Foundation, upewnij się, że włączono publikowanie metadanych pod określonym adresem. Aby uzyskać pomoc dotyczącą publikowania metadanych, zapoznaj się z dokumentacją w sieci MSDN na stronie http://go.microsoft.com/fwlink/?LinkId=65455.
pt_br: Se esse for um serviço do Windows (R) Communication Foundation ao qual você tem acesso, verifique se você habilitou publicação de metadados no endereço especificado. Para obter ajuda para habilitar publicação de metadados, consulte a documentação MSDN em http://go.microsoft.com/fwlink/?LinkId=65455.
ru: Если у вас есть доступ к службе Windows (R) Communication Foundation, убедитесь, что включена публикация метаданных по указанному адресу. Справочные сведения по включению публикации метаданных см. в документации MSDN по адресу http://go.microsoft.com/fwlink/?LinkId=65455.
tr: Bu hizmet, erişim iznine sahip olduğunuz bir Windows (R) Communication Foundation hizmetiyse lütfen belirtilen adreste meta veri yayımlamayı etkinleştirdiğinizden emin olun. Meta veri yayımlamayı etkinleştirme konusunda yardım almak için http://go.microsoft.com/fwlink/?LinkId=65455 adresindeki MSDN belgelerine başvurun.
zh_hans: 如果这是你有权访问的 Windows (R) Communication Foundation 服务，请检查是否已启用在指定地址发布元数据。有关启用元数据发布的帮助，请参阅 http://go.microsoft.com/fwlink/?LinkId=65455 上的 MSDN 文档。
zh_hant: 若這是您具有存取權的 Windows (R) Communication Foundation 服務，請檢查您是否已在指定的位址啟用中繼資料發佈。如需啟用中繼資料發佈的說明，請參閱 MSDN 文件，網址是 http://go.microsoft.com/fwlink/?LinkId=65455。

# ErrCannotCreateAMetadataExchangeClientFormat
source: Cannot obtain Metadata from {0}. The URI scheme '{1}' is not supported by default.
cs: Nejde získat metadata z {0}. Schéma URI {1} není standardně podporované.
de: Es können keine Metadaten von {0} abgerufen werden. Das URI-Schema "{1}" wird nicht standardmäßig unterstützt.
es: No se pueden obtener metadatos de {0}. El esquema del identificador URI "{1}" no se admite de manera predeterminada.
fr: Impossible de récupérer les métadonnées de {0}. Le schéma URI '{1}' n'est pas pris en charge par défaut.
it: Non è possibile ottenere i metadati da {0}. Lo schema URI '{1}' non è supportato per impostazione predefinita.
ja: {0} からメタデータを取得できません。既定では、URI スキーム '{1}' はサポートされていません。
ko: {0}에서 메타데이터를 가져올 수 없습니다. URI 스키마 '{1}'은(는) 기본적으로 지원되지 않습니다.
pl: Nie można uzyskać metadanych z lokalizacji {0}. Schemat identyfikatora URI „{1}” domyślnie nie jest obsługiwany.
pt_br: Não é possível obter metadados do {0}. O esquema de URI '{1}' não tem suporte por padrão.
ru: Невозможно получить метаданные из {0}. Схема URI "{1}" не поддерживается по умолчанию.
tr: {0} kaynağından Meta Veriler alınamıyor. '{1}' URI düzeni varsayılan olarak desteklenmez.
zh_hans: 无法从 {0} 获取元数据。URI 架构“{1}”默认情况下不受支持。
zh_hant: 無法從 {0} 取得中繼資料。根據預設，不支援 URI 結構描述 '{1}'。

# ErrDirectoryInsteadOfFileFormat
source: The input path '{0}' appears to be a directory. Inputs must be either URLs or file paths.
cs: Zdá se, že vstupní cesta {0} představuje adresář. Vstupy musí být buď adresy URL, nebo cesty k souborům.
de: Der Eingabepfad "{0}" ist offenbar ein Verzeichnis. Als Eingabe können nur URLs oder Dateipfade verwendet werden.
es: La ruta de acceso de entrada "{0}" parece ser un directorio. Las entradas deben ser direcciones URL o rutas de acceso a archivos.
fr: Le chemin d'entrée '{0}' est un répertoire. Les entrées doivent être des URL ou des chemins de fichiers.
it: Il percorso di input '{0}' sembra essere una directory. Gli input devono essere URL o percorsi di file.
ja: 入力パス '{0}' はディレクトリである可能性があります。入力は URL またはファイル パスのいずれかである必要があります。
ko: 입력 경로 '{0}'이(가) 디렉터리입니다. 입력은 URL 또는 파일 경로여야 합니다.
pl: Ścieżka danych wejściowych „{0}” wygląda na katalog. Dane wejściowe muszą być adresami URL albo ścieżkami plików.
pt_br: O caminho de entrada '{0}' parece ser um diretório. As entradas devem ser caminhos de arquivo ou URLs.
ru: Вероятно, входной путь "{0}" является каталогом. Входные данные должны быть URL-адресами или путями к файлам.
tr: '{0}' giriş yolu bir dizin. Girişlerin URL veya dosya yolu olması gerekir.
zh_hans: 输入路径“{0}”似乎是一个目录。输入必须是 URL 或文件路径。
zh_hant: 輸入路徑 '{0}' 似乎是目錄，但輸入必須是 URL 或檔案路徑。

# ErrDirectoryNotFoundFormat
source: The directory '{0}' could not be found. Verify that the directory exists and that you have the appropriate permissions to read it.
cs: Adresář {0} se nepodařilo najít. Ověřte, že existuje a že máte příslušná oprávnění jej číst.
de: Das Verzeichnis "{0}" wurde nicht gefunden. Stellen Sie sicher, dass das Verzeichnis vorhanden ist, und dass Sie über Leseberechtigungen für das Verzeichnis verfügen.
es: No se encuentra el directorio "{0}". Compruebe que el directorio existe y que tiene los permisos apropiados para leerlo.
fr: Le répertoire '{0}' est introuvable. Vérifiez que le répertoire existe et que vous avez les autorisations appropriées pour le lire.
it: Non è stato possibile trovare la directory '{0}'. Verificare che la directory esista e che siano disponibili le autorizzazioni necessarie per leggerla.
ja: ディレクトリ '{0}' が見つかりませんでした。ディレクトリが存在し、ディレクトリを読み取るための適切なアクセス許可があることを確認してください。
ko: '{0}' 디렉터리를 찾을 수 없습니다. 디렉터리가 있는지 확인하고 해당 디렉터리를 읽을 수 있는 권한이 있는지 확인하세요.
pl: Nie można znaleźć katalogu „{0}”. Sprawdź, czy katalog istnieje i czy masz odpowiednie uprawnienia umożliwiające jego odczyt.
pt_br: Não foi possível encontrar o diretório '{0}'. Verifique se o diretório existe e se você tem as permissões apropriadas para lê-lo.
ru: Не удалось найти каталог "{0}". Убедитесь, что он существует и у вас есть соответствующие разрешения на его чтение.
tr: '{0}' dizini bulunamadı. Dizinin mevcut olduğunu ve dizini okumak için uygun izinlere sahip olduğunuzu doğrulayın.
zh_hans: 找不到目录“{0}”。请验证该目录是否存在并且你是否具有相应的读取权限。
zh_hant: 找不到目錄 '{0}'。請確認該目錄存在，且您有適當的權限可讀取該目錄。

# ErrFileAlreadyExistsFormat
source: The file '{0}' already exists.
cs: Soubor {0} už existuje.
de: Die Datei "{0}" ist bereits vorhanden.
es: El archivo {0} ya existe
fr: Le fichier {0} existe déjà
it: Il file '{0}' esiste già.
ja: ファイル '{0}' は既に存在します。
ko: '{0}' 파일이 이미 있습니다.
pl: Plik „{0}” już istnieje.
pt_br: O arquivo {0} já existe.
ru: Файл "{0}" уже существует.
tr: '{0}' dosyası zaten var.
zh_hans: 文件“{0}”已存在。
zh_hant: 檔案 '{0}' 已存在。

# ErrInvalidUriFormat
source: The specified URI '{0}' does not appear to be valid.
cs: Vypadá to, že zadaný identifikátor URI {0} není platný.
de: Der angegebene URI "{0}" ist anscheinend nicht gültig.
es: No parece que el identificador URI especificado "{0}" sea válido.
fr: L'URI spécifié '{0}' semble non valide.
it: L'URI specificato '{0}' non sembra valido.
ja: 指定した URI '{0}' は有効ではないようです。
ko: 지정한 URI '{0}'은(는) 잘못된 것 같습니다.
pl: Określony identyfikator URI „{0}” wydaje się nieprawidłowy.
pt_br: A URI especificada '{0}' não parece ser válida.
ru: Возможно, указанный URI "{0}" недопустим.
tr: Belirtilen '{0}' URI'si geçerli değil.
zh_hans: 指定的 URI“{0}”无效。
zh_hant: 指定的 URI '{0}' 似乎無效。

# ErrNoFilesFoundFormat
source: The input path '{0}' doesn't appear to refer to any existing files
cs: Vstupní cesta {0} pravděpodobně neodkazuje na žádný existující soubor.
de: Der Eingabepfad "{0}" scheint auf keine vorhandenen Dateien zu verweisen.
es: La ruta de acceso de entrada "{0}" no parece hacer referencia a ningún archivo existente
fr: Le chemin d'entrée '{0}' ne semble pas faire référence à un fichier existant
it: Il percorso di input '{0}' non sembra fare riferimento ad alcun file esistente
ja: 入力パス '{0}' は既存のファイルを参照していない可能性があります
ko: 입력 경로 '{0}'이(가) 기존 파일을 참조하지 않습니다.
pl: Ścieżka wejściowa „{0}” nie wydaje się odwoływać do żadnego istniejącego pliku
pt_br: O caminho de entrada '{0}' não parece fazer referência a nenhum arquivo existente
ru: Входной путь "{0}" не ссылается ни на один существующий файл.
tr: '{0}' giriş yolu mevcut bir dosyaya başvurmuyor
zh_hans: 输入路径“{0}”似乎未引用任何现有文件
zh_hant: 輸入路徑 '{0}' 似乎未參考任何現有的檔案

# ErrNotXmlMetadataFileFormat
source: The specified path '{0}' does not appear to refer to an XML metadata file.
cs: Vypadá to, že zadaná cesta {0} neodkazuje na soubor metadat XML.
de: Der angegebene Pfad "{0}" verweist anscheinend nicht auf eine XML-Metadatendatei.
es: La ruta de acceso especificada "{0}" no parece que haga referencia a un archivo de metadatos XML.
fr: Le chemin spécifié '{0}' ne semble pas faire référence à un fichier de métadonnées XML.
it: Il percorso specificato '{0}' non sembra fare riferimento a un file di metadati XML.
ja: 指定したパス '{0}' は XML メタデータ ファイルを参照していないようです。
ko: 지정한 경로 '{0}'이(가) XML 메타데이터 파일을 참조하는 것 같지 않습니다.
pl: Wygląda na to, że określona ścieżka „{0}” nie odwołuje się do pliku metadanych XML.
pt_br: O caminho especificado '{0}' não parece referir-se a um arquivo de metadados XML.
ru: Возможно, указанный путь "{0}" не ссылается на файл метаданных XML.
tr: Belirtilen '{0}' yolu bir XML meta veri dosyasına başvurmuyor.
zh_hans: 指定的路径“{0}”似乎没有指示 XML 元数据文件。
zh_hant: 指定的路徑 '{0}' 似乎未參考 XML 中繼資料檔案。

# ErrServiceMetadataNotImported
source: The service metadata has not been imported yet.
cs: Metadata služby se zatím neimportovala.
de: Die Dienstmetadaten wurden noch nicht importiert.
es: Todavía no se han importado los metadatos del servicio.
fr: Les métadonnées du service n'ont pas encore été importées.
it: I metadati del servizio non sono stati ancora importati.
ja: サービスのメタデータはまだインポートされていません。
ko: 서비스 메타데이터를 아직 가져오지 않았습니다.
pl: Metadane usługi nie zostały jeszcze zaimportowane.
pt_br: Os metadados do serviço ainda não foram importados.
ru: Метаданные службы еще не импортированы.
tr: Hizmet meta verileri henüz içeri aktarılmadı.
zh_hans: 服务元数据尚未导入。
zh_hant: 服務中繼資料尚未匯入。

# ErrUnableToConnectToUriFormat
source: Cannot obtain Metadata from the URI: {0} Check the URI and try again.{1}
cs: Nejde získat metadata z URI: {0} Zkontrolujte URI a zkuste to znovu.{1}
de: Von dem URI "{0}" können keine Metadaten abgerufen werden. Überprüfen Sie den URI, und versuchen Sie es noch mal.{1}
es: No se pueden obtener metadatos del identificador URI: {0} Compruebe el identificador URI e inténtelo de nuevo.{1}
fr: Impossible de récupérer les métadonnées à partir de l'URI : {0} Vérifiez l'URI, puis réessayez.{1}
it: Non è possibile ottenere i metadati dall'URI: {0} Controllare l'URI e riprovare.{1}
ja: URI からメタデータを取得できません: {0} URI を確認して、もう一度お試しください。{1}
ko: URI에서 메타데이터를 가져올 수 없습니다. {0} URI를 확인하고 다시 시도하세요.{1}
pl: Nie można uzyskać metadanych z identyfikatora URI: {0} Sprawdź identyfikator URI i spróbuj ponownie.{1}
pt_br: Não é possível obter metadados da URI: {0} Verifique a URI e tente novamente.{1}
ru: Не удается получить метаданные из идентификатора URI: {0} Проверьте URI и повторите попытку.{1}
tr: {0} URI'sinden Meta Veriler alınamadı. URI'yi denetleyin ve yeniden deneyin.{1}
zh_hans: 无法从 URI {0} 获取元数据 请检查 URI 并重试。{1}
zh_hant: 無法從 URI {0} 取得中繼資料 請檢查 URI 並再試一次。{1}

# ErrUnableToCreateUniqueFileNameFormat
source: Too many files are being created with the prefix '{0}'.
cs: Vytváří se příliš mnoho souborů s předponou {0}.
de: Es werden zu viele Dateien mit dem Präfix "{0}" erstellt.
es: Se están creando demasiados archivos con el prefijo "{0}".
fr: Les fichiers créés avec le préfixe '{0}' sont trop nombreux.
it: Il numero di file creati con il prefisso '{0}' è eccessivo.
ja: プレフィックス '{0}' を使用して作成されているファイルの数が多すぎます。
ko: '{0}' 접두사를 사용하여 너무 많은 파일을 만들고 있습니다.
pl: Jest tworzonych zbyt wiele plików z prefiksem „{0}”.
pt_br: Arquivos demais estão sendo criados com o prefixo '{0}'.
ru: Слишком много файлов создается с префиксом "{0}".
tr: '{0}' ön ekiyle çok fazla dosya oluşturuluyor.
zh_hans: 使用前缀“{0}”创建的文件过多。
zh_hant: 已使用前置詞 '{0}' 建立太多檔案。

# ErrUnableToResolveSchemaReferenceFormat
source: Unable to resolve schema reference '{0}'.
cs: Nejde vyřešit odkaz na schéma {0}.
de: Der Schemaverweis "{0}" kann nicht aufgelöst werden.
es: No se puede resolver la referencia de esquema "{0}".
fr: Impossible de résoudre la référence de schéma '{0}'.
it: Non è possibile risolvere il riferimento allo schema '{0}'.
ja: スキーマ参照 '{0}' を解決できません。
ko: 스키마 참조 '{0}'을(를) 확인할 수 없습니다.
pl: Nie można rozpoznać odwołania do schematu „{0}”.
pt_br: Não é possível resolver a referência de esquema '{0}'.
ru: Невозможно разрешить ссылку на схему "{0}".
tr: {0}' şema başvurusu çözümlenemiyor.
zh_hans: 无法解析架构引用“{0}”。
zh_hant: 無法解析結構描述參考 '{0}'。

# ErrUrlNotAllowedOnMultipleInputsFormat
source: "URL not allowed: '{0}'. Only metadata document files are allowed when multiple inputs specified!"
cs: "Nepovolená adresa URL: {0}. Při zadání více vstupů jsou povolené jen soubory dokumentů metadat!"
de: "URL nicht zulässig: {0}. Beim Angeben mehrerer Eingaben sind nur Metadatendokumentdateien zulässig."
es: "Dirección URL no permitida: '{0}'. Solo se permiten archivos de documentos de metadatos cuando se especifican varias entradas".
fr: "URL non autorisée : '{0}'. Seuls les fichiers de document de métadonnées sont autorisés quand plusieurs entrées sont spécifiées !"
it: "URL non consentito: '{0}'. Quando si specificano più input, sono consentiti solo file di documento dei metadati."
ja: "URL が許可されていません: '{0}'。複数の入力が指定されている場合、メタデータ ドキュメント ファイルのみが許可されます。"
ko: "허용되지 않는 URL('{0}')입니다. 여러 입력이 지정된 경우 메타데이터 문서 파일만 허용됩니다."
pl: „Niedozwolony adres URL: „{0}”. W przypadku określenia wielu danych wejściowych dozwolone są tylko pliki dokumentów metadanych.”
pt_br: "URL não permitida: '{0}'. Somente arquivos de documento de metadados são permitidos quando há várias entradas especificadas."
ru: "URL-адрес не разрешен: {0}. При указании нескольких входных значений разрешены только файлы документов метаданных."
tr: "URL'ye izin verilmiyor: '{0}'. Birden çok girdi belirtildiğinde yalnızca meta veri belgesi dosyalarına izin verilir!"
zh_hans: “不允许使用的 URL:“{0}”。指定了多个输入时仅允许使用元数据文档文件!”
zh_hant: "不允許 URL: '{0}'。指定多重輸入時，只允許中繼資料文件檔!"
